{
    "news": [
        {
            "title": "Zanu PF Supporters Bash Mwenezi Man For Sympathizing With Blessed Geza",
            "url": "https://www.zimeye.net/2025/12/06/zanu-pf-supporters-bash-mwenezi-man-for-sympathizing-with-blessed-geza/",
            "content": "Tinashe Sambiri Zanu PF supporters in Mwenezi reportedly attacked a local resident after he expressed support for opposition activist Blessed Geza, highlighting the ongoing climate of politically motivated violence in Masvingo Province.\n\nAccording to the Zimbabwe Peace Project (ZPP) October 2025 report, Masvingo recorded three major human rights violations in Gutu and Mwenezi districts, including forced displacement, harassment, and physical assault.\n\nIn Mwenezi Ward 4, a male resident was accused of organizing the one million men march on 17 October and was assaulted by ZANU PF supporters, sustaining injuries, illustrating politically motivated violence and the suppression of civic participation, the report states.\n\nThe ZPP report also documented other violations across the province. In Gutu Ward 6, a woman living with a disability was forcibly removed from her land by a traditional leader, exposing the vulnerabilities of marginalized residents. Additionally, in Gutu Ward 24, nurses at a medical facility were harassed and intimidated for accepting donated blankets without Zanu PF approval, demonstrating interference in professional and humanitarian activities.\n\nThe report notes that such violations affected a total of 2,531 individuals across Masvingo in October alone, including 1,360 women and 1,171 men. Among them, 58 women and 51 men were persons with disabilities.\n\nIn October 2025, ZPP documented a total of 116 human rights violations across the country, affecting 2,531 individuals, reads part of the report. The violations recorded included gross abuses such as forced displacements, hate-motivated violence, threats, and physical assault.\n\nThe report further highlighted broader infringements on civil liberties, noting that victims faced restrictions on freedom of assembly and association, curtailment of freedom of expression, unjustified arrests, and unequal access to government aid and essential social services.\n\nThe attack on the Mwenezi resident underscores the risks faced by citizens who express political opinions that diverge from the ruling partys interests. ZPP has called for urgent measures to protect individuals from politically motivated attacks and to uphold human rights across Masvingo and the rest of Zimbabwe.\n\nZanu PF HQ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF supporters in Mwenezi reportedly attacked a local resident after he expressed support for opposition activist Blessed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/zanu-pf-supporters-bash-mwenezi-man-for-sympathizing-with-blessed-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Supporters Bash Mwenezi Man For Sympathizing With Blessed Geza\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Prominent Driving Instructor Dies",
            "url": "https://www.zimeye.net/2025/12/06/prominent-driving-instructor-dies/",
            "content": "By A Correspondent  TRIANGLE  The Triangle community is mourning the loss of well-known driving instructor Mr. Dadirai Marx, whose body was discovered under unclear circumstances at his rural resettlement home a few days ago.\n\nAuthorities say the exact cause of death remains unknown, though initial reports suggest he may have taken his own life.\n\nIn a statement to the community, Elder T. Muzamani, the outgoing Director for Funerals in Triangle District, expressed deep sorrow over the tragedy. It is with great sadness that we share the news of the passing of our beloved brother, Mr. Dadirai Marx. The circumstances surrounding his untimely departure remain unclear, he said.\n\nElder Muzamani urged community members to rally around the family during this difficult time. Our Directorate and the Leadership urge each of you to come together in this time of sorrow. Let us extend our condolences and support to Mr. Marxs family during this heartbreaking period, he added.\n\nHe also highlighted the importance of mental health awareness, urging residents to care for one another. We encourage all members to be vigilant about the mental well-being of those around us. Its vital that we foster an environment where individuals feel safe to share their struggles, Elder Muzamani said.\n\nDetails regarding burial arrangements and how the community can honor Mr. Marxs memory will be shared in due course. Let us keep him and his family in our thoughts and prayers, the statement concluded.\n\nDadirai Marx\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – TRIANGLE – The Triangle community is mourning the loss of well-known driving instructor Mr. Dadirai Marx, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/prominent-driving-instructor-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Driving Instructor Dies\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Gutu Nurses In Trouble For Receiving Donated Blankets Without Zanu PF Approval",
            "url": "https://www.zimeye.net/2025/12/06/gutu-nurses-in-trouble-for-receiving-donated-blankets-without-zanu-pf-approval/",
            "content": "Tinashe Sambiri Nurses at a medical facility in Gutu Ward 24 have reportedly faced harassment and intimidation for accepting donated blankets without obtaining approval from Zanu PF, highlighting ongoing political interference in professional and humanitarian activities in the district.\n\nAccording to the Zimbabwe Peace Project (ZPP) October 2025 report, Masvingo Province recorded multiple human rights violations, including forced displacement, physical assault, and politically motivated intimidation.\n\nIn Gutu Ward 24, nurses at a medical facility were harassed and intimidated for accepting donated blankets without ZANU PF approval, demonstrating interference in professional and humanitarian activities, the report states.\n\nOther incidents in the province included a woman with a disability being forcibly displaced from her land in Gutu Ward 6 and a male resident in Mwenezi Ward 4 being assaulted by Zanu PF supporters for allegedly organizing the one million men march on 17 October.\n\nThe report notes that these violations affected 2,531 individuals in Masvingo alone, including 1,360 women and 1,171 men, of whom 58 women and 51 men were persons with disabilities.\n\nIn October 2025, ZPP documented a total of 116 human rights violations across the country, affecting 2,531 individuals. The violations recorded included gross abuses such as forced displacements, hate-motivated violence, threats, and physical assault, reads part of the report.\n\nThe organization further highlighted infringements on civil liberties, including restrictions on freedom of assembly and association, curtailment of freedom of expression, unjustified arrests, and unequal access to government aid and essential social services.\n\nThe harassment of nurses in Gutu underscores growing concerns over the politicization of humanitarian aid and the suppression of independent professional actions in Zimbabwe.\n\nFile picture : nurses\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Nurses at a medical facility in Gutu Ward 24 have reportedly faced harassment and intimidation for accepting donated … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/gutu-nurses-in-trouble-for-receiving-donated-blankets-without-zanu-pf-approval/\">Continue reading<span class=\"screen-reader-text\"> \"Gutu Nurses In Trouble For Receiving Donated Blankets Without Zanu PF Approval\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Chivayo Splashes Cash on Zanu PF Women",
            "url": "https://www.zimeye.net/2025/12/06/chivayo-splashes-cash-on-zanu-pf-women/",
            "content": "By a Correspondent Controversial businessman and convicted fraudsterWicknell Chivayohas once again splashed millions of dollars on Zanu PF structures, this time donating cars and cash to the partys Womens League and its affiliate, Young Women for Economic Development.\n\nPresidentEmmerson Mnangagwapersonally presided over the handover ceremony at State House in Harare, a move critics say openly legitimises Chivayos questionable wealth and entrenches their long-standing political alliance. Mnangagwa has repeatedly defended Chivayodespite the latters criminal convictionsdescribing him as a successful businessman, a stance widely viewed as shielding a key political funder.\n\nThe President handed over21 vehiclesdonated by Chivayo, including top-of-the-range models. Six vehicles went to the Womens League leadership, while ten were allocated to provinces. Five vehicles were given to Young Women for ED, one of the partys most visible youth mobilisation groups.\n\nMnangagwa also distributedUS$500,000to Womens League provincial structures andUS$100,000to Young Women for ED, saying the funds would support government-aligned empowerment projects.\n\nThe MnangagwaChivayo relationship dates back to the mid-2010s, when Chivayo began receiving lucrative state-linked contractsincluding the controversial Gwanda Solar Projectdespite lacking the technical capacity to deliver. Since then, he has become one of Mnangagwas most prominent benefactors, donating luxury vehicles to Zanu PF officials, musicians, and state institutions, often ahead of major political events. Analysts argue that Chivayos generosity functions as a parallel patronage system reinforcing Mnangagwas power base.\n\nWomens League secretary for Womens AffairsMabel Chinomonapraised the donations, saying they would boost mobilisation efforts. Young Women for ED chairpersonTatenda Maveterasaid the vehicles would empower the affiliates grassroots recruitment drive.\n\nMnangagwa has in recent years intensified high-profile handovers of cars, trucks, and machinery to Zanu PF structures and aligned groupsmoves critics see as overt political patronage ahead of internal party contests and national elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent — Controversial businessman and convicted fraudster Wicknell Chivayo has once again splashed millions of dollars on Zanu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/chivayo-splashes-cash-on-zanu-pf-women/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Splashes Cash on Zanu PF Women\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Mnangagwa Roasted For Praising Chivayo “Patriotism” Amid Rampant Looting By Zvigananda",
            "url": "https://www.zimeye.net/2025/12/06/mnangagwa-roasted-for-praising-chivayo-patriotism-amid-rampant-looting-by-zvigananda/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwas public endorsement of controversial businessman Wicknell Chivayo has sparked widespread outrage, with many Zimbabweans questioning the motives behind the lavish donation of 21 vehicles to the ZANU-PF Womens League.\n\nAt the handover ceremony on Friday, 5 December, Mnangagwa hailed Chivayo as a patriotic businessman, celebrating his role in supplying luxury vehicles to strengthen ZANU-PF structures. The president confirmed that the Womens League received six Toyota Land Cruiser 300 Series VXR vehicles for the top six leadership positions, alongside ten Toyota Hilux GD6 Double Cab vehicles. He claimed the vehicles would enhance grassroots mobilisation efforts across the ten provinces.\n\nMnangagwa also revealed that the Womens League had been given a substantial cash injection, saying: In addition, the Womens League received US$500,000, to be distributed equally across the 10 provinces to support various Party development and empowerment initiatives.\n\nThe president extended the praise to the Young Women 4ED, announcing: I also handed over five (5) Toyota Hilux GD6 Double Cabs to the Young Women 4ED The Young Women 4ED also received US$100,000 to support their activities in mobilising the youth.\n\nBut outside the ZANU-PF bubble, critics view the spectacle as yet another illustration of a ruling party strengthening its political machinery through questionable benefactors while ignoring the suffering of ordinary citizens. Many argue that the so-called empowerment programmes are exclusive partisan projects disguised as national development.\n\nMnangagwa heavily credited Chivayo for the donations, saying: These donations have been made possible through the generous support of a young patriotic businessman, Mr Wicknell Chivayo, whose philanthropy and charitable commitment to National development are exceptional. He added that Chivayos actions reflect the true spirit of our national philosophy that Nyika Inovakwa Nevene Vayo.\n\nHowever, analysts say this praise paints a distorted picture. Chivayos long-standing reputation for opaque deals and incomplete state-funded projects raises serious questions about the origin of his newfound generosity. Critics argue that the presidents effusive endorsement appears politically motivated and signals a deepening reliance on wealthy loyalists to shore up ZANU-PF power.\n\nWith hospitals lacking basic drugs, civil servants underpaid, and millions struggling with poverty, many Zimbabweans see the celebration of Chivayos donations as a troubling symbol of a government more focused on partisan survival than national wellbeing.\n\nMnangagwa and Chivayo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa’s public endorsement of controversial businessman Wicknell Chivayo has sparked widespread outrage, with many Zimbabweans questioning … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/mnangagwa-roasted-for-praising-chivayo-patriotism-amid-rampant-looting-by-zvigananda/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Roasted For Praising Chivayo “Patriotism” Amid Rampant Looting By Zvigananda\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Mnangagwa Triggers SA Whites To Ask Trump for Sanctions",
            "url": "https://www.zimeye.net/2025/12/06/mnangagwa-triggers-sa-whites-to-ask-trump-for-sanctions/",
            "content": "President Emmerson Mnangagwa triggered South African whites to ask the US President to impose sanctions. This was in November, 3 weeks before Donald Trump abruptly disconnected South Africa over alleged racially motivated abuse of whites.\n\nMnangagwa made a proclamation over how easy it is to chase white farmers, triggering angers. Video:\n\n@POTUSyou must bring back the sanctions to Zimbabwe. They haven't learned to behave \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "President Emmerson Mnangagwa triggered South African whites to ask the US President to impose sanctions. This was in November, 3 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/mnangagwa-triggers-sa-whites-to-ask-trump-for-sanctions/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Triggers SA Whites To Ask Trump for Sanctions\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Zanu PF Women’s League Boss Mabel Chinomoma Threatens To Knock Out Those Opposing 2030 Agenda",
            "url": "https://www.zimeye.net/2025/12/06/zanu-pf-womens-league-boss-mabel-chinomoma-threatens-to-knock-out-those-opposing-2030-agenda/",
            "content": "Tinashe Sambiri ZANU-PF Womens League secretary Mabel Chinomoma sparked alarm on Friday after openly threatening anyone who dares oppose efforts to push President Emmerson Mnangagwas stay in office beyond the current constitutional limit.\n\nSpeaking in Harare, Chinomoma declared that the Womens League would not tolerate resistance to the so-called 2030 agenda, which many critics believe is a disguised campaign to extend Mnangagwas rule. She warned: We are the Womens League and we are very effective. If you oppose us you will be in trouble. We will knock you out if you challenge us. We are saying 2030 is unstoppable.\n\nHer remarks came at the same event where Mnangagwa praised businessman Wicknell Chivayo for donating a fleet of vehicles and large sums of money to ZANU-PF structures  a development that has drawn heavy scrutiny from the public.\n\nAt the handover ceremony held on 5 December, Mnangagwa celebrated Chivayo as a patriotic businessman, crediting him for providing 21 vehicles to the Womens League. The president revealed that the organisation received six Toyota Land Cruiser 300 Series VXR vehicles for the top six leadership positions, alongside ten Toyota Hilux GD6 Double Cab vehicles, which he said would support grassroots mobilisation efforts across all provinces.\n\nMnangagwa also announced significant cash donations: In addition, the Womens League received US$500,000, to be distributed equally across the 10 provinces to support various Party development and empowerment initiatives.\n\nThe Young Women 4ED were also beneficiaries. The president said: I also handed over five Toyota Hilux GD6 Double Cabs to the Young Women 4ED The Young Women 4ED also received US$100,000 to support their activities in mobilising the youth.\n\nCritics argue that such donations serve to strengthen partisan structures rather than advancing national development. Many Zimbabweans believe the ruling party is increasingly reliant on politically connected businessmen while basic services continue to collapse nationwide.\n\nDespite public backlash, Mnangagwa repeatedly applauded Chivayos involvement, stating: These donations have been made possible through the generous support of a young patriotic businessman, Mr Wicknell Chivayo, whose philanthropy and charitable commitment to national development are exceptional. He added that Chivayos conduct reflects the true spirit of our national philosophy that Nyika Inovakwa Nevene Vayo.\n\nAnalysts, however, say the praise ignores Chivayos controversial business record, pointing out his history of unfulfilled state contracts and opaque dealings. They argue the presidents enthusiastic endorsement suggests a tightening alliance between ZANU-PF leadership and wealthy loyalists.\n\nWith the public health sector in crisis, civil servants struggling on poor salaries, and millions facing daily hardship, the visible luxury and political posturing have only intensified anger  especially after Chinomomas aggressive declaration that dissenters will be knocked out.\n\nMabel Chinomoma with Emmerson Mnangagwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– ZANU-PF Women’s League secretary Mabel Chinomoma sparked alarm on Friday after openly threatening anyone who dares oppose efforts … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/zanu-pf-womens-league-boss-mabel-chinomoma-threatens-to-knock-out-those-opposing-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Women’s League Boss Mabel Chinomoma Threatens To Knock Out Those Opposing 2030 Agenda\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Sweden Withdraws Funding From Zimbabwe Projects",
            "url": "https://www.zimeye.net/2025/12/06/sweden-withdraws-funding-from-zimbabwe-projects/",
            "content": "By A Correspondent-The government of Sweden has withdrawn funding from Harare and several other Southern African countries, including Tanzania, Mozambique, Liberia and Bolivia, and redirected the funds to support Ukraine.\n\nStockholm has also closed its embassy in Zimbabwe.\n\nThe move follows earlier reductions, with Sweden having already cut aid to more than 10 countries since 2022.\n\nIts annual development budget, currently around US$5.95 billion, is set for further reductions in 2026.\n\nA statement released by the Embassy of Sweden in Harare on Friday, 05 December, reads:\n\nThe Government of Sweden has decided to phase out Swedens Bilateral Development Cooperation Strategy with Zimbabwe in an orderly and responsible way by 31 August 2026.\n\nThis decision was made within a broader context involving many difficult deliberations. The decision responds to Swedens wider foreign policy priorities, including emerging security and defence challenges in our neighbourhood.\n\nIt is also connected to the implementation of the Swedish Governments Reform Agenda for development cooperation, which aims to sharpen the focus of Swedens development cooperation and reduce the number of bilateral development cooperation strategies.\n\nOther countries that are affected in Africa include Liberia, Mozambique and Tanzania.\n\nThe decision is not connected to any specific events or developments in Zimbabwe.\n\nSince the Embassys primary mission is closely linked to the Swedish development cooperation, the need for a permanent diplomatic presence has been reduced. The decision, therefore, also entails that the Swedish Embassy in Harare will close.\n\nZimbabwe remains an important partner for Sweden. Our historic relations are strong and marked by strong people-to-people ties.\n\nThese ties create opportunities for continued collaboration between actors in Sweden and in Zimbabwe, even if the form for these collaborations may change.\n\nThe historic and diverse collaborations between our countries represent a stable base on which to build our continued partnership.\n\nSweden seeks to have continued positive diplomatic relations with Zimbabwe with an increased focus on trade, investments and sustainable growth.\n\nThe Swedish government particularly sees opportunities to continue our collaboration on sustainable mining, environment and climate and democracy and human rights.\n\nSweden remains engaged through political dialogue and economic ties. Support to Zimbabwe also comes through Swedens contributions to the multilateral system and organisations working in the country, as well as through the EUs development cooperation. Support can also come through Swedens thematic and regional development cooperation strategies.\n\nThe Swedish Foreign Ministry, Business Sweden and other parts of Team Sweden will continue to support Swedish companies that are active in the Zimbabwe market.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The government of Sweden has withdrawn funding from Harare and several other Southern African countries, including Tanzania, Mozambique, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/sweden-withdraws-funding-from-zimbabwe-projects/\">Continue reading<span class=\"screen-reader-text\"> \"Sweden Withdraws Funding From Zimbabwe Projects\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Jalai Not Navaya — Gore Explodes At Journalists Over “Unfair” Soccer Stars Selection",
            "url": "https://www.zimeye.net/2025/12/06/jalai-not-navaya-gore-explodes-at-journalists-over-unfair-soccer-stars-selection/",
            "content": "Sports Correspondent  Football administrator Marshall Gore has ignited a storm after declaring that Emmanuel Jalai  not Washington Navaya  deserved to be crowned Soccer Star of the Year.\n\nGore criticised journalists for what he called an unfair decision, insisting Jalai was the undisputed best player in Zimbabwe this season. The awards honouring the countrys top football performers for 2025 were held last night.\n\nGore began his attack with a firm statement: Emmanuel Jalai is my undisputed Soccer Star of the Year.\n\nHe then questioned the credibility of the voters, saying: For Jalai to be overlooked for the Soccer Star of the Year award is nothing short of a football injustice I am genuinely puzzled by the journalists selection panel.\n\nHe added that he was glad he stayed away from the event. To be honest, Im relieved I didnt attend the function last night. I could not have endorsed such an outcome.\n\nGore highlighted Jalais influence this season. This season, he saved Dynamos FC from relegation through sheer brilliance, delivering outstanding individual performances and exceptional leadership.\n\nHe also praised Jalais contributions to the national team. He was immense for the national team man-of-the-match against Nigeria, South Africa, and in every assignment.\n\nOn club achievements, Gore said: He captained Dynamos and won a double, two major trophies, while steering the club away from relegation. That impact is far greater than simply scoring goals.\n\nMany observers saw this as a pointed dig at Navaya, who finished the season as the Golden Boot winner.\n\nGore continued: In the local league, he was a cut above the rest For Jalai to be overlooked is pure injustice.\n\nHe dismissed suggestions that his comments were based on club bias. I dont support Dynamos FC. Im a diehard CAPS United fan, seeking justice.\n\nHarare vs Gweru Debate\n\nSome fans suggested that geography played a role in the outrage, arguing: This debate wouldnt exist if the winner was from Harare. Others countered that journalists simply rewarded merit.\n\nNavayas Stats Remain Undeniable\n\n17 goals (Golden Boot winner)\n\n7 assists\n\n24 goal contributions\n\nMultiple Player of the Month awards\n\nThree TelOne FC awards\n\nFUZ Player of the Month (March)\n\nNational team debut vs Algeria\n\nBest XI selection\n\nKey Questions\n\nDid Jalai deserve it more because of his influence?\n\nDid Navaya win it because of his output?\n\nDid journalists vote fairly  or not?\n\n2025 Winners\n\nSoccer Star of the Year: Washington Navaya\n\n1st Runner-up: Kevin Njabulo Moyo\n\n2nd Runner-up: Emmanuel Ziocha\n\nFans Choice Award: Emmanuel Jalai\n\nTop Goalscorer: Washington Navaya\n\nGoalkeeper of the Year: William Thole\n\nCoach of the Year: Tonderayi Ndiraya\n\nMost Promising Player: Mafios Tadiwa Chihweta\n\nMost Disciplined Team: Bikita Minerals FC\n\nReferee of the Year: Brighton Chimene\n\n1st Runner-up (Referee): Francis Chirwa\n\n2nd Runner-up (Referee): Tafadzwa Nkala\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Football administrator Marshall Gore has ignited a storm after declaring that Emmanuel Jalai — not Washington Navaya … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/jalai-not-navaya-gore-explodes-at-journalists-over-unfair-soccer-stars-selection/\">Continue reading<span class=\"screen-reader-text\"> \"Jalai Not Navaya — Gore Explodes At Journalists Over “Unfair” Soccer Stars Selection\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        },
        {
            "title": "Zimbabwe Loses Swedish Funding",
            "url": "https://www.zimeye.net/2025/12/06/zimbabwe-loses-swedish-funding/",
            "content": "By A Correspondent, the Swedish government has withdrawn funding from Harare and several other Southern African countries, including Tanzania, Mozambique, Liberia and Bolivia, and redirected the funds to support Ukraine.\n\nStockholm has also closed its embassy in Zimbabwe.\n\nThe move follows earlier reductions, with Sweden having already cut aid to more than 10 countries since 2022.\n\nIts annual development budget, currently around US$5.95 billion, is set for further reductions in 2026.\n\nA statement released by the Embassy of Sweden in Harare on Friday, 05 December, reads:\n\nThe Government of Sweden has decided to phase out Swedens Bilateral Development Cooperation Strategy with Zimbabwe in an orderly and responsible way by 31 August 2026.\n\nThis decision was made within a broader context involving many difficult deliberations. The decision responds to Swedens wider foreign policy priorities, including emerging security and defence challenges in our neighbourhood.\n\nIt is also connected to the implementation of the Swedish Governments Reform Agenda for development cooperation, which aims to sharpen the focus of Swedens development cooperation and reduce the number of bilateral development cooperation strategies.\n\nOther countries that are affected in Africa include Liberia, Mozambique and Tanzania.\n\nThe decision is not connected to any specific events or developments in Zimbabwe.\n\nSince the Embassys primary mission is closely linked to the Swedish development cooperation, the need for a permanent diplomatic presence has been reduced. The decision, therefore, also entails that the Swedish Embassy in Harare will close.\n\nZimbabwe remains an important partner for Sweden. Our historic relations are strong and marked by strong people-to-people ties.\n\nThese ties create opportunities for continued collaboration between actors in Sweden and in Zimbabwe, even if the form for these collaborations may change.\n\nThe historic and diverse collaborations between our countries represent a stable base on which to build our continued partnership.\n\nSweden seeks to have continued positive diplomatic relations with Zimbabwe with an increased focus on trade, investments and sustainable growth.\n\nThe Swedish government particularly sees opportunities to continue our collaboration on sustainable mining, environment and climate and democracy and human rights.\n\nSweden remains engaged through political dialogue and economic ties. Support to Zimbabwe also comes through Swedens contributions to the multilateral system and organisations working in the country, as well as through the EUs development cooperation. Support can also come through Swedens thematic and regional development cooperation strategies.\n\nThe Swedish Foreign Ministry, Business Sweden and other parts of Team Sweden will continue to support Swedish companies that are active in the Zimbabwe market.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Swedish government has withdrawn funding from Harare and several other Southern African countries, including Tanzania, Mozambique, Liberia … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/06/zimbabwe-loses-swedish-funding/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Loses Swedish Funding\"</span></a></p>",
            "time": "08:41",
            "date": "07 Dec 2025"
        }
    ]
}