{
    "news": [
        {
            "title": "Bunjira’s Fiancée Dies After Horror Crash",
            "url": "https://www.zimeye.net/2025/08/20/bunjiras-fiancee-dies-after-horror-crash/",
            "content": "By Sports Reporter-Former CAPS United starAlois Bunjirahas been plunged into mourning following the death of his fiance,Brenda Zvinorova, who succumbed to injuries sustained in a tragic car accident.\n\nThe couple, who were preparing for their wedding in December this year, saw their future together shattered when Brenda lost her battle for life yesterday, three days after the accident.\n\nThe horror crash occurred on Saturday along the RusapeNyanga road when a BMW, driven by Bunjira with Brenda as a passenger, collided head-on with an Isuzu pickup. Two people travelling in the Isuzu died instantly.\n\nBunjira and Brenda were initially rushed toRusape General Hospital, before Brenda was transferred the same day toMilton Park Medical Centrein Harare due to the severity of her injuries. She was placed on life support but succumbed yesterday despite fighting bravely for three days.\n\nThe tragedy has devastated not only Bunjiras family but also the sporting community, where Brenda had become a familiar figure. She was part of theNetOne Albun Marathon organising team, serving as an administrator, and was often seen alongside Bunjira at official functions.\n\nHarare businessmanAndrew Rusike, who chairs the marathon organising committee and is also Bunjiras elder brother, confirmed the couples plans for marriage.\n\nBrenda was Alois fiance, Rusike toldH-Metro. They lived together in Westgate and he had planned to marry her at the end of this year. She was the administrator of our organising committee.\n\nRusike, one of the first people to arrive at the crash scene, recalled the harrowing moment he pulled Brenda from the wreckage.\n\nI could see that she had suffered injuries on her hands. When I got her out of the car, the first thing she asked me was whether her hands were still there, he said, his voice heavy with emotion.\n\nHe explained that the group had been on a business trip related to theNetOne Albun Marathon, which they hoped would be recognised as a qualifier for theComrades Marathon.\n\nPolice confirmed the accident, saying:Two people died, while three others were injured, after an Isuzu pickup truck with three passengers on board tried to overtake a bus and collided head-on with an oncoming BMW driven by Alois Bunjira. Two passengers from the Isuzu vehicle died on the spot.\n\nThe passing of Brenda has left a deep void in Bunjiras life and in the marathon organising committee, where she had become a vital presence. For many close to the couple, her untimely death is not only a personal loss but also a heartbreaking reminder of how suddenly tragedy can strike.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter-Former CAPS United star Alois Bunjira has been plunged into mourning following the death of his fiancée, Brenda Zvinorova, who succumbed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/bunjiras-fiancee-dies-after-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Bunjira’s Fiancée Dies After Horror Crash\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Sad: Crocodile Kills Woman In Mashonaland West",
            "url": "https://www.zimeye.net/2025/08/20/sad-crocodile-kills-woman-in-mashonaland-west/",
            "content": "By A Correspondent\n\nMashonaland West Proportional Representation MP Mutsa Murombedzi reported on Wednesday that another tragic crocodile attack has claimed the life of a woman at Satake Pool on the Ume River, in Ward 7, Nyaminyami, Kariba Rural under Chief Nebiri.\n\nThe woman had gone to the river to wash clothes and bathe when the attack occurred, Murombedzi said, expressing deep concern over the incident.\n\nHe highlighted the ongoing plight of local communities, noting, This is the cruel reality: the same people displaced to make way for hydro-power on Lake Kariba, Africas largest reservoir of fresh water, are the ones who live without safe water.\n\nMurombedzi further condemned the systemic neglect, saying, Every day, women and girls walk long distances to rivers where death lurks in the water. Their struggle is not by choice, it is by neglect, and the government continues to look away. For women, bathing or fetching water should not be a death sentence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mashonaland West Proportional Representation MP Mutsa Murombedzi reported on Wednesday that another tragic crocodile attack has claimed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/sad-crocodile-kills-woman-in-mashonaland-west/\">Continue reading<span class=\"screen-reader-text\"> \"Sad: Crocodile Kills Woman In Mashonaland West\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Zimbabwe Cricket Pledges Growth Amid Allegations Of Mismanagement",
            "url": "https://www.zimeye.net/2025/08/20/zimbabwe-cricket-pledges-growth-amid-allegations-of-mismanagement/",
            "content": "By A Correspondent| Zimbabwe Cricket (ZC) has reaffirmed its commitment to developing the sport nationwide, dismissing recent allegations of racism and mismanagement as unfounded.\n\nThe claims, primarily raised by Bulawayo Mayor Senator David Coltart, suggested that certain regions and communities were being overlooked in cricket development programs and that resources meant for grassroots initiatives were being mismanaged.\n\nWhile these allegations have attracted public attention, Zimbabwe Crickets leadership maintains that the organisation has consistently worked to promote inclusivity, unity, and talent development across the country.\n\nHistorically, ZC has faced challenges similar to those experienced by other national sports boards, including limited financial resources and the logistical difficulties of coordinating programs in both urban and rural areas. Despite this, the board has maintained a strong focus on school and community cricket programs, which have grown steadily over the past decade.\n\nZC President Tavengwa Mukuhlani emphasised that the board is committed to expanding crickets reach across Zimbabwe.\n\nOur resources are stretched, but the will to grow the game is stronger than ever. We are rolling out projects in towns and rural areas, ensuring that all communities have access to opportunities in cricket, he said.\n\nThese initiatives include youth coaching clinics, talent identification programs, school competitions, and the rehabilitation of cricket facilities in regions that historically lacked access to proper infrastructure.\n\nThe government has publicly backed ZC, describing the organisation as a vital partner in building a healthy and educated society through sport, in line with Vision 2030.\n\nMinistry spokesperson Taungana Ndoro stressed that claims of racism, tribalism, or mismanagement are baseless and contrary to the values upheld by ZC and the government.\n\nNdoro highlighted that Zimbabwe Cricket has played an important role in fostering national cohesion, providing opportunities for youth from diverse backgrounds, and promoting the sport as a tool for education and social development.\n\nZimbabwe Cricket has also pointed out that it has been collaborating with the Sports and Recreation Commission (SRC) to ensure transparency and accountability in its operations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Zimbabwe Cricket (ZC) has reaffirmed its commitment to developing the sport nationwide, dismissing recent allegations of racism … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/zimbabwe-cricket-pledges-growth-amid-allegations-of-mismanagement/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Cricket Pledges Growth Amid Allegations Of Mismanagement\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Shuntai Cement Plant to Transform Chegutu",
            "url": "https://www.zimeye.net/2025/08/20/shuntai-cement-plant-to-transform-chegutu/",
            "content": "CHEGUTU  Shuntai Investments (Pvt) Ltd is set to bring new life to Chegutu with the establishment of a modern cement plant, a project that promises to create at least 800 jobs, boost industrial growth, and meet Zimbabwes soaring demand for cement.\n\nThe development, located 1.2 kilometres from Bryden Country School, has faced resistance from the school authorities who argued that the project was commenced without an Environmental Impact Assessment (EIA) certificate. That concern, however, is now sterile  the Environmental Management Agency (EMA) has since granted Shuntai the required EIA certificate, confirming that the project is compliant and can proceed.\n\nBryden Country School was founded in 1983, decades after quarrying and mining activities had already been established in the Chegutu area, then known as Hartley. Quarry sites in the area were owned by whites from the 1940s and were pegged in the 1970s under GW. Mining operations, including blasting, were active from the 1980s until 2007  all of which existed alongside the school without incident.\n\nCommunity members who spoke to this publication on condition of anonymity said Bryden had little basis to raise objections to pre-existing and legally sanctioned industrial activities.\n\nNotably, the school has raised no complaints about a gold mine owned by Bangira, which was registered after 1983 and operates just 600 metres from the schools offices and residences. In contrast, the Shuntai cement plant is nearly double that distance away, at 1.2 km, one community member said.\n\nConcerns about dust and noise pollution also appear misplaced. The busy A5 highway  carrying thousands of vehicles daily  runs just 200 metres from Brydens premises, generating far greater noise than the distant cement plant ever will.\n\nShuntai has invested in cutting-edge technology to manage dust and noise, ensuring full compliance with environmental standards. Company officials have assured stakeholders that the plants operations will not exceed regulatory limits.\n\nThe cement project comes at a crucial time for Zimbabwe, as the Second Republic drives massive infrastructure development projects in housing, roads, and dams. Cement demand is rising sharply, and Shuntais investment will ease shortages, lower costs, and support the governments development agenda.\n\nBeyond national benefits, the project will bring life-changing opportunities to Chegutu. Hundreds of jobs are expected to be created during construction and operation, providing employment to local communities, particularly the youth.\n\nThis is not just about cement production  it is about empowering people, growing the local economy, and building Zimbabwes future, a Shuntai spokesperson said.\n\nWhile the High Court recently found Shuntai in contempt of a provisional order halting work, the company has already filed an appeal with the Supreme Court.Shuntai is confident in the lawfulness of its operations and the economic necessity of the project. The Supreme Court is now seized with the contempt matter and will soon decide whether the order should stand or be set aside.\n\nFor Chegutu, the cement plant represents progress, jobs, and opportunity. For Zimbabwe, it means increased capacity to build and develop.\n\nIn the face of outdated objections, Shuntai Investments stands ready to deliver a world-class cement plant that will serve not only Chegutu but the entire nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "CHEGUTU – Shuntai Investments (Pvt) Ltd is set to bring new life to Chegutu with the establishment of a modern … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/shuntai-cement-plant-to-transform-chegutu/\">Continue reading<span class=\"screen-reader-text\"> \"Shuntai Cement Plant to Transform Chegutu\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Mugabe-Era Minister Battles Ill Health",
            "url": "https://www.zimeye.net/2025/08/20/mugabe-era-minister-battles-ill-health/",
            "content": "By A Correspondent-Veteran nationalist and former Matabeleland South Provincial MinisterAngeline Masukuis battling ill health at her Warringham home on the outskirts of Bulawayo, where doctors are attending to her.\n\nMasuku, who will celebrate her 90th birthday in two months, is one of the few remaining senior female politicians from the liberation generation. A trailblazer for women in politics, she rose to prominence in the 1970s as part of the liberation struggle networks and went on to play an influential role in the post-independence government of Zimbabwe.\n\nOften described as amother figure within ZANUPF and a unifying presence in Matabeleland, Masuku served as Governor for Matabeleland South before later being appointed Minister of State for Provincial Affairs and Devolution for Bulawayo. Throughout her tenure, she was celebrated for her accessibility, humility, and hands-on approach to leadership, especially in rural communities.\n\nHer political journey, however, was not without challenges. Masuku navigated the turbulent Mugabe years, which were marred by factionalism, political violence, and the unresolved wounds of Gukurahundi in Matabeleland. Despite these tensions, she earned respect across political lines for calling for peace, dialogue, and national unity at a time when such positions were politically sensitive.\n\nAs one of the longest-serving female political leaders in Zimbabwe, she carved a reputation as agrounded and principled leaderwho often put people before party politics. Even after retiring from government, Masuku continued to participate in community initiatives, mentoring younger politicians and advocating for the welfare of ordinary citizens.\n\nHer current ill health has sparked concern across the political spectrum, with many remembering her as a rare politician who maintained integrity and humility in a space often dominated by patronage and power struggles.\n\nDespite her frailty, Masuku has expressed joy that she has lived to witness nearly nine decades of life and service. Friends, relatives, and political colleagues who have visited her say she remains in high spirits, still offering words of wisdom and encouragement to those around her.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Veteran nationalist and former Matabeleland South Provincial Minister Angeline Masuku is battling ill health at her Warringham home on the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/mugabe-era-minister-battles-ill-health/\">Continue reading<span class=\"screen-reader-text\"> \"Mugabe-Era Minister Battles Ill Health\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Police Investigate Mutangazi’s Wife Over Brutal Sunday Murder?",
            "url": "https://www.zimeye.net/2025/08/20/police-investigate-mutangazis-wife-over-brutal-sunday-murder/",
            "content": "By Crime and Courts Reporter The brutal killing of prominent businessman Joseph Mutangaz Mutangadura, which police initially described as a violent robbery, is now raising strong suspicions of foul play  with fresh twists pointing to a possible assassination and growing scrutiny of his wife, Patience.\n\nMutangadura, 67, was gunned down late Sunday night inside his 13-room farmhouse at Lisheen Estate in Ruwa. While police maintain that it was a case of armed robbery, inconsistencies in the attackers conduct suggest otherwise.\n\nAccording to police, seven masked men armed with pistols, crowbars, and hammers overpowered a security guard before storming the house. The gang tied him up, demanded a description of Mutangadura, and went straight for the businessmans bedroom, where he was asleep with his wife.\n\nDespite Mutangadura reportedly offering to lead them to an abattoir where he kept cash, the intruders shot him multiple times in the stomach and chest. He died at the scene.\n\nStrangely, the attackers left behind cash and valuables, only taking a cellphone worth about US$10  a detail that has fueled speculation that their mission was not theft but elimination.What is disturbing is that the gang was not after the money but the life of Joseph,a family member told reporters.\n\nPatience, with whom Mutangadura had only recently reunited after a divorce, was left unconscious during the attack and later rushed to hospital. She is recovering under police protection.\n\nHowever, questions have emerged after reports that investigating officers confiscated her cellphone. A close family relative confirmed the seizure, though police have not publicly commented on it. This development has sparked speculation about whether investigators are probing the possibility of inside information or other links to the gunmen.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the murder but insisted the case is still being treated as robbery and homicide.The value of stolen property is yet to be verified,he said.\n\nThe chilling precision of the attack mirrors a disturbing pattern of suspected hire killings that have rocked Zimbabwe since the 2017 coup. In many of those cases, victims were executed while little or nothing was stolen, raising fears of a growing underworld of contract assassins operating with impunity.\n\nMutangadura, who owned butcheries, Lisheen Estate, and the popular Mutangadura Hideout, was a towering figure in Ruwa and Harare business circles. His violent death has left the community reeling  and demanding answers about who wanted him dead, and why.\n\nDetectives from the CID Homicide Unit are leading the manhunt for the killers. But with Patiences phone now in police custody and questions swirling about the true motive of the assailants, relatives and residents remain convinced: this was no ordinary robbery, but a carefully planned assassination.\n\nSource: H-Metro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – The brutal killing of prominent businessman Joseph “Mutangaz” Mutangadura, which police initially described as a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/police-investigate-mutangazis-wife-over-brutal-sunday-murder/\">Continue reading<span class=\"screen-reader-text\"> \"Police Investigate Mutangazi’s Wife Over Brutal Sunday Murder?\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Tendai Ndoro’s Parents Demand Answers",
            "url": "https://www.zimeye.net/2025/08/20/tendai-ndoros-parents-demand-answers/",
            "content": "By Sports Reporter  Grief has engulfed Nketa 8 in Bulawayo, where the parents of former Warriors and Orlando Pirates striker Tendai Ndoro are demanding answers following his sudden death in South Africa.\n\nNdoro (40) was found dead on Monday at his Sandton apartment in Johannesburg, shocking the football fraternity across Zimbabwe and beyond. His parents, Silas Mukundwa and Christina Mukundwa, described him as a peace-loving son whose untimely passing has left the family devastated.\n\nI invite all who played with Tendai to come and celebrate his life as someone who they shared the pitch with, his mother, Christina, said tearfully. There are many things Tendai did for us as a family. God knows what he did, and He has taken him back.\n\nHis father, Silas, echoed the familys grief and frustration: Tendai was soft-spoken, he loved singing, and he always wanted peace. As his parents, we are waiting to hear what really happened to him. We are devastated, and it is painful to accept.\n\nMourners have gathered at the family home at number 1916 Nketa 8, where his legacy is being remembered, while in South Africa soccer legends and former Warriors teammates visited the Sandton apartment where his body was discovered. Former CAPS United and Warriors star Edelbert Dinha, together with representatives from Zororo-Phumulani, have already paid their respects, with reports that former Warriors captain Peter Ndlovu is also expected.\n\nNdoros career began at Chicken Inn in Bulawayo, where his explosive pace and eye for goal made him a household name in the local Premier Soccer League. His rise quickly attracted attention across the Limpopo, leading to a move to South Africa where he became one of the most feared strikers in the DStv Premiership.\n\nHe first made his mark at Mpumalanga Black Aces before moving to Soweto giants Orlando Pirates in 2015. At Pirates, Ndoro enjoyed his peak years, finishing as the clubs top scorer in the 2016/17 season and delivering memorable performances, including a hat-trick against Golden Arrows. His deadly finishing earned him a place in the Warriors squad for the 2017 Africa Cup of Nations in Gabon, where he featured for Zimbabwe on the continental stage.\n\nAfter Pirates, he had stints with Ajax Cape Town and briefly moved to Saudi Arabian club Al-Faisaly, before returning to South Africa. His career, however, began to decline after 2018, amid disputes with clubs, inconsistent form, and fitness issues.\n\nDespite his brilliance on the field, Ndoros career was not without controversy. In 2018, FIFA investigated his eligibility after he turned out for three different clubs in a single season  Pirates, Ajax Cape Town, and Highlands Park  sparking a high-profile legal tussle that eventually saw Ajax relegated after the league docked points for fielding him.\n\nIn later years, Ndoros personal life also drew attention. Reports emerged of his battles with illness, weight loss, and financial struggles. In 2021, he made headlines after it was alleged that he had been kicked out of his home in South Africa by his then-wife, amid rumors of deteriorating health. Images of a frail Ndoro shocked fans, raising concerns about his well-being.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter – Grief has engulfed Nketa 8 in Bulawayo, where the parents of former Warriors and Orlando Pirates … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/tendai-ndoros-parents-demand-answers/\">Continue reading<span class=\"screen-reader-text\"> \"Tendai Ndoro’s Parents Demand Answers\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Police Probe Brutal Murder of Ruwa Businessman",
            "url": "https://www.zimeye.net/2025/08/20/police-probe-brutal-murder-of-ruwa-businessman/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) is investigating the brutal killing of a Ruwa businessman during a robbery at his farm along Dustain Road, commonly known as Mutangadura Hideout, on Sunday night.\n\nPolice spokesperson Commissioner Paul Nyathi confirmed the incident, which occurred at around 11:00 pm on 17th August 2025, when a gang of armed robbers stormed the property.\n\nSeven unknown suspects, who were armed with pistols, claw bars and hammers, and wearing balaclavas, overpowered the security guard at the premises, said Commissioner Nyathi. They tied his hands with shoelaces and forced him to lead them to the main house, where they broke in using metal bars.\n\nThe attackers then targeted the family inside the home. The victim, Joseph Mutangadura (67), was shot in the stomach while sleeping in his bedroom with his wife, Nyathi revealed. The suspects forced the security guard and the victims son to lie down in the dining room as they ransacked the house before fleeing.\n\nMutangadura and his wife, who was also left unconscious, were rushed to Eden Hospital in Windsor, Ruwa. Sadly, the businessman was pronounced dead on arrival, while his wife remains under medical care.\n\nCommissioner Nyathi said the value of the stolen property is yet to be established. We are conducting thorough investigations into this callous attack, and more details will be released in due course, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) is investigating the brutal killing of a Ruwa businessman during a robbery … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/police-probe-brutal-murder-of-ruwa-businessman/\">Continue reading<span class=\"screen-reader-text\"> \"Police Probe Brutal Murder of Ruwa Businessman\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Cephas Chimedza Pays Tribute to Former Zimbabwe Warriors Striker Tendai Ndoro",
            "url": "https://www.zimeye.net/2025/08/20/cephas-chimedza-pays-tribute-to-former-zimbabwe-warriors-striker-tendai-ndoro/",
            "content": "By Sports Correspondent\n\nFormer Dynamos, Caps United, Germinal Beerschot, Sint Truiden (STVV), and Zimbabwe Warriors defender Cephas Chimedza has paid tribute to former Warriors striker Tendai Ndoro, who passed away in South Africa on Monday.\n\nIn a brief statement, Chimedza expressed his sorrow, writing on social media:\n\nR.I.P chief striker.He also confirmed the news of Ndoros death, adding:Yes Tendai passed on in Joburg\n\nNdoro was celebrated for his prolific goal-scoring ability and his significant contributions to both club and national football. He played for top Zimbabwean clubs and also had stints in South Africa, making him a well-known figure in African football circles.\n\nFans, former teammates, and football enthusiasts have since flooded social media with tributes, remembering Ndoro as a dynamic striker and an inspiration to young footballers in Zimbabwe and beyond.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Former Dynamos, Caps United, Germinal Beerschot, Sint Truiden (STVV), and Zimbabwe Warriors defender Cephas Chimedza has paid … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/cephas-chimedza-pays-tribute-to-former-zimbabwe-warriors-striker-tendai-ndoro/\">Continue reading<span class=\"screen-reader-text\"> \"Cephas Chimedza Pays Tribute to Former Zimbabwe Warriors Striker Tendai Ndoro\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Tendai Ndoro Had Been Dead For Three Days, Says Edelbert Dinha",
            "url": "https://www.zimeye.net/2025/08/19/tendai-ndoro-had-been-dead-for-three-days-says-edelbert-dinha/",
            "content": "By A Correspondent\n\nFormer Warriors midfielder Edelbert Dinha has disclosed that Tendai Fire Ndoros remains were discovered several days after his passing. Ndoros body was found at his Johannesburg apartment on Monday, August 18, though Dinha believes he may have died three days earlier.\n\nDinha, who once shared the stage with Ndoro in South Africas Premier Soccer League, was among the first to arrive at the scene after word spread of the former strikers death. He noted that family members, including uncles and aunts, as well as fellow football icon Peter Ndlovu, quickly gathered at the residence in solidarity.\n\nThe exact details leading to Ndoros death are still to be confirmed, but it is understood that he was alone at the time.\n\nNdoro, born in Bulawayo, began his rise to prominence at Chicken Inn, where his goal-scoring instincts made him one of the most feared forwards in the Zimbabwe Premier Soccer League. His exploits earned him a move to Mpumalanga Black Aces in South Africa before he was snapped up by Orlando Pirates in 2015.\n\nDuring his time with the Buccaneers, Ndoro became a fan favourite, producing match-winning goals and establishing himself as one of the most prolific strikers in the PSL. He later ventured abroad to Saudi Arabia with Al-Faisaly before returning to South Africa, turning out for Ajax Cape Town and Highlands Park.\n\nOn the international scene, Ndoro represented the Zimbabwe national team between 2013 and 2017, featuring at the 2017 Africa Cup of Nations and leaving behind memories of his dedication in the Warriors jersey.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Warriors midfielder Edelbert Dinha has disclosed that Tendai “Fire” Ndoro’s remains were discovered several days after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/tendai-ndoro-had-been-dead-for-three-days-says-edelbert-dinha/\">Continue reading<span class=\"screen-reader-text\"> \"Tendai Ndoro Had Been Dead For Three Days, Says Edelbert Dinha\"</span></a></p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        }
    ]
}