{
    "news": [
        {
            "title": "Doctor, Nurse, Pharmacist Cleared In Drugs Allegations",
            "url": "https://www.zimeye.net/2024/12/19/doctor-nurse-pharmacist-cleared-in-drugs-allegations/",
            "content": "By A Correspondent| A top Harare medical doctor who was arrested together with a registered nurse and a pharmacist after being implicated in an illegal drugs scandal involving pethidine have been cleared of the allegations.\n\nTanaka Chimuka, Tapiwa Mutebuka and Sam Chasaya were arrested by detectives from CID drugs who claimed to have had received information from an informant linking them to the scandal.\n\nThis was after the capture of one Osla Mpamhanga who was allegedly on his way to deliver the drugs, 40 by 100mgs pethidine solution and 40 injection needles.\n\nFrom the onset, the three argued that they are personel in the medical industry exempt from arrest as they are part of the authorized persons to administer, possess and supply drugs like pethidine.\n\nHowever, the State insisted on prosecuting them but failed to lead incriminating evidence that the trio was dealing in the alleged drugs resulting in the collapse of the case after the trio mounted an application for discharge.\n\nThis follows their failure to have the recovered drugs produced in court as exhibits and also failure to have the biker, Mupamhanga, testify in court, to confirm whether he had been sent by the trio or not.\n\nIn their application for discharge, the trio represented by Admire Rubaya, Stephen Chikotora and Malvern Mapako, the trio described the prosecution as a classical failed fishing expedition where the State has failed to even catch a small tadpole.\n\nThey argued that the State had failed to lead anything incriminating against them and had also failed to prove that pethidine was a dangerous drug at law.\n\nIt was their argument that the State had failed to prove the said drug was pethidine and had not led any expert evidence to support that the recovered items were indeed pethidine.\n\nThe State was obliged to prove that the alleged drug was pethidine in the first place. The State failed to produce the said drug into evidence and failed to prove that the subject matter was a dangerous drug called pethidine, their lawyers argued.\n\nThe suspects also argued that they were never arrested in possession of the alleged drugs but only through implication by a person who was never arrested or through information by an informant who was never brought to court to testify against them.\n\nThere is no evidence which has been led by the State that the Accused persons had the requisite knowledge of the existence of the alleged Pethidine since it was in the physical control of a person who was never arrested by the police and has not been accounted for.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A top Harare medical doctor who was arrested together with a registered nurse and a pharmacist after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/doctor-nurse-pharmacist-cleared-in-drugs-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Doctor, Nurse, Pharmacist Cleared In Drugs Allegations\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Another Chiwenga Ally Fired",
            "url": "https://www.zimeye.net/2024/12/19/another-chiwenga-ally-fired/",
            "content": "By Political Reporter-Zanu PF in Masvingo has fired a ward councilor for suporting Vice President Constantino Chiwenga.\n\nBrighton Mushekwa the partys Bikita ward 12 councillor was verbally dismissed by Zanu PF Deputy Secretary for Youth Affairs John Paradza during a District Coordinating Committee (DCC) meeting.\n\nMushekwa stands accused of refusing to chant the contentious slogan 2030 vanenge vachipo, perceived as an endorsement of President Emmerson Mnangagwas continued rule beyond 2028, despite the slogan lacking official approval from the partys Central Committee.\n\nThe councillor, however, claims his expulsion is based on unfounded allegations that he supports Chiwengas faction in the partys escalating succession battle.\n\nFactional tensions have been brewing within Zanu PF as Mnangagwa and his deputy, Chiwenga, jockey for influence ahead of the 2028 elections.\n\nChiwenga, a former army general instrumental in ousting Robert Mugabe in 2017, is seen by many as vying for the top position.\n\nMeanwhile, Mnangagwas allies are pushing a narrative of his leadership extending into the next decade, symbolized by the controversial 2030 vanenge vachipo slogan.\n\nThis slogan has sparked a divide in the party, with Mnangagwa loyalists using it as a litmus test for allegiance, while others, like Mushekwa, argue that it has not been constitutionally endorsed.\n\nMushekwa denies belonging to any faction, emphasizing his commitment to Zanu PFs constitution and its processes.I support the sitting President and the partys constitutional obligations. The Central Committee is the highest decision-making body, and no one has the authority to enforce unapproved slogans, Mushekwa stated.\n\nHe added that his refusal to chant the slogan does not signify disloyalty but adherence to party rules. These baseless allegations are being used to abuse power and settle political scores, he said.\n\nMushekwa also criticized the use of verbal expulsions, pointing out that Zanu PFs constitution mandates formal hearings and proper protocols for disciplinary actions.\n\nHis claims were backed by Zanu PF Masvingo Provincial Spokesperson Pepukai Chiwewe, who clarified that any expulsion without due process is invalid.\n\nDespite Mnangagwa previously indicating he would not stand in 2030, figures like Paradza and other provincial leaders have aggressively championed the slogan.\n\nThey have reportedly threatened to punish members who refuse to endorse it, further inflaming divisions within the party.\n\nMasvingo Province remains a hotbed for factional activity, with leaders leveraging slogans and public rallies to consolidate power.\n\nChiwewe, however, downplayed the disputes, calling insults during rallies normal and advising against taking them seriously.Source-TellZimNews\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-Zanu PF in Masvingo has fired a ward councilor for suporting Vice President Constantino Chiwenga. Brighton Mushekwa the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/another-chiwenga-ally-fired/\">Continue reading<span class=\"screen-reader-text\"> \"Another Chiwenga Ally Fired\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Magaya’s Boarding School Continues Advertising Despite Long History of Kids’ Abuse",
            "url": "https://www.zimeye.net/2024/12/19/magayas-boarding-school-continues-advertising-despite-long-history-of-kids-abuse/",
            "content": "Magaya-Linked School Filchrist Hill Faces Controversy Amid New Advertisements\n\nBy Dorrothy Moyo |Filchrist Hill Boarding School, a Shamva-based institution linked to controversial preacher Walter Magaya, has resurfaced in the spotlight after a new advertisement for student enrollment was posted on social media. The advert, promoted through a socialites Facebook page, has reignited concerns surrounding the school, which has faced repeated allegations of abuse and misconduct over the years.\n\nBackground of Controversy\n\nThe school, led by headmaster Jebes Muchapondwa, has been at the center of scandal since 2019, when parents accused him of sexually, physically, and emotionally abusing students. Reports allege that Muchapondwa subjected students to inappropriate behavior, including making girls work long hours, verbally abusing them, and entering female hostels unannounced.\n\nThe most alarming allegations involve claims that Muchapondwa cut the hair of female students and took it to Magayas church for suspected rituals. Concerned parents toldZimEyethey feared their children were being groomed for purposes beyond education.\n\nOne parent revealed:\n\nFemale pupils are called to the headmasters office at 10 p.m. for closed-door discussions. There is no matron, and the headmaster enters the female hostels even when learners are bathing. My daughter was verbally abused and told she had jelly buttocks. When I confronted him, he blocked me.\n\nDespite the gravity of these accusations, no concrete actions were taken to address them, leaving parents disillusioned and fearful for their childrens safety.\n\nBoardroom Squabbles and Leadership Issues\n\nIn addition to allegations of abuse, Filchrist Hill has also been plagued by internal management problems. Earlier this year, Jebes Muchapondwa stepped down from his role in the Premier Netball League due to irreconcilable differences. This resignation further cast a shadow over his leadership at the school.\n\nMuchapondwa, who has also withdrawn his teams from national netball leagues, cited frustration with unresolved conflicts, adding to questions about his ability to manage both sports and educational initiatives effectively.\n\nMagayas Involvement\n\nThe connection between Filchrist Hill and Walter Magaya, a convicted medical fraudster, has fueled public skepticism about the schools integrity. Magayas controversial history, coupled with allegations of ritualistic practices at the school, has led to calls for increased scrutiny and accountability.\n\nNew Advertisements Amid Old Scandals\n\nThe schools recent Facebook advertisement, encouraging parents to enroll their children, has sparked mixed reactions. Many wonder whether the institution can rebuild trust given its history of abuse allegations and managerial disputes.\n\nThe advertisement, featuring a socialite endorsing the school, promotes opportunities at Filchrist Hill Boarding School while omitting its checkered past. Observers have questioned whether families will be willing to send their children to an institution mired in controversy.\n\nPublic Reaction and Calls for Accountability\n\nThe resurfacing of Filchrist Hill in the public eye has reignited calls for government intervention and thorough investigations into the allegations against Muchapondwa and the schools connection to Walter Magaya.\n\nThis school has a history that no amount of advertising can erase. Parents must think twice before enrolling their children here, said one concerned citizen.\n\nAs Filchrist Hill attempts to attract new students, its ability to address past accusations and restore its reputation remains uncertain. The situation raises broader questions about accountability and governance in private educational institutions across Zimbabwe.\n\nThis is a developing story. Updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Magaya-Linked School Filchrist Hill Faces Controversy Amid New Advertisements By Dorrothy Moyo | Filchrist Hill Boarding School, a Shamva-based institution … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/magayas-boarding-school-continues-advertising-despite-long-history-of-kids-abuse/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya’s Boarding School Continues Advertising Despite Long History of Kids’ Abuse\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Jailed Woman Who Behaved ‘Like Grace Mugabe’ Acquitted",
            "url": "https://www.zimeye.net/2024/12/19/jailed-woman-who-behaved-like-grace-mugabe-acquitted/",
            "content": "Bulawayo Mother Freed After Controversial Incarceration for Disciplining Son\n\nMs. Panashe Mpofu, a single mother from New Luveve, Bulawayo, who was compared by some to Grace Mugabe for her strict disciplinary actions, has been released after spending a harrowing month in Mlondolozi Prison. Her imprisonment for disciplining her 15-year-old son and three other teenagers who hosted aVuzuparty during school hours had sparked widespread debate about parenting, justice, and societal values in Zimbabwe.\n\nFrom a Mothers Discipline to a Prison Cell\n\nMs. Mpofus ordeal began on November 14, when she rushed home from church to find her son and his friends drinking alcohol and watching X-rated movies at a neighbors house. In what she describes as a moment of parental concern and frustration, she disciplined the teenagers with a stick.\n\nI acted as any concerned parent would, Ms. Mpofu said. I wanted to correct their behavior before it got worse. No one was harmed.\n\nHowever, her actions were swiftly criminalized. Accused of injuring one of the teenagers, she was arrested, spent a night in police custody, and was sentenced to five years in prison, with three years suspended, at West Commonage Court. She was not allowed to call witnesses to testify on her behalf.\n\nThe harsh penalty left Ms. Mpofu in despair, questioning how her actions as a mother could lead to such severe consequences.\n\nGrace Mugabe Comparisons and the Public Outcry\n\nMany compared Ms. Mpofus actions to the infamous disciplinary methods of Grace Mugabe, Zimbabwes former First Lady, known for her unrestrained public outbursts. Critics labeled her behavior as excessive, while supporters argued that she was a mother trying to protect her child from societal vices.\n\nPublic sentiment largely rallied around Ms. Mpofu, with calls for a review of her sentence. Advocacy groups and community members highlighted the disproportionate punishment meted out to a struggling single mother trying to instill discipline.\n\nA Month of Despair\n\nDuring her incarceration, Ms. Mpofu faced immense hardship. She lost her job as a general hand at a local company, leaving her uncertain about how to provide for her son.\n\nWe worked in the gardens, and I often thought of ending my life, she revealed. I know suicide is not the answer, but I felt like my life was over.\n\nHer son, the center of the incident, was left without guidance, compounding Ms. Mpofus distress.\n\nJustice Prevails: Release Ordered\n\nOn Monday, Bulawayo High Court Judge Evangelista Kabasa reviewed Ms. Mpofus case and ordered her release, acknowledging the excessive nature of the sentence.\n\nMs. Mpofu expressed immense relief and gratitude to those who supported her during her ordeal. To everyone who stood by me, I cannot thank you enough. Your prayers and words of encouragement meant a lot to me, she said.\n\nA New Beginning Amid Uncertainty\n\nAs she steps out of prison, Ms. Mpofu faces the daunting task of rebuilding her life. With no job and mounting responsibilities, she remains focused on providing for her 15-year-old son.\n\nIm a single mother trying to give my son a better life. Losing my job means I dont know where to start, but Im determined to move forward, she said.\n\nA Controversial Case With Broader Implications\n\nMs. Mpofus case has ignited discussions about the balance between parental discipline and legal boundaries. While her actions may have been harsh, her punishment has been widely viewed as excessive, highlighting gaps in Zimbabwes justice system.\n\nHer story, echoing comparisons to Grace Mugabe, raises questions about societal standards and the treatment of mothers navigating complex parenting challenges.\n\nMs. Mpofus release offers her a second chance, but her journey serves as a cautionary tale about the delicate line between discipline and legalityand the heavy toll it can take on a family.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo Mother Freed After Controversial Incarceration for Disciplining Son Ms. Panashe Mpofu, a single mother from New Luveve, Bulawayo, who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/jailed-woman-who-behaved-like-grace-mugabe-acquitted/\">Continue reading<span class=\"screen-reader-text\"> \"Jailed Woman Who Behaved ‘Like Grace Mugabe’ Acquitted\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Guilty Govt Launches “Smuggling Crackdown” Amid Gold Smuggling Scandal",
            "url": "https://www.zimeye.net/2024/12/19/guilty-govt-launches-smuggling-crackdown-amid-gold-smuggling-scandal/",
            "content": "By Dorrothy Moyo | Analysis|In a sudden and aggressive move, the Zimbabwean government has launched a door-to-door crackdown on smuggled goods, coinciding with recent sanctions tied to a gold smuggling and election-rigging scheme that implicates Kamlesh Pattni, President Emmerson Mnangagwas largest business partner.\n\nThis operation, touted as a fight against the estimated US$1 billion annual losses due to smuggling, is raising suspicions of a deeper agendapotentially an effort to obscure the high-level corruption unearthed by international sanctions.\n\nA Convenient Timing\n\nThe crackdown comes shortly after global sanctions were announced against individuals and entities involved in gold smuggling networks, with evidence pointing to Pattnis role in financing election rigging through illicit gold deals. Pattni, a controversial figure with a history of corruption scandals across Africa, has long been associated with Mnangagwas business dealings. Critics argue the governments sudden overdrive on smuggling is a smokescreen to shift focus from these damning allegations.\n\nSweeping Measures or Smokescreen?\n\nPermanent Secretary for Presidential Affairs Engineer Tafadzwa Muguti announced that a taskforce comprising inter-governmental agencies has been deployed to major border posts and roads to intercept smuggled goods. These agencies include the Zimbabwe Revenue Authority (Zimra), the Zimbabwe Republic Police, the Reserve Bank of Zimbabwe (RBZ), and the Consumer Protection Commission.\n\nThis December, we will have inter-governmental agencies stationed at our major border posts to ensure zero tolerance for smugglers. The taskforce will conduct door-to-door inspections of all goods in wholesale and retail shops, Muguti said.\n\nYet, observers question why the government is only now ramping up efforts against smugglingparticularly when the sanctioned gold smuggling operations are allegedly linked to Mnangagwas inner circle.\n\nTargeting the Wrong Smugglers?\n\nThe crackdown focuses on consumer goods such as groceries, clothing, alcohol, electrical gadgets, and vehicles, with diasporans returning for the holidays warned against failing to declare their goods. However, it conspicuously avoids addressing the gold smuggling networks that international investigators have linked to Zimbabwes leadership.\n\nCritics argue that the government is deflecting attention from the core issuesystemic corruption and the illicit gold tradeby targeting smaller smuggling activities involving everyday goods.\n\nThe timing is no coincidence. By focusing on consumer goods, the government is attempting to distract from the revelations of high-level gold smuggling that implicates Mnangagwas close allies, said a political analyst who spoke on condition of anonymity.\n\nWarnings and Arrests\n\nAuthorities have arrested over 15,000 individuals for smuggling since January, with officials warning that the festive season will see even stricter enforcement. Diasporans returning for the holidays face arrest for undeclared items, while businesses caught using parallel market exchange rates or selling counterfeit goods are also in the crosshairs.\n\nEng Muguti issued a stern warning: There will be no fines for violations at roadblocks. Those caught will be arrested on the spot. You risk spending Christmas behind bars.\n\nDespite these warnings, questions remain about whether this operation will truly address Zimbabwes smuggling crisisor if its simply a tool to silence dissent and distract from the deeper scandals involving the nations leadership.\n\nPattni and Mnangagwa: The Untouched Connection\n\nKamlesh Pattnis involvement in the gold smuggling scandal underscores the hypocrisy of the governments sudden anti-smuggling zeal. While thousands of ordinary citizens face arrest for minor infractions, those implicated in large-scale gold smuggling, including Pattni, remain untouched.\n\nPattni, a central figure in the sanctions, has been accused of laundering millions of dollars through Zimbabwes gold exports to fund election rigging operations that bolstered Mnangagwas regime. Despite mounting evidence, the government has yet to take meaningful action against him or his associates.\n\nA Nation in Crisis\n\nZimbabwes crackdown on smuggling may appear to be a move to protect the economy and local industry, but many see it as a strategic deflection from the deeper corruption plaguing the nation. With the president and his allies increasingly under international scrutiny, the question remains: will Zimbabwe confront its gold smuggling epidemic at the highest levels, or will ordinary citizens bear the brunt of a campaign designed to protect the powerful?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Analysis| In a sudden and aggressive move, the Zimbabwean government has launched a door-to-door crackdown on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/guilty-govt-launches-smuggling-crackdown-amid-gold-smuggling-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Guilty Govt Launches “Smuggling Crackdown” Amid Gold Smuggling Scandal\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Pollution Hits Lake Chivero",
            "url": "https://www.zimeye.net/2024/12/19/pollution-hits-lake-chivero/",
            "content": "By A Correspondent\n\nMassive pollution has led to the suspension of fishing activities at Lake Chivero, one of Zimbabwes seven Ramsar-protected sites, following reports of over a thousand dead fish washing ashore. This alarming development has raised concerns about the lakes environmental health and the safety of its aquatic resources.\n\nRecent reports indicate a sharp increase in toxic algae blooms in the lake, resulting in the deaths of several animals. Among the casualties are four rhinos, three zebras, four wildebeests, and four fish eagles. The rising pollution levels have made the lake a danger to both wildlife and humans.\n\nThe situation has sparked outrage and concern from local residents. The Harare Residents Association Trust has called on the city council to urgently address the issue. The situation at Lake Chivero is not to be taken lightly. The city council needs to tell us what is going on, especially regarding the water. We all know that the Harare catchment area depends on the lake for its water, and for us to see the pictures of dead fish and animals circulating on social media is alarming. Are we safe from the contamination that has taken place, and what are they doing to ensure our safety? asked Mr. Precious Shumba, chairperson of the Harare Residents Trust.\n\nReuben Akili, the director of the Combined Harare Residents Association, also expressed concern over the ongoing issue of water contamination at Lake Chivero. This issue of water contamination at Lake Chivero has been going on for a long time, and the city fathers have been given leeway for too long. Now its time for the government and relevant authorities, including bodies like EMA, to intervene and fix this once and for all. A state of emergency or disaster has to be declared because if fish and animals are dying, what about us humans? Akili stated.\n\nMr. Goodlife Mudzingwa, the program manager at the Community Water Alliance, further emphasized the need for urgent action. Our sewer plants have a design capacity of 80 megalitres, but we are currently channeling about 200 megalitres of sewage through them. We need to expand our plants to accommodate this excess, which is now being dumped into the lake, causing animal deaths and posing a health risk to residents, Mudzingwa said.\n\nThe ongoing pollution crisis at Lake Chivero has highlighted the urgent need for action to protect the lakes ecosystem and safeguard the health of both wildlife and humans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Massive pollution has led to the suspension of fishing activities at Lake Chivero, one of Zimbabwe’s seven … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/pollution-hits-lake-chivero/\">Continue reading<span class=\"screen-reader-text\"> \"Pollution Hits Lake Chivero\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Mnangagwa Assembles Private Army to Counter Chiwenga’s Military",
            "url": "https://www.zimeye.net/2024/12/19/mnangagwa-assembles-private-army-to-counter-chiwengas-military/",
            "content": "By A Correspondent | ZimEye |President Emmerson Mnangagwa is reportedly building a private militia to counter his deputy, Vice President Constantino Chiwenga, in what insiders describe as an escalating power struggle between Zimbabwes top leaders.\n\nEmmerson Mnangagwa and his just awarded hospitality-degree-holder wife, Auxillia is since 2021 assembling their own army of armed robbers to ward off [Vice President] Constantino Chiwengas military, this investigation reveals.This is a developing security nexus showing thepic.twitter.com/H5i5mARY7j\n\nThis investigation reveals that the Mnangagwa family, led by the president and his wife, Auxillia Mnangagwa, has been assembling an armed network since 2021, comprising convicted criminals and state security forces to consolidate power and neutralize potential threats from Chiwengas military faction.\n\nAuxillia Mnangagwas Shadow Role in Security Affairs\n\nFirst Lady Auxillia Mnangagwa, fresh from receiving her controversial hospitality degree, has emerged as a central figure in this shadowy operation. Reports link her to deploying soldiers, Central Intelligence Organisation (CIO) operatives, and riot police to enforce her will.\n\nIn 2021, Auxillia used state security forces to impose her brother, a convicted armed robber, as Chief Negomo in Chiweshe. Video evidence and eyewitness accounts contradict her public denials of involvement. Despite her claim that she merely attended the event as an observer, footage shows her actively participating in the installation ceremony and addressing the crowd with a microphone.\n\nA Convicted Criminal at the Helm of State Residences\n\nThe appointment of Paradzai Kutyauripo, Auxillias brother, as Chief Negomo raises serious national security concerns. Kutyauripo, who served four years in Chikurubi Maximum Prison for armed robbery, was released early through a presidential amnesty signed by Mnangagwa during his tenure as Justice Minister. Kutyauripo now holds dual roles as Chief Negomo and Director of State Residencesa combination that has sparked outrage.\n\nIs the nation safe? investigative journalist Simba Chikanza asked, highlighting the risks of Kutyauripos criminal network infiltrating the nations highest offices. What does it mean for an armed robber to oversee all State Residences? Any criminal fleeing the law could simply take refuge in State House, ending any investigation.\n\nMilitarized Takeover of Chiweshe\n\nDuring the 2021 takeover of the Negomo chieftainship, Auxillia reportedly led a military motorcade into Chiweshe, accompanied by heavily armed soldiers and police. Residents allege they were intimidated into submission, with soldiers seizing personal belongings and silencing dissent.\n\nThe late Chief Negomos wife was seen on camera crying as Auxillias forces allegedly attempted to confiscate her property. Family sources claim Auxillia declared, If you all dont want this to happen, I will take the pin myself and wear it.\n\nAuxillia has denied all allegations, but her involvement is corroborated by multiple witnesses, video footage, and local leaders who claim the First Ladys power extends far beyond her ceremonial role.\n\nMnangagwas Private Army: A Counter to Chiwenga?\n\nInsiders suggest Mnangagwas actions are part of a broader strategy to counterbalance Chiwenga, whose military ties make him a formidable rival. The creation of a private militia comprising convicted criminals and rogue state agents signals Mnangagwas intent to secure his political survival at all costs.\n\nChiwenga has been vocal in criticizing Mnangagwas administration, accusing it of rampant corruption. Many interpret this as a direct challenge to the presidents authority. With tensions between the two escalating, Zimbabwes security apparatus is increasingly polarized, with factions loyal to Mnangagwa and Chiwenga locked in a dangerous power struggle.\n\nA Nation at Risk\n\nObservers warn that Mnangagwas reliance on armed criminals and rogue operatives undermines national security and risks plunging Zimbabwe into chaos. The First Ladys unprecedented role in deploying state resources for personal and political gain raises further questions about governance under Mnangagwa.\n\nAs the feud between Mnangagwa and Chiwenga intensifies, Zimbabweans are left to wonder: how much longer can the country endure the fallout of this high-stakes political battle?\n\nThis is a developing story. Stay tuned for more updates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | President Emmerson Mnangagwa is reportedly building a private militia to counter his deputy, Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/mnangagwa-assembles-private-army-to-counter-chiwengas-military/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Assembles Private Army to Counter Chiwenga’s Military\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Magaya Faces Disqualification From ZIFA Polls",
            "url": "https://www.zimeye.net/2024/12/19/magaya-faces-disqualification-in-zifa-polls/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) executive committee elections, scheduled for January 25, 2025, have hit a snag. Three presidential candidates, Martin Kweza, Philemon Machana, and Prophet Walter Magaya, face potential disqualification due to legal challenges.\n\nChallenged Candidatures\n\nProphet Magaya, Kweza, and Machanas nominations are under review by the Ethics Committee, which will announce successful candidates on December 23. The committee must carefully evaluate evidence and allegations, ensuring candidates meet ZIFA statutes.\n\nCandidates in the Running\n\nEthics Committees Role\n\nAccording to sports lawyer Allan Murimirwa, the Ethics Committee will assess evidence and make judgments based on ZIFA statutes. The committees decisions are binding, emphasizing its crucial role in ensuring candidate eligibility, independence, and integrity.\n\nWith the elections approaching, the outcome of the Ethics Committees review will shape Zimbabwean footballs future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) executive committee elections, scheduled for January 25, 2025, have hit a snag. Three … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/magaya-faces-disqualification-in-zifa-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Faces Disqualification From ZIFA Polls\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Chiwenga-ED War Intensifies as Councillor Suspended Over Mnangagwa 2030 Slogan",
            "url": "https://www.zimeye.net/2024/12/19/chiwenga-ed-war-intensifies-as-councillor-suspended-over-mnangagwa-2030-slogan/",
            "content": "The escalating factionalism within Zimbabwes ruling ZANU-PF party has reached a boiling point, with the suspension of a Masvingo-based councillor over his refusal to endorse the controversial slogan, 2030 VaMnangagwa Vanenge Vachipo (Mnangagwa Will Rule Till 2030).\n\nBrighton Mushekwa, a ZANU-PF councillor for Ward 12 in Bikita, was verbally expelled from his position by the partys deputy secretary for youth affairs, John Paradza. This follows allegations that Mushekwa opposed the slogan and was aligned with Vice President Constantino Chiwengas faction, which is reportedly angling for leadership beyond 2028.\n\nThe slogan, which originated in Masvingo Province, has been a source of division in ZANU-PF, with party members claiming it has not been approved by the Central Committee, the partys highest decision-making body. Despite this, provincial leaders have been enforcing its adoption, threatening dissenters with expulsion.\n\nCouncillor Denies Factional Ties\n\nMushekwa denies any allegiance to Chiwengas camp, maintaining that he is a constitutionalist who supports the sitting president, Emmerson Mnangagwa. I dont belong to any faction. I support the current president and the party constitution, which is the guiding document for all members, Mushekwa toldTellZim News.\n\nHe also argued that no one has the mandate to force members to chant a slogan that has not received formal approval. The party constitution says the Central Committee must approve all slogans. 2030 VaMnangagwa Vanenge Vachipo is not part of our constitution. Forcing members to chant it is an abuse of power, he said.\n\nMushekwas alleged verbal expulsion occurred during a District Coordinating Committee (DCC) meeting in Bikita after complaints that he was opposing the slogan. However, ZANU-PF Masvingo Provincial Spokesperson Pepukai Chiwewe dismissed the expulsion as invalid, stating that due process had not been followed.\n\nThere are protocols for suspending or expelling a member, including hearings from district to national levels. If these were not followed, then the expulsion is not valid, Chiwewe said.\n\nFactional Tensions and Allegations of Corruption\n\nThe controversy comes amid growing tensions between factions loyal to Mnangagwa and those aligned with Chiwenga. Recently, the vice president publicly declared that corruption has destroyed Zimbabwe, a statement widely interpreted as a veiled attack on Mnangagwas leadership.\n\nMasvingo Province has become a hotbed of factional battles, with local leaders reportedly adamant about enforcing the slogan despite Mnangagwas own indications that he will not seek office in 2030.\n\nObservers believe the slogans enforcement is a strategic move to solidify Mnangagwas grip on power while sidelining perceived threats within the party. However, dissenters like Mushekwa argue that these tactics undermine party unity and constitutional integrity.\n\nWhats Next for ZANU-PF?\n\nThe factional infighting within ZANU-PF raises questions about the partys stability as it faces growing economic challenges and public discontent. With provincial leaders threatening punitive measures against those opposing the slogan, the internal cracks appear to be widening.\n\nMushekwas case is expected to set a precedent for how dissenting voices are treated within the ruling party, as ZANU-PF continues to grapple with its leadership struggles ahead of the 2028 elections. TellZim\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The escalating factionalism within Zimbabwe’s ruling ZANU-PF party has reached a boiling point, with the suspension of a Masvingo-based councillor … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/chiwenga-ed-war-intensifies-as-councillor-suspended-over-mnangagwa-2030-slogan/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga-ED War Intensifies as Councillor Suspended Over Mnangagwa 2030 Slogan\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        },
        {
            "title": "Is Mnangagwa Losing His Grip on Power?",
            "url": "https://www.zimeye.net/2024/12/19/is-mnangagwa-losing-his-grip-on-power/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has issued a strong warning to cabinet ministers who regularly miss his weekly cabinet meetings, instead sending their deputies to represent them.\n\nDuring his final cabinet meeting of 2024 at State House on Tuesday, December 17, Mnangagwa made it clear that such practices would no longer be tolerated in the coming year. He stated:\n\nThe troubling trend of ministers being absent from meetings is unacceptable.\n\nIn some instances, lower-level officials are sent to attend, merely occupying space without meaningful contribution.\n\nLooking ahead to 2025, Mnangagwa instructed the Chief Secretary to closely monitor attendance and ensure that ministers and officials comply with the expectations, or face serious consequences.\n\nPermanent Secretaries must ensure that, in their absence, only directors or higher-ranking officials attend Working Party Meetings, he added. If deputy ministers are assigned, they must be properly equipped to engage in discussions effectively, with their deputies thoroughly briefed to ensure productive participation.\n\nIn a further announcement, Mnangagwa revealed that starting next year, deputy ministers will be required to sign performance contracts, similar to those signed by their senior counterparts.\n\nThe president also voiced dissatisfaction with the current state of government websites, emphasizing that despite the countrys wealth of ICT talent, many ministry websites remain outdated or non-functional.\n\nAdditionally, Mnangagwa called for significant improvements in the governments communication strategies, urging more effective dissemination of information.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has issued a strong warning to cabinet ministers who regularly miss his weekly cabinet … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/is-mnangagwa-losing-his-grip-on-power/\">Continue reading<span class=\"screen-reader-text\"> \"Is Mnangagwa Losing His Grip on Power?\"</span></a></p>",
            "time": "09:46",
            "date": "19 Dec 2024"
        }
    ]
}