{
    "news": [
        {
            "title": "Zemura, Jalai Shine For Warriors",
            "url": "https://www.zimeye.net/2025/03/21/zemura-jalai-shine-for-warriors/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Warriors recently took to the field, and while the teams performance was a mixed bag, two players stood out for their exceptional display: Jordan Zemura and Emmanuel Jalai.\n\nZemura, in particular, has been making waves with his impressive skills, cementing his position as a key player for the Warriors. His outstanding performance has earned him recognition as the shining star of the team.\n\nJalai also put in a fantastic shift, showcasing his talent and work ethic. However, there is room for improvement, particularly in his crossing ability. With some fine-tuning, Jalai has the potential to become an even more formidable force on the field.\n\nOn the other hand, seasoned goalkeeper Washington Arubi had a disappointing outing, committing basic errors that are concerning for a player of his experience. Arubis mistake was uncharacteristic, and he needs to regain his focus and composure, especially with the AFCON tournament looming in nine months.\n\nAs Arubi prepares for future matches, he would do well to adopt a more practical approach, prioritizing safety over flair, much like Manchester Uniteds David De Gea.\n\nBy doing so, he can avoid repeating costly mistakes and help the Warriors achieve success in upcoming tournaments.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Warriors recently took to the field, and while the team’s performance was a mixed bag, two … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/zemura-jalai-shine-for-warriors/\">Continue reading<span class=\"screen-reader-text\"> \"Zemura, Jalai Shine For Warriors\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Full Text: Gomwe Statement after Vandalism At Family Home",
            "url": "https://www.zimeye.net/2025/03/21/full-text-gomwe-statement-after-vandalism-at-family-home/",
            "content": "Good evening cadres\n\nI stand unwavering and unshaken by the recent vandalism incident at my rural homestead in Zvimba. This cowardly and barbaric act will not intimidate me, nor will it deter our collective march towards a brighter future.\n\nSuch acts of violence and intimidation only serve to expose the desperation and fear of those who seek to undermine our progress.\n\nLet me be clear: these tactics will not succeed. The revolution that seeks to emancipate our people and bring us to greater heights will not be stopped by senseless acts of destruction.\n\nTo the perpetrators,you will face the full wrath of the law. Justice will be served, and you will be held accountable for your actions.\n\nTo my fellow comrades, let us stand strong and united in the face of such cowardice. Let us continue to push forward, undeterred, towards a future that is brighter, more just, and more equal for all.\n\nAluta continua\n\n# No to 2030# Gudo Guru woyeee\n\nGifford Gomwe\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Good evening cadres I stand unwavering and unshaken by the recent vandalism incident at my rural homestead in Zvimba. This … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/full-text-gomwe-statement-after-vandalism-at-family-home/\">Continue reading<span class=\"screen-reader-text\"> \"Full Text: Gomwe Statement after Vandalism At Family Home\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Michael Nees Reflects On Draw With Benin",
            "url": "https://www.zimeye.net/2025/03/21/michael-nees-reflects-on-draw-with-benin/",
            "content": "By Sports Correspondent\n\nZimbabwes national football team, the Warriors, staged an impressive comeback to secure a 2-2 draw against Benin in a thrilling FIFA World Cup qualifier held in Durban.\n\nBenin dominated the early stages of the match, scoring two goals to take a commanding lead. However, the Warriors refused to give up, with captain Knowledge Musona leading the charge by scoring a crucial goal that sparked hope for his side.\n\nWe gave everything, said Warriors coach Michael Nees, reflecting on the match. The team showed great spirit and determination to come back from two goals down.\n\nMusonas goal marked a turning point in the match, as Zimbabwe gained momentum and began to push for an equalizer. Marshall Munetsi eventually found the back of the net, securing a valuable point for the Warriors.\n\nNees also praised his decision to start with Jalai, saying, Starting with Jalai was the right decision. He brought a new dimension to our attack.\n\nHowever, Nees noted that Musona was showing signs of fatigue, which led to his substitution. Knowledge was showing signs of fatigue, thats why we took him off, Nees explained.\n\nThe draw leaves Benin at the top of Group C with eight points, while Zimbabwe remains five points adrift. Despite the challenge ahead, Nees remains optimistic about his teams chances of qualifying for the World Cup.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Zimbabwe’s national football team, the Warriors, staged an impressive comeback to secure a 2-2 draw against Benin … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/michael-nees-reflects-on-draw-with-benin/\">Continue reading<span class=\"screen-reader-text\"> \"Michael Nees Reflects On Draw With Benin\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "The Importance of Helmets and Seat Belts",
            "url": "https://www.zimeye.net/2025/03/21/the-importance-of-helmets-and-seat-belts/",
            "content": "In todays fast-paced world, we often overlook one of the simplest yet most effective ways to safeguard our lives and the lives of those we care about: wearing helmets and seat belts. Whether youre cycling, riding a motorcycle, or simply driving a car, these preventive measures play a crucial role in reducing the risk of injuries and fatalities in the event of an accident.\n\nHelmets: A Life-Saving Accessory\n\nHelmets are an essential piece of safety equipment for anyone participating in activities such as biking, motorcycling, or even skateboarding. They are designed to protect the most vital part of your bodyyour brain. In fact, research has shown that wearing a helmet significantly reduces the risk of head injury and death. According to studies, wearing a helmet while riding a bicycle can reduce the risk of a head injury by up to 70%. For motorcyclists, this number is just as impressive, with helmets reducing the risk of a fatal head injury by 37%.\n\nDespite the overwhelming evidence, many people still neglect to wear helmets, often due to inconvenience, discomfort, or a sense of invincibility. The truth is, accidents can happen in the blink of an eye, and in those moments, a helmet can be the difference between life and death.\n\nSeat Belts: A Simple Yet Effective Safety Tool\n\nSeat belts are just as crucial for protecting yourself while driving or riding in a car. In the United States alone, the Centers for Disease Control and Prevention (CDC) report that seat belts save thousands of lives each year. Wearing a seat belt reduces the risk of fatal injury to front-seat passengers by 45%, and it lowers the risk of moderate to severe injuries by 50%.\n\nWhile many people might think theyre safe driving short distances or at low speeds, the reality is that most car accidents happen within a few miles of home or at low speeds. Even minor accidents can result in serious injuries or fatalities if youre not wearing a seat belt. Unfortunately, many people still neglect to buckle up, putting themselves and their passengers at risk.\n\nBe Your Own Advocate\n\nOne of the most empowering actions you can take for yourself and your loved ones is to become your own advocate when it comes to safety. This means consistently wearing a helmet when engaging in activities like biking or motorcycling, and always buckling up before you start driving or riding in a car. Taking these precautions not only ensures your own well-being, but it also sets a positive example for your family and friends.\n\nMoreover, educating othersespecially children and teenagersabout the importance of wearing helmets and seat belts can have a lasting impact. Encourage your loved ones to adopt safe practices, and dont hesitate to speak up if you see someone not wearing their helmet or seat belt. By advocating for safety, you contribute to creating a culture of care, responsibility, and mutual protection.\n\nThe Power of Prevention\n\nIn life, there are many things we cannot control. Accidents, however, are one thing we can work to prevent. By wearing helmets and seat belts, you are taking proactive steps to protect yourself and your loved ones from preventable injuries and deaths. These simple actions dont just save livesthey also provide peace of mind.\n\nUltimately, the decision to wear a helmet or seat belt isnt just about following the law or avoiding finesits about being a responsible individual who values their life and the lives of others. Become your own advocate for safety, and inspire others to do the same. Protect yourself, protect your family, and together, lets make safety a priority.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In today’s fast-paced world, we often overlook one of the simplest yet most effective ways to safeguard our lives and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/the-importance-of-helmets-and-seat-belts/\">Continue reading<span class=\"screen-reader-text\"> \"The Importance of Helmets and Seat Belts\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Zanu PF Claims Credit for Kirsty Coventry’s Election as IOC President",
            "url": "https://www.zimeye.net/2025/03/21/zanu-pf-claims-credit-for-kirsty-coventrys-election-as-ioc-president/",
            "content": "By A Correspondent\n\nThe Zanu PF Masvingo Youth League has publicly claimed credit for the election of Zimbabwes Sports Minister Kirsty Coventry as the 10th President of the International Olympic Committee (IOC).\n\nHer election, which took place at the 144th IOC Session in Costa Navarino, Greece, has stirred significant political commentary, with the ruling party asserting that Coventrys success is a direct result of the leadership of President Emmerson Mnangagwa.\n\nIn a statement released on Friday morning, a Zanu PF Masvingo Youth League official congratulated Coventry, highlighting the partys belief that her election was inspired by President Mnangagwas leadership and the strength of the Zanu PF party.\n\nCongratulations to Kirsty Coventry on her election as the 10th President of the International Olympic Committee at the 144th IOC Session in Costa Navarino.\n\nShe belongs to the winning team Zanu PF. Her victory is our victory. It is President Mnangagwas victory and indeed the nations victory, the official said.\n\nCoventrys election to the prestigious position marks a significant achievement for Zimbabwe and the international sports community.\n\nHowever, Zanu PF has been quick to tie her success to the political influence of President Mnangagwa, framing it as a testament to his leadership and the partys ability to deliver results for Zimbabweans on the world stage.\n\nThis claim of credit comes amidst ongoing political discourse, where Zanu PF has often linked the achievements of individuals, especially in global forums, to the broader successes of the ruling party and its president.\n\nThe Masvingo Youth Leagues statement reflects this tendency, with party officials eager to align themselves with high-profile successes such as Coventrys IOC presidency.\n\nAs the international sporting community celebrates her achievement, political implications continue to surface at home, with the ruling party positioning itself as the driving force behind Zimbabwes representation on the global stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zanu PF Masvingo Youth League has publicly claimed credit for the election of Zimbabwe’s Sports Minister … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/zanu-pf-claims-credit-for-kirsty-coventrys-election-as-ioc-president/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Claims Credit for Kirsty Coventry’s Election as IOC President\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Zanu PF Hardliners Declare Holy Ten Is Untouchable",
            "url": "https://www.zimeye.net/2025/03/21/zanu-pf-hardliners-declare-holy-ten-is-untouchable/",
            "content": "By A Correspondent\n\nZimbabwean hip-hop artist Mukudzei Chitsama, better known as Holy Ten, has garnered support from Zanu PF hardliners after being embroiled in a defamation lawsuit filed by social media figure Mama Vee.\n\nThe lawsuit stems from allegations that Holy Ten made defamatory remarks about Mama Vees character, which has led to a growing public dispute.\n\nHoly Tens troubles began on March 4, 2025, when he posted a video on his Instagram account (@holytenmusic), where he allegedly referred to Mama Vee as a Ngochani, a derogatory term in local vernacular meaning homosexual.\n\nFurther fuel was added to the fire during an interview on March 18, 2025, on the DJ Ollah 7 podcast, where Holy Ten allegedly reiterated similar statements, accusing Mama Vee of being a bad influence on youth and questioning his worthiness of the NAMA awards.\n\nThe controversy intensified when Holy Ten claimed that, during a chance encounter on a plane from South Africa to Zimbabwe on March 10, 2025, he had greeted Mama Vee in a similar derogatory manner. These statements have sparked public outrage and are at the heart of the lawsuit.\n\nMama Vees legal representatives have issued a letter of demand, which outlines the defamatory nature of Holy Tens comments. The letter states that the statements made by Holy Ten were not only untrue but also malicious, damaging Mama Vees reputation as a respected public figure. The legal team argues that these comments have portrayed Mama Vee as a homosexual with a negative societal influence, damaging both his personal and business reputation.\n\nThe lawsuit further alleges that Holy Tens statements have led to significant financial losses for Mama Vee, as some of his partnerships have been severed. His reputation as a brand influencer, with over a million social media followers, has reportedly suffered as a result of the controversy.\n\nAs part of the legal proceedings, Mama Vees lawyers have demanded that Holy Ten publicly retract his statements within 48 hours and pay monetary compensation amounting to US$ 100,000 for damages caused by the defamation.\n\nAmid the legal battle, Holy Ten has garnered backing from Zanu PF hardliners, with youth league official Taurai Kandishaya expressing strong support for the artist. In a statement issued on Thursday, Kandishaya emphasized the importance of defending Zimbabwes cultural values, including opposition to homosexuality.\n\nKandishaya was quoted as saying, Uyu Mupfanha wedu Zvekutodaro! Anyway, its high time we defended our constitution and cultural values by putting a stop to content that violates our moral values. We are not a nation that promotes or condones homosexuality. Be warned.\n\nHe further expressed that, similar to companies like Toyota halting sponsorships for LGBT-related causes, individuals should also stop supporting those who promote such views. Kandishaya urged people to buy from dignified suppliers.\n\nThe controversy surrounding Holy Ten has not been limited to Mama Vee. The artist has also clashed with other public figures, including Mudiwa Hood and Uebert Angel, who are both reportedly considering legal action against him. The situation has become a growing storm for Holy Ten, who continues to face both legal and public backlash over his remarks.\n\nAs the lawsuits unfold, it remains to be seen how the situation will evolve, with political factions and public figures taking sides in what has become a high-profile dispute.\n\nHoly Tens actions have ignited discussions on free speech, cultural values, and the boundaries of public expression in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean hip-hop artist Mukudzei Chitsama, better known as Holy Ten, has garnered support from Zanu PF hardliners … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/zanu-pf-hardliners-declare-holy-ten-is-untouchable/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hardliners Declare Holy Ten Is Untouchable\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Nelson Chamisa: I Am Open To Dialogue But Currently Not In Talks With Anybody",
            "url": "https://www.zimeye.net/2025/03/21/nelson-chamisa-i-am-open-to-dialogue-but-currently-not-in-talks-with-anybody/",
            "content": "By A Correspondent\n\nZimbabwes charismatic opposition leader, Advocate Nelson Chamisa, has reaffirmed his openness to dialogue but emphasized that he is not currently involved in any negotiations or discussions with anyone. In a statement released on Friday, Chamisa addressed ongoing speculation regarding his role in the countrys political crisis and clarified his stance on the issue.\n\nI want to clarify that my door is always open to speak with anyone who reaches out to me for constructive conversations and nation building, Chamisa said. However, I have not been involved in recent dialogues with anyone.\n\nThe opposition leaders remarks come amid increasing political tension in Zimbabwe, as the country grapples with an ongoing crisis and infighting within the ruling party, Zanu PF. Chamisa cautioned against any attempts to involve him in matters that do not directly concern him, distancing himself from issues that are unrelated to his leadership and vision for Zimbabwes future.\n\nI dont want to be made the focal point of things that have nothing to do with me, Chamisa stressed, clearly defining the boundaries of his involvement in current political dynamics.\n\nWhile he has made it clear that he remains open to constructive discussions aimed at nation building, Chamisas comments reflect a cautious approach to the political climate, where calls for dialogue and reconciliation are often intertwined with power struggles. He did not offer specifics on what conditions or parties he would be willing to engage with but underlined his commitment to moving Zimbabwe forward through inclusive and meaningful conversations.\n\nThe situation in Zimbabwe remains tense, with a deeply divided political landscape that has led to widespread unrest and calls for reform. Chamisa, as leader of the opposition Citizens Coalition for Change (CCC), has been a vocal critic of the current governments handling of the countrys economic and political crises. However, his latest statement underscores the importance of maintaining focus on constructive engagements rather than getting entangled in distractions or disputes that do not directly relate to his mission for the nation.\n\nThe opposition leaders cautious remarks also reflect his awareness of the internal struggles within Zanu PF, which has been plagued by infighting in recent months. While Chamisa did not delve deeply into the specifics of these divisions, his acknowledgment of the current crisis suggests he is closely monitoring the situation, perhaps positioning himself as a key player in the future of Zimbabwes political landscape.\n\nAs the nation awaits further developments, it remains to be seen whether Chamisas calls for dialogue will translate into meaningful negotiations or whether the political landscape will continue to be defined by conflict and division.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s charismatic opposition leader, Advocate Nelson Chamisa, has reaffirmed his openness to dialogue but emphasized that he … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/nelson-chamisa-i-am-open-to-dialogue-but-currently-not-in-talks-with-anybody/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa: I Am Open To Dialogue But Currently Not In Talks With Anybody\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Holy Ten Seeks Protection From Mnangagwa Amid Defamation Lawsuits",
            "url": "https://www.zimeye.net/2025/03/21/holy-ten-seeks-protection-from-mnangagwa-amid-defamation-lawsuits/",
            "content": "By A Correspondent\n\nZimbabwean hip-hop artist Mukudzei Chitsama, better known as Holy Ten, has garnered support from Zanu PF hardliners after being embroiled in a defamation lawsuit filed by social media figure Mama Vee.\n\nThe lawsuit stems from allegations that Holy Ten made defamatory remarks about Mama Vees character, which has led to a growing public dispute.\n\nHoly Tens troubles began on March 4, 2025, when he posted a video on his Instagram account (@holytenmusic), where he allegedly referred to Mama Vee as a Ngochani, a derogatory term in local vernacular meaning homosexual.\n\nFurther fuel was added to the fire during an interview on March 18, 2025, on the DJ Ollah 7 podcast, where Holy Ten allegedly reiterated similar statements, accusing Mama Vee of being a bad influence on youth and questioning his worthiness of the NAMA awards.\n\nThe controversy intensified when Holy Ten claimed that, during a chance encounter on a plane from South Africa to Zimbabwe on March 10, 2025, he had greeted Mama Vee in a similar derogatory manner. These statements have sparked public outrage and are at the heart of the lawsuit.\n\nMama Vees legal representatives have issued a letter of demand, which outlines the defamatory nature of Holy Tens comments. The letter states that the statements made by Holy Ten were not only untrue but also malicious, damaging Mama Vees reputation as a respected public figure. The legal team argues that these comments have portrayed Mama Vee as a homosexual with a negative societal influence, damaging both his personal and business reputation.\n\nThe lawsuit further alleges that Holy Tens statements have led to significant financial losses for Mama Vee, as some of his partnerships have been severed. His reputation as a brand influencer, with over a million social media followers, has reportedly suffered as a result of the controversy.\n\nAs part of the legal proceedings, Mama Vees lawyers have demanded that Holy Ten publicly retract his statements within 48 hours and pay monetary compensation amounting to US$ 100,000 for damages caused by the defamation.\n\nAmid the legal battle, Holy Ten has garnered backing from Zanu PF hardliners, with youth league official Taurai Kandishaya expressing strong support for the artist. In a statement issued on Thursday, Kandishaya emphasized the importance of defending Zimbabwes cultural values, including opposition to homosexuality.\n\nKandishaya was quoted as saying, Uyu Mupfanha wedu Zvekutodaro! Anyway, its high time we defended our constitution and cultural values by putting a stop to content that violates our moral values. We are not a nation that promotes or condones homosexuality. Be warned.\n\nHe further expressed that, similar to companies like Toyota halting sponsorships for LGBT-related causes, individuals should also stop supporting those who promote such views. Kandishaya urged people to buy from dignified suppliers.\n\nThe controversy surrounding Holy Ten has not been limited to Mama Vee. The artist has also clashed with other public figures, including Mudiwa Hood and Uebert Angel, who are both reportedly considering legal action against him. The situation has become a growing storm for Holy Ten, who continues to face both legal and public backlash over his remarks.\n\nAs the lawsuits unfold, it remains to be seen how the situation will evolve, with political factions and public figures taking sides in what has become a high-profile dispute.\n\nHoly Tens actions have ignited discussions on free speech, cultural values, and the boundaries of public expression in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean hip-hop artist Mukudzei Chitsama, better known as Holy Ten, has garnered support from Zanu PF hardliners … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/holy-ten-seeks-protection-from-mnangagwa-amid-defamation-lawsuits/\">Continue reading<span class=\"screen-reader-text\"> \"Holy Ten Seeks Protection From Mnangagwa Amid Defamation Lawsuits\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Geza Speaks On Raid At His Farm …",
            "url": "https://www.zimeye.net/2025/03/21/geza-speaks-on-raid-at-his-farm/",
            "content": "By A Correspondent\n\nWar veteran and political activist Blessed Geza, who has been at the forefront of a campaign opposing President Emmerson Mnangagwas alleged attempts to extend his tenure beyond 2028, has revealed that his farm was raided by a group of suspected Zanu PF supporters on Thursday night.\n\nIn a statement posted on his official X account, Geza detailed the harrowing experience, indicating that a group of approximately 30 individuals arrived at his farm in two trucks.\n\nAccording to Geza, the thugs violently breached the property, cutting through the perimeter fence, smashing windows, and breaking doors at the main house.\n\nFellow Zimbabwe, I want to report to you that a group of about 30 thugs using two trucks stormed my farm last night, cut the perimeter fence, broke doors, and smashed all window panes on the main house. I strongly suspect they are ZANU PF-sent thugs spoiling for a fight with me, Geza wrote in his post.\n\nGeza, who has been vocal in his opposition to what he perceives as Mnangagwas unconstitutional attempt to remain in power, expressed his belief that the raid was politically motivated. He named several Zanu PF figures whom he suspects are behind the attack, including Legal Ziyambi Ziyambi, MP Polite Kambamura, and Councillor Freedom Matahwa.\n\nI strongly believe Legal Ziyambi Ziyambi, MP Polite Kambamura, and Councillor Freedom Matahwa are behind this. I will not be intimidated by kindergartens. Time for action is now. Watch out, Geza stated, vowing not to be silenced by what he described as kindergartens or political intimidation.\n\nThe attack on Gezas farm comes amid growing political tensions in Zimbabwe as Mnangagwas administration faces increasing opposition, with critics accusing the government of undermining the countrys constitution and seeking to extend presidential term limits. Gezas outspoken criticism and activism against these perceived threats to democracy have made him a target of what he believes are politically motivated attacks.\n\nThe raid has sparked concern about the rising political violence in Zimbabwe, with many questioning the governments role in fostering such actions. Gezas resolve to continue his fight for constitutional integrity and his refusal to be intimidated by the attacks signal his commitment to his cause, despite the mounting pressure.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran and political activist Blessed Geza, who has been at the forefront of a campaign opposing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/geza-speaks-on-raid-at-his-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Speaks On Raid At His Farm …\"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Fairly Known Female Musician Dies",
            "url": "https://www.zimeye.net/2025/03/21/fairly-known-female-musician-dies/",
            "content": "By Showbiz Reporter- Fairly knownfemalemusicianVeronica Chibandahas died.\n\nShe was 52.\n\nChibanda passed away in the early hours of Thursday, March 20, 2025, after a brief illness.\n\nThe exact cause of death has notbeen disclosed.\n\nTheZimbabwe Music Rights Association (ZIMURA)confirmed her passingin a statement, describing her as acherished member of ZIMURA and a revered figure in the music industry.\n\nBorn onMay 2, 1973, Chibanda rose to prominence in the early 2000s with the release of her debut album,Anouya Zvekare.\n\nThealbumstitle track became an instant hit, earning her recognition as one of the leading female voices in the genre.\n\nOver the years, Chibanda releasedseveral albums which solidified her reputation as a storyteller through music.\n\nHer lyrics often touched on themes of love, resilience, and cultural heritage, resonating deeply with fans across Zimbabwe and beyond\n\n.\n\nIn addition to her music career, Chibanda was a passionate advocate forwomen in the arts, mentoring young female musicians and campaigning for better copyright protection for local artists.\n\nShe was an active member of ZIMURA, working to ensure fair compensation for musicians in Zimbabwe.\n\nFuneral arrangements are yet tobe announced.\n\nMay her soul rest in eternal peace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter- Fairly known female musician Veronica Chibanda has died.  She was 52. Chibanda passed away in the early hours of Thursday, March … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/21/fairly-known-female-musician-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Fairly Known Female Musician Dies \"</span></a></p>",
            "time": "09:07",
            "date": "22 Mar 2025"
        }
    ]
}