{
    "news": [
        {
            "title": "Parents Confront School Authorities Over “Chibuwe Bus Scandal”",
            "url": "https://www.zimeye.net/2025/11/20/parents-confront-school-authorities-over-chibuwe-bus-scandal/",
            "content": "Chibuwe, Chipinge- Tensions between parents and school authorities at Chibuwe Primary School escalated this week over unresolved questions surrounding the acquisition and management of a school bus purchased under unclear circumstances.\n\nA high-level meeting was convened on Friday and attended by representatives from the Ministry of Primary and Secondary Education, including Chipinge South Acting District Schools Inspector Mr Mapfumo, Chipinge West Schools Inspector Mr Taruberekera, the District Accountant Mr Dumba, and council representative Mr Maposa. Officers from the Zimbabwe Republic Police Assistant Inspector Tapfumanei, Sergeant Mudondo and Nemaungwa were also present, together with School Development Committee (SDC) representatives Mr Chipokore, Mrs Chishiri, Mrs Chikumba, and the school head.\n\nThe meeting followed growing concern in the community after Ecobank officials visited the school to check on instalments due for the recently purchased bus. According to discussions at the meeting, Ecobank facilitated the acquisition of the bus on a zero-deposit arrangement, meaning the school owes the bank the full purchase amount to be paid through instalments.\n\nParents say the school head and SDC failed to provide satisfactory answers on key issues, including:\n\nParents allege that attempts to obtain this information were met with evasive responses, prompting a public demonstration on Thursday.\n\nDuring the meeting, Ministry officials urged calm and appeared to back the headmaster, arguing that processes were underway to address the parents concerns. However, parents insisted they had lost confidence in his leadership.\n\nOur position as parents is that the headmaster must go. We have failed to work with him, said one parent. He is rough to the parents, and when we ask about school matters he tells us to go to school to become administrators. He thinks of his pocket, not the learners.\n\nParents accuse the headmaster of prioritising the bus project ahead of urgent learner needs such as textbooks, desks, writing materials and reading resources.\n\nWhen pressed on whether the head would be transferred, one Ministry official said, On the issue of transferring the head, we cannot comment on that today.\n\nConcerns over school buses have become common in the district. The Chibuwe dispute follows earlier controversies at Checheche Primary School, where accountability questions arose before the eventual passing of headmaster Mr Gandi. A similar case was reported at Ngangu Primary School in Chimanimani, where a newly purchased bus was ultimately returned to the supplier.\n\nMinistry officials said they were working to resolve the issues raised and would continue engaging stakeholders. Parents, however, maintain that without leadership change and financial transparency, trust cannot be restored.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chibuwe, Chipinge- Tensions between parents and school authorities at Chibuwe Primary School escalated this week over unresolved questions surrounding the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/parents-confront-school-authorities-over-chibuwe-bus-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Parents Confront School Authorities Over “Chibuwe Bus Scandal”\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "ZANU PF Former DCC Member Dies During Alleged Sexual Encounter",
            "url": "https://www.zimeye.net/2025/11/20/zanu-pf-former-dcc-member-dies-during-alleged-sexual-encounter/",
            "content": "A former ZANU Patriotic Front District Coordinating Committee (DCC) member, Simon Mapamba Mapfumo, died under unusual circumstances during a reported sexual encounter at Mutsingo Lodge in Tanganda last week, leaving the community shocked and speculating about what transpired.\n\nMapfumo, 67, is said to have been with a woman identified as Grace, a long-time acquaintance from Chipinge. Sources claim the two had maintained a relationship for years, during which Mapfumo allegedly used his political influence to facilitate her placement on a war veterans orphans benefits list. She later trained as a teacher at Mutare Teachers College, reportedly with his assistance.\n\nAccording to accounts from individuals close to the pair, the two met at Mutsingo Lodge to settle old obligations. During the encounter, it is alleged that Mapfumo requested oral sex and later asked Grace to get on top. Grace reportedly told investigators that she heard a strange sound from Mapfumo, initially assuming it was part of their activity unaware it was his final breath.\n\nMapfumo was pronounced dead at the scene, and his body was taken to Chipinge Mortuary for further examination.\n\nA controversial figure in local politics, Mapfumo was known as a staunch supporter of Enock Porusingazi . He was accused by opposition activists of playing a key role in intimidation campaigns in the early 2000s, including during the violent 2008 elections, where gangs allegedly assaulted opponents and burned homes in Chipinge South.\n\nPorusingazi, speaking after viewing the body of his late colleague, confirmed the death but avoided discussing the alleged circumstances.\n\nAll I can say is that Simon died at Mutsingo Lodge in Tanganda, where he had booked to rest. His remains were taken by the police to Chipinge Mortuary. We are waiting to hear from the police if there is any foul play, he said.\n\nMapfumo has since been buried at his farm in Chipangayi, where he was accorded district hero status.\n\nPolice are yet to release an official statement regarding the cause of death.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A former ZANU Patriotic Front District Coordinating Committee (DCC) member, Simon Mapamba Mapfumo, died under unusual circumstances during a reported … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/zanu-pf-former-dcc-member-dies-during-alleged-sexual-encounter/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Former DCC Member Dies During Alleged Sexual Encounter\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Mushekwi Continues To Shine",
            "url": "https://www.zimeye.net/2025/11/20/mushekwi-continues-to-shine/",
            "content": "Sports Correspondent  Former Warriors striker Nyasha Mushekwi finished as the top scorer for his club, Dalian Kun City, in the 2025 China League One season.\n\nDespite the team ending the campaign in 8th place, the 38-year-old Mushekwi netted 18 of the clubs 42 goals, showcasing his enduring striking prowess. He shares the third spot on the leagues top scorers list with two other players, trailing the leader, who scored 28 goals, and the second-placed scorer with 22 goals.\n\nMushekwi, who previously starred for CAPS United, joined Dalian Kun City this season from Yunnan Yukun. Last year, he had an impressive tally of 25 goals for his former club.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Former Warriors striker Nyasha Mushekwi finished as the top scorer for his club, Dalian K’un City, in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/mushekwi-continues-to-shine/\">Continue reading<span class=\"screen-reader-text\"> \"Mushekwi Continues To Shine\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "‘Unjust’ Paid Toilet System By Bulawayo City Council",
            "url": "https://www.zimeye.net/2025/11/20/unjust-paid-toilet-system-by-bulawayo-city-council/",
            "content": "Dear City Council Fathers,\n\nWe write this open letter to express our deep disappointment and concern regarding the continued silence from your office following our correspondence initially on the 19th of September 2025 and a follow up letter on the 10th of October about the hygiene challenges associated with the payment system at public toilets.As residents and regular users of these facilities, we raise legitimate issues that affect the health, dignity, and daily wellbeing of community members. The introduction of payment at public toilets was presented as a measure to improve cleanliness and maintenance. Maybe yes, that objective has been realized but it is unfortunate that the reasons for which the public toilets were erected will never be realized despite the fees being collected.City fathers, as Mthwakazi Liberation Movement, believe the payment system creates several negative impacts to the communities of the City of the Kings as that:(1) It excludes low-income residents, the homeless, and vulnerable individuals who cannot afford to pay.(2) It increases public health risks as people often resort to unsafe alternatives when they are unable to pay the required fee.(3) It causes delays and inconvenience during emergencies, especially for children, the elderly, and individuals with medical conditions.(4) It deprives women, girls and the disabled of privacy, dignity, and safety when they cannot access a toilet due to lack of money, forcing them into unsafe or unsanitary alternatives. This situation is not only unfair but also exposes them to risks of harassment, infection, and emotional distress.(5) It undermines the principle of public facilities being accessible to all, not only to those who can afford them.(6) It increases chances of the outbreaks of the pandemics like cholera and typhoid, putting the lives of many people into risk.\n\nWe therefore request an urgent review of the payment system and its impact on public health, safety, privacy, and accessibilityespecially for women, girls and the disabled and a detailed plan of action outlining how the City Council intends to improve hygiene standards in public toilets and ensure fair access for all residents.We trust that the City Council will address this matter with the seriousness it deserves. Access to clean and safe sanitation is a basic human right, and we expect your office to uphold this responsibility.\n\nYours faithfully,Sibangani Ngwenya (Mr.)Mthwakazi Liberation Movement (MLM)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dear City Council Fathers, We write this open letter to express our deep disappointment and concern regarding the continued silence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/unjust-paid-toilet-system-by-bulawayo-city-council/\">Continue reading<span class=\"screen-reader-text\"> \"‘Unjust’ Paid Toilet System By Bulawayo City Council\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "William Ruto Unrolls Red Carpet For Wicknell Chivayo Again, What’s Really Going On?",
            "url": "https://www.zimeye.net/2025/11/20/william-ruto-unrolls-red-carpet-for-wicknell-chivayo-again-whats-really-going-on/",
            "content": "Tinashe Sambiri- Controversial Zanu PF-linked businessman Wicknell Chivayo on Thursday morning shared details of his recent trip to Kenya, where he met President William Ruto, sparking questions about possible political and business alignments. Chivayo, often described as a frontman for President Mnangagwa in contentious deals, took to Facebook to recount his visit.\n\nIn his post, Chivayo wrote: Yesterday, I once again had the privilege of paying a courtesy call on His Excellency, President William Samoei Ruto, at State House in Nairobi. It remains an exceptional pleasure to rub shoulders with eminent leaders, especially those of kingly character and continental influence. I consider myself highly favoured to carry the grace that allows me to sit with such a leader who upholds faith as the yardstick of leadership.\n\nHe continued to praise President Rutos humility and personal mentorship, saying: One thing I have consistently found profoundly admirable about His Excellency is his extraordinary humility and spiritual grounding. Despite presiding over the highest office and commanding the defence forces of Kenya, President Ruto remains one of the most humble and unassuming leaders I have ever met. Ever since our very first meeting, every conversation carries deep biblical insight and spiritual conviction, reflecting the values and ethos of a true servant-leader. On a personal level, I consider him a father and mentor, whose guidance extends beyond areas of business and investment interests and ventures into matters of faith and eternal destiny. For that, I offer my deepest gratitude, Your Excellency.\n\nChivayo also highlighted the economic and investment opportunities he discussed with the Kenyan leader: My brief visit served to re-engage His Excellency as a Pan-African investor with an enduring passion for the infrastructure development of Africa, with particular emphasis on renewable and sustainable energy. Kenya has abundant natural resources that range from coal-bed methane deposits, to mini-hydro opportunities, floating solar, and vast terrains for aeolian energy, where massive wind farms can be constructed to diversify and strengthen its energy mix.\n\nHe added: More importantly, His Excellency presides over an administration that prioritizes the empowerment of the Kenyan people, and that understands the strategic importance of intra-African investment, trade, and infrastructure development. These priorities closely align with the Africa Continental Free Trade Area (AfCFTA) agenda, which promotes cross-border trade and regional economic integration through private sector participation. It is therefore my conviction that these vast opportunities can be exploited for the benefit of Kenya and indeed the African continent.\n\nConcluding his post, Chivayo expressed gratitude for Rutos mentorship and leadership: I humbly salute His Excellency and am extremely grateful for always creating time in his demanding schedule to mentor and impart wisdom in the most generous of ways. I remain highly inspired by your leadership, which stands as a beacon of an Africa that is built by Africans, for Africans.\n\nChivayos visit and public praise of President Ruto have reignited debates over the role of politically connected business figures in fostering cross-border influence, with critics questioning whether the meetings reflect purely investment interests or a broader political agenda.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri- Controversial Zanu PF-linked businessman Wicknell Chivayo on Thursday morning shared details of his recent trip to Kenya, where … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/william-ruto-unrolls-red-carpet-for-wicknell-chivayo-again-whats-really-going-on/\">Continue reading<span class=\"screen-reader-text\"> \"William Ruto Unrolls Red Carpet For Wicknell Chivayo Again, What’s Really Going On?\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Mnangagwa’s Stunning Military Shake-Up Sparks Widespread Debate Over ED Power Consolidation Gimmick…",
            "url": "https://www.zimeye.net/2025/11/20/mnangagwas-stunning-military-shake-up-sparks-widespread-debate-over-ed-power-consolidation-gimmick/",
            "content": "By A Correspondent  Zimbabwes military leadership has undergone a dramatic reshuffle, sparking debate about whether President Emmerson Dambudzo Mnangagwa is using the appointments to consolidate power and place loyalists in key positions amid succession dynamics within Zanu PF.\n\nLieutenant General Emmanuel Matatu has been promoted to General and appointed Commander of the Zimbabwe Defence Forces (ZDF), following the retirement of long-serving General Philip Valerio Sibanda. In a related move, Major General Asher Walter Tapfumaneyi was promoted to Lieutenant General and appointed Commander of the Zimbabwe National Army (ZNA), effective 25 November 2025.\n\nIn an official statement, the Office of the President and Cabinet explained: His Excellency, the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of section 216(2) of the Constitution of Zimbabwe as read with sections 11(1)(a) and 11(4) of the Defence Act [Chapter 11:02], promoted Major General Asher Walter Tapfumaneyi to the rank of Lieutenant General and appointed him Commander of the Zimbabwe National Army with effect from 25 November 2025.\n\nObservers have noted that Tapfumaneyis rise has been unusually rapid. He was reintegrated into the military earlier in 2025 as a retired Brigadier, promoted to Major General, and now assumes command of the ZNA within the same year  bypassing several officers of equivalent or longer-standing rank. Analysts say the move reflects a focus on loyalty to the President rather than seniority or length of service.\n\nThe reshuffle comes amid ongoing discussions about succession within the ruling party, and many commentators see the appointments as part of a broader strategy to ensure that key military posts are held by trusted allies.\n\nThe notices were signed by Dr Martin Rushwaya, Secretary to the President and Cabinet, and issued on 19 November 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Zimbabwe’s military leadership has undergone a dramatic reshuffle, sparking debate about whether President Emmerson Dambudzo Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/mnangagwas-stunning-military-shake-up-sparks-widespread-debate-over-ed-power-consolidation-gimmick/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Stunning Military Shake-Up Sparks Widespread Debate Over ED Power Consolidation Gimmick…\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zanu PF Youth League’s Taurai Kandishaya Defends Tagwirei Rallies As Tension Rises In Ruling Party",
            "url": "https://www.zimeye.net/2025/11/20/zanu-pf-youth-leagues-taurai-kandishaya-defends-tagwirei-rallies-as-tension-rises-in-ruling-party/",
            "content": "Tinashe Sambiri Zanu PF Youth League official Taurai Kandishaya on Wednesday defended the ongoing feedback rallies in Harare, dismissing criticism over controversial businessman Kudakwashe Tagwireis active role.\n\nTagwirei, recently co-opted into the Zanu PF Central Committee, has sparked debate over his prominence at the meetings, with some questioning why he is addressing grassroots structures.\n\nResponding to the scrutiny, Kandishaya said: Many are asking questions, some genuine, some acting dumb with an agenda. In what capacity is Cde Kuda Tagwirei addressing rallies in Harare? Heres the explanation: Harare province is having its feedback rallies to inform grassroots structures about what was agreed upon at the recently held conference.\n\nResolutions are crafted at these grassroots levels and then escalated to the main conference.\n\nHe explained that the rallies are organised into seven clusters, each covering a specific thematic area: 1. State of the party affairs; 2. State of economic affairs; 3. Environment; 4. Youths and drug abuse; 5. Social welfare; 6. War veterans affairs; 7. Women affairs. These reports are presented by Politburo members and Central Committee members from Harare province, each according to the thematic committee assigned. In doing this, we deploy according to skills and understanding. So dont get it twisted  Dr KT is reporting among others.\n\nAddressing criticisms that more senior members should be presenting, Kandishaya emphasised equality within the Central Committee:\n\nSome may say, But there are more senior members who can report; listen, Central Committee members are all equal  there are no positions in the Central Committee, no senior, no junior. Above all, even National members who are neither Central Committee nor Politburo members can present if leadership deploys them.\n\nHe noted that Tagwireis prominence at the rallies is due to his appeal and ability to engage the audience: Its just that he is new to addressing rallies; he is likable, he is convincing, and more determined  thats why it comes out as if he is the only one presenting.\n\nKandishaya concluded by reminding the public that the main figure at the rallies is party leader and Politburo member CZ Tavengwa, who serves as Resident Minister for Harare: Above all, our leader is at the centre of these rallies.\n\nFollow through. We meet in Epworth at Epworth High School.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF Youth League official Taurai Kandishaya on Wednesday defended the ongoing feedback rallies in Harare, dismissing criticism … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/zanu-pf-youth-leagues-taurai-kandishaya-defends-tagwirei-rallies-as-tension-rises-in-ruling-party/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Youth League’s Taurai Kandishaya Defends Tagwirei Rallies As Tension Rises In Ruling Party\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zim Requires Staggering 6 Billion USD Reserves To Successfully Use ZiG As Official Currency",
            "url": "https://www.zimeye.net/2025/11/20/zim-requires-staggering-6-billion-usd-reserves-to-successfully-use-zig-as-official-currency/",
            "content": "Tinashe Sambiri  Zimbabwe faces a daunting challenge in transitioning to a mono-currency system by 2030, with experts suggesting the country will need up to US$6 billion in reserves.\n\nPersistence Gwanyanya, a member of the Central Banks Monetary Policy Committee (MPC), outlined the shortfall during an interview with Channel Africa on Tuesday.\n\nGwanyanya noted that current reserves stand at just US$980 million, a figure well below the level needed for the Zimbabwe Gold (ZiG) to function as the countrys sole currency.\n\nHe acknowledged that the existing reserves cover more than four times the reserve money, surpassing the minimum one-to-one requirement, but insisted this is still insufficient for a fully mono-currency environment.\n\nThe MPC member emphasized that the domestic currency must be fully backed by foreign currency reserves and precious minerals to gain credibility, stating:We need reserves that provide between three and six months of import cover for a mono-currency regime. To achieve that, Zimbabwe would require between 5 and 6 billion dollars. At the pace we are accumulating reserves, we are confident we can reach those levels.\n\nHowever, questions remain about whether such confidence is justified. Critics argue that historical trends in Zimbabwes monetary policy, including hyperinflation episodes and repeated currency reforms, suggest that mere accumulation of reserves may not be enough. Gwanyanya himself acknowledged that reserves alone cannot guarantee success:We need durable stability, price stability, and exchange-rate stability to restore trust in the currency. Stability for beyond one year is crucial for the market to accept a mono-currency arrangement.\n\nThe Reserve Bank points to factors behind its reserve growth, including deliberate government strategies, rising export earnings, stronger foreign currency inflows, and gold holdings, currently estimated at around 3.5 tonnes. Authorities also cite the recent global gold price rally as a contributing factor.\n\nYet, critics warn that relying heavily on gold and mineral reserves exposes the country to external shocks, while persistent domestic economic instability may undermine any attempt to establish ZiG as a credible, standalone currency. In other words, the promise of a mono-currency system may be more aspirational than achievable unless fundamental economic reforms are implemented alongside reserve accumulation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Zimbabwe faces a daunting challenge in transitioning to a mono-currency system by 2030, with experts suggesting the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/zim-requires-staggering-6-billion-usd-reserves-to-successfully-use-zig-as-official-currency/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Requires Staggering 6 Billion USD Reserves To Successfully Use ZiG As Official Currency\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Mutsvangwa Says Mnangagwa Not Seeking Third Term Of Office",
            "url": "https://www.zimeye.net/2025/11/20/mutsvangwa-says-mnangagwa-not-seeking-third-term-of-office/",
            "content": "Tinashe Sambiri ZANU PF spokesperson Ambassador Christopher Mutsvangwa has dismissed claims that President Emmerson Mnangagwa is seeking a third term, insisting that the party will follow constitutional processes and timelines.\n\nSpeaking at a press conference in Harare on Thursday, Mutsvangwa sought to clarify growing speculation surrounding ZANU PFs resolutions and the future of the partys leadership.\n\nPresident Mnangagwa is not seeking a third term, let me make it clear, Mutsvangwa said. We will know about everything in 2027. I also want to inform you that in our next press conference we will be bringing our legal team from the party so that you can ask any questions regarding Resolution Number One.\n\nHe went on to explain key positions adopted at the recent ZANU PF Annual National Peoples Conference.Our resolution at the party conference was that the President remain in power until 2030 and it was adopted unanimously, he said.\n\nHowever, Mutsvangwa also reiterated Mnangagwas previously stated position on term limits.The President had said that he will not go beyond 2028, and ZANU PF will also have a congress in 2027 to choose a leader, he noted.\n\nAddressing internal party dynamics, Mutsvangwa dismissed narratives suggesting there is a predetermined successor to Mnangagwa.There is no natural successor, anyone who has a presidential ambition should keep it in their hearts like everyone else, he remarked.\n\nHis comments come amid growing debate within ZANU PF, as some party hardliners have been pushing the 2030 agenda  a political narrative seen as an attempt to extend Mnangagwas rule beyond the constitutional two-term limit. The Zimbabwean Constitution clearly states that a president can serve only two terms, and Mnangagwas second term is set to end in 2028.\n\nMutsvangwas remarks appear to be an attempt to reconcile conflicting signals from within the ruling party as questions about succession and 2028 continue to dominate national political discourse.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– ZANU PF spokesperson Ambassador Christopher Mutsvangwa has dismissed claims that President Emmerson Mnangagwa is seeking a third term, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/mutsvangwa-says-mnangagwa-not-seeking-third-term-of-office/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Says Mnangagwa Not Seeking Third Term Of Office\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Mudiwa Hood Speaks On Wicknell Chivayo Motor Vehicle Donation",
            "url": "https://www.zimeye.net/2025/11/20/mudiwa-hood-speaks-on-wicknell-chivayo-motor-vehicle-donation/",
            "content": "Tinashe Sambiri Zimbabwean social media influencer and artist Mudiwa Hood has publicly expressed his gratitude after receiving a brand new Range Rover from controversial Zanu PF-linked businessman Wicknell Chivayo.\n\nIn a statement on Wednesday, Mudiwa Hood shared his surprise and appreciation, saying:\n\nHad a busy day today and guess what? the unthinkable happened to meand left me with no words .\n\nI am used to giving people money, buying people cars, paying fees etc, to be on the receiving end hits different! Thank you Sir @Wicknell for gift, Mukoma may you never lack and may God continue blessing you. Am deeply humbled by this gesture!\n\nHoods post highlights his amazement at being on the receiving end of generosity, noting that he is typically in the role of helping others financially.\n\nThe gift of a brand new Range Rover from Chivayo, who has been a polarising figure in Zimbabwe due to his political and business affiliations, left the artist visibly humbled and appreciative.\n\nThe donation has sparked conversations on social media, with fans and followers praising the gesture while some also questioned the political undertones given Chivayos controversial profile.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zimbabwean social media influencer and artist Mudiwa Hood has publicly expressed his gratitude after receiving a brand new … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/20/mudiwa-hood-speaks-on-wicknell-chivayo-motor-vehicle-donation/\">Continue reading<span class=\"screen-reader-text\"> \"Mudiwa Hood Speaks On Wicknell Chivayo Motor Vehicle Donation\"</span></a></p>",
            "time": "18:46",
            "date": "20 Nov 2025"
        }
    ]
}