{
    "news": [
        {
            "title": "Chinomona Crashes Monica Mutsvangwa",
            "url": "https://www.zimeye.net/2025/04/24/chinomona-crashes-monica-mutsvangwa/",
            "content": "By Munacho Gwamanda- A Zanu PF faction aligned with thepartysWomensLeague boss, Mabel Chinomona, recently won the ManicalandWomenstop leadership position, defeating that ofWomensAffairs Minister Monica Mutsvangwa and her husband, Zanu PF spokesperson ChristopherMutsvangwa.\n\nThe Chinomona-aligned candidate, Dorothy Mabika, was recently declared the substantive chairperson of the Zanu PF ManicalandWomensLeague, decisively beating Mercy Sacco, who had the backing of Monica Mutsvangwa.\n\nWithChinomonasfull support, Mabika secured a landslide victoryreportedly garnering 29 votes toSaccoslone votefurther cementing herfactionsdominance in the province.\n\nThe election, held on April 6, was meant to replace Happiness Nyakuedzwa, who was suspended from party positions last year.\n\nDespite initial resistance from the Mutsvangwa camp,Mabikasvictory has nowbeen officially endorsedby the national leadership.\n\nA memo confirmingMabikasappointmentwas signedbyWomensLeague Secretary Mabel Chinomona and addressed to Manicaland provincial chairperson Tawanda Mukodza.\n\nIt was also copiedto high-ranking officialsincludingZanu PF Secretary-General Obert Mpofu, National Political Commissar Munyaradzi Machacha, Monica Mutsvangwa, andMabikasrival, Mercy Sacco.\n\nWe are writing to confirm and endorse Cde Mabika as the substantive provincial chairwoman for Manicaland Province with immediate effect,the memo reads.\n\nMabika, a seasoned party cadre and former deputy provincial chairperson, expressed humility and gratitude upon her confirmation.\n\nShe pledged to focus onwomensempowerment and development projectsin support ofPresidentMnangagwasagenda, vowing to unite women behind ZanuPFsvision and to push for an extension ofMnangagwaspresidency until 2030.\n\nBut the election has sparked deep internal rifts, with Chris Mutsvangwa going on the offensive against Information Minister Jenfan Muswere, whom he accused of prematurely announcing the results before party leadership had sanctioned them.\n\nIn a scathing letter, Mutsvangwa blasted Muswere for bypassing party protocol by authorizing ZBC andThe Heraldto publicizeMabikasvictory.\n\nHe labeled the moveirregularand a violation of party procedure, claiming that only his officeas party spokespersonhad the authority to make such announcements.\n\nYet beneath the procedural outrage lay a more personal motive: Mutsvangwa was fighting for hiswifesfaction, which had just been humiliated in a high-stakes intra-party contest.\n\nThe meeting wascancelled,said one insider,but the other faction went ahead at an unknown location. There is real fighting in thewomensleague. Chinomona supports Mabika, while Monica Mutsvangwa supports Sacco. Now Chris [Mutsvangwa] is fighting in hiswifescorner.\n\nObservers sayMutsvangwasletter was less about party discipline and more about protecting hisfamilyswaning political influence.\n\nHis aggressive tone, public rebuke of a cabinet minister, and use of thepartyscommunications machinery have exposed his desperation to maintain relevance.\n\nThis is not just about Muswere,a senior Zanu PF official noted.Chris Mutsvangwa is trying to reassert himself as a power broker in the party. But this was a miscalculated moveand it shows how much he has lost grip.\n\nMuswere, a youthful minister and MP for Makoni, is widely regarded as one of PresidentMnangagwasrising protgs.\n\nHis increasing control over state media narratives suggests a shift in thepresidentsinner circleonethat favors the younger generation over the liberation-era stalwarts like Mutsvangwa.\n\nMuswere is part ofMnangagwasstrategy to build a loyal base,another source added.Mutsvangwa knows this, andhesthreatenedby it.\n\nOnce instrumental in helping Mnangagwa ascend to power during the 2017 coup that deposed Robert Mugabe, ChrisMutsvangwasrelationship with the presidenthas sincedeteriorated.\n\nParty insiders say he now positions himself as a potential successor, leveraging his liberation war credentials and connections among veterans and elites disillusioned withMnangagwasleadership.\n\nRumors of personal history between Monica Mutsvangwa and President Mnangagwalong dismissed as gossiphave resurfaced amid the factional fallout, further fueling speculation about the deep, personal stakes in this battle for influence.\n\nThese are not just political fights,a source said.These are wars rooted in ambition, betrayal, and survival.\n\nAs the party gears up for a potentially explosive elective congress, theMutsvangwasdefeat in Manicaland marks more thanjusta local political setback.\n\nIt signals a broader realignment within Zanu PF, where old alliancesare crumblingandnew power centersare emerging.\n\nWhile Mutsvangwa lashes out to defend hiswifesinterests, Muswere is quietly consolidating his ownand with thepresidentsbacking, he may be unstoppable.\n\nThis is no longer about protocol,the party official concluded.Itsabout who controls the future of Zanu PFandwhosbeing left behind.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- A Zanu PF faction aligned with the party’s Women’s League boss, Mabel Chinomona, recently won the Manicaland Women’s top leadership position, defeating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/chinomona-crashes-monica-mutsvangwa/\">Continue reading<span class=\"screen-reader-text\"> \"Chinomona Crashes Monica Mutsvangwa\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Geza Revolution Starts Here: Rescue the Constitution, Rescue the Nation",
            "url": "https://www.zimeye.net/2025/04/24/geza-revolution-starts-here-rescue-the-constitution-rescue-the-nation/",
            "content": "News Analysis | Lets Rescue Our Captured Constitution First: Why Zimbabwes Path to Change Begins With Legal Restoration\n\nBy @Gushaz\n\nIn the flurry of political speeches, revolutionary hashtags, and policy wishlists sweeping across Zimbabwes activist circles, one glaring truth remains sidelined: our constitution is captured, and until it is rescued, nothing else will hold. This isnt just a legal technicality  it is the very root of Zimbabwes multifaceted crisis.\n\nThe Constitution: Broken Backbone of the State\n\nThe 2013 Constitution was a landmark document born out of a painstaking process of negotiation, participation, and hope. It was meant to signify a new dawn  a democratic contract between the state and the people. Instead, what weve witnessed in the years since is the deliberate subversion and manipulation of that contract by a regime intent on entrenching power, shielding impunity, and blocking reform.\n\nWhat use is a constitution if it can be amended to serve the whims of the ruling elite? What value does Section 59 (freedom of assembly) hold when peaceful protesters are met with violence? How can we speak of electoral democracy when institutions meant to oversee fair elections are staffed with partisan actors?\n\nThe constitution today exists only in name. Its spirit has been hollowed out by executive overreach, judicial capture, and legislative paralysis. And therein lies the root cause of every other crisis  economic decay, corruption, public service collapse, and the mass exodus of skilled Zimbabweans.\n\nThe Revolution Needs a Reset  And a Legal Anchor\n\nCalls for radical change are echoing louder by the day. But without constitutional restoration, even the most well-intentioned revolution risks collapsing into chaos or reproducing the same authoritarian tendencies it seeks to dismantle.\n\nIts time to put constitutionalism back at the centre of the national agenda. Lets rescue the constitution first. Not later. Not as an afterthought. Now.\n\nAs activists rightly note, Section 212 of the Constitution empowers the national security services to act in defense of the countrys interests. But how can this be meaningfully invoked if those same institutions are compromised and manipulated?\n\nA revolution without a legal compass is susceptible to fragmentation and repression. A revolution anchored in the constitution, however, can gain moral legitimacy, international solidarity, and sustainable momentum.\n\nGeza Revolution: A Vision Needing Constitutional Grounding\n\nThe Geza Revolution manifesto presents a bold, people-centered roadmap: free education, healthcare reform, economic empowerment, infrastructure rehabilitation, and job creation. These demands are not only desirable  they are essential. But achieving them outside the framework of a functioning, independent legal system will invite instability and abuse.\n\nWe cannot legislate empowerment without a credible parliament. We cannot deliver free maternal care without a judiciary that defends budget transparency. We cannot regulate banking or nationalize mines fairly without laws that protect citizens over cronies.\n\nMomentum Must Be Rekindled  and Redirected\n\nMany revolutionaries today are losing hope  frustrated by the slow pace of change, divided strategies, and fear of repression. But whats missing is not just action; its direction. The movement must coalesce around one non-negotiable demand: constitutional restoration as the precondition for all other reforms.\n\nThis means:\n\nFinal Word: The Fight Is Legal, Moral, and Political\n\nThis is not just about legalism. This is about the soul of Zimbabwes democracy. When the constitution is captured, everything else becomes negotiable  rights, resources, justice, and sovereignty.\n\nSo before we talk about free education or nationalized mines, we must reclaim the document that makes those dreams possible. The fight ahead is risky, but it must be strategic. It must be radical in vision and grounded in law.\n\nLets not just chase revolution for revolutions sake. Lets make this a revolution for restoration. Lets rescue our constitution first  and build everything else on solid ground.\n\nAluta continua. Action, Action, Action.\n\n@Gushaz\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "News Analysis | Let’s Rescue Our Captured Constitution First: Why Zimbabwe’s Path to Change Begins With Legal Restoration By @Gushaz … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/geza-revolution-starts-here-rescue-the-constitution-rescue-the-nation/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Revolution Starts Here: Rescue the Constitution, Rescue the Nation\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Jamie Vardy Leaves Leicester City",
            "url": "https://www.zimeye.net/2025/04/24/jamie-vardy-leaves-leicester-city/",
            "content": "Sports Correspondent\n\nIn a poignant moment for the Foxes, Jamie Vardy has announced that he will be departing Leicester City at the end of the current season.\n\nThe 38-year-old strikers decision marks the end of an era, with the legendary player having spent 13 incredible years with the club.\n\nVardys departure will undoubtedly leave a void in the Leicester City squad, but his legacy will live on.\n\nThroughout his tenure, Vardy has been an integral part of the teams success, showcasing his remarkable skill and dedication on the pitch. As he prepares to hang up his boots, fans and teammates alike will surely cherish the memories hes created at the club.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a poignant moment for the Foxes, Jamie Vardy has announced that he will be departing Leicester City … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/jamie-vardy-leaves-leicester-city/\">Continue reading<span class=\"screen-reader-text\"> \"Jamie Vardy Leaves Leicester City\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Another Spy Boss Dies",
            "url": "https://www.zimeye.net/2025/04/24/another-spy-boss-dies/",
            "content": "By MunachoGwamanda-Anotherkey figure inZimbabwesshadowy intelligence network has died, adding to a growing list of mysterious deaths within thecountryspowerful military-securityestablishment\n\nFormer Mashonaland Central Provincial Intelligence Officer (PIO),Ndai Rachel Chatora, passed away onApril 19and was laid to rest earlier this week atPlot 2, Riverview Farm in Bindura.\n\nShe was buried with full militaryhonours, having beendeclared aliberation war hero.\n\nChatora served as the PIO for Mashonaland Central in2005and later rose through the ranks to becomePIO Administration at the CIO Headquartersin Harare, where she worked from2007 until her retirement in 2020, concluding a39-year career in the intelligence service.\n\nHer death comes in the same monthand notably the same weekthat two other senior figures inZimbabwesfeared military-security establishment also passed away under murky circumstances, raising new questions about the fate of the so-calledmilitary juntathat has dominated Zimbabwean politics since the November 2017 coup.\n\nThe two deceased areWalter Basopo, a veteranCentral Intelligence Organisation (CIO)operative long linked to political abductions, andRetired Brigadier General Victor Rungani, a formerJoint Operations Command (JOC)member implicated in state-sponsored violence.\n\nBasopo,was reportedly a close relative of PresidentEmmerson Mnangagwa.\n\nHeis rememberedin activist and human rights circles as one of the state agents frequently associated with theMarch 2015 disappearance of journalist and pro-democracy campaigner Itai Dzamara.\n\nDzamara, who led theOccupy Africa Unity Squareprotest movement, was abducted in broad daylight by suspected state security agents and has not been seen since.\n\nDespite ongoing pressure from both local and international human rightsorganisationsincludingAmnesty Internationaland theUnited Nationsthe state has never offered a credible explanation forDzamarasfate.\n\nBasopo was repeatedly named by insiders and watchdog groups as a member of theCIOsSpecial Operations Unit, whichwas believedto carry out surveillance, abductions, torture, and disappearances targeting government critics.\n\nHis death closes a potential chapter in one ofZimbabwesmost chilling unsolved cases and deprives any future truth-seeking efforts of a key potential witness.\n\nStrikingly, Basopo died on thesame dayas Retired Brigadier GeneralVictor Rungani, whose deathwas confirmedby theChildren of War Veterans Association (COZWVA).\n\nHis son,Hardlife Rungani, is a prominent member of the group.\n\nOriginally fromBikita in Masvingo Province, Rungani served in theJoint Operations Command (JOC)a covert bodymade up ofthe top brass from the military, police, intelligence, and prison services.\n\nJOC played a central role in coordinating ZANUPFsauthoritarian grip on power, particularly during elections and periods of political upheaval.\n\nDuring the2008 presidential run-off, Runganiwas reportedly deployedtoMashonaland East, wherewidespread and systematic violence against opposition supporters was documented.\n\nHuman rights observers described the violenceranging from beatings and torture to arson and murderas acampaign of terrorthat ultimately forced opposition leaderMorgan Tsvangiraito pull out of the race, paving the way forRobertMugabescontested victory.\n\nBoth Rungani and Basopo belonged to a generation of security chiefs who wielded immense power and often operated withimpunityfirst underMugabe,and later under Mnangagwa.\n\nTheir sudden and near-simultaneous deaths have fuelled speculation about internal tensions, silencing of potential dissenters, or even a possible purge withinZimbabwesentrenched security elite.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Another key figure in Zimbabwe’s shadowy intelligence network has died, adding to a growing list of mysterious deaths within the country’s powerful military-security establishment Former … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/another-spy-boss-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Another Spy Boss Dies\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Warriors Defender Chicksen Suffers Serious Knee Injury",
            "url": "https://www.zimeye.net/2025/04/24/warriors-defender-chicksen-suffers-serious-knee-injury/",
            "content": "Sports Correspondent\n\nFormer Notts County and Zimbabwe defender Adam Chicksen has suffered a serious knee injury while on loan at Woking FC. The English National League side confirmed that Chicksen ruptured his ACL and MCL during a match against Aldershot Town.\n\nChicksen, who joined Woking on loan in October last year, made 34 appearances for the team before the injury. He has now returned to his parent club, Notts County, for treatment.\n\nThe severity of the injury will likely keep Chicksen sidelined for an extended period, and the defender faces a long and challenging road to recovery.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Notts County and Zimbabwe defender Adam Chicksen has suffered a serious knee injury while on loan at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/warriors-defender-chicksen-suffers-serious-knee-injury/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Defender Chicksen Suffers Serious Knee Injury\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Terrible Vehicle, Elephant Collision In Kariba: One Dies, Five Injured …",
            "url": "https://www.zimeye.net/2025/04/24/terrible-vehicle-elephant-collision-in-kariba-one-dies-five-injured/",
            "content": "By A Correspondent\n\nA tragic road accident occurred on Wednesday evening along Kazungula Road, around 40 kilometres from Victoria Falls, when a vehicle collided with an elephant, resulting in one fatality and five injuries.\n\nThe crash involved a Toyota Isis that struck a young female elephant.\n\nAccording to reports, the vehicle was traveling toward Victoria Falls and tried to overtake another car that had stopped and activated its hazard lights. Unbeknown to the driver, the other vehicle had halted to avoid the elephant standing on the road.\n\nAs the Toyota attempted to pass, it hit the elephant, which then landed on the cars roof. The collision was so powerful that the vehicle was thrown about 100 metres off the road into nearby bushland, with the elephant still on top of it. All six occupants were trapped inside the wrecked car.\n\nSadly, the front passenger died at the scene. The remaining five passengers suffered various injuries and were taken to a nearby medical facility for treatment.\n\nAuthorities had to put down the injured elephant to safely extract the deceased from the vehicle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic road accident occurred on Wednesday evening along Kazungula Road, around 40 kilometres from Victoria Falls, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/terrible-vehicle-elephant-collision-in-kariba-one-dies-five-injured/\">Continue reading<span class=\"screen-reader-text\"> \"Terrible Vehicle, Elephant Collision In Kariba: One Dies, Five Injured …\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Lazy Government Bureaucrats Sit On Masvingo Solar Project",
            "url": "https://www.zimeye.net/2025/04/24/lazy-government-bureaucrats-sit-on-masvingo-solar-project/",
            "content": "By A Correspondent\n\nA proposed 50MW solar plant in Mashava, Masvingo, is facing significant delays due to the inaction of government bureaucrats.\n\nDespite the projects potential to alleviate chronic power shortages, officials seem reluctant to expedite the process.\n\nEdmore Pazvakavambwa, Permanent Secretary in the Minister of States office, acknowledged the projects importance but failed to provide a timeline for its completion.\n\nWe have an investor who is keen to generate electricity, specifically solar, in the Mashava area, Pazvakavambwa said, but we need to ensure that all necessary procedures are followed.\n\nThe projects cost, estimated to be between $40 million and $50 million, could bring much-needed relief to Masvingos energy sector.\n\nHowever, residents continue to suffer from prolonged load shedding due to the governments slow pace.\n\nWe are the benefiting Province, Pazvakavambwa admitted, but we need to move swiftly to bring this project to fruition.\n\nThe lack of urgency from government officials has raised concerns about the projects future and the impact on the local community.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A proposed 50MW solar plant in Mashava, Masvingo, is facing significant delays due to the inaction of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/lazy-government-bureaucrats-sit-on-masvingo-solar-project/\">Continue reading<span class=\"screen-reader-text\"> \"Lazy Government Bureaucrats Sit On Masvingo Solar Project\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Man Missing Since Dec 2024",
            "url": "https://www.zimeye.net/2025/04/24/man-missing-since-dec-2024/",
            "content": "By Farai D Hove | ZimEye | POLICE APPEAL FOR ASSISTANCE: Help Locate Missing Person Garikai Mashinga\n\nThe Zimbabwe Republic Police (ZRP) is appealing to members of the public for any information that may assist in locating Garikai Mashinga, a 53-year-old man who went missing in the early hours of 11 December 2024 in Nyatsime, Chitungwiza.\n\nAccording to reports, Mr. Mashinga left his residence at around 0200 hours after complaining of stomach pains and informing his wife that he was going outside to relieve himself. However, he did not return, and his wife later discovered that he had not entered the toilet or been seen since.\n\nThe missing person is described as having a lean build with prominent cheekbones and a well-defined jawline. He has a receding hairline, short-cropped hair, and a noticeable facial structure with a defined nose and deep-set eyes. In the provided photo, he is seen wearing a zip-up top, possibly a sports or casual jacket, and appears to be sitting inside a vehicle.\n\nThe ZRP urges anyone who may have seen Mr. Mashinga or has any knowledge of his whereabouts to report to the nearest police station or contact the police on emergency lines. Your assistance could be vital in reuniting Mr. Mashinga with his family.\n\nLets help bring him home.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | POLICE APPEAL FOR ASSISTANCE: Help Locate Missing Person Garikai Mashinga The Zimbabwe Republic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/man-missing-since-dec-2024/\">Continue reading<span class=\"screen-reader-text\"> \"Man Missing Since Dec 2024\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "Government of Zimbabwe on Agrifood Systems Transformation",
            "url": "https://www.zimeye.net/2025/04/24/government-of-zimbabwe-on-agrifood-systems-transformation/",
            "content": "Agnes Mugova-Director of strategic planning, monitoring and evaluation in the Ministry of Agriculture explaining successes and challenges of Agrifood Systems Transformation in Zimbabwe during a Food and Agriculture Organization of the United Nations dialogue meeting in Bulawayo at the ZITF 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Agnes Mugova-Director of strategic planning, monitoring and evaluation in the Ministry of Agriculture explaining successes and challenges of Agrifood Systems … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/government-of-zimbabwe-on-agrifood-systems-transformation/\">Continue reading<span class=\"screen-reader-text\"> \"Government of Zimbabwe on Agrifood Systems Transformation\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        },
        {
            "title": "FAO on Agrifood Systems in Zimbabwe",
            "url": "https://www.zimeye.net/2025/04/24/fao-on-agrifood-systems-in-zimbabwe/",
            "content": "Louse Muhigurwa- Deputy Food and Agriculture Organization of the United Nations says UN is working in partnership with the Government of Zimbabwe on agrifood system transformation in a move set to eradicate hunger and poverty\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Louse Muhigurwa- Deputy Food and Agriculture Organization of the United Nations says UN is working in partnership with the Government … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/24/fao-on-agrifood-systems-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"FAO on Agrifood Systems in Zimbabwe\"</span></a></p>",
            "time": "18:32",
            "date": "25 Apr 2025"
        }
    ]
}