{
    "news": [
        {
            "title": "KG6 Fire Unearths Election Rigging Scam",
            "url": "https://www.zimeye.net/2024/12/15/kg6-fire-sparks-election-rigging-scam/",
            "content": "By Political Reporter A fire at the KG6 Army Headquarters, now Josiah Magama Tongogara Barracks, early Sunday has ignited fears of sabotage linked to Zimbabwes controversial election rigging machinery.\n\nThe blaze, confirmed by Colonel Alphios Makotore, Director of Army Public Relations, broke out at around 2:50 am, damaging several offices.\n\nWe regret to inform the public that a fire has broken out at the Army Headquarters administrative complex, resulting in damage to some offices, Col. Makotore said in a statement.\n\nHowever, insiders allege the fire may have been deliberate, with suspicions pointing to disgruntled personnel within the army.\n\nThe barracks are notorious for their role in election manipulation, with sources revealing that passports, IDs, and ballot papers are secretly printed and administered there by senior army officials closely tied to Zanu PFs election rigging apparatus.\n\nThe fire could have been an inside job by individuals fed up with the regime, one source speculated.\n\nThe incident has triggered a witch hunt, with middle-ranked officers reportedly under investigation for possible involvement in the arson attack.\n\nThis development has further exposed the militarys profoundly entrenched role in securing Zanu PFs grip on power through clandestine operations at KG6.\n\nFor years, Zimbabwes elections have been marred by allegations of military interference, voter suppression, and rigging.\n\nThe fire at the heart of the armys operations raises serious questions about the lengths to which the regime will go to maintain control and the growing discontent within its ranks.\n\nThis is a developing story, and more updates will follow as investigations continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter – A fire at the KG6 Army Headquarters, now Josiah Magama Tongogara Barracks, early Sunday has ignited fears … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/kg6-fire-sparks-election-rigging-scam/\">Continue reading<span class=\"screen-reader-text\"> \"KG6 Fire Unearths Election Rigging Scam\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Zim Granny In Viral Degrading Video",
            "url": "https://www.zimeye.net/2024/12/15/zim-granny-in-viral-degrading-video/",
            "content": "By Showbiz Reporter  A Zimbabwean granny has admitted to engaging in a controversial intimate encounter involving herself, a man, and her friend, an act commonly referred to as a threesome.\n\nThe unnamed woman detailed the events in a viral video that has ignited heated public discourse and condemnation.\n\nNarrating the incident, she explained:We met a man who had booked a hotel for us. He said he was interested in my friend, Milan, from Malawi. I asked, What about my friendwill she be left alone? Eventually, the three of us were involved. He paid each of us separately.She continued:There were two beds, but he pushed them together and slept in the middle. What happened was consensual, and I made my own decisions. It wasnt in front of kids.\n\nThe videos release has drawn widespread criticism for the casual tone in which the events were described, particularly since the hotel booking took place during a funeral.\n\nWhile some social media users have labelled the story as shocking and inappropriate, others have raised concerns about the impact of explicit content circulating online and have called for measures to address such issues.\n\nAuthorities have yet to comment, but the incident has sparked broader discussions around personal responsibility, morality, and the role of social media in spreading sensitive content.\n\nThis is a developing story; updates will follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – A Zimbabwean granny has admitted to engaging in a controversial intimate encounter involving herself, a man, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/zim-granny-in-viral-degrading-video/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Granny In Viral Degrading Video\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Mighty Warriors Conclude 2024 with Low FIFA World Ranking",
            "url": "https://www.zimeye.net/2024/12/15/mighty-warriors-conclude-2024-with-low-fifa-world-ranking/",
            "content": "Sports Correspondent\n\nThe Mighty Warriors have learned their final FIFA World Ranking for 2024, following the release of the official rankings on Friday.\n\nThe national womens team participated in the 2024 COSAFA Womens Championship last month, where they played two matches. Despite securing one victory, they were unable to advance beyond the group stage of the tournament.\n\nZimbabwe ends the year ranked 127th in the world, marking their joint-second worst ranking in history. On the African continent, the Mighty Warriors are ranked 20th.\n\nNigeria holds the top spot in Africa, while the USA remains the number one team globally.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Mighty Warriors have learned their final FIFA World Ranking for 2024, following the release of the official … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/mighty-warriors-conclude-2024-with-low-fifa-world-ranking/\">Continue reading<span class=\"screen-reader-text\"> \"Mighty Warriors Conclude 2024 with Low FIFA World Ranking\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Tourist Goes Missing In Matopos National Park",
            "url": "https://www.zimeye.net/2024/12/15/tourist-goes-missing-in-matopos-national-park/",
            "content": "By Tourism Reporter-The Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced the disappearance of an 18-year-old tourist in the iconic Matopos National Park.\n\nZimParks spokesperson Tinashe Farawo confirmed the incident via a tweet.\n\nHe said a search operation involvingZimParksrangers and the Zimbabwe Republic Police (ZRP) is underway.\n\nThe terse announcement refrained from revealing the tourists nationality, adding an air of mystery to the case. Farawos tweet read:\n\nAn 18-year-old tourist is missing in Matopos National Park. @Zimparks reaction team & @PoliceZimbabwe are currently searching for him.\n\nThe disappearance has raised questions about the safety of visitors in Zimbabwes national parks, which are renowned for their rugged terrain and diverse wildlife. While such incidents are rare, they underscore the potential risks of exploring the untamed wilderness.\n\nMatopos National Park, a UNESCO World Heritage Site, is famous for its dramatic granite formations, ancient rock art, and thriving wildlife.\n\nHowever, its expansive, rocky landscape presents challenges, including disorientation, falls, and encounters with wildlife.\n\nSpeculation about the missing tourists fate ranges from accidental injury to the possibility of encountering dangerous animals, such as leopards or snakes, which inhabit the park.\n\nWhile no foul play hasbeen suggestedso far, park officials and law enforcementare leavingno stone unturned in their search.\n\nThis incidentis likely toreignite discussions around safety protocols for tourists in Zimbabwes national parks.\n\nExperts have long recommended stricter monitoring of visitors, mandatory use of experienced guides, and enhanced communication tools for emergencies.\n\nAs the search operation continues, the world watches with concern, hoping for the safe recovery of the young visitor.\n\nTourists and locals alikeare urgedto exercise caution and follow safety guidelines when venturing into Zimbabwes wilderness.\n\nAuthorities have yet to release further details.\n\nFamilies and communities with ties to thetouristare anxiously awaitingupdates on the unfolding situation.\n\nAn 18 year old tourist is missing in Matopos National Park.@Zimparksreaction team &@PoliceZimbabweare currently searching for him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tourism Reporter-The Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced the disappearance of an 18-year-old tourist in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/tourist-goes-missing-in-matopos-national-park/\">Continue reading<span class=\"screen-reader-text\"> \"Tourist Goes Missing In Matopos National Park\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Safety Tips For Cyclists",
            "url": "https://www.zimeye.net/2024/12/15/safety-tips-for-cyclists/",
            "content": "When it comes to cycling, safety should always be a top priority. One often overlooked yet crucial element of a cyclists safety gear is the tail light or reflector. Just as vehicle tail lights play an essential role in helping drivers see each other, bicycle tail lights and reflectors are vital for ensuring cyclists are visible to other road users, especially from behind.\n\nEnhanced Visibility in Low Light Conditions\n\nCyclists often ride during dawn, dusk, or at night, when visibility is reduced. Tail lights and reflectors are designed to make a cyclist visible to others, reducing the risk of accidents. Tail lights are particularly effective in low-light conditions or when there is limited visibility, such as on poorly lit roads or in foggy weather. The bright light emitted by tail lights ensures that cyclists can be easily spotted by motorists, fellow cyclists, and pedestrians, even from a distance.\n\nReflectors, on the other hand, work by bouncing back light from other vehicles. Even without a battery-powered light source, these small, reflective devices can help you stand out in the dark, as they are designed to catch headlights from other vehicles and send that light back in the direction it came from.\n\nReducing Accidents and Enhancing Road Safety\n\nBicycle accidents, particularly rear-end collisions, are a significant concern for cyclists. Since they often ride in areas where traffic is moving faster or on roads without dedicated bike lanes, the risk of being overlooked by a driver is high. Bicycle tail lights and reflectors act as a clear signal that a cyclist is present on the road, alerting drivers to slow down, pass safely, and keep a safe distance. This can make a huge difference in preventing accidents and ensuring the cyclists safety.\n\nIn addition to rear visibility, these lights and reflectors also help to highlight the cyclists position on the road, making it easier for vehicles to predict their movement and avoid close encounters. For cyclists who ride in groups, having properly working tail lights can prevent dangerous situations where riders are missed by other road users.\n\nLegal Requirements and Best Practices\n\nIn many places, having a tail light or reflector on a bicycle is not just a safety measure but a legal requirement. Laws often mandate that cyclists use lights and reflectors when riding at night or in low-light conditions to ensure visibility. In some regions, the law stipulates that the rear light should be red, and the reflector must be positioned in a specific area to maximize visibility. Its important for cyclists to familiarize themselves with local regulations and ensure they are complying with safety standards.\n\nChoosing the Right Tail Light or Reflector\n\nWhen selecting a tail light, cyclists should consider factors such as brightness, battery life, and mounting options. LED lights are often the best choice, as they are energy-efficient and can emit a bright beam visible from far away. USB rechargeable models are also a popular option for those who want to reduce battery waste.\n\nFor reflectors, its crucial to ensure they are correctly positioned on the back of the bicycle and are made from high-quality reflective materials. Some cyclists opt for both a tail light and additional reflectors to provide maximum visibility from different angles.\n\nConclusion\n\nTail lights and reflectors are not just accessories but essential components of cycling safety. By increasing visibility to other road users, they play a vital role in preventing accidents and ensuring cyclists can ride with greater confidence and security. Whether youre cycling through city streets or on quiet rural roads, make sure your bike is equipped with these critical safety features.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When it comes to cycling, safety should always be a top priority. One often overlooked yet crucial element of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/safety-tips-for-cyclists/\">Continue reading<span class=\"screen-reader-text\"> \"Safety Tips For Cyclists\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Name Of ZAOGA Pastor Caught Pants Revealed",
            "url": "https://www.zimeye.net/2024/12/15/name-of-zaoga-pastor-caught-pants-revealed/",
            "content": "By Religion Reporter- The senior ZAOGA pastor who was fired following allegations of multiple extramarital affairs with married female congregants, as well as other acts of misconduct, has been identified as Joel Chabume Chinhema.\n\nThe Bindura-based Overseer, Joel Chabume Chinhema, was recently fired after a woman from Rusape reported him to the churchs headquarters in Harare for neglecting the two children they share.\n\nThe scandal deepened when another woman accused Chinhema of sexual harassment, claiming he had sent her explicit nude photos.\n\nDuring questioning, the pastor confessed to his misdeeds, leading to his dismissal.\n\nHowever, the case has sparked outrage across the church as more allegations of misconduct surfaced.\n\nChinhema, who previously pastored at a city-centre church in Bulawayo, allegedly left a trail of misconduct.\n\nSeveral women, including widows, divorcees, and unmarried congregants, have come forward claiming he made inappropriate advances, including late-night visits and sending lewd photos.\n\nDespite these allegations, some cases were suppressed, reportedly due to his support from Atoria Gudyanga, the then-Overseer in Bulawayo.\n\nThis scandal has reignited longstanding concerns about corruption and immorality within ZAOGAs leadership.\n\nAllegations have surfaced that some senior pastors, including members of the churchs Transferring Board, exploit their positions to prey on pastors wives in exchange for promotions or transfers to lucrative assignments, including postings abroad.\n\nOne such case allegedly involves a pastor recently transferred to the UK after his wife fell victim to this abuse of power.\n\nReports also suggest that promotions within ZAOGA have become transactional.\n\nSince 2017, aspiring Overseers allegedly pay $1,000, while District Pastor promotions cost $500.\n\nMerit-based appointments appear to have been replaced by bribes and favouritism, prompting non-compromising pastors to leave the church in frustration.\n\nThese revelations point to a systemic culture of corruption and exploitation within ZAOGA, particularly among members of the Transferring Board.\n\nZimEye is currently finalising a year-long investigation into the churchs top leadership, which promises to uncover more cases of hidden immorality and corruption.\n\nZAOGA church and Overseer Chinhema have not yet commented on these allegations as they are unreachable.\n\nPLEASE NOTE: This is a developing story..\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Religion Reporter- The senior ZAOGA pastor who was fired following allegations of multiple extramarital affairs with married female congregants, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/name-of-zaoga-pastor-caught-pants-revealed/\">Continue reading<span class=\"screen-reader-text\"> \"Name Of ZAOGA Pastor Caught Pants Revealed\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Mnangagwa Throws Lavish Party for Wife Amid Economic Struggles",
            "url": "https://www.zimeye.net/2024/12/15/mnangagwa-throws-lavish-party-for-wife-amid-economic-struggles/",
            "content": "By A Correspondent\n\nIn a move that has sparked widespread debate, Zimbabwes President, Emmerson Mnangagwa, hosted a lavish celebration in Chiweshe on Saturday to honor his wife, Dr. Auxillia Mnangagwa, after she was awarded a Doctor of Philosophy (PhD) in Tourism and Hospitality Management from the Midlands State University. The extravagant event, featuring speeches, performances, and an air of opulence, drew attention not only for its lavish nature but also for the stark contrast it presented against the backdrop of the countrys deepening economic crisis.\n\nAs Zimbabwe grapples with soaring inflation, unemployment, and shortages of basic goods, many citizens and political commentators are questioning the timing and necessity of such a grand celebration.\n\nThe country is enduring one of its most challenging economic periods in recent history, with ordinary Zimbabweans struggling to make ends meet amid escalating prices and a deteriorating standard of living.\n\nWhile the first familys celebration was seen as an occasion to mark Dr. Mnangagwas academic achievement, critics have raised concerns about the growing disconnect between the elites ostentatious displays of wealth and the reality faced by millions of Zimbabweans. It is disappointing to see such a lavish display of wealth when the majority of the population is suffering from the consequences of government policies and economic mismanagement, said one political analyst.\n\nAdding to the controversy, some academics have questioned the authenticity of Dr. Auxillia Mnangagwas PhD.\n\nThere are claims that the research and work required for the degree may not meet the rigorous standards expected of such a prestigious academic award. Critics argue that the rapid conferment of the degree and the lack of transparency surrounding her academic journey could undermine the credibility of the award.\n\nIn response, the First Lady has maintained that her academic pursuit was legitimate and that she worked diligently for her qualifications, emphasizing the importance of education in empowering individuals, especially women.\n\nDespite these assertions, skepticism remains among various academic circles, with some raising questions about whether political connections played a role in her academic success.\n\nThe lavish party and the ensuing controversy come at a time when the countrys leadership is under increasing scrutiny for its handling of the economy and social issues.\n\nThe stark contrast between the elites celebratory events and the suffering of ordinary Zimbabweans has raised uncomfortable questions about priorities.\n\nWhile the Mnangagwa familys celebration may have been intended to showcase the First Ladys personal accomplishment, it has inadvertently highlighted the growing divide between Zimbabwes ruling class and its citizens.\n\nAs Zimbabwe continues to battle economic hardships, many will be watching closely to see how the government addresses the concerns of its people.\n\nThe Mnangagwa familys opulent celebration serves as a stark reminder of the deepening political and economic divisions that threaten to further alienate the countrys leadership from the very citizens they govern.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that has sparked widespread debate, Zimbabwe’s President, Emmerson Mnangagwa, hosted a lavish celebration in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/mnangagwa-throws-lavish-party-for-wife-amid-economic-struggles/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Throws Lavish Party for Wife Amid Economic Struggles\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Watch: Mnangagwa Praises General Tongogara But Many Say He Isn’t Sincere At All",
            "url": "https://www.zimeye.net/2024/12/15/watch-mnangagwa-praises-general-tongogara-but-many-say-he-isnt-sincere-at-all/",
            "content": "By A Correspondent\n\nIn a video clip that was posted by Information Ministry Permanent Secretary Nick Mangwana on Sunday, Mr Emmerson Mnangagwa expressed admiration for the late General Josiah Magama Tongogara.\n\nHowever, observers say the Zanu PF leader is not sincete at all\n\nIn this clip you can detect utmost reverence the President has for his late Commander General Tongogara.pic.twitter.com/djA1D5M1Pg\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a video clip that was posted by Information Ministry Permanent Secretary Nick Mangwana on Sunday, Mr … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/watch-mnangagwa-praises-general-tongogara-but-many-say-he-isnt-sincere-at-all/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Mnangagwa Praises General Tongogara But Many Say He Isn’t Sincere At All\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "President Chamisa’s Annual Charity Dinner Brings Relief To Citizens",
            "url": "https://www.zimeye.net/2024/12/15/president-chamisas-annual-charity-dinner-brings-relief-to-citizens/",
            "content": "Tinashe Sambiri\n\nZimbabwean opposition leader, Advocate Nelson Chamisa, hosted a remarkable Annual Charity Dinner on Saturday, drawing a large and enthusiastic crowd. The event, a hallmark of Chamisas dedication to giving back to the community, served not only as a fundraiser but also as a platform for citizens to come together in the spirit of charity and solidarity.\n\nIn a statement following the event, Chamisa expressed his gratitude and highlighted the success of the evening. He shared, The Annual Charity Dinner  Fully subscribed and superbly organized.\n\nKudos to the technical team and an army of citizens volunteers who made this event memorable. Thank you all for supporting the charity vision! Towards a giving Zimbabwe #Godisinit.\n\nThis years dinner saw the participation of numerous donors, volunteers, and citizens, all united under the common goal of supporting those in need.\n\nThe event has become a key fixture in the Zimbabwean charity calendar, contributing significantly to alleviating the challenges faced by many across the country.\n\nChamisa, known for his strong commitment to the welfare of Zimbabweans, used the occasion to underscore the importance of community involvement. He commended the technical team and volunteers for their efforts, emphasizing that the success of the dinner was a collective achievement.\n\nThe night was marked by speeches, entertainment, and an outpouring of generosity from attendees who contributed towards various charitable causes.\n\nThe Annual Charity Dinner is a clear reflection of Chamisas vision for a more compassionate and giving Zimbabwe.\n\nHis call for a giving Zimbabwe resonated deeply with attendees, encouraging further contributions to support local communities and provide much-needed relief to vulnerable citizens.\n\nAs Zimbabwe continues to face economic challenges, events like the Annual Charity Dinner offer a glimmer of hope, showcasing the power of unity and collective action in making a positive impact on society.\n\nThrough these efforts, Chamisas charity initiative continues to bring vital relief and uplift the lives of many, reinforcing his commitment to improving the lives of ordinary Zimbabweans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Zimbabwean opposition leader, Advocate Nelson Chamisa, hosted a remarkable Annual Charity Dinner on Saturday, drawing a large and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/president-chamisas-annual-charity-dinner-brings-relief-to-citizens/\">Continue reading<span class=\"screen-reader-text\"> \"President Chamisa’s Annual Charity Dinner Brings Relief To Citizens\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        },
        {
            "title": "Prominent Kadoma Businessman Gunned Down",
            "url": "https://www.zimeye.net/2024/12/15/prominent-kadoma-businessman-gunned-down/",
            "content": "By Crime and Courts Reporter- A Prominent Kadoma businessman and farmer, Eric Tambudze was assasinated in a gold mafia that has implicated Zanu PF, Gokwe Kabuyuni Member of Parliament, Spencer Tshuma.\n\nTambudze, a well-respected entrepreneur involved in farming, pharmaceuticals, gold mining, and retail, was fatally shot at his Kadoma home in early November.\n\nHis son, Leslie, confirmed the tragic event, stating, My father was shot dead upon arriving home from work last Friday.\n\nPolice have acknowledged the case and are actively investigating, though no arrests have been made so far.\n\nSources close to the matter allege that Tshuma, a prominent businessman himself, hired hitmen from South Africa to execute Tambudze following a heated land dispute.\n\nTshuma, who owns Spencer Fuelsa fuel station on the outskirts of Kadomahad reportedly seized land near his business for expansion.\n\nThe land, however, legally belonged to Tambudze, who successfully contested the fraudulent acquisition in court.\n\nDespite the legal ruling in Tambudzes favour, Tshuma is said to have refused to relinquish the property.\n\nConstruction had already begun, escalating tensions between the two men.\n\nFollowing his court defeat, Tshuma allegedly resorted to violence, hiring hitmen to resolve the matter permanently.\n\nThe murder has shocked the Kadoma community and reignited public scrutiny of Zanu PF officials often linked to gold smuggling syndicates and illicit land deals.\n\nTshuma himself is rumoured to have deep connections to Zimbabwes gold mafia, a network accused of laundering money and exploiting the countrys natural resources.\n\nEfforts to reach Tshuma for comment were unsuccessful, as his phone remained unreachable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- A Prominent Kadoma businessman and farmer, Eric Tambudze was assasinated in a gold mafia that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/prominent-kadoma-businessman-gunned-down/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Kadoma Businessman Gunned Down\"</span></a></p>",
            "time": "21:36",
            "date": "15 Dec 2024"
        }
    ]
}