{
    "news": [
        {
            "title": "Plan To Fire VP Chiwenga Hots Up",
            "url": "https://www.zimeye.net/2025/04/06/plan-to-fire-vp-chiwenga-hots-up/",
            "content": "By Dorrothy Moyo | ZimEye | In an escalation of ZANU PFs internal succession war, Zimbabwes Justice Minister Ziyambi Ziyambi has allegedly urged First Lady Auxillia Mnangagwa to move swiftly and decisively to fire Vice President Constantino Chiwengadeclaring that the former general should forget about succeeding President Mnangagwa in 2028.\n\nThe revelation comes from a pair of high-level, JOC-style meetingsfirst held in Borrowdale, then at Precabe Farm, President Mnangagwas private estate. The gatherings were attended by Mnangagwa himself, Ziyambi, State Security Minister Lovemore Matuke, First Lady Auxillia Mnangagwa, and senior operatives including Owen Mudha Ncube. Sources say the meetings bore the hallmarks of a Joint Operations Command (JOC) council, even if not officially designated as such.\n\nAccording to leaked intelligence notes, the agenda was clear: to eliminate internal resistance to Mnangagwas continued rule and neutralize potential threatsincluding Chiwenga and Retired Lieutenant General Engelbert Rugeje. One attendee reportedly volunteered to carry out the task, referencing a prior failed operation targeting Rugeje, where gunfire erupted but the former general was absent from the property.\n\nThe Precabe meeting followed a tense session in Borrowdale, where the newly installed army commander reportedly warned that if Chiwenga were removed, the barracks will be hot to touch, and even he, the commander, might not be able to enter. The statement was viewed as a stark reminder of Chiwengas lingering grip on the military.\n\nZiyambi, meanwhile, has privately dismissed any suggestion that Chiwenga remains in line to succeed Mnangagwa. In a WhatsApp exchange with ZimEye, he shot back at claims the VP was being groomed for 2028: Who said he cannot be elected in 2030?a loaded statement widely interpreted as confirmation that Chiwenga has been politically iced out.\n\nInside sources close to Auxillia Mnangagwa say shes grown increasingly wary of Chiwengas ambitions and has aligned herself with efforts to extend EDs rule beyond 2028. Ziyambi reportedly cited a resolution launched last year at Precabe by Shamu and Tshabangu in EDs presence that laid the groundwork for Mnangagwas prolonged stay in power, bypassing any VP-led transition.\n\nThe meeting reportedly turned theatrical when Mfanha Mutamba declared, Shefu, if you want me to go arrest him (Chiwenga), I can do it, underscoring the volatile nature of the political climate and the raw loyalty driving these confrontations.\n\nWhile Chiwenga has remained publicly silent, insiders suggest he is consolidating support within the military and war veterans. With the JOC-like gatherings deepening factional divides, Zimbabwe finds itself on the brink of a dangerous internal showdownone not fought in parliament or at the ballot box, but behind closed doors at Precabe.\n\nMore to follow\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | In an escalation of ZANU PF’s internal succession war, Zimbabwe’s Justice Minister Ziyambi Ziyambi … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/plan-to-fire-vp-chiwenga-hots-up/\">Continue reading<span class=\"screen-reader-text\"> \"Plan To Fire VP Chiwenga Hots Up\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "DeMbare Fall",
            "url": "https://www.zimeye.net/2025/04/06/dembare-fall-2/",
            "content": "Sports Correspondent\n\nMWOS FC has surged to the top of the Castle Lager Premier Soccer League table, securing a narrow 1-0 win over ZPC Kariba. The Norton-based team now boasts eleven points, thanks to a crucial first-half goal from Billy Vheremu. Making their debut in the league, MWOS currently holds a one-point lead at the summit of the standings.\n\nIn other matches, Dynamos suffered their first defeat of the season at the hands of Manica Diamonds at Sakubva Stadium. The Glamour Boys had started the campaign on a strong note, with three draws and a win, but were ultimately undone by Donald Tegurus 15th-minute strike for the Gem Boys.\n\nElsewhere, Scotand FC dominated Bikita Minerals with a convincing 3-0 victory. The newcomers secured their win with goals from Walter Musona and Mthokozisi Msebe, as well as an own goal in the second half.\n\nDefending champions Simba Bhora edged out TelOne 1-0, while Greenfuel secured a narrow 1-0 win over Yadah.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent MWOS FC has surged to the top of the Castle Lager Premier Soccer League table, securing a narrow … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/dembare-fall-2/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Fall\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Be Patient When Trailing Long Vehicles",
            "url": "https://www.zimeye.net/2025/04/06/be-patient-when-trailing-long-vehicles/",
            "content": "When navigating roundabouts or joining a road, its important to be mindful of long vehicles, such as trucks or buses, which may need to use more than one lane to make their turns. These vehicles require additional space and may take a different course than expected to safely maneuver through the area.\n\nTo ensure safety for both yourself and the driver of the long vehicle, stay well back and give them plenty of room. Remember, their size and turning radius mean they need extra space to complete the maneuver without obstruction. By keeping a safe distance and being patient, you help prevent accidents and ensure smoother traffic flow for everyone on the road.\n\nAlways be aware of the needs of larger vehicles, particularly in tight spaces like roundabouts or when merging onto busy roads. Safety and awareness are key to preventing collisions and promoting safer driving habits.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When navigating roundabouts or joining a road, it’s important to be mindful of long vehicles, such as trucks or buses, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/be-patient-when-trailing-long-vehicles/\">Continue reading<span class=\"screen-reader-text\"> \"Be Patient When Trailing Long Vehicles\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "People Lured By Hopewell To His Chisipite Home Before Being Destroyed Include Nelson Chamisa, Scores Others",
            "url": "https://www.zimeye.net/2025/04/06/people-lured-by-hopewell-to-his-chisipite-home-before-being-destroyed-include-nelson-chamisa-scores-others/",
            "content": "The list of women, men plus vulnerable people endangered by Hopewell Chinono since 2014, including some who he lured to his Chisipite house claiming he is their Daddy figure, include \n\n1. CCC PresidentNelson Chamisa, from whom Chinono needed political endorsement, before turning to destroy his party and career.\n\n2. Rape trial complainant at Falkirk in 2014, against whose safety, Chinono competed with the rape suspect to lure her into an affair.\n\n3. NHS expert Grace Mupfurutsa who Hopewell Chinono has falsely claimed was sent to a media outfit for an interview on 18 Aug 2020, something that did not happen and Mupfurutsa had shot her son live video the day before on 17 Aug 2020.\n\n4. Several women and tortured activists in the civil society upon whom the army was unleashed after Chinono advised the minister of Defence to deploy security forces in order to achieve the avoidance of political tension.\n\n5. Several women whove request anonymity and state they were approached in their inbox windows for an affair (see documents).\n\n6. Chinonos colleage Jennifer Banyure who the journalist encouraged to sabotage Gatwick Airport records leading to anattempted hacking hit on 26 Aug 2024. (full documentary in link below)\n\n7. Analysts allege that Chinono is a spy. \n\nCheck his record. He makes sure that anybody who matters in Zim politics owes him something in order to shut them from speaking against him or challenge the status quo\n\nAnybody who challenges the current government without being close to Hopewell is scandalised and sold out by Hopewell to the authorities, writes Hulu, @pachisolife\n\nScores of Zimbabweans continue to testify with compelling evidence that@daddyhopeHopewell Chinono has over the decade since 2014 been using journalism/activism to compromise news sources, including his own written admission that he corrupted the Minister Of Defence advisinghttps://t.co/sQwE92wyGRpic.twitter.com/Y8KdLcv4UM\n\nhttps://www.facebook.com/zimeye/videos/654124957172341\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The list of women, men plus vulnerable people endangered by Hopewell Chin’ono since 2014, including some who he lured to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/people-lured-by-hopewell-to-his-chisipite-home-before-being-destroyed-include-nelson-chamisa-scores-others/\">Continue reading<span class=\"screen-reader-text\"> \"People Lured By Hopewell To His Chisipite Home Before Being Destroyed Include Nelson Chamisa, Scores Others\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Will Madhuku Party Stop Zanu PF In Glen View South By-election?",
            "url": "https://www.zimeye.net/2025/04/06/will-madhuku-party-stop-zanu-pf-in-glen-view-south-by-election/",
            "content": "By A Correspondent\n\nThe National Constitutional Assembly (NCA), led by Professor Lovemore Madhuku, is determined to secure a victory in the upcoming Glen View South by-election set for April 12, 2025.\n\nAt a star rally held in the Glen View South constituency on Saturday, Madhuku exuded confidence in his partys ability to perform strongly in the election, positioning the NCA as a serious contender to challenge the political status quo.\n\nDuring the rally, Madhuku passionately rallied support for Perpetua Mukanda, the NCAs candidate for the by-election. He made it clear that the NCA is ready to go up against the established political parties and achieve victory.\n\nWe are here to claim victory. We are a strong and formidable entity. After all, we are no pushovers, Madhuku declared, his words galvanizing the crowd and reinforcing the partys resolve to bring change to the region.\n\nMukanda, the NCAs representative in Glen View South, also took part in the rally, drawing attention from the community. Her candidacy has brought hope to NCA supporters, who are eager to expand the partys influence in the area.\n\nWhile the Glen View South by-election is expected to be a tough contest with various political players involved, the NCA is focused on achieving a decisive win. The party aims to position itself as a key political force in Zimbabwes changing political landscape.\n\nWith the election just days away, the NCAs message of empowerment and change is gaining traction among voters in Glen View South, who are preparing to make their voices heard at the polls.\n\nTsitsi Tawomhera is representing Zanu PF in the by-election.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The National Constitutional Assembly (NCA), led by Professor Lovemore Madhuku, is determined to secure a victory in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/will-madhuku-party-stop-zanu-pf-in-glen-view-south-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Will Madhuku Party Stop Zanu PF In Glen View South By-election?\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Zanu PF Women’s League Invades Glen View South",
            "url": "https://www.zimeye.net/2025/04/06/zanu-pf-womens-league-invades-glen-view-south/",
            "content": "By A Correspondent\n\nThe Zanu PF Womens League made a powerful show of support for their candidate, Tsitsi Tawomhera, as they descended on Glen View South Constituency this past Saturday to rally voters ahead of the upcoming by-election.\n\nA strong contingent of Zanu PF leaders attended the event, including Politburo member Charles Tavengwa, the Womens League National Finance Secretary Mai Mugabe, Harare Provincial Chairperson Masimerembwa, and several other prominent provincial figures.\n\nDuring the rally, Tsitsi Mugabe, a key figure in the Womens League, addressed the crowd, expressing unwavering confidence in the partys victory. We are winning resoundingly here. Zanu PF is for the people, she declared, a statement that was met with loud cheers from the gathered supporters.\n\nThe presence of these high-ranking officials underscored the importance of the by-election for the party, with the Womens League mobilizing resources and support to ensure Tawomheras victory. The event was filled with energy as party loyalists gathered to reaffirm their commitment to Zanu PFs leadership and vision for the country.\n\nAs the by-election approaches, Zanu PF appears determined to secure Glen View South, and the Womens Leagues active involvement highlights the partys ongoing efforts to galvanize support at the grassroots level. With leaders like Tsitsi Tawomhera at the forefront, Zanu PF aims to further solidify its presence in the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zanu PF Women’s League made a powerful show of support for their candidate, Tsitsi Tawomhera, as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/zanu-pf-womens-league-invades-glen-view-south/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Women’s League Invades Glen View South\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Madhuku Party Targets Victory in Glen View South By-election",
            "url": "https://www.zimeye.net/2025/04/06/madhuku-party-targets-victory-in-glen-view-south-by-election/",
            "content": "By A Correspondent\n\nThe National Constitutional Assembly (NCA), led by Professor Lovemore Madhuku, is poised to secure a victory in the upcoming Glen View South by-election set for April 12, 2025. During a star rally held on Saturday in the Glen View South constituency, Madhuku expressed unwavering confidence in his partys chances, positioning the NCA as a formidable political force.\n\nAt the rally, Professor Madhuku rallied support for the partys candidate, Perpetua Mukanda, who will represent the NCA in the highly anticipated by-election. Speaking to a crowd of supporters, Madhuku emphasized the partys readiness to challenge the political establishment and secure a victory.\n\nWe are here to claim victory. We are a strong and formidable entity. After all, we are no pushovers, Madhuku declared passionately. His words resonated with the crowd, reinforcing the partys message of strength and determination in the political landscape.\n\nMukanda, who is the NCAs candidate for Glen View South, was also present at the rally, garnering significant attention from the constituents. Her candidacy has sparked a sense of hope among the NCAs supporters, as they aim to expand their political influence in the region.\n\nThe Glen View South by-election is expected to be a closely contested race, with multiple political parties vying for the seat.\n\nThe NCA, however, is aiming for a decisive win, positioning itself as a key player in Zimbabwes evolving political environment.\n\nWith just days left until the election, the NCAs message of empowerment and change is resonating strongly with voters in Glen View South, as they prepare to head to the polls.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The National Constitutional Assembly (NCA), led by Professor Lovemore Madhuku, is poised to secure a victory in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/madhuku-party-targets-victory-in-glen-view-south-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Madhuku Party Targets Victory in Glen View South By-election\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Fatal Shooting at Chinese-Owned Mine Sparks Violent Protests in Zimbabwe",
            "url": "https://www.zimeye.net/2025/04/06/fatal-shooting-at-chinese-owned-mine-sparks-violent-protests-in-zimbabwe/",
            "content": "By A Correspondent\n\nA Zimbabwean artisanal miner lost his life in a tragic incident at the Chinese-owned Sino Africa Huijin mine in Premier Estate, Old Mutare, on Wednesday night. The security guards allegedly shot the miner three times in the face, prompting widespread condemnation.\n\nFarai Maguwu, Director of the Centre for Natural Resource Governance (CNRG), expressed outrage over the incident, describing it as a clear case of homicide. Maguwu questioned the legitimacy of the guards actions, citing a lack of self-defense and clear intent to kill.\n\nThe Zimbabwe Republic Police (ZRP) have launched an investigation into the allegations, assuring the public that full details will be released soon. However, concerns have been raised over the polices alleged acceptance of fuel from the Chinese compound, sparking questions about potential bias in the investigation.\n\nThe incident has sparked violent protests in the community, with locals demanding justice for the victim and accountability from the mining company. The CNRG is calling for a thorough investigation, a forensic audit of the mines finances, and the deportation of the Chinese operators.\n\nThis incident is not the first controversy surrounding Sino Africa Huijin. Previous concerns have been raised over the mines safety standards, labour practices, and alleged links to gold smuggling.\n\nIn January, a worker died under unclear circumstances, and the company offered inadequate compensation to the family .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zimbabwean artisanal miner lost his life in a tragic incident at the Chinese-owned Sino Africa Huijin … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/fatal-shooting-at-chinese-owned-mine-sparks-violent-protests-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Fatal Shooting at Chinese-Owned Mine Sparks Violent Protests in Zimbabwe\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "RBZ Prints More Useless ZiG Notes As Economy Collapses",
            "url": "https://www.zimeye.net/2025/04/06/rbz-prints-more-useless-zig-notes-as-economy-collapses/",
            "content": "By Business Reporter-The Reserve Bank of Zimbabwe (RBZ) now says it isprinting more the Zimbabwe Gold (ZiG)ZiG notesin a desperate attempt to shore up confidence, despite the currency havinglost value within a month of its debut in April last year.\n\nRBZ GovernorJohn Mushayavanhuconfirmed the centralbanksplan to enhance and print new notes, citing agradual de-dollarisation roadmapand claiming the rollout of new designs will take between six months and two years  a delay critics say will do nothing to reverse the eroding trust in the local currency.\n\nThe Reserve Bank is working on enhancing the quality and design of the ZiG banknotes in line with international standards,Mushayavanhu said, adding that the process was part of broader measures to transition to amonocurrency regimeby 2030.\n\nBut economists and ordinary Zimbabweans alike are not convinced.\n\nThe latest developments expose a troubling pattern in PresidentEmmersonMnangagwasadministration  a repetition of the same failed currency policies implemented under former President Robert Mugabe.\n\nSince 2000, Zimbabwe has introduced and abandoned a string of currencies and monetary instruments, including bearer cheques, bond notes, and electronic RTGS dollars  all of which collapsed under inflation and public rejection.\n\nMnangagwasrise to power in 2017 was marked by promises of economic reform, foreign investment, and a break from Mugabe-era economic mismanagement.\n\nHowever, the ZANU PF government hasdoubled down oncentralisedeconomic control, monetary policy manipulation,and a hostile business environment, pushing the country further away from genuine recovery.\n\nThe latest currency experiment  theZiG was marketed as a gold-backed solution to instability.\n\nBut it has done little toinstilconfidence among citizens and investors. Instead, many Zimbabweans continue to rely on the US dollar for everyday transactions, withlocal currency use hovering at just 35 percent, despite official efforts to enforce de-dollarisation.\n\nWhile RBZ insists thatprice stabilityandcontrolled inflation including a reportednegative food inflation rate of -0.5% are signs ofZiGssuccess, the broader economic picture remains bleak.\n\nRent shocks, fuel volatility, and shortages in essential goods continue to undercut official optimism.\n\nThe government claims that end-2025 annual inflation will be contained below 30%, paving the way for a 6% GDP growth.\n\nBut these projections appear detached from the real challenges facingZimbabwesinformalised and largely dollarised economy.\n\nWhat Zimbabwe needs, economists argue, is not anothershort-lived localcurrency,butstructural economic reformsto restore investor confidence. These include:\n\nWithout these fundamentals, any currency be itZiG or otherwise  is bound to fail.\n\nFrom bearer cheques to bond notes, from RTGS dollars to ZiG Zimbabwesmonetary history is littered with broken promises and vanished savings.\n\nThe return to printing more notes signals notstability,but desperation.\n\nAnd as long as PresidentMnangagwasgovernment refuses to address the root causes of economic collapse  cronyism, corruption, and policy inconsistency  the ZiG will join the ghosts of currencies past.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-The Reserve Bank of Zimbabwe (RBZ) now says it is printing more the Zimbabwe Gold (ZiG)ZiG notes in a desperate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/rbz-prints-more-useless-zig-notes-as-economy-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Prints More Useless ZiG Notes As Economy Collapses\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Mnangagwa Daughter Breaks Through RGM Airport Without Valid Ticket for Travel",
            "url": "https://www.zimeye.net/2025/04/06/mnangagwa-daughter-breaks-through-rgm-airport-without-valid-ticket-for-travel/",
            "content": "By A Correspondent | ZimEye | President Emmerson Mnangagwas daughter, Farai on Sunday morning played outhwugananda when she rammed into the RGM Aiport without a ticket.\n\nShe was at the time escorting her husband.\n\nFor security this secured departure area should\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | President Emmerson Mnangagwa’s daughter, Farai on Sunday morning played out’hwugananda’ when she rammed into … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/06/mnangagwa-daughter-breaks-through-rgm-airport-without-valid-ticket-for-travel/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Daughter Breaks Through RGM Airport Without Valid Ticket for Travel\"</span></a></p>",
            "time": "20:25",
            "date": "06 Apr 2025"
        }
    ]
}