{
    "news": [
        {
            "title": "Namibia’s Founding Father Sam Nujoma Has Died",
            "url": "https://www.zimeye.net/2025/02/09/namibias-founding-father-sam-nujoma-has-died/",
            "content": "Windhoek  Sam Nujoma, the guerrilla leader who became Namibias first president after it won independence from South Africa in 1990, died aged 95 on Saturday, the Namibian presidency said in a post on Facebook.\n\nNujoma had been hospitalised over the past three weeks, battling an illness from which he could not recover, Namibian President Nangolo Mbumba said in a statement announcing the death.\n\nIt is therefore with utmost sorrow and sadness that I announce this morning of the 9th of February 2025 to the Namibian people, our African brothers and sisters and the world at large, about the passing of our revered freedom fighter and revolutionary leader, Mbumba said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Windhoek – Sam Nujoma, the guerrilla leader who became Namibia’s first president after it won independence from South Africa in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/namibias-founding-father-sam-nujoma-has-died/\">Continue reading<span class=\"screen-reader-text\"> \"Namibia’s Founding Father Sam Nujoma Has Died\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "Epworth Faces Shortage Of Condoms",
            "url": "https://www.zimeye.net/2025/02/09/epworth-faces-shortage-of-condoms/",
            "content": "CONSTITUENCY UPDATE BY HONORABLE MHETU EPWORTH NORTH MP\n\nIn my capacity as the Member of Parliament for Epworth North, I visited health centres in the constituency on January 5, 2025 to ascertain the situation at various clinics following the recent freeze on aid programmes by the American government.\n\nI managed to visit and interact with staff at Epworth Poly Clinic, Overspill Clinic and was assured that currently, there is enough medication for the 22 000 residents on Anti-Retroviral Therapy.\n\nThe National Pharmaceutical Company (Natpharm) is currently supplying ARVs to the health centres and the current stock of ARVs will be informed to me later after a detailed audit and I shall keep the constituency updated.\n\nI was also briefed that at present, there is 4 months supply of condoms left.\n\nHowever I was alerted to the reduction of staff at these health centres after Zimtech and PEPFAR withdrew 6 nurses and 5 primary counsellors from Epworth Poly Clinic. At Overspill Clinic, 5 nurses and 4 primary counsellors have left while 1 nurse and 2 primary counsellors have left Epworth Mission Clinic.\n\nCurrently, skeletal staff at these health centres are overwhelmed with work and the District Medical Officer made a plea for the government to bring in LOCUM staff to fill the void.\n\nAs the Member of Parliament for Epworth North, I will engage various Government Ministries and Departments to ensure that LOCUM Staff is supplied at the these health centres in Epworth North.\n\nI have also taken it upon myself to engage various donor agencies and well-wishers to ensure adequate medication supplies at our health centres in Epworth North.\n\nOn behalf of the people of Epworth North, I do hereby make a passionate appeal to the United States government to review its stance on foreign aid and continue to save lives.\n\nPrior notice on cutting aid- at least 24 months- would have been appropriate, since the abrupt stall of aid does not only pose a risk to beneficiaries but is also a violation of legitimate expectation. The government of Zimbabwe passed its budget in December 2024.\n\nFunds to cover this gap may require a supplementary budget which may not be possible since the citizens are already overly taxed.\n\nAs the Member of Parliament for Epworth North, I would like to reiterate my commitment to ensuring residents receive quality health care.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "CONSTITUENCY UPDATE BY HONORABLE MHETU EPWORTH NORTH MP In my capacity as the Member of Parliament for Epworth North, I … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/epworth-faces-shortage-of-condoms/\">Continue reading<span class=\"screen-reader-text\"> \"Epworth Faces Shortage Of Condoms\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "ZIMRA Officer Dies",
            "url": "https://www.zimeye.net/2025/02/09/zimra-officer-tapiwa-mazuru-passes-away/",
            "content": "By A  Correspondent\n\nThe Zimbabwe Revenue Authority (ZIMRA) is mourning the loss of one of its dedicated officers, Mr. Tapiwa Mazuru, who tragically passed away on the 5th of February, 2025. In a heartfelt statement issued on Friday, the ZIMRA Board, Commissioner General, Management, and Staff conveyed their deepest condolences to the Mazuru family, relatives, and friends during this difficult time.\n\nMr. Mazuru, who had been stationed in Victoria Falls, was highly regarded by his colleagues and the wider community. His untimely passing has left a profound impact on all who knew him, and his dedication to his role at ZIMRA will be remembered by many.\n\nThe statement from ZIMRA expressed their sympathy, acknowledging the loss of an exceptional individual. The Board, Commissioner General, Management, and Staff of the Zimbabwe Revenue Authority (ZIMRA) express their deepest condolences to the Mazuru family, relatives, and friends following the passing of Mr. Tapiwa Mazuru, it read.\n\nZIMRA further paid tribute to Mr. Mazurus hard work and commitment to his duties, underscoring the gap his passing leaves within the organization. As a valued member of the ZIMRA team, his contributions will be remembered and cherished.\n\nAs the family and colleagues mourn his loss, ZIMRA extended their thoughts and prayers, offering support to the grieving loved ones. May his soul rest in eternal peace, the statement concluded.\n\nThe death of Mr. Tapiwa Mazuru marks a significant loss to both ZIMRA and the wider community, and his memory will surely live on in the hearts of those who worked alongside him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Revenue Authority (ZIMRA) is mourning the loss of one of its dedicated officers, Mr. Tapiwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/zimra-officer-tapiwa-mazuru-passes-away/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA Officer Dies\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "ZiG Doomed",
            "url": "https://www.zimeye.net/2025/02/09/zig-doomed-2/",
            "content": "By A Correspondent\n\nIn a surprising and controversial statement, Zanu PF official Killer Zivhu has vowed to walk naked if Zimbabwes ZiG currency ever regains its value.\n\nZivhus statement on Friday sparked mixed reactions from the public and political circles.\n\nZivhu reflected on the current state of Zimbabwes economy and the value of the ZiG currency, which has struggled to gain traction.\n\nThe Zanu PF official suggested that if ZiG were to be used exclusively for everyday transactions, from petrol to groceries and salaries, it would indicate a significant shift in the countrys economic stability.\n\nThe day we have ZiG petrol only, ZiG fees only, ZiG groceries only, ZiG salaries only, is the day Ill move around naked calling for an amendment of our constitution, Zivhu declared.\n\nHe further emphasized his stance, adding, For now, the light isnt bright enough to tamper with our constitution. #ZimConstitution.\n\n. The ZiG currency has been part of discussions on ways to stabilize the local economy, but its value has been under question due to various economic factors.\n\nThe Zanu PF officials vow to walk naked if the ZiG gains value has caught the attention of both supporters and critics.\n\nWhile some have laughed off the statement as a dramatic exaggeration, others have questioned the broader implications for Zimbabwes constitutional framework.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a surprising and controversial statement, Zanu PF official Killer Zivhu has vowed to walk naked if … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/zig-doomed-2/\">Continue reading<span class=\"screen-reader-text\"> \"ZiG Doomed\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "Brett Muvhet Announces Formation of New Political Party in the Diaspora",
            "url": "https://www.zimeye.net/2025/02/09/brett-muvhet-announces-formation-of-new-political-party-in-the-diaspora/",
            "content": "By A Correspondent | ZimEye | Pretoria, SA  In a bold and unprecedented move, activist and political commentator Brett Muvhet has announced the formation of a new political party aimed at uniting Zimbabweans in exile and the diaspora. Speaking in a video message, Muvhet described the initiative as a necessary step in the fight against the ruling regime, which he claims has closed all political avenues for opposition within the country.\n\nFor years, I have firmly believed that a peoples revolution is the only way forward to remove the regime in Zimbabwe, Muvhet declared. However, he noted that influential figures, including business and political elites, have been reluctant to engage in revolutionary discourse, prompting the decision to establish a formal political structure.\n\nA Political Party with a Revolutionary Foundation\n\nUnlike traditional opposition movements within Zimbabwe, Muvhet envisions this party as a platform primarily for Zimbabweans in exile. Many of us cannot return to Zimbabwe without facing persecution, he explained. So, this party will be based in the diaspora, but with the goal of eventually playing a role in Zimbabwes future, whether through revolution or diplomatic means.\n\nMuvhet revealed that, despite discussions with members of various opposition parties, there appears to be little urgency for unification ahead of the 2028 elections. Instead, opposition groups remain focused on building their individual bases, leaving those who advocate for a more radical transformation excluded from key political discussions. The international community and regional bodies are engaging with these fragmented parties, but we are not invited. That is why we need our own political base.\n\nSelective Membership and Ideological Clarity\n\nEmphasizing quality over quantity, Muvhet stated that membership in the new party will not be open to everyone immediately. You will have to apply to be part of the leadership. This is not about numbersthis is about committed individuals who understand what we stand for, he said. While general supporters will be welcomed, formal membership will only be granted after the release of a book outlining the partys principles, policies, and vision for Zimbabwe.\n\nAmong the key issues to be addressed in this manifesto are land reform, border policies, taxation, and economic policies. Until that book is out, we wont take membership requests. You need to know exactly what youre supporting, he stated.\n\nFinancial Appeal for a Political Launch\n\nMuvhet has launched a financial appeal to fund the partys operations, requesting Zimbabweans to contribute $4.50 per month via a subscription model. He argued that financial support would accelerate their efforts, covering essential costs such as office space, research teams, and grassroots mobilization within Zimbabwe.\n\nI could continue doing this alone, but it will take much longer. If we get at least 900 to 1,000 Zimbabweans contributing, we can formally launch this party and push for real change, he said. He also acknowledged skepticism over fundraising efforts, citing past abuses of political donations, but reassured supporters that funds would not be used to enrich himself. I live an average life, drive average cars, and wear overalls to work. This money will go into the movement, not my personal lifestyle.\n\nA Response to Political Instability and the Looming Coup\n\nMuvhet warned of growing instability within Zimbabwes ruling elite, claiming that internal conflicts and economic collapse could lead to another coup. The regime has run out of things to steal. Now, they are turning on each other, he said, predicting imminent political shifts. However, he maintained that regardless of what happens, a movement built on strong principles will always be necessary in Zimbabwes political landscape.\n\nIn his closing remarks, he challenged Zimbabweans to take action. You can sit back and hope for a miracle, or you can invest in a real political movement. God helps those who help themselves, he urged.\n\nWith this announcement, Muvhet has positioned himself as a new political force in Zimbabwes opposition landscape, sparking debate over whether his movement will gain traction or face the same challenges that have plagued other opposition efforts. As the political climate in Zimbabwe remains volatile, the coming months will determine whether his vision for a peoples revolution can translate into tangible change.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Pretoria, SA – In a bold and unprecedented move, activist and political commentator Brett … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/brett-muvhet-announces-formation-of-new-political-party-in-the-diaspora/\">Continue reading<span class=\"screen-reader-text\"> \"Brett Muvhet Announces Formation of New Political Party in the Diaspora\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "This Married Woman Is Sleeping With My Husband",
            "url": "https://www.zimeye.net/2025/02/09/this-married-woman-is-sleeping-with-my-husband/",
            "content": "Dear Editor.\n\nThis young married woman is sleeping with my husband. Im suspecting they even have a new baby where by her husband thinks its his child. She is currently staying Joburb. Unfortunately, she has deleted her social media account. Her name is San*\n\nREPLY: This is very sad. A lot of ugly things do happen to many people, in these troubling times. And you have done well by staying calm. You need to protect your heart always, dont you think so? Are you getting counseling? Do you have professional counsellors near you? AUDIO:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dear Editor. This young married woman is sleeping with my husband. Im suspecting they even have a new baby where … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/this-married-woman-is-sleeping-with-my-husband/\">Continue reading<span class=\"screen-reader-text\"> \"This Married Woman Is Sleeping With My Husband\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "Trump Hits SA With Sanctions",
            "url": "https://www.zimeye.net/2025/02/09/trump-hits-sa-with-sanctions/",
            "content": "By A Correspondent\n\nIn a significant shift in U.S. foreign policy, President Donald J. Trump has issued an executive order targeting South Africa, imposing sanctions in response to what he describes as egregious actions by the South African government.\n\nThe order comes after South Africa enacted its controversial Expropriation Act 13 of 2024, which allows the government to seize agricultural property from ethnic minority Afrikaners without compensation.\n\nThe U.S. president condemned the act, stating that it represents shocking disregard of its citizens rights. Trump further criticized the governments broader actions, claiming they dismantle equal opportunities in areas such as employment, education, and business, while also fueling violence against minority landowners. He also pointed to South Africas foreign policy moves, including its stance on Israel and its growing ties with Iran.\n\nThe United States cannot support the government of South Africas commission of rights violations in its country or its undermining of U.S. foreign policy, Trump said in a statement. This poses national security threats to our Nation, our allies, our African partners, and our interests.\n\nAs part of the executive order, the U.S. will halt all foreign aid to South Africa. The United States shall not provide aid or assistance to South Africa, Trump declared, emphasizing that South Africas actions cannot be ignored without repercussions. The U.S. will also prioritize the resettlement of Afrikaners who are fleeing government-sponsored racial discrimination, including land confiscations. We are committed to promoting the resettlement of Afrikaner refugees escaping these injustices, the order stated.\n\nAdditionally, the president confirmed that the United States would not attend the upcoming G20 summit in November. This move underscores the administrations stance on South Africas policies, signaling the growing tensions between the two nations.\n\nIn terms of refugee resettlement, the order directs the Secretary of State and the Secretary of Homeland Security to take steps to prioritize the admission and resettlement of Afrikaners affected by racial discrimination. The plan for this resettlement program is to be submitted to the President through the Homeland Security Advisor.\n\nThe executive order also mandates that U.S. agencies, including USAID and PEPFAR, cease providing financial aid to South Africa. As part of these sanctions, the U.S. will also block any future foreign assistance to the country, including the annual $440 million allocated for HIV/AIDS programs through PEPFAR.\n\nThe United States is taking this action to protect our values and interests. We stand against any government that undermines human rights and acts contrary to international standards, Trump added.\n\nThis development marks a pivotal moment in U.S.-South Africa relations, with far-reaching consequences for the future of foreign aid, refugee resettlement, and international diplomacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a significant shift in U.S. foreign policy, President Donald J. Trump has issued an executive order … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/trump-hits-sa-with-sanctions/\">Continue reading<span class=\"screen-reader-text\"> \"Trump Hits SA With Sanctions\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "Zimbabwean Defender Leaves West Ham By Mutual Consent",
            "url": "https://www.zimeye.net/2025/02/09/zimbabwean-defender-leaves-west-ham-by-mutual-consent/",
            "content": "Sports Correspondent\n\nWest Ham United has confirmed the departure of Zimbabwean talent Sean Tarima.\n\nThe 20-year-old defender has parted ways with the club by mutual consent.\n\nA statement from the Premier League club read: West Ham United can confirm that Favour Fawunmi and Sean Tarima have left the Club\n\nDefender Tarima leaves West Ham following a mutual agreement. The 20-year-old was part of the 2022/23 double-winning squad, making 22 appearances for the U18s that season. Tarima, who joined the club at the U9 level, also featured in 18 matches for Mark Robsons development squad this season.\n\nEveryone at West Ham United extends their gratitude to Favour and Sean for their commitment and dedication during their time with the club and wishes them all the best for their future endeavors.\n\nBorn in the UK to Zimbabwean parents, Tarima is eligible to represent Zimbabwe at the international level.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent West Ham United has confirmed the departure of Zimbabwean talent Sean Tarima. The 20-year-old defender has parted ways … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/zimbabwean-defender-leaves-west-ham-by-mutual-consent/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Defender Leaves West Ham By Mutual Consent\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "Notorious Robbers Nabbed",
            "url": "https://www.zimeye.net/2025/02/09/notorious-robbers-nabbed-4/",
            "content": "By A Correspondent\n\nTwo armed robbers, Munyaradzi Sigareta Zakaria (38) and Zvikomborero Rukoni Zvikoni (29), have been sentenced to 10 years in prison after being convicted of robbery by the Harare Magistrates Court.\n\nAccording to the National Prosecuting Authority (NPA), the pair enticed their victims by offering them a ride in a white Toyota Probox (registration AGC 3919). Once the victims were inside, they brandished knives, threatened them, and forcefully took their possessions.\n\nOn 20 October 2023, Zakaria and Zvikoni, together with two accomplices who remain at large, carried out two separate robberies in Harare:\n\nIn the first incident, which occurred in Marlborough along Harare Drive, the robbers threatened Bernadette Yvete Chafachinoyaura with knives and stole her Samsung Galaxy M02 phone, US$13, a silver engagement ring, and other items.\n\nIn the second incident, on Lomagundi Road, the robbers blindfolded Patience Dadirai Choto, threatened her with a knife, and stole her belongings.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two armed robbers, Munyaradzi Sigareta Zakaria (38) and Zvikomborero Rukoni Zvikoni (29), have been sentenced to 10 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/notorious-robbers-nabbed-4/\">Continue reading<span class=\"screen-reader-text\"> \"Notorious Robbers Nabbed\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        },
        {
            "title": "Trump Attacks SA Over “Abuse of Citizens’ Rights”",
            "url": "https://www.zimeye.net/2025/02/09/trump-attacks-sa-over-abuse-of-citizens-rights/",
            "content": "By A Correspondent\n\nPresident Donald Trump has announced a suspension of foreign aid to South Africa, accusing the government of mistreating white landowners. The decision emphasizes the resettlement of white Afrikaner refugees to the United States.\n\nTrumps move follows a series of social media posts in which he claimed that South Africa is engaged in a massive Human Rights VIOLATION. This declaration has sparked significant controversy, with critics arguing that it promotes conspiracy theories regarding the treatment of white South Africans.\n\nThe South African government is currently working on land reform policies designed to address historical injustices. These efforts involve redistributing land from white farmers to Black South Africans, in an attempt to rectify the legacy of apartheid-era land ownership disparities.\n\nThe suspension of aid has raised concerns about the future of US-South Africa relations and the potential impact on crucial programs, particularly those addressing HIV/AIDS. In 2023, South Africa received over $400 million in aid from the US, primarily allocated for HIV/AIDS initiatives. The halt in assistance could threaten these vital programs, worsening the countrys already strained fight against the disease.\n\nCritics of Trumps decision argue that it is based on faulty assumptions and a lack of understanding about South Africas land reform policies, which are designed to address inequality rather than target specific racial groups. Many view the suspension as an attempt to placate Trumps conservative base, rather than a genuine concern for human rights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Donald Trump has announced a suspension of foreign aid to South Africa, accusing the government of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/09/trump-attacks-sa-over-abuse-of-citizens-rights/\">Continue reading<span class=\"screen-reader-text\"> \"Trump Attacks SA Over “Abuse of Citizens’ Rights”\"</span></a></p>",
            "time": "18:30",
            "date": "09 Feb 2025"
        }
    ]
}