{
    "news": [
        {
            "title": "RBZ Introduces New ZiG Notes",
            "url": "https://www.zimeye.net/2025/06/02/rbz-introduces-new-zig-notes/",
            "content": "By Business Reporter-In a move that reflects both desperation and determination, the Reserve Bank of Zimbabwe (RBZ) has announced plans to introduce a new series of higher-quality ZiG (Zimbabwe Gold) banknotes in denominations of ZiG10, ZiG20, ZiG50, ZiG100, and ZiG200.\n\nRBZ Governor Dr. John Mushayavanhu said the rollout will be gradual and based on market demand.\n\nThe process of procuring and producing banknotes, however, can be lengthy, and the Reserve Bank will keep the public updated on the progress, Mushayavanhu said during a press briefing.\n\nThis latest development comes just months after the RBZ introduced the ZiG in April 2024, a gold-backed currency meant to replace the much-maligned Zimbabwean dollar (ZWL) and restore stability in a country plagued by over two decades of currency and economic turmoil.\n\nZimbabwes currency instability is deeply rooted in a history of poor economic management, political interference in monetary policy, and a chronic lack of confidence in the financial system.\n\nThe first major crack appeared in the early 2000s following the controversial fast-track land reform programme, which triggered capital flight, agricultural collapse, and a sharp decline in foreign currency inflows.\n\nHyperinflation spiraled out of control in the years that followed, culminating in the 2008 economic meltdown, where inflation reached an astronomical 89.7 sextillion percent.\n\nThe Zimbabwean dollar became worthless, forcing the government to abandon it in 2009 and adopt a multi-currency system dominated by the US dollar.\n\nDespite the relative stability the multi-currency regime brought, government insistence on reviving a local currency saw the reintroduction of the Zimbabwean dollar in 2019  a move that was met with deep skepticism.\n\nSince then, the country has experienced multiple currency iterations: bond notes, RTGS dollars, and now the ZiG  all of which have struggled to gain public trust.\n\nCurrently, only ZiG10 and ZiG20 notes are in circulation, but they are in short supply and rapidly deteriorating due to poor quality.\n\nThe RBZs decision to issue more durable notes in higher denominations is a recognition of the shortcomings of the initial rollout.\n\nIt also reveals a tacit acknowledgment that deeper systemic issues remain unresolved.\n\nIn addition to printing new notes, the government is pursuing measures to boost ZiG usage, particularly in the informal sector.\n\nThese include mandating point-of-sale (POS) machines for all businesses and requiring a portion of tax payments to be made in local currency.\n\nWhile such measures may increase transactional demand for ZiG, economists argue that they amount to coercion rather than confidence-building. Without addressing underlying issues  such as fiscal indiscipline, corruption, and lack of production  these interventions are unlikely to yield sustainable results.\n\nHistory has shown that no currency  regardless of how it is backed or branded  can succeed in the absence of robust economic fundamentals. What Zimbabwe needs is not just new notes, but a comprehensive policy framework that fosters investor confidence, ensures monetary independence, promotes industrial productivity, and respects property rights.\n\nEconomic stability is not achieved through currency rebranding but through credible leadership, policy consistency, and institutional reform. Until these fundamentals are addressed, the new ZiG notes may simply follow the fate of their predecessors: born with fanfare, and buried by inflation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-In a move that reflects both desperation and determination, the Reserve Bank of Zimbabwe (RBZ) has announced plans … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/rbz-introduces-new-zig-notes/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Introduces New ZiG Notes\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Mnangagwa Ally Butchers White Farmer",
            "url": "https://www.zimeye.net/2025/06/02/mnangagwa-ally-butchers-white-farmer/",
            "content": "By A Correspondent-A close ally of President Emmerson Mnangagwa and losing Zanu PF parliamentary candidate, Thomas Chidzomba, has allegedly assaulted a white farmer in Lions Den.\n\nChidzomba faces possible arrest and could be charged with assault after a police report was filed by farmer Brinsk Bosman, who claims he and his farm guard were attacked.\n\nYes, I filed a report of illegal occupation and assault on me, RRB No. 6398554, Bosman toldNewsDayyesterday.\n\nMashonaland West police spokesperson Inspector Ian Kohwera confirmed the incident.\n\nYes, I can confirm that Bosman made a report of assault at Murereka Police Station, and Chidzomba also filed a counter-report of malicious damage to property against Bosman at the same station, Kohwera said.\n\nBosmans troubles began on April 5 this year when Chidzomba, along with Elington Chanetsa, Bruno Elias, and Norbert Mawere, allegedly occupied his 578.54-hectare Subdivision 1 of Manenga Dundrennan Farm without legal authority from either him or the State.\n\nThe case was brought before Chinhoyi magistrate Kudzai Kapurura, but the State withdrew the charges after plea on May 16, 2025.\n\nDuring the trial, Chidzombas lawyer, Tungamirai Chamutsa, told the court that his client acted based on a power of attorney that has since been withdrawn.\n\nProsecutor Grace Zhou consented to the withdrawal of the charges, and the State did not explain the circumstances under which the power of attorney was initially granted and later revoked during the course of the investigation.\n\nBosman was issued an offer letter for Dundrennan Farm on September 30, 2004.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-A close ally of President Emmerson Mnangagwa and losing Zanu PF parliamentary candidate, Thomas Chidzomba, has allegedly assaulted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/mnangagwa-ally-butchers-white-farmer/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ally Butchers White Farmer\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Doctor Khumalo Speaks On Mamelodi Sundowns Defeat",
            "url": "https://www.zimeye.net/2025/06/02/doctor-khumalo-speaks-on-mamelodi-sundowns-defeat/",
            "content": "Sports Correspondent\n\nKaizer Chiefs and Bafana Bafana legend Doctor Khumalo has praised Mamelodi Sundowns for their performance in the CAF Champions League, despite their narrow defeat in the final.\n\nSundowns suffered a 2-1 loss to Pyramids in Cairo on Sunday, resulting in a 3-2 aggregate defeat and ending their hopes of a second continental title. It was their second appearance in the final since 2001, while Pyramids celebrated their first-ever CAF Champions League triumph.\n\nSpeaking on SABC3, Khumalo stressed the importance of unity and discouraged the blame game, choosing instead to commend Sundowns for their effort and fighting spirit.\n\nI dont think its right to point fingers, Khumalo said. We win together, we lose together. Credit must go to Sundownsthey showed great character in the final 30 minutes. Had they started the game that way, it might have been a different story.\n\nHe also highlighted the impact of the substitutes, noting how they injected energy and shifted the momentum, even as questions lingered about key players like Themba Zwane.\n\nYes, I understand people were hoping for Mshishi [Zwane], but he hasnt played in a while. Still, Sundowns stuck to their identitycombinational play, possession-based football. They created several chances and gave it everything.\n\nKhumalo concluded by expressing pride in the entire Sundowns team, saying they carried the South African flag with honor.\n\nThey gave their all, from the players on the pitch to those on the bench and in the traveling squad. Sundowns represented South African football with pride.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kaizer Chiefs and Bafana Bafana legend Doctor Khumalo has praised Mamelodi Sundowns for their performance in the CAF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/doctor-khumalo-speaks-on-mamelodi-sundowns-defeat/\">Continue reading<span class=\"screen-reader-text\"> \"Doctor Khumalo Speaks On Mamelodi Sundowns Defeat\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "DeMbare, Bosso In Dull Draw",
            "url": "https://www.zimeye.net/2025/06/02/dembare-bosso-in-dull-draw-2/",
            "content": "Sports Correspondent\n\nDynamos and Highlanders played out a goalless stalemate in their first clash of the 2025 Castle Lager Premier Soccer League season.\n\nThe much-anticipated Matchday 14 fixture was held at Rufaro Stadium in Harare on Sunday, but it failed to live up to expectations.\n\nHighlanders started on the front foot, launching a series of early attacks and earning two corners, yet they couldnt make them count. Dynamos responded with a sixth-minute header from Frank Agyemang, but the effort lacked power and was comfortably dealt with by Highlanders goalkeeper Raphael Pitisi.\n\nDespite their early dominance, Highlanders couldnt break through Dynamos defense, with goalkeeper Prince Tafiremutsa making a string of crucial saves to keep the hosts in the game. Dynamos looked dangerous on the counter but lacked composure in the final third.\n\nThe second half followed a similar pattern, with Highlanders applying consistent pressure but failing to convert chances.\n\nThe match ended 0-0, leaving Dynamos stuck in 16th place in the relegation zone, while Highlanders edged up to ninth on the table.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos and Highlanders played out a goalless stalemate in their first clash of the 2025 Castle Lager Premier … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/dembare-bosso-in-dull-draw-2/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare, Bosso In Dull Draw\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Tshabangu Celebrates Trabablas Interchange Mediocrity",
            "url": "https://www.zimeye.net/2025/06/02/tshabangu-celebrates-trabablas-interchange-mediocrity/",
            "content": "By A Correspondent\n\nHARARE  Controversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has stirred debate after publicly celebrating the commissioning of the Mbudzi Interchangedubbed the Trabablas Interchangeby President Emmerson Mnangagwa, despite widespread concerns over corruption and inflated costs linked to the project.\n\nIn a statement released last week, Tshabangu not only endorsed the project but also pledged full participation from opposition lawmakers at its official opening.\n\nAs a matter of fact, Ill be leading my team of opposition Senators and MPs for the official opening to traffic of the TRABABLAS INTERCHANGE, Tshabangu declared. We celebrate every inch towards the development of Zimbabwe. This will go a long way in reducing traffic congestion to road users.\n\nHis remarks have drawn criticism from both opposition supporters and civil society groups, who argue that the celebration of such a project glosses over serious allegations of mismanagement and financial abuse. Investigations and media reports have pointed to the looting of millions of dollars during the construction process, with procurement irregularities and questionable contracts at the center of the controversy.\n\nTshabangu, however, appeared unfazed by the corruption claims. The politics of bitterness does not build roads, he reportedly said in a follow-up conversation with local journalists. Lets be constructive in our criticism. If something is working, we must acknowledge it.\n\nThis stance has added to Tshabangus reputation as a divisive figure within the CCC, with some accusing him of aligning too closely with the ruling ZANU-PF agenda. Critics say his praise for the interchange, in light of its tainted financial record, undermines the role of the opposition in holding the government accountable.\n\nThe Mbudzi Interchangerenamed the Trabablas Interchange was touted as a flagship infrastructure project aimed at easing chronic congestion in southern Harare.\n\nHowever, its development has been overshadowed by allegations of inflated pricing, lack of transparency, and elite enrichment.\n\nDespite these concerns, Tshabangu insists the end result merits recognition. This is not about politics. Its about progress. Lets appreciate development when we see it, he said.\n\nWhether his message resonates with the wider publicor further isolates him within his partyremains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Controversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has stirred debate after publicly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/tshabangu-celebrates-trabablas-interchange-mediocrity/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Celebrates Trabablas Interchange Mediocrity\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Zimbabweans To Pay Oxygen Tax Soon: Zivhu",
            "url": "https://www.zimeye.net/2025/06/02/zimbabweans-to-pay-oxygen-tax-soon-zivhu/",
            "content": "By A Correspondent\n\nHARARE  Controversial Zanu PF official Killer Zivhu has questioned the governments aggressive taxation policies, sarcastically suggesting that Zimbabweans may soon be taxed for simply breathing.\n\nIn a sharp social media post last week, Zivhu expressed concern over what he sees as a never-ending list of new taxes, highlighting growing frustration among citizens already burdened by the high cost of living.\n\nPredicting the future: oxygen tax, toilet tax, sex tax, roora tax Whats next? Zivhu wrote, capturing the mood of many Zimbabweans who feel the state is exploiting every possible avenue to raise revenue.\n\nHis remarks follow President Emmerson Mnangagwas recent approval of amendments to the Broadcasting Services Act, which now requires all motorists to pay a radio licence feeregardless of whether they use the radio or not. The policy change has been widely criticised as unjust and opportunistic.\n\nThough Zivhu didnt name Mnangagwa directly, his sarcasm pointed clearly toward the administrations taxation approach. Theres a tax for everything nowadays. I wouldnt be surprised if people are charged for simply existing, one user commented in response to his post.\n\nZivhu, known for his bold and often unfiltered commentary, has frequently used satire to spotlight unpopular policieseven as a member of the ruling party. His comments, while sometimes dismissed by party loyalists, often reflect public sentiment.\n\nAs the government seeks to plug fiscal deficits, citizens have been hit with an increasing number of levies, many of which have not translated into meaningful public service improvements. Zivhus oxygen tax warning, though tongue-in-cheek, underscores growing anxiety over the governments direction.\n\nOfficials have not yet responded to Zivhus comments, but his remarks have reignited a national debate about fairness, accountability, and the limits of taxation in a struggling economy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Controversial Zanu PF official Killer Zivhu has questioned the government’s aggressive taxation policies, sarcastically suggesting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/zimbabweans-to-pay-oxygen-tax-soon-zivhu/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabweans To Pay Oxygen Tax Soon: Zivhu\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Kapfupi Too Drunk to Collect Car Gift from Wicknell Chivayo ?",
            "url": "https://www.zimeye.net/2025/06/02/kapfupi-too-drunk-to-collect-car-gift-from-wicknell-chivayo/",
            "content": "By A Correspondent\n\nPopular Zimbabwean comedian Freddy Kapfupi Manjalima has found himself at the centre of controversy after arriving too intoxicated to collect a vehicle and cash gift from businessman and philanthropist Wicknell Chivayo.\n\nThe comic was reportedly due to receive a brand new Toyota Aqua and a cash sum of US$3,000 from Chivayo, who has been gifting cars to entertainers and influencers in recent months. However, the handover was abruptly cancelled after Kapfupi showed up in a drunken state, sparking concern among observers.\n\nOne individual, identified as Mr. Chipanga, voiced his concern over the comedians well-being, suggesting that Kapfupi may be battling alcohol dependency. Chipanga noted that this is not the first time Kapfupi has had issues linked to alcohol. He revealed that a previous car gifted to the comedian by Chivayo was involved in an accident, allegedly while Kapfupi was driving under the influence.\n\nIts painful to see someone with such talent falling into this trap. Alcohol seems to be derailing him, and its starting to affect how others see him, said Chipanga.\n\nThe incident has sparked a broader conversation on social media about the challenges faced by Zimbabwean entertainers, especially regarding substance abuse and the pressures that come with fame and financial instability. While many fans have expressed disappointment, others have called for compassion and support for the comedian, who has long been a household name for his slapstick humor and skits portraying life in the high-density suburbs.\n\nWicknell Chivayo has not yet made a public statement on whether the gift will be reissued at a later date or withdrawn entirely.\n\nAs the situation unfolds, the public waits to see whether this incident will serve as a wake-up call for Kapfupior a turning point in his public image.\n\nComedian Kapfupi failed to collect the Toyota Aqua vehicle and the $3,000 cash gift from Wicknell Chivayo after showing up in a drunken state.A person identified as Mr Chipanga expressed concern, suggesting that Kapfupi may be struggling with alcohol addiction. According topic.twitter.com/Q666SXj8Sq\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Popular Zimbabwean comedian Freddy “Kapfupi” Manjalima has found himself at the centre of controversy after arriving too … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/kapfupi-too-drunk-to-collect-car-gift-from-wicknell-chivayo/\">Continue reading<span class=\"screen-reader-text\"> \"Kapfupi Too Drunk to Collect Car Gift from Wicknell Chivayo ?\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Ban Pitbulls, MP Joanah Mamombe Fumes After Bluffhill Horror",
            "url": "https://www.zimeye.net/2025/06/02/ban-pitbulls-mp-joanah-mamombe-fumes-after-bluffhill-horror/",
            "content": "By A Correspondent\n\nHARARE  Harare West legislator Joanah Mamombe has led a renewed push for the banning of dangerous dog breeds following a gruesome pitbull attack that left a man dead in the New Bluffhill suburb on Sunday.\n\nThe horrifying incident, which saw a man in his 30s mauled to death by a roaming pitbull, has reignited public concern and put Mamombe at the forefront of demands for urgent legal reforms to protect communities.\n\nWe have learnt, with sadness, of the death of a #HarareWest constituency resident after he was attacked by a pitbull dog that was roaming freely in the street, Mamombe said in a strongly worded statement.\n\n#MHSRIP. Its time, as the legislature, that we pass breed-specific legislation which restricts and bans certain dog breeds.\n\nMamombe described the fatal attack as both tragic and avoidable, calling it a wake-up call for lawmakers and enforcement agencies alike. She said she would push for the introduction of breed-specific laws to outlaw pitbull ownership, citing public safety as a priority.\n\nThe victim, whose identity was still being withheld pending notification of family, was killed near a home where the same pitbull had reportedly jumped over a partially built wall on previous occasions. Despite repeated complaints from residents, no preventive action was taken.\n\nLocal watchdog Crime Watch Zimbabwe confirmed the mans body remained near the scene of the attack for several hours, highlighting the severity and suddenness of the incident.\n\nThe dog was seen roaming the street without any restraint, the watchdog said.\n\nResidents in Bluffhill say their warnings were ignored. Weve been raising the alarm about this dog for months, said one neighbour. It was a tragedy waiting to happen.\n\nAs grief and anger ripple through the community, Mamombe has vowed to ensure that Parliament addresses the legislative gap. We cannot wait for another life to be lost before we act, she said.\n\nAuthorities are yet to comment on any pending charges against the dogs owner, but pressure is mounting for accountabilityand for real change in how potentially dangerous animals are regulated.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Harare West legislator Joanah Mamombe has led a renewed push for the banning of dangerous … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/ban-pitbulls-mp-joanah-mamombe-fumes-after-bluffhill-horror/\">Continue reading<span class=\"screen-reader-text\"> \"Ban Pitbulls, MP Joanah Mamombe Fumes After Bluffhill Horror\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Tell Us What You Think About The Church Built By Mnangagwa’s Ally Winston Chitando In Gutu…",
            "url": "https://www.zimeye.net/2025/06/02/tell-us-what-you-think-about-the-church-built-by-mnangagwas-ally-winston-chitando-in-gutu/",
            "content": "By A Correspondent\n\nGUTU, Sunday 01 June 2025  The Chitando family, led by Mines and Mining Development Minister Winston Chitando, who also serves as the Member of Parliament for Gutu Central, has officially handed over a newly built church complex to the Gonye Reformed Church in Zimbabwe congregation.\n\nThe modern facility, unveiled yesterday, includes a 200-seater church building, a pastoral house, and a solar power system, among other features.\n\nIt was constructed in memory of the Chitando familys late parents, as part of what they described as a legacy project rooted in faith and community service.\n\nThis church was built not only to honor our parents but to serve God and uplift the community, said Chitando during the handover ceremony.\n\nWe believe that the church is a cornerstone of moral guidance, and we hope this facility will support the spiritual growth of generations to come.\n\nThe handover event was attended by senior government officials, church leaders, and community members.\n\nState Security Minister , Lovemore Matuke, who was the guest of honor, praised the Chitando familys efforts and called on others to follow their example.\n\nThis is the kind of leadership we want to seeservant leadership that leaves a lasting impact, said Matuke. The Chitando family has shown what it means to give back meaningfully. I encourage more families and individuals to invest in their communities this way.\n\nThe church complex has already sparked conversation locally, with many praising the initiative as a positive contribution to the communitys spiritual and social development. However, some have raised questions about whether such projects, especially by political figures, are purely philanthropic or strategically aimed at solidifying political influence ahead of future elections.\n\nStill, for the Gonye congregation, the church is a welcome gift. This is a blessing for us, said one elder from the church. Weve prayed for this kind of infrastructure for years, and now its here. We are grateful.\n\nWhat do you think about the project? Is this a genuine act of service, or does it reflect the growing intersection of politics and religion in Zimbabwean communities?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent GUTU, Sunday 01 June 2025 – The Chitando family, led by Mines and Mining Development Minister Winston … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/tell-us-what-you-think-about-the-church-built-by-mnangagwas-ally-winston-chitando-in-gutu/\">Continue reading<span class=\"screen-reader-text\"> \"Tell Us What You Think About The Church Built By Mnangagwa’s Ally Winston Chitando In Gutu…\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        },
        {
            "title": "Nelson Chamisa Bemoans Deteriorating Learning Standards In Zim As 50 000 Drop Out Of School",
            "url": "https://www.zimeye.net/2025/06/02/nelson-chamisa-bemoans-deteriorating-learning-standards-in-zim-as-50-000-drop-out-of-school/",
            "content": "By Tinashe Sambiri\n\nHARARE  Opposition leader Advocate Nelson Chamisa has raised alarm over Zimbabwes worsening education crisis, expressing deep concern over the sharp rise in school dropouts and declining learning standards across the country.\n\nIn a passionate statement released Monday, Chamisa said he was heartbroken by the number of Zimbabwean families struggling to keep their children in school. According to official statistics, nearly 50,000 students dropped out of school in 2024 alone.\n\nPeople of Zimbabwe, my heart is burdened when I hear many of you tell me that you can no longer afford to send your children to school, Chamisa said. The latest statistics show a shockingly high number of 49,555 school dropouts in 2024.\n\nDespite the government allocating 17.7% of the national budget to education for the 202425 fiscal year, Chamisa argued that it still falls short of international benchmarks and fails to address the urgent needs of the sector.\n\nOur education needs urgent attention. Its such a pain point, he stated. Despite allocating 17.7% of the national budget to education in the 202425 budget, funding remains below the 20% benchmark agreed upon under the Dakar Framework for Action.\n\nChamisa, who has consistently positioned education as a central pillar of his political vision, promised sweeping reforms under what he termed The New Plan, aimed at transforming Zimbabwe into a global leader in education.\n\nWe will build a great education nation, he said. A time is coming when education will no longer be only for those who can pay for it. A time is coming when Zimbabwe will be renowned as an education nationwe will educate the world.\n\nHe also painted a hopeful picture for Zimbabwes future, emphasizing that young people from all walks of life must be empowered to dream and achieve.\n\nA time is coming when our children from all backgrounds, and every corner of Zimbabwe, will be filled with hope again. A time is coming when our young people will dream dreams and be empowered to live out those dreams in their lifetimes, Chamisa said. Education, and not corruption, will produce admirable and honourable role models worth emulating.\n\nUsing the hashtags #TimeIsComing, #TheNewPlan, and #ImaginationMonday, Chamisas message struck a chord online, reigniting debate about government priorities and the long-term future of Zimbabwes education system.\n\nThe Ministry of Primary and Secondary Education has yet to respond to the opposition leaders remarks. However, education advocates and parents across the country have echoed similar concerns, pointing to rising school fees, lack of teaching materials, and underpaid educators as key factors behind the crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri HARARE – Opposition leader Advocate Nelson Chamisa has raised alarm over Zimbabwe’s worsening education crisis, expressing deep … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/02/nelson-chamisa-bemoans-deteriorating-learning-standards-in-zim-as-50-000-drop-out-of-school/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Bemoans Deteriorating Learning Standards In Zim As 50 000 Drop Out Of School\"</span></a></p>",
            "time": "06:15",
            "date": "03 Jun 2025"
        }
    ]
}