{
    "news": [
        {
            "title": "AFM Pastor’s Son Controversially Released After Vicious Assault",
            "url": "https://www.zimeye.net/2025/07/04/afm-pastors-son-controversially-released-after-vicious-assault/",
            "content": "By A Correspondent| The son of a senior AFM pastor, Titus Murefu, who was sentenced to an effective nine months in jail after being convicted of viciously assaulting a security guard at a Harare private school, was released from prison just a month into his sentence.\n\nPhidelis Murefu was convicted by Harare magistrate Rufaro Panavanhu for indiscriminately assaulting Leon Musonza, who works at Destiny Achievers Group of Schools, which is located on the same plot as Murefus residence in Glenforest.\n\nPhidelis is believed to have filed for bail pending his appeal against conviction and sentence at the High Court.\n\nThe court heard that the land in question is owned by a United Kingdom-based family, with part of it leased to the Murefu family.\n\nOn September 16, 2024, at around 11 AM, two real estate agents, hired by the owners who intend to sell the property, arrived to carry out some valuations. The property was wrestled from the Murefus.\n\nThe estate agents viewed the plot on the side occupied by the complainants employers before Musonza took them to the other side where they were refused permission by the Murefu familys foreman.\n\nThe court heard that later during the same day, the complainant was in a guardroom at work when Phidelis arrived, banged on the door, and got inside.\n\nPhidelis claimed the complainant had brought thieves to their side of the plot before indiscriminately assaulting him with kicks and fists all over his body.\n\nThe matter was reported to the police and the complainant was referred to the hospital for a medical examination.\n\nMagistrate Panavanhu ruled that the State had proved a prima facie case against Phidelis, hence the conviction and sentence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The son of a senior AFM pastor, Titus Murefu, who was sentenced to an effective nine months … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/afm-pastors-son-controversially-released-after-vicious-assault/\">Continue reading<span class=\"screen-reader-text\"> \"AFM Pastor’s Son Controversially Released After Vicious Assault\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "The Other Side of Sydney Gata",
            "url": "https://www.zimeye.net/2025/07/04/the-other-side-of-sydney-gata/",
            "content": "By Own Correspondent-The Chipinge community is mourning the death of Sydney Zukuzo Gata, the Executive Chairman of the Zimbabwe Electricity Supply Authority (ZESA), who passed away on Thursday evening at a private hospital in Harare after being admitted earlier in the week with chest pains.\n\nHe was originally from the Mutema communal area under Chief Mutema.\n\nNationally, Gata was a powerful and often controversial figurewidely seen as a staunch ally of President Emmerson Mnangagwa and a beneficiary of Zimbabwes patronage system.\n\nHis career was marked by allegations of state-sanctioned corruption, nepotism, and misuse of public resources.\n\nYet, in his home district of Chipinge, many remember a different man: a loyal son, a generous benefactor, and a warm, accessible figure who remained closely connected to his rural roots.\n\nWard 23 Councillor Mr. Shingai Gapara confirmed that all political and community activities in Chipinge have been suspended in honor of Gatas passing.\n\nIn honoring his legacy and respecting the Gata family, we have suspended all gatherings and programs in Ward 23 of Chipinge Rural. May we find strength in our collective grief and support one another during this difficult period,he said.\n\nCommunity activist Oliver Chikumba, one of the first to break the news of Gatas death, offered a deeply personal tribute:\n\nThe giant has fallen. Aman of few words and more action. The nation has been robbed. Dr. Engineer Sydney Zukuzo Gatayour legacy will forever be cherished. Rest in power, Mutape.\n\nDr. Robbert Matikiti, an academic and consultant, described him as a hero who has left behind a good legacy, adding:\n\nWe will always remember his immense contributions. Hamba kahle, true Gazaland son of the soil.\n\nDespite his image as a political insider and controversial power broker, Gata remained actively engaged with Chipinge, particularly through the United Church of Christ in Zimbabwe (UCCZ) and local development initiatives. He was a key advocate of Gazaland University (GU), a proposed institution in Chipinge, and played a leading role in conceptualizing an Agriculture Centre of Excellenceunderthe project.\n\nMr. Phillimon Mlambo, Chairperson of the GU Taskforce, said:\n\nDr. Gata was one of our greatest advocates and cheerleaders for Gazaland University. In his honor, we are even more determined to make GU a reality.\n\nHowever, not all in Chipinge remember Gata fondly.\n\nHis close relationship with President Mnangagwaearning him the monikerChiganandaafforded him immense political and economic leverage, which critics say he used to entrench his familys power.In MutemaMusikavanhu constituency, where his wifeAngelineservesasMemberof Parliament and Deputy Minister of Primary and Secondary Education, his influence was both feared and resented.\n\nIn Ward 5 of the constituency, Gata is accused of displacing communities through land seizures. In the June 14 by-election for the same ward, a team of activists reportedly loyal to Gata and his wife allegedly intimidated voters before and after the polls. Over 1,200 people were assisted to vote under the claim they were illiteratea group that bizarrely included schoolteachers.\n\nHis wifes nomination as MP was also widely criticized as the product of political imposition, which many say deepened internal divisions within the ruling ZANU-PF party. Locals argue that few dared to challenge Gatas power due to his tribal affiliation, political connections, and proximity to Mnangagwa.\n\nProfessionally, Gatas resume was formidable. He became the first Black General Manager of the Electricity Supply Commission (ESC) from 1981 to 1985, later serving as Chief Executive Officer and board member of ZESA through the 1990s. His controversial reappointment as Executive Chairman in 2019 came amid a deepening power crisis and mounting allegations of mismanagement and corruption within the parastatal.\n\nInternationally, he held senior positions including as a board member and deputy chair of the Studies Committee of the World Energy Council (19921994). He also advised organizations such as the African Development Bank and Integrated Energy Systems Limited (UK).\n\nGata is survived by his wife, Hon. Angeline Gata, their children, and grandchildren.\n\nAs Zimbabwe reflects onhiscomplex legacyone defined by both immense privilege and lasting local impactChipinge grieves not the powerful insider, but the village son whose memory endures in the hearts of many.\n\nFuneral and burial arrangements will be announced in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Own Correspondent-The Chipinge community is mourning the death of Sydney Zukuzo Gata, the Executive Chairman of the Zimbabwe Electricity … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/the-other-side-of-sydney-gata/\">Continue reading<span class=\"screen-reader-text\"> \"The Other Side of Sydney Gata\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "I am old to remember things- Gono tells court as he comes under scrutiny in fraud case",
            "url": "https://www.zimeye.net/2025/07/04/i-am-old-to-remember-things-gono-tells-court-as-he-comes-under-scrutiny-in-fraud-case/",
            "content": "By A Correspondent| Reserve Bank of Zimbabwe Governor Gideon Gono in the late Robert Mugabe era has been accused of usurping his relations in political circles and within the law enforcement agencies in causing the arrest of a Harare couple which he handpicked to manage his businesses.\n\nThe ex-banker was testifying against Clark Makoni and his wife Beverly whom he accused of fraudulently altering his company documents to take it over.\n\nAppearing in court on Friday as witness and upon being pressed to justify the allegations, he made a revelation that he was now forgetting things because of age.\n\nThe State alleges that in July 2017, Gono engaged the services of the accused persons to manage Valley Lodge, among other properties.\n\nThe State also alleges that the couple forged a CR14 form in which Clark appointed himself director and company secretary and Beverly as his deputy in Valley Lodge.\n\nThe couple describe the allegations as malicious and frivolous being driven by Gono using his connections in the law enforcement agencies.\n\nThis comes after it emerged that Clark Makoni was arrested twice over the same allegations after reports were made to the ZRP and ZACC.\n\nThe former banker made a fatal concession that he was now forgetting other details because of his advanced age.\n\nThis resulted in the defence led by Admire Rubaya questioning the credibility of his evidence as he had no knowledge of other details such as dates.\n\nThis came after the defence asked him the date he got into an agreement with the couple and only resorted to August 2017.\n\nHe was also taken to task to explain the terms of the agreement he went into with couple when he gave them the mandate to manage his properties.\n\nGono went on to tell the court that he was withdrawing the age statement as the defence was now exploiting it.\n\nHe was taken to task to prove the terms of the agreement after emerged that it was a verbal agreement with no supporting documentary evidence.\n\nGono went on to play the emotional card saying the case had caused him distress as a pensioner.\n\nIn his emotional card, Gono said he is retired adding that it is sad the two had defrauded a pensioner saying he was only surviving on NSSA payouts.\n\nHe said it is painful and putting pressure on him to be in court over the allegations.\n\nIt however emerged that the company does not belong to him and he is not a shareholder after the company documents presented in court showed that the Omar family are the owners.\n\nHe conceded that he is yet to be the legal owner of the company describing himself as the lawful occupier.\n\nHe said the agreement he entered with the Omar brothers said transfer will only be done if full payment is made.\n\nWhile he tried to downplay his wealth in court presenting himself as a pensioner serving on NSSA payouts, it emerged that Gono owns 15 properties in Chivhu which were also being managed by the couple.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Reserve Bank of Zimbabwe Governor Gideon Gono in the late Robert Mugabe era has been accused of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/i-am-old-to-remember-things-gono-tells-court-as-he-comes-under-scrutiny-in-fraud-case/\">Continue reading<span class=\"screen-reader-text\"> \"I am old to remember things- Gono tells court as he comes under scrutiny in fraud case\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "Government of Zambia Moves to Repatriate Lungu’s Body, Cites no Burial Wish in Will",
            "url": "https://www.zimeye.net/2025/07/04/government-of-zambia-moves-to-repatriate-lungus-body-cites-no-burial-wish-in-will/",
            "content": "Attorney General Mulilo Kabesha has filed submission in South Africas High Court , Guateng Division, Pretoria that Zambias government has a clear right to determine the type of funeral and burial place of the late former President Edgar Chagwa Lungu.\n\nThe Zambian Government has filed an amended notice of motion in the Pretoria High Court, South Africa, seeking the repatriation and burial of former President Edgar Lungu in Zambia.\n\nIn its submission, the government argues that the late President Lungu did not specify in his will how or where he wished to be buried.\n\nIt further contends that, as a beneficiary under the Former Presidents Benefits Act, it should be presumed that he intended to be given a state funeral in accordance with Zambian customs and traditions.\n\nThe state maintains that Mr. Lungus acceptance of benefits under the Act should be interpreted as an expression of his burial wishes.\n\nAdditionally, the government argues that Mr. Lungu was never disqualified from receiving those benefits, as outlined in Section 5(2) of the Act. Instead, it explains that his entitlement was merely suspended when he re-entered active politics, and that suspension ceased upon his death.\n\nAs a result, the state asserts that it regained the right to provide a state funeral, fully funded and conducted in line with national customs and traditions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Attorney General Mulilo Kabesha has filed submission in South Africa’s High Court , Guateng Division, Pretoria that Zambia’s government has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/government-of-zambia-moves-to-repatriate-lungus-body-cites-no-burial-wish-in-will/\">Continue reading<span class=\"screen-reader-text\"> \"Government of Zambia Moves to Repatriate Lungu’s Body, Cites no Burial Wish in Will\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "Details in Gata’s Death Emerge",
            "url": "https://www.zimeye.net/2025/07/04/details-in-gatas-death-emerge/",
            "content": "By A Correspondent-Details have emerged following the death of Dr. Sydney Zukuzo Gata, the Executive Chairman of the Zimbabwe Electricity Supply Authority (ZESA), who passed away on Thursday evening at a private hospital in Harare after being admitted with chest pains earlier in the week.\n\nBorn in Mutema communal lands under Chief Mutema in Chipinge, Dr. Gata was a towering figure in Zimbabwes energy sector and a long-time ally of President Emmerson Mnangagwa. He was also married to Hon. Angeline Gata, the Deputy Minister of Primary and Secondary Education and MP for MutemaMusikavanhu.\n\nDr. Gata made history in 1981 when he became the first Black General Manager of the Electricity Supply Commission (ESC). He later led ZESA as CEO and board member during the 1980s and 1990s. He was reappointed as Executive Chairman in 2019a period marked by deepening load-shedding, widespread power cuts, and continued decline in energy infrastructure despite significant investment pledges.\n\nThough he held prestigious international rolesincluding Deputy Chair of the World Energy Councils Studies Committee and advisory positions with the African Development Bankcritics argue his domestic legacy is overshadowed by his failure to stabilize Zimbabwes electricity supply.\n\nDr. Gata remained politically influential to the end, serving within a network of elites aligned with Mnangagwas administration, often accused of looting state resources under the guise of development\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Details have emerged following the death of Dr. Sydney Zukuzo Gata, the Executive Chairman of the Zimbabwe Electricity … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/details-in-gatas-death-emerge/\">Continue reading<span class=\"screen-reader-text\"> \"Details in Gata’s Death Emerge\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "Tagwirei Learns Chiwenga Still Rules ZANU PF Succession Politics",
            "url": "https://www.zimeye.net/2025/07/04/tagwirei-learns-chiwenga-still-rules-zanu-pf-succession-politics/",
            "content": "Analysis Opinion:By Desmond Nleya and Shelton Muchena | Here is an analysis of Tagwireis public humiliation yesterday from a school dropout and Dombodema villagers point of view.\n\nZANU PF is deeply embroiled in succession issues, and a dark horse in the form of Kuda Tagwirei, who wields immense financial power, has been unleashed with the support of the President.\n\nThere have been rumours that the President himself does not wish to anoint a successor. However, all indications are that this is merely a sideshow aimed at sidelining the General. The irony is that the President was handed his seat on a silver platter by the General, and like all ungrateful human beings, he is now choosing either to extend his termwhich he publicly deniesor to anoint Kuda Tagwirei.And so, Kuda Tagwirei was catapulted into the Central Committee, and yesterday was supposed to mark the beginning of his journey to State House.\n\nWhat happened?\n\nKuda Tagwireis unceremonious expulsion from the Central Committee meeting yesterday at ZANU PF Headquarters is perhaps the most vivid public display of the partys deep factin recent years.\n\nVice President Constantino Chiwengas move to personally order Tagwireis exitreportedly on technicalities around procedural regularitieswas not merely a bureaucratic tidying-up. It was a calculated show of force.That Chiwenga could eject Tagwirei, who is widely regarded as President Mnangagwas preferred front-runner and financial proxy, shows the Vice Presidents considerable influence within the ruling party. It also demonstrates that he is prepared to assert that power in ways that publicly humiliate rivals. The timing and manner of the expulsion sent a clear message: Chiwenga is not a ceremonial deputy. He remains the man with the meansand the willto discipline, even those closest to the President himself.\n\nCrucially, this is not Chiwengas first decisive intervention in ZANU PF succession. From the liberation struggle, he was instrumental in pushing for Robert Mugabes inclusion in the leadership ranks. Decades later, he masterminded the military operation that removed Mugabe and installed Mnangagwa. Now, with the same steely resolve, he is signaling that it is finally his turnand that he is not a push-over. This long record makes him arguably the most consequential power broker of ZANU PFs modern history.\n\nFor those in the party who quietly support the General, the incident will be interpreted as reassuring proof that aligning with him remains a safe and potentially rewarding bet. The spectacle of Tagwirei being forced to leave, with no apparent protection from Mnangagwa, will embolden those who have been sitting on the fence or doubting Chiwengas capacity to check the Presidents growing patronage networks.\n\nEqually, this was a warning to the Generals enemies: he will not be sidelined or underestimated. Observers will recall that the ZANU PF HQs inner echelonmany of whom hold lingering resentments against Mnangagwamight easily abandon the President for Chiwenga if it appears expedient. The Central Committees failure to preempt the drama by notifying Tagwirei in advance about his supposed ineligibility was telling.\n\nThe question almost writes itself: if this was truly about procedure, why was he not told before he set foot in the meeting?Even more striking was the Politburos refusal to deliberate meaningfully on his co-option, with reports suggesting only two of 49 members voted in Tagwireis favour.\n\nIf that figure is accurate, it confirms just how much resistance he faces within the highest decision-making organs of the party. Yesterday was a potent reminder that the road to State House is very longand that access to wealth and proximity to power do not automatically translate into unassailable political legitimacy.\n\nMonica Mutsvangwas recent remark that people cant buy powera thinly veiled jab at Tagwireifits neatly into this narrative. It shows that the chorus of skepticism about his ambitions is no longer whispered in the corridors. It is being voiced from the podium by senior figures who sense the shifting tides.\n\nWhile ZANU PF loyalists are attempting to downplay the incident as an unfortunate misunderstanding, the reality is more significant.\n\nThe General exercised his authority in a way that even the President could not, or would not, prevent. For Tagwirei, the lesson is sobering: yesterdays debacle was a wake-up call that the presidency remains out of reach, and any illusions to the contrary have been shatteredat least for now.Chiwengas messaging around corruption is another pressure point that will be causing Tagwirei and his handlers considerable anxiety. Branding rivals as corrupt has long been an effective weapon in ZANU PFs internal wars, and the tactic appears to be back in full force.\n\nLooking ahead, it is highly likely that Chiwenga, Chris Mutsvangwa, and other heavyweights in the top echelons of the party will begin to close ranks to frustrate Tagwireis ascent. They know that the time to neutralise him is before he consolidates more influence. Yesterday was the first salvoa deliberate demonstration that no matter how deep his pockets are, Tagwirei will not simply buy his way to the top.\n\nIf anything, this episode has revealed the true state of play in ZANU PF: a party where the real battles are not between the ruling elite and the opposition, but among the ruling elite themselves. And in this battle, the General has made it abundantly clearhe will not be outflanked without a fight. After all, he has shaped every succession crisis since the 1970s, from ushering in Mugabe, to removing him, to elevating Mnangagwa. This time, Chiwenga appears determined that it will be his own ascendancyand nobody elses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Analysis Opinion: By Desmond Nleya and Shelton Muchena | Here is an analysis of Tagwirei’s public humiliation yesterday from a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/tagwirei-learns-chiwenga-still-rules-zanu-pf-succession-politics/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Learns Chiwenga Still Rules ZANU PF Succession Politics\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "ZIFA Cracks the Whip: Three Referees Suspended Over Poor Officiating",
            "url": "https://www.zimeye.net/2025/07/04/zifa-cracks-the-whip-three-referees-suspended-over-poor-officiating/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has announced disciplinary action against three match officials following substandard performances during recent Castle Lager Premier Soccer League fixtures.\n\nIn a statement released on Wednesday, ZIFA said the suspensions were part of its commitment to enforcing professionalism, integrity, and high standards of officiating. The sanctions were issued in accordance with paragraph 21 of the Referees Code of Conduct after thorough assessments by match commissioners.\n\nOfficials Suspended:\n\nZIFA stressed the importance of match officials in safeguarding the credibility of the game, adding that referees must consistently demonstrate fairness, competence, and professionalism on the field.\n\nZIFA remains committed to ensuring accountability while also supporting referee development through training, evaluation, and mentorship programs, the association said.\n\nThe move has been welcomed by some quarters of the football fraternity who have recently expressed concern over inconsistent officiating in the local league.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has announced disciplinary action against three match officials following substandard performances during recent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/zifa-cracks-the-whip-three-referees-suspended-over-poor-officiating/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Cracks the Whip: Three Referees Suspended Over Poor Officiating\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "Nico Williams Snubs Barcelona Deal…",
            "url": "https://www.zimeye.net/2025/07/04/nico-williams-snubs-barcelona-deal/",
            "content": "Sports Correspondent\n\nBarcelonas hopes of signing Nico Williams have been dealt a massive blow after the Spanish international signed a shock 10-year contract extension with Athletic Club, effectively ending months of transfer speculation.\n\nThe 22-year-old winger had been widely tipped to join the Catalan giants this summer, with reports suggesting that personal terms had already been agreed. However, in a dramatic U-turn, Williams committed his long-term future to his boyhood club, putting pen to paper on a deal that will keep him at San Mams until 2035.\n\nAthletic Club confirmed the news on Friday morning, catching many off guard. The deal also includes a significant increase in his release clausereportedly more than 50% higher than beforemaking it even harder for interested clubs to trigger a future move.\n\nSpeaking after the announcement, Williams expressed his loyalty to Athletic:\n\nWhen it comes to making decisions, the most important thing is to listen to your heart. I am in the place where I want to be, with my people. This is my home. Aupa Athletic!\n\nThe announcement marks the second consecutive year that Barcelona have failed in their bid to land the highly rated winger, and tensions between the two La Liga clubs appear to be growing. Athletic reportedly raised concerns with La Liga over Barcelonas financial capacity to register new signings, further fuelling the ongoing rivalry.\n\nIn a cheeky dig at Barcelona, Athletic Club included the hashtag #AthleticWIN in their official post, celebrating their successful attempt to retain one of Spains brightest young talents.\n\nWhats Next for Barcelona?\n\nWith the collapse of the Williams deal, new Barcelona manager Hansi Flick will now have to turn his attention elsewhere. Reports suggest the Catalans could shift their focus to Manchester Uniteds Marcus Rashford or Liverpools Luis Daz as alternative wide attacking options.\n\nFor now, Athletic Club celebrate a major victory off the pitch, securing their star man and sending a clear message to Spains biggest clubs: they wont be pushed around.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Barcelona’s hopes of signing Nico Williams have been dealt a massive blow after the Spanish international signed a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/nico-williams-snubs-barcelona-deal/\">Continue reading<span class=\"screen-reader-text\"> \"Nico Williams Snubs Barcelona Deal…\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "Absent MP? Gutu East Electorate Turns to Defeated Candidate for Leadership",
            "url": "https://www.zimeye.net/2025/07/04/absent-mp-gutu-east-electorate-turns-to-defeated-candidate-for-leadership/",
            "content": "By A Correspondent\n\nAs questions grow over the whereabouts of Zanu PFs winning candidate Zvarevashe Masvingise, it is the losing candidate, Gift Gonese, who has remained visible and active in Gutu East, winning praise from villagers for staying committed to development work long after the campaign trail cooled.\n\nMasvingise, who won the June 14 by-election, has allegedly gone silent since his victory, with some villagers claiming he has disappeared and failed to return to the ground.\n\nWe havent seen him since the election. Its like he vanished. Were beginning to worry about whether he will really represent us, said a resident from Ward 12.\n\nMeanwhile, Gonese, who came second in the by-election, is pressing ahead with community development projects, including water access initiatives, youth empowerment programmes, and agricultural support schemes.\n\nSpeaking on Friday, Gonese reaffirmed his commitment to Gutu East:\n\nWe are reviving our projects in the constituency and this time on a higher trajectory.\n\nWhile Gonese lost to Masvingise in a three-way race that also featured Zivanai Nzvenga of the National Constitutional Assembly (NCA), he has refused to retreat from public serviceprompting many locals to label him the peoples choice in action.\n\nPolitics aside, we just want development, said a villager in Ward 14.Gonese has shown us that he is still with the people, and that matters. He didnt disappear after the votes were counted.\n\nAnalysts say Goneses post-election engagement offers a refreshing counter-narrative to Zimbabwes political culture, where many candidates disengage from their constituencies once elections are over.\n\nThis is what leadership should look likeservice that isnt dependent on a title, said a local community development officer.\n\nWith Masvingise yet to publicly respond to the criticism or outline his post-election plans, some are beginning to question whether winning an election is enough, or if continued presence and service are what truly define political leadership.\n\nAs the dust settles from the by-election, all eyes remain on Gutu Eastwhere the winner is absent, but the runner-up is leading from the ground.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As questions grow over the whereabouts of Zanu PF’s winning candidate Zvarevashe Masvingise, it is the losing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/absent-mp-gutu-east-electorate-turns-to-defeated-candidate-for-leadership/\">Continue reading<span class=\"screen-reader-text\"> \"Absent MP? Gutu East Electorate Turns to Defeated Candidate for Leadership\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        },
        {
            "title": "Former Arsenal Midfielder Thomas Partey Charged with Rape and Sexual Assault",
            "url": "https://www.zimeye.net/2025/07/04/former-arsenal-midfielder-thomas-partey-charged-with-rape-and-sexual-assault/",
            "content": "LONDON  The Metropolitan Police have officially charged Arsenal and Ghana international midfielder Thomas Partey, 32, with multiple sex offences, including five counts of rape and one count of sexual assault.\n\nAccording to authorities, the alleged incidents took place between 2021 and 2022. The charges were approved by the Crown Prosecution Service following a detailed investigation.\n\nIn a brief statement, the Met Police confirmed the charges and stated that Partey is expected to appear in court at a date yet to be announced.\n\nThe developments mark a serious turn in the high-profile case, which has been under investigation for over a year. Neither Arsenal Football Club nor Parteys legal representatives have issued a public response as of Friday morning.\n\nThe Crown Prosecution Service emphasized that criminal proceedings are now active, and that all parties involved are entitled to a fair trial.\n\nMore details are expected as the case proceeds through the legal system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "LONDON – The Metropolitan Police have officially charged Arsenal and Ghana international midfielder Thomas Partey, 32, with multiple sex offences, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/04/former-arsenal-midfielder-thomas-partey-charged-with-rape-and-sexual-assault/\">Continue reading<span class=\"screen-reader-text\"> \"Former Arsenal Midfielder Thomas Partey Charged with Rape and Sexual Assault\"</span></a></p>",
            "time": "06:42",
            "date": "05 Jul 2025"
        }
    ]
}