{
    "news": [
        {
            "title": "European Clubs Eye Trey Nyoni",
            "url": "https://www.zimeye.net/2025/11/21/european-clubs-eye-trey-nyoni/",
            "content": "Sports Correspondent  Several European clubs are reportedly monitoring Trey Nyoni ahead of the January transfer window.\n\nNyoni has found it difficult to secure consistent playing time since his promotion to Liverpools senior squad at the start of the season.\n\nAccording to The Athletic, Liverpool are expected to consider loan offers from clubs keen on the young midfielder. The Reds will assess each potential destination carefully before deciding whether a loan move would support Nyonis development.\n\nHowever, the clubs final decision will hinge largely on the fitness and form of Liverpools senior midfielders, meaning any approval for a loan is likely to come later in the window.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Several European clubs are reportedly monitoring Trey Nyoni ahead of the January transfer window. Nyoni has found … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/european-clubs-eye-trey-nyoni/\">Continue reading<span class=\"screen-reader-text\"> \"European Clubs Eye Trey Nyoni\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Government Restricts VID to Depot Inspections Only",
            "url": "https://www.zimeye.net/2025/11/21/government-restricts-vid-to-depot-inspections-only/",
            "content": "Tinashe Sambiri -The Vehicle Inspectorate Department (VID) will soon be limited to conducting vehicle inspections at its depots only, Government has announced.\n\nMinister of Transport and Infrastructural Development, Felix Mhona this week revealed that his ministry is drafting legislation to transform the Traffic Safety Council of Zimbabwe (TSCZ) from a traffic safety promotional body into a Road Traffic Safety Authority, also referred to as the Road Traffic Safety Lead Agency.\n\nUnder the new authority, the Inspectorate will gain powers to stop and inspect vehicles, issue tickets, investigate accidents, recommend measures to prevent recurrence, and perform other regulatory functions, including conducting road infrastructure audits and overseeing road authorities.\n\nSpeaking during his keynote address at the Ministrys Eighth (Second 2025) Session of the Line Ministers Public Entities Corporate Governance Oversight meeting held at a Bulawayo hotel on Wednesday, Minister Mhona said:\n\nThe Ministry is working on a law to transform the TSCZ from being a traffic safety promotional institution to a Road Traffic Safety Authority with the Inspectorate armed with the powers to stop and inspect vehicles, issue tickets, investigate accidents and proffer recommendations to eliminate recurrence and other regulatory powers such as road infrastructure audits and oversight over road authorities.\n\nHe clarified that the envisaged role of the TSCZ Inspectorate will not duplicate VID functions.\n\nThe Inspectorate of the Traffic Safety Authority will have powers to stop, institute spot inspections and refer vehicles to the VID depots for inspection. This will separate functions between the Traffic Safety Authoritys Inspectorate and the VID, which should focus on inspections at the depots, Minister Mhona explained.\n\nThe move signals a significant shift in Zimbabwes road safety regulatory framework, limiting VIDs highway operations while expanding the enforcement role of the newly proposed Traffic Safety Authority.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri -The Vehicle Inspectorate Department (VID) will soon be limited to conducting vehicle inspections at its depots only, Government … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/government-restricts-vid-to-depot-inspections-only/\">Continue reading<span class=\"screen-reader-text\"> \"Government Restricts VID to Depot Inspections Only\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Mutsvangwa Taunts Opposition Over Criticism of Zimbabwe’s Economy",
            "url": "https://www.zimeye.net/2025/11/21/mutsvangwa-taunts-opposition-over-criticism-of-zimbabwes-economy/",
            "content": "Tinashe Sambiri ZANU-PF spokesperson Ambassador Christopher Mutsvangwa on Thursday launched a sharp rebuke at opposition figures Tendai Biti and Jealousy Mawarire, accusing them of constantly disparaging Zimbabwe and its economic policies.\n\nThe comments were made during a Zanu PF media briefing in Harare.\n\nAddressing the two opposition leaders directly, Mutsvangwa said:\n\nYou are making futile efforts to denigrate our country. That should not be tolerated. Biti and Mawarire are always negative. They cant stop the wave of transformation.\n\nHe further warned Biti against criticizing the country while lacking the financial means to contribute to investment and economic growth. You cannot speak badly about Zimbabwe when you do not have money to invest, Mutsvangwa said.\n\nThe spokespersons remarks come amid ongoing debates over Zimbabwes economic performance, with Zanu PF emphasizing recent policy measures aimed at economic transformation and stability. Mutsvangwas message underscores the partys firm stance against what it perceives as persistent opposition negativity, insisting that the countrys development agenda will continue despite detractors.\n\nThe country is moving forward, and no amount of criticism from those with no constructive solutions will change that, Mutsvangwa concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– ZANU-PF spokesperson Ambassador Christopher Mutsvangwa on Thursday launched a sharp rebuke at opposition figures Tendai Biti and Jealousy … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/mutsvangwa-taunts-opposition-over-criticism-of-zimbabwes-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Taunts Opposition Over Criticism of Zimbabwe’s Economy\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Outrage As Kuda Tagwirei’s Funeral Fund For War Veterans Overshadows Social Needs",
            "url": "https://www.zimeye.net/2025/11/21/outrage-as-kuda-tagwireis-funeral-fund-for-war-veterans-overshadows-social-needs/",
            "content": "Tinashe Sambiri At a Zanu PF Harare Province Zone 5 Inter-District meeting in Epworth on Thursday, controversial businessman Kuda Tagwirei announced a series of initiatives for war veterans, party leagues, and local communities.\n\nAmong the most controversial was a US$2 500 funeral policy for all war veterans and their spouses, designed to ensure a dignified burial for those who fought for Zimbabwes liberation.\n\nWhile Tagwirei defended the move, saying, This funeral policy is designed to honour the sacrifices of our war veterans. Every veteran and spouse will be guaranteed proper arrangements, because they gave everything for our nation, critics argue that the scheme prioritizes the deceased over the living.\n\nOther announcements included a US$300 000 empowerment boost for party leagues, donations of computers, laptops, and wheelchairs, the construction of five clinics with maternity wards, and a party-owned market in DCC 5.\n\nResidents and opposition voices, however, expressed concern that these initiatives favor political loyalists and symbolic gestures over urgent community needs such as food security, housing, and education.\n\nThe policy seems to prioritize the dead over the living, one local resident said. People in our communities are struggling with access to health care, clean water, and education. Why give thousands for funerals while families go hungry?\n\nDespite Tagwireis emphasis on social and economic empowerment, including SME support and the nationwide rollout of free WiFi, many argue that the heavy focus on funeral payouts risks leaving living citizens underserved.\n\nCritics are now calling for more transparent allocation of resources that directly address pressing needs in DCC 5 and beyond, highlighting the tension between symbolic gestures and practical community support.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– At a Zanu PF Harare Province Zone 5 Inter-District meeting in Epworth on Thursday, controversial businessman Kuda Tagwirei … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/outrage-as-kuda-tagwireis-funeral-fund-for-war-veterans-overshadows-social-needs/\">Continue reading<span class=\"screen-reader-text\"> \"Outrage As Kuda Tagwirei’s Funeral Fund For War Veterans Overshadows Social Needs\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Tribute To Archbishop Paul Mwazha We Africa",
            "url": "https://www.zimeye.net/2025/11/21/tribute-to-archbishop-paul-mwazha-we-africa/",
            "content": "THE PILLAR OF OUR AFRICAN FAITH IS GONE.\n\nBy Dr Masimba Mavaza | We remember Archbishop Paul Mwazha, a devoted servant of God and founder of the African Apostolic Church. Born on October 25, 1918, he dedicated his life to spreading the gospel, leaving a lasting impact on millions.\n\nArchbishop Mwazhas ministry was marked by his unwavering commitment to Jesus Christ. He was a true soldier and ambassador of God, fearlessly sharing the Good News. His leadership and teachings guided countless individuals, and his legacy continues to inspire.\n\nWe recall his remarkable faith, compassion, and generosity. He was a man of prayer, devoted to his family, and a true example of godly living. His humility, kindness, and love for others remain a shining example for us all.\n\nAs we mourn his passing, we celebrate his life and achievements. May his family, friends, and the global church find comfort in Gods presence. We pray that his legacy will continue to inspire us to live a life of faith, hope, and love.\n\nRest in peace, Archbishop Mwazha. Your impact will be remembered forever.\n\nGod has always blessed Paul Mwazha. Living for 107 years is a remarkable blessing, a testament to a life well lived and a legacy that will be remembered for generations to come. Archbishop Paul Mwazhas life was a journey of faith, dedication, and service to others.\n\nReaching such an advanced age is a gift, allowing one to witness history unfold, to see families grow, and to leave an indelible mark on the world. Its a time to reflect on memories, experiences, and the countless lives touched.\n\nImagine: Witnessing significant historical events and transformations Celebrating milestones and achievements Sharing wisdom and guidance with loved ones Seeing the impact of ones work and legacy Experiencing the love and devotion of family and community\n\nArchbishop Mwazhas life was a blessing to many, and his legacy will continue to inspire and uplift others. His remarkable life serves as a reminder to cherish every moment, to live with purpose, and to leave a lasting impact on the world.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "THE PILLAR OF OUR AFRICAN FAITH IS GONE. By Dr Masimba Mavaza | We remember Archbishop Paul Mwazha, a devoted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/tribute-to-archbishop-paul-mwazha-we-africa/\">Continue reading<span class=\"screen-reader-text\"> \"Tribute To Archbishop Paul Mwazha We Africa\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Opposition Leader Chamisa Pays Emotional Tribute to Mwazha",
            "url": "https://www.zimeye.net/2025/11/21/opposition-leader-chamisa-pays-emotional-tribute-to-mwazha/",
            "content": "Nelson Chamisa has paid tribute to the late African Apostolic Church founder, Archbishop Paul Mwazha, who died on Thursday, 20 November 2025.\n\nChamisa hailed Mwazha as a faith general who worked tirelessly and dedicated his life to the preaching of the gospel of salvation. He said the Archbishops commitment to ministry, even in old age, reflected a rare discipline: a servant who runs his race to the very last breath.\n\nHe noted that Mwazha consistently delivered a message of hope for the continent, emphasising Gods promise for the recreation of Africa  Africa yedu!\n\nChamisa added: He ran his race and did his bit. Rest in power, Mudzidzisi!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Nelson Chamisa has paid tribute to the late African Apostolic Church founder, Archbishop Paul Mwazha, who died on Thursday, 20 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/opposition-leader-chamisa-pays-emotional-tribute-to-mwazha/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition Leader Chamisa Pays Emotional Tribute to Mwazha\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "BREAKING NEWS: AFM Reverend Chitanda Dies Suddenly in Early-Morning Incident",
            "url": "https://www.zimeye.net/2025/11/21/breaking-news-afm-reverend-chitanda-dies-suddenly-in-early-morning-incident/",
            "content": "By A Correspondent  Chinhoyi  The Apostolic Faith Mission (AFM) community in Chinhoyi has been plunged into mourning following the sudden death of Reverend Chitanda early this morning.\n\nAccording to preliminary information circulating among congregants, Rev Chitanda is reported to have collapsed in the bathroom at around 4AM. Family members and neighbours rushed him to Chinhoyi Provincial Hospital, where medical staff confirmed on arrival that he had already passed away.\n\nDetails around the circumstances leading to the collapse remain unclear, and relatives, as well as church officials, are expected to issue a formal statement once all procedures have been completed. Police are also expected to attend the scene as required in all sudden-death cases.\n\nRev Chitanda was a respected cleric within AFM circles, known for his pastoral work, community outreach, and leadership within the church.\n\nMore updates to follow as the story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Chinhoyi – The Apostolic Faith Mission (AFM) community in Chinhoyi has been plunged into mourning following … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/breaking-news-afm-reverend-chitanda-dies-suddenly-in-early-morning-incident/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING NEWS: AFM Reverend Chitanda Dies Suddenly in Early-Morning Incident\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "“ED’s Millionaires Are Thieves” – Mawarire Openly Challenges Mnangagwa",
            "url": "https://www.zimeye.net/2025/11/21/eds-millionaires-are-thieves-mawarire-openly-challenges-mnangagwa/",
            "content": "Tinashe Sambiri Zimbabwean journalist and political commentator Jealousy Mawarire on Friday delivered a scathing critique of President Emmerson Mnangagwa, accusing him of glorifying corruption and misrepresenting Zimbabwes development achievements.\n\nMawarire directly challenged claims that Mnangagwa succeeded where former President Robert Mugabe had failed, particularly regarding infrastructure and economic growth.\n\nHe stated:The claim that ED succeeded in what Mugabe failed is a lie from the pit of hell. Lets take, for instance, infrastructure. Mugabe built the National Sports Stadium, Reserve Bank building, New Government building, Karigamombe, Causeway, and universities in nine provinces, starting with NUST in Bulawayo.\n\nHe also criticized the roads credited to Mnangagwa:\n\nThe Mutare-Harare-Bulawayo-Plumtree road, in its current state, was built under Mugabe. The Masvingo-Beitbridge road, which ED is resurfacing, was initially done by Mugabe. The Chivhu-Chiredzi highway was done by Mugabe between 1987 and 1989.\n\nMawarire was particularly scathing about the new class of wealthy individuals associated with Mnangagwas tenure:\n\nThe millionaires you are talking about, the thieves looting Zimbabwe now, cant be compared to real businesspeople who came up during Mugabes time, like Shingai Mutasa, Strive Masiiwa, Nigel Chanakira, and others. Crediting ED for creating millionaires is an insult to our national psyche, a glorification of thievery which can only come from someone of the same ilk.\n\nHe further claimed that many projects completed under Mnangagwa were originally brokered under Mugabe and are now being used as opportunities for corruption:\n\nYes, there are projects that have been undertaken during EDs time, but if you look closely, these are projects that were brokered by Mugabe before the coup. The new parliament and the airport are good examples. What ED has done is turning such projects into looting schemes by overpricing the projects through proxy contractors who bring suitcases of money every day to his private office in Borrowdale.\n\nMawarire also accused Mnangagwa of failing citizens in the healthcare sector:\n\nMugabe built clinics all over the country. ED, through his wife, has made sure there are no painkillers in those clinics and even major referral hospitals. Give us a break. ED is a thief, the worst thing that has happened to Zimbabwe since colonialism.\n\nHis remarks are likely to reignite debates over Zimbabwes economic management, governance, and the legacies of both Mugabe and Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zimbabwean journalist and political commentator Jealousy Mawarire on Friday delivered a scathing critique of President Emmerson Mnangagwa, accusing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/eds-millionaires-are-thieves-mawarire-openly-challenges-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"“ED’s Millionaires Are Thieves” – Mawarire Openly Challenges Mnangagwa\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "War Vets Humiliate Tagwirei",
            "url": "https://www.zimeye.net/2025/11/21/war-vets-humiliate-tagwirei/",
            "content": "By A Correspondent Some members of the Zimbabwe National Liberation War Veterans Association (ZNLWVA) have rejected offers made by businessman and Zanu PF benefactor Kuda Tagwirei, describing them as patronage-driven bribes meant to buy political influence in the ruling partys increasingly tense succession battles.\n\nThe Andrease Ethan Mathibelaled ZNLWVA issued a strongly worded statement after Tagwirei  recently co-opted into Zanu PFs Central Committee  pledged to provide funeral cover for war veterans and their spouses at a Harare inter-district meeting on Wednesday.\n\nThe association said ex-combatants did not require funeral policies, but meaningful economic empowerment that honoured their central role in the liberation struggle.\n\nThe ZNLWVA notes with profound concern, disbelief and indignation the recent utterances by a novice politician proposing funeral policies as a form of empowerment for the gallant veterans of Zimbabwes liberation struggle, the statement said.\n\nSuch a proposal is not only misguided, it is an insult, a curse and a direct assault on the dignity of those who liberated this nation.\n\nMathibela said the liberation fighters did not sacrifice their youth, limbs, health and lives so that the political elite could reduce their legacy to burial schemes.\n\nThe rejection of Tagwireis pledge comes as frustration among ex-combatants grows over years of unfulfilled government promises, deteriorating welfare provisions, and what the ZNLWVA calls deliberate marginalisation while politically connected elites, chiefs and legislators routinely receive luxury cars, houses, farms and other benefits.\n\nTagwirei has for years been one of the most influential financiers of Zanu PF politics, building an empire through lucrative government contracts and his proximity to power.Some of his widely reported political sponsorship activities include:\n\nAgainst this backdrop, war veterans say Tagwireis latest pledge is merely another attempt to entrench his political foothold by using liberation fighters as pawns.\n\nMathibela said real empowerment should include title deeds for land, access to health services, decent pensions, business capitalisation and inclusion in national economic opportunities.\n\nWar veterans are nation builders, not charity cases waiting for burial handouts, he said.\n\nReal empowerment includes land securitisation and title deeds, access to medical support, decent pensions, income-generating projects and business capitalisation. A funeral policy is not one of them.\n\nHe condemned the government for repeatedly making empty promises, saying the welfare of ex-combatants had collapsed while political elites grew wealthier.\n\nThe ZNLWVA said respect for war veterans was a constitutional and moral duty  not a political bargaining chip.\n\nTagwirei had announced that Harare war veterans and their spouses would receive funeral policies valued at US$2 500 each  an offer now publicly dismissed as degrading and politically manipulative.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Some members of the Zimbabwe National Liberation War Veterans Association (ZNLWVA) have rejected offers made by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/war-vets-humiliate-tagwirei/\">Continue reading<span class=\"screen-reader-text\"> \"War Vets Humiliate Tagwirei\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Mutsvangwa On Mnangagwa Succession: Wait For 2027, No Vacancy At The Moment",
            "url": "https://www.zimeye.net/2025/11/21/mutsvangwa-on-mnangagwa-succession-wait-for-2027-no-vacancy-at-the-moment/",
            "content": "Tinashe Sambiri ZANU PF Secretary for Information and Publicity, Ambassador Christopher Mutsvangwa, on Thursday addressed questions surrounding President Emmerson Mnangagwas succession, insisting that the issue will only be clarified in 2027.\n\nSpeaking at a press conference in Harare, Mutsvangwa said the partys position was already clearly stated at its last conference. We had our resolution number 1 at the party conference in Bulawayo, which said that President Mnangagwa remains the President of Zimbabwe until 2030, and that resolution was unanimous, made by a majority, he said.\n\nHe emphasised that no one can claim the partys top position before the appropriate internal processes take place. The decision of the President in 2027 will decide where the party will go as we have a Congress in 2027, Mutsvangwa said.\n\nHe warned against early declarations of presidential ambition. If you declare yourself as a candidate ahead of the party itself, and the party having not announced the availability of a vacancy in the Presidency, it is totally wrong, he stated.\n\nMutsvangwas remarks underline what many describe as his enigmatic and unpredictable political messaging, but his latest comments reaffirm the ruling partys stance that there is no vacancy until 2027.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– ZANU PF Secretary for Information and Publicity, Ambassador Christopher Mutsvangwa, on Thursday addressed questions surrounding President Emmerson Mnangagwa’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/21/mutsvangwa-on-mnangagwa-succession-wait-for-2027-no-vacancy-at-the-moment/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa On Mnangagwa Succession: Wait For 2027, No Vacancy At The Moment\"</span></a></p>",
            "time": "21:46",
            "date": "21 Nov 2025"
        }
    ]
}