{
    "news": [
        {
            "title": "Tagwirei Hits Mutsvangwa Hard",
            "url": "https://www.zimeye.net/2025/07/23/tagwirei-hits-mutsvangwa-hard/",
            "content": "By A Correspondent-Controversial businessman and Zanu PF benefactor, Kudakwashe Kuda Tagwirei, has hit back hard at party spokesperson and long-time rival, Ambassador Chris Mutsvangwa, in what insiders say is the clearest sign yet of a growing power struggle within the ruling party.\n\nTagwirei, widely believed to be a key financier and frontman for President Emmerson Mnangagwa, was unanimously nominated by the ZANU PF Harare Provincial Coordinating Committee (PCC) to fill a vacant seat in the partys Central Committeea powerful decision-making organ.\n\nThe nomination is being resisted by the Zanu PF Presidium, sparking political tremors, particularly among factions alignedtoMutsvangwa, who for yearshaspublicly questioned Tagwireis growing influence in both the economy and the party.\n\nA Calculated Move\n\nThe PCCs statement, cloaked in formal party language, reads more like a declaration of political war than a routine nomination. It hailed Tagwirei as a symbol of competence, loyalty, and strategic insight, and framed his selection as essential to the provinces structural resilience and visionary leadership.\n\nParty insiders say this is a direct swipe at Mutsvangwas camp, which has in the past accused Tagwirei of running a shadow government through economic monopolies and opaque deals. Mutsvangwa himself has been particularly vocal about Tagwireis alleged abuse of fuel and mining tenders and once famously described him as a corrupt tenderpreneur who has captured the state.\n\nHowever, the PCCs overwhelming endorsement of Tagwirei sends a clear message that the businessman is now more than just a behind-the-scenes powerbrokerhe is becoming a central political player. His controversial nomination to the Central Committee would elevate him to formal leadership within Zanu PF, providing the kind of political legitimacy Mutsvangwa has fought to deny him.\n\nThe Battle Lines\n\nThe Tagwirei-Mutsvangwa feudhasbeen simmering for years but became public around 2019 when Mutsvangwa, then Presidential Special Advisor, was sidelined amid reports he had clashed with Tagwirei over access to Mnangagwa. Mutsvangwa has since reinvented himself as the partys mouthpiece and is believed to harbour ambitions for higher office.\n\nBut his attempts to discredit Tagwirei appear to have backfired. Zanu PF sources say the Harare PCC nomination is being driven from the top, as part of a broader strategy to entrench loyalists in strategic positions ahead of the partys next elective congress.\n\nTagwirei is no longer just the money guy. Hes entering the ring, politically, said a senior party official familiar with the dynamics. This nomination is a slap in the face for Mutsvangwa. It shows who is really in charge.\n\nSymbolism in Structure\n\nBeyond personalities, the nomination signals a larger power shift within Zanu PF. The statement praised Tagwirei for offering vehicle support to Harare Province, a veiled reference to his financial muscle and logistical clout. It went on to declare that a robust political engine requires fuelnot just ideologically, but physically.\n\nThis language echoes growing calls within the party for technocratic leadership that can deliver resources, not just rhetoric. In that context, Tagwireis nomination is as much about political survival as it is about political service.\n\nHistory Repeating Itself\n\nZanu PF has a long tradition of co-opting wealthy or influential individuals into its structures. The move often serves dual purposesmuting criticism and leveraging resources. But in Tagwireis case, it also reflects a deliberate effort by the Mnangagwa faction to neutralize dissenting voices  and assert full control of the party machinery.\n\nThis moment isnt just about filling a vacancy, the statement reads. Its about reaffirming the partys commitment to strategic expansion, operational readiness, and leadership rooted in loyalty and skill.\n\nIn the battle of billionaires and spokespersons, it appears Tagwirei has drawn first bloodby turning what looked like a routine nomination into a well-executed political counterpunch.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Controversial businessman and Zanu PF benefactor, Kudakwashe “Kuda” Tagwirei, has hit back hard at party spokesperson and long-time … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/tagwirei-hits-mutsvangwa-hard/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Hits Mutsvangwa Hard\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Has President Retired One Of The VPs? No Way!",
            "url": "https://www.zimeye.net/2025/07/23/has-president-retired-one-of-the-vps-no-way/",
            "content": "Response to letters to editors.\n\nSerious grammatical and formatting errors are on a leaked letter retiring one of the Vice Presidents, Kembo Mohadi.\n\nThis letter has been in the ash tray for some days and it has many errors, a source told ZimEye.\n\nOrdinarily, a resignation or retirement is announced before appointment.\n\nA source in the presidents office who neither confirmed nor denied the letter told ZimEye the document must be dismissed.\n\nMohadi participated In Mnangagwas launch of a Zimplats project today, as a VP.\n\nReaders are advised to treat the leaked letter with caution  and utmost suspicion.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Response to letters to editors.  Serious grammatical and formatting errors are on a ‘leaked letter’ retiring one of the Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/has-president-retired-one-of-the-vps-no-way/\">Continue reading<span class=\"screen-reader-text\"> \"Has President Retired One Of The VPs? No Way!\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Police Release Names Of Chitungwiza Horrific Accident Victims",
            "url": "https://www.zimeye.net/2025/07/23/police-release-names-of-chitungwiza-horrific-accident-victims/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has released the names of the 17 people who tragically lost their lives in the horrific road accident that occurred on 22 July 2025 at Hunyani Bridge along Seke Road in Chitungwiza.\n\nThe accident, which involved a kombi and a haulage truck, shocked the nation and has drawn widespread grief and calls for increased road safety.\n\nIn a statement issued on 23 July 2025, Police spokesperson Commissioner Paul Nyathi confirmed the identities of the deceased, who were identified by their next of kin.\n\nThe victims are:\n\nThe Zimbabwe Republic Police expresses condolences to the bereaved families, said Commissioner Nyathi. We understand the deep pain that has been caused by this tragedy, and our thoughts are with the affected communities.\n\nCommissioner Nyathi also confirmed that investigations into the cause of the fatal crash are underway. The Police is conducting comprehensive investigations to determine the causes of the accident, he said.\n\nHe took the opportunity to urge motorists across the country to prioritise road safety. Motorists are urged to be safety conscious while driving on the countrys roads. Above all, vehicles should be regularly serviced and checked to address mechanical issues for road safety, Nyathi stressed.\n\nThe Chitungwiza crash has once again highlighted the urgent need for better road safety enforcement and vehicle maintenance, particularly on busy highways such as Seke Road.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has released the names of the 17 people who tragically lost their … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/police-release-names-of-chitungwiza-horrific-accident-victims/\">Continue reading<span class=\"screen-reader-text\"> \"Police Release Names Of Chitungwiza Horrific Accident Victims\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Manicaland Anglican Bishop In Messy Divorce",
            "url": "https://www.zimeye.net/2025/07/23/manicaland-anglican-bishop-in-messy-divorce/",
            "content": "By Crime and Courts Reporter-Lord Bishop of the Anglican Diocese of Manicaland, and Prominent banker, Dr Julius Makoni, has lost a luxurious Chisipite mansion and a stand in Chishawasha Hills following a protracted and acrimonious divorce with his ex-wife, Pauline Mutsa Makoni.\n\nMakoni,was ordered by the Supreme Court to cede ownership of the properties to Pauline. The main property in dispute is a palatial home at No. 5 Rietfontein Close in Chisipite, where Makoni currently resides with a new wife.\n\nThe legal battle began in 2013 when Pauline filed for divorce in the United Kingdom. In December 2014, she obtained a divorce order and consequential relief from the High Court of Justice, Family Division, in England.\n\nMakoni challenged the enforceability of the UK courts decision in Zimbabwe, arguing that the English court had no jurisdiction. While he initially succeeded at the High Court in Harare, Pauline appealed the decision to the Supreme Court.\n\nIn October 2023, Justices Tendai Uchena and Alphas Chitakunye ruled in favour of Pauline, ordering the transfer of both the Chisipite property and the Chishawasha Hills stand into her name.\n\nPart of the Supreme Court ruling reads:\n\nJulius Tawona Makoni shall sign all relevant documents to effect transfer of properties awarded to Pauline Mutsa Makoni in respect of No. 5 Rietfontein Close, Chisipite, Harare and Stand 159 Chishawasha Hills Township, Harare, within 7 days of this order, failing which the Sheriff is authorised to sign such documents and effect such transfers.The costs of the transfers shall be borne by Makoni.Makoni shall also bear the costs of suit in respect of both applications.\n\nPauline was represented by Advocate Thabani Mpofu, while Advocate Welshman Ncube appeared for Makoni.\n\nMakoni, a former employee of the World Bank and Bankers Trust inEngland, boasts an impressive academic portfolio. He holds a degree in Economics, an MSc in Finance, an MBA, a PhD in International Finance, a Postgraduate Diploma in Theology, and an MPhil in Theology.\n\nThe ruling brings to an end a decade-long legal wrangle that played out across two continents, exposing the personal and financial cracks in the life of one of Zimbabwes most accomplished banking executives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Lord Bishop of the Anglican Diocese of Manicaland, and Prominent banker, Dr Julius Makoni, has lost … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/manicaland-anglican-bishop-in-messy-divorce/\">Continue reading<span class=\"screen-reader-text\"> \"Manicaland Anglican Bishop In Messy Divorce\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Mnangagwa and Chiwenga Visibly Laugh Off Tagwirei-Tug at Zimplats Launch",
            "url": "https://www.zimeye.net/2025/07/23/mnangagwa-and-chiwenga-visibly-laugh-off-tagwirei-tug-at-zimplats-launch/",
            "content": "Selous | 23 July 2025 \n\nBy Dorrothy Moyo | ZimEye | President Emmerson Mnangagwa and his deputy, Vice President Constantino Chiwenga, were pictured sharing a light moment amid heavy security and a sea of white overalls as they jointly officiated the commissioning of the Zimplats Smelter Expansion and Phase 1 Sulphur Dioxide (SO) Abatement Project at the Selous Metallurgical Complex.\n\nThe occasion, marked by ceremonial flair and industrial pride, comes just weeks after swirling rumours of political fallout between the two men. But as they stood togethersmiling, laughing, and donning full safety regaliaany visible cracks in their working relationship were, at least for the cameras, paved over by the gleaming metalwork of one of Zimbabwes most significant mining infrastructure projects in years.\n\nThe commemorative plaque, unveiled at the site, proudly bears Mnangagwas name, declaring his presence as the nations Head of State at the commissioning of the nearly US$400 million investment. Backdropped by towering furnaces and sulphur abatement tanks, the Zimplats expansion represents a major leap in local beneficiation and emissions control within Zimbabwes platinum industry.\n\nA technical display board at the site revealed the scope of the project:\n\nThe project is expected to process 380,000 tonnes of concentrate per annum, delivering over 1 million ounces of platinum group metals. The new abatement facility is designed to drastically reduce sulphur emissions, bringing Zimbabwes mining practices closer to global environmental standards.\n\nAs ministers, ZANU PF politburo members, and foreign dignitaries milled about, a relaxed Chiwenga was seen pointing animatedly at sections of the plant while Mnangagwa stood beside him, grinningan image starkly at odds with recent whispers of a brewing internal rift.\n\nCritics have pointed out the curious date listed on the plaque: 23 July 2025nearly 10 months after the official commissioning date listed as October 2024raising questions about delayed ceremonies versus actual operations.\n\nNonetheless, the event was framed as a major milestone in Zimbabwes economic transformation. This is not just about platinum, a Zimplats executive said at the event, its about industrial development, jobs, and sustainable growth.\n\nObservers say the event served dual purposes: one industrial, the other political. This is Mnangagwa and Chiwengas handshake in steel and sulphur, a government insider remarked. What happens behind the scenes may be another matter.\n\nDeveloping story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Selous | 23 July 2025 – By Dorrothy Moyo | ZimEye | President Emmerson Mnangagwa and his deputy, Vice President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/mnangagwa-and-chiwenga-visibly-laugh-off-tagwirei-tug-at-zimplats-launch/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa and Chiwenga Visibly Laugh Off Tagwirei-Tug at Zimplats Launch\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Mnangagwa Ditches Zanu PF Affiliates",
            "url": "https://www.zimeye.net/2025/07/23/mnangagwa-ditches-zanu-pf-affiliates/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has reportedly turned his back on several Zanu PF-affiliated groups that played a major role in mobilising support for his re-election campaign during the 2023 harmonised elections.\n\nThe affiliates  including Teachers 4ED, Mahwindi 4ED, Doctors and Nurses 4ED, Young Women 4ED, and Hairdressers 4ED  were formed under the ED banner to rally different professional and social groups behind Mnangagwas candidacy.\n\nHowever, the ruling party now appears to be shifting its strategy, with indications that many of these groups will no longer be recognised as official affiliates of Zanu PF.\n\nNew requirements for all affiliates including old ones as the ZANU PF Party discovered that maAffiliates haana vanhu, read a post on the Zanu PF-aligned Operation Restore Legacy page on Wednesday. The statement suggests that many of the groups existed only on paper and had no meaningful grassroots structures or membership.\n\nTo me, I guess its wise to close all silly affiliates and be left with proper affiliates like ZICOSU, ZILIWACO, and CZLWVA, the post added, referring to more established bodies such as the Zimbabwe Congress of Students Union, the Zimbabwe Liberation War Collaborators, and the Zimbabwe National Liberation War Veterans Association.\n\nOthers must join the Youth League and Womens League, the post further advised, signalling a consolidation of support structures within the partys traditional wings.\n\nThis move is likely to be seen as a betrayal by some of the grassroots campaigners who invested time and resources in promoting Mnangagwas campaign under the 4ED banner.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has reportedly turned his back on several Zanu PF-affiliated groups that played a major … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/mnangagwa-ditches-zanu-pf-affiliates/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ditches Zanu PF Affiliates\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Did Ollah Commit A Crime By Being A First Responder?",
            "url": "https://www.zimeye.net/2025/07/23/did-ollah-commit-a-crime-by-being-a-first-responder/",
            "content": "By Dorrothy Moyo. | DJ @djollah_7 rammed into an emergency  was he wrong?\n\nAs sirens wailed and dust still hung in the air over Seke Road, one voice pierced the chaosnot that of a police officer or paramedic, but that of DJ Ollah 7, microphone in hand, capturing a raw, unfiltered moment of survival.\n\nIn a nation where official statements often arrive days later, it was a journalistnot the authoritieswho gave Zimbabwe its first human glimpse into the horror. The image of a bandaged man, dazed but alive, speaking from his hospital bed gripped the nation. And yet, this bold act of frontline journalism has sparked fierce debate: was DJ Ollah performing a civic duty, or interfering with police work?\n\nIn Jan 2021, Simba Chikanza was slammed for rushing to interview the head of the COVID task force @oczmk during mourning around the time she was denying millions of people medical facilities by falsifying death statistics.\n\nAs critics question the ethics of both Ollah and @schikanza, the following scholarly sources support DJ Ollahs decision to film and interview the Seke Road driver during the emergency  even if critics argue that only police should handle the drivers questioning:\n\nHolmberg & Olausson (2020) argue that journalists often function as first responders, providing essential real-time information and moral clarity during emergencies . In the Seke Road context, DJ Ollahs interview supports public understanding while official responders are on scene.\n\nSenior emergency managers highlight that media interviews with firsthand witnesses  even before police statements  are vital for rapid, accurate public communication during accidents .\n\nThis 2024 study emphasizes the need for journalists to use unofficial sources  such as witnesses or survivors  alongside police and emergency officials to create a more complete and humanized narrative .\n\nA 2013 Swedish study showed that press coverage can be helpful, aiding survivors to process trauma and understand what happened . DJ Ollahs interview with the driver may similarly assist both driver and community to make sense of the accident.\n\nForsberg warns against discarding interviews with involved parties too quickly. Well-handled interviews with accident participants can validate and support those affected, but rushed abandonment can feel callous . DJ Ollahs approach, if empathetic, aligns with this comfort before closure ethic.\n\n Summary: In Defense of Media Intervention by DJ Ollah\n\nBenefitScholarly SupportServes as first responder reportingHolmberg & Olausson; emergency reportingOffers immediacy and human contextOlivar de Julin et al.Helps survivors process traumaSwedish crash survivor studyComplements not complicates police workForsberg; emergency managers\n\nThe academic consensus emphasizes that ethical, empathetic media interviews with accident participants  like DJ Ollahs conversation with the driver  play a critical role in rapid information delivery, humanizing the story, aiding survivor recovery, and balancing official narratives. When done responsibly, these media interventions are not a breakdown of procedure, but a vital journalistic function acknowledged by scholars.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo. | DJ @djollah_7 rammed into an emergency – was he wrong? As sirens wailed and dust still … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/did-ollah-commit-a-crime-by-being-a-first-responder/\">Continue reading<span class=\"screen-reader-text\"> \"Did Ollah Commit A Crime By Being A First Responder?\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Mbeba Out of Highlanders Squad for Triangle Clash Due to Injury",
            "url": "https://www.zimeye.net/2025/07/23/mbeba-out-of-highlanders-squad-for-triangle-clash-due-to-injury/",
            "content": "Sports Correspondent\n\nHighlanders FC will be without captain Andrew Mbeba when they face Triangle United in a Castle Lager Premier Soccer League Matchday 23 fixture at Barbourfields Stadium on Thursday.\n\nMbeba sustained an ankle injury during Highlanders last outing against Scottland FC on Sunday and had to be substituted in the second half. His absence is a major blow for the Bulawayo giants, who are looking to maintain their strong home form.\n\nCoach Try Ncube confirmed the defenders unavailability while addressing the media ahead of the clash.\n\nPreparations have gone well, but we have an injury in the squad  Andrew Mbeba, said Ncube. We will miss him, but we have good replacements.\n\nHe added that the club is still waiting on a medical report to determine the full extent of the injury following recent scans.\n\nBosso will now rely on their squad depth as they aim to secure maximum points in the absence of their influential skipper.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Highlanders FC will be without captain Andrew Mbeba when they face Triangle United in a Castle Lager Premier … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/mbeba-out-of-highlanders-squad-for-triangle-clash-due-to-injury/\">Continue reading<span class=\"screen-reader-text\"> \"Mbeba Out of Highlanders Squad for Triangle Clash Due to Injury\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Dynamos Lose Three Points as PSL Delivers Heavy Punishment Over Abandoned Match",
            "url": "https://www.zimeye.net/2025/07/23/dynamos-lose-three-points-as-psl-delivers-heavy-punishment-over-abandoned-match/",
            "content": "Sports Correspondent\n\nThe Premier Soccer League (PSL) has punished Dynamos FC following the abandonment of their Castle Lager Premier Soccer League fixture against FC Platinum at Mandava Stadium.\n\nIn a disciplinary ruling announced this week, Dynamos have been docked three points, with the match officially awarded to FC Platinum on a 30 scoreline. The Harare giants have also been fined US$5,000, while their head coach has been hit with a separate US$4,000 fine.\n\nThe PSL found Dynamos responsible for the disruption that led to the premature end of the match, and the ruling serves as a stern warning to clubs across the league to uphold discipline and professionalism on the field.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Premier Soccer League (PSL) has punished Dynamos FC following the abandonment of their Castle Lager Premier Soccer … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/dynamos-lose-three-points-as-psl-delivers-heavy-punishment-over-abandoned-match/\">Continue reading<span class=\"screen-reader-text\"> \"Dynamos Lose Three Points as PSL Delivers Heavy Punishment Over Abandoned Match\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        },
        {
            "title": "Exposing Fence-Sitting Mutsvangwa In Mnangagwa Succession Battle",
            "url": "https://www.zimeye.net/2025/07/23/exposing-fence-sitting-mutsvangwa-in-mnangagwa-succession-battle/",
            "content": "By A Correspondent\n\nUnited Kingdom-based Zimbabwean lawyer and political analyst Brighton Mutebuka has launched a scathing attack on ZANU PF spokesperson Christopher Mutsvangwa, accusing him of playing a duplicitous game in the partys high-stakes succession battle.\n\nIn a strongly worded statement released Tuesday, Mutebuka described Mutsvangwa as a cunning political goon who is trying to position himself favourably amid the growing power struggle between President Emmerson Mnangagwa and his deputy, Constantino Chiwenga.\n\nMutsvangwa seeks to dribble past ED in the ZANU PF succession race, Mutebuka declared. Its common cause that Tagwirei is EDs contingency horse in his vicious power struggle with Chiwenga.\n\nMutebuka suggested that Mutsvangwas recent public rejection of controversial businessman Kudakwashe Tagwireis bid for political elevation is more than just personalits strategic.\n\nWhether motivated by personal hatred, jealousy, or political ambition, Mutsvangwa has firmly shut the door for Tagwireis attempted, contrived moonshot, he said. This creates a fortuitous convergence of political interests with Chiwengabut a momentary one.\n\nWhile not aligning directly with Chiwenga, Mutebuka said Mutsvangwa is exploiting the moment to deal a disguised blow to Mnangagwas succession strategy. His fawning praise of ED is laced with camouflaged political poison, he said. That poison is being publicly administered to deliver a fatal blow to EDs last political gamble via Tagwirei.\n\nAccording to Mutebuka, Mutsvangwa is executing high-level political brinkmanship by pretending loyalty to Mnangagwa while undermining him from within.\n\nBy effusively praising ED while twisting the political knife on the Tagwirei project, Mutsvangwa subtly seeks to evade political censure from party apparatchiks, Mutebuka noted. Yet it represents political brinkmanship of the highest orderas ED is wily enough to unravel it at any point.\n\nHe added, Mutsvangwas high-octane gamble is likely based on the calculation that EDs political capital is fast running out.\n\nThe analysis highlights the increasingly complex internal dynamics within ZANU PF, as senior party figures begin jockeying for influence in anticipation of a post-Mnangagwa era.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent United Kingdom-based Zimbabwean lawyer and political analyst Brighton Mutebuka has launched a scathing attack on ZANU PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/23/exposing-fence-sitting-mutsvangwa-in-mnangagwa-succession-battle/\">Continue reading<span class=\"screen-reader-text\"> \"Exposing Fence-Sitting Mutsvangwa In Mnangagwa Succession Battle\"</span></a></p>",
            "time": "18:10",
            "date": "24 Jul 2025"
        }
    ]
}