{
    "news": [
        {
            "title": "Ruthless MWOS Thrash Kwekwe United",
            "url": "https://www.zimeye.net/2025/05/18/ruthless-mwos-thrash-kwekwe-united/",
            "content": "Sports Correspondent\n\nMWOS FC tightened their grip on the Castle Lager Premier Soccer League summit with a commanding 4-0 victory over Kwekwe United in a Matchday 8 clash at Ngoni Stadium on Saturday.\n\nA brilliant hat-trick by Billy Vheremuscoring in the 12th minute via penalty, then adding goals in the 26th and 53rd minutesset the tone for the dominant performance. Tafadzwa George sealed the win with a stoppage-time strike, ensuring MWOS remain unbeaten this season.\n\nThe victory lifts MWOS to 26 points, three ahead of second-placed Scottland FC, who were held to a goalless draw by Manica Diamonds at Sakubva Stadium.\n\nAt Wadzanayi Stadium, Simba Bhora surged into third place after thrashing Triangle United 4-0. Goals came from Ishmael Nyanhi, Donald Mudadi, Junior Makunike, and Never Tigere, as they rebounded from a previous defeat.\n\nZPC Kariba pulled off a shock 2-1 win over Highlanders at Nyamhunga Stadium, thanks to a brace from Fanuel Shoko. The result ended Bossos 10-match unbeaten run and dropped them to fifth, while ZPC climbed to sixth.\n\nElsewhere, Ngezi Platinum suffered a 1-0 defeat to Herentals, FC Platinum shared the spoils 1-1 with Bikita Minerals, and nine-man Yadah held TelOne to a 1-1 draw. Chicken Inn also slipped to a 1-0 loss at home to Greenfuel.\n\nMatchday 8 Results (Saturday):\n\nZPC Kariba 21 Highlanders\n\nFC Platinum 11 Bikita Minerals\n\nSimba Bhora 40 Triangle United\n\nManica Diamonds 00 Scottland FC\n\nMWOS FC 40 Kwekwe United\n\nHerentals 10 Ngezi Platinum\n\nChicken Inn 01 Greenfuel\n\nTelOne 11 Yadah\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent MWOS FC tightened their grip on the Castle Lager Premier Soccer League summit with a commanding 4-0 victory … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/ruthless-mwos-thrash-kwekwe-united/\">Continue reading<span class=\"screen-reader-text\"> \"Ruthless MWOS Thrash Kwekwe United\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "Man Flogs Schoolgirls For Stealing Sugarcane",
            "url": "https://www.zimeye.net/2025/05/18/man-flogs-schoolgirls-for-stealing-sugarcane/",
            "content": "By A Correspondent\n\nA Chipinge man has been arrested for flogging schoolchildren he accused of stealing sugarcane.\n\nOne Makina was arrested last week for physically abusing schoolgirls.\n\nIn a statement on Saturday Chipinge South MP, Clifford Hlatywayo said :\n\nThis act of abuse happened in our community in ward 26 on the 12th of May. Perpetrated by one MAKINA on school children on their way back home.\n\nI would like to thank the ZRP Chisumbanje for acting fast. As we are speaking the culprit is behind bars.\n\nMan Flogs Schoolgirls for Stealing SugarcaneA disturbing incident of abuse occurred in Ward 26, Chipinge South, on May 12, where a man named Makina physically punished schoolgirls for allegedly stealing sugarcane while they were on their way Makina has since been arrestedpic.twitter.com/e8nYvedpAd\n\nNo to any form of ABUSE!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Chipinge man has been arrested for flogging schoolchildren he accused of stealing sugarcane. One Makina was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/man-flogs-schoolgirls-for-stealing-sugarcane/\">Continue reading<span class=\"screen-reader-text\"> \"Man Flogs Schoolgirls For Stealing Sugarcane\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "Makandiwa U Turn On Massive Gold Bulging From Ground, Says Not Even A Lizard In Zimbabwe’s Forests | UPCOMING",
            "url": "https://www.zimeye.net/2025/05/18/makandiwa-u-turn-on-massive-gold-bulging-from-ground-says-not-even-a-lizard-in-zimbabwes-forests/",
            "content": "By A Correspondent | ZimEye | UFIC church leader Emmanuel Makandiwa has contradicted his previous sermons that say his church members are going to pick up gold bricks bulging from the ground and become rich.\n\nIn a sermon at the weekend, the man regarded by some as a prophet, said there is nothing to pick up in the countrys forests, not even a lizard.  PROGRAM WITH HOWARD NYONI COMING 7PM.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | UFIC church leader Emmanuel Makandiwa has contradicted his previous sermons that say his church … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/makandiwa-u-turn-on-massive-gold-bulging-from-ground-says-not-even-a-lizard-in-zimbabwes-forests/\">Continue reading<span class=\"screen-reader-text\"> \"Makandiwa U Turn On Massive Gold Bulging From Ground, Says Not Even A Lizard In Zimbabwe’s Forests | UPCOMING\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "MPs Shoot Down Mnangagwa Belarus Deal",
            "url": "https://www.zimeye.net/2025/05/18/mps-shoot-down-mnangagwa-belarus-deal/",
            "content": "By A Correspondent\n\nOpposition Members of Parliament from the Citizens Coalition for Change (CCC) have rejected a controversial investment agreement between Zimbabwe and Belarus, arguing that it lacks transparency and could benefit a privileged few.\n\nAlthough President Emmerson Mnangagwa signed the deal in 2023, it still requires parliamentary ratification to come into force. Deputy Minister of Foreign Affairs and International Trade, Sheila Chikomo, brought the memorandum before Parliament seeking approval for the Agreement on the Promotion and Reciprocal Protection of Investments between the two countries.\n\nChikomo urged lawmakers to ratify the agreement by May 31, 2025, claiming it would enhance Zimbabwes appeal to foreign investors and foster economic development.\n\nThe agreement is intended to secure and protect investments from both countries, and to provide a framework for mutual economic cooperation, she said.\n\nA parliamentary foreign affairs committee also recommended the deals approval, arguing it would support sustainable development and strengthen bilateral ties.\n\nHowever, CCC legislators expressed deep skepticism, with one MP stating that the timing of the agreements presentation to Parliament was suspicious.\n\nThe coincidence of the minister bringing this agreement before this August House was designed to be timed with the presidents official visit currently happening, the MP said.\n\nCritics pointed out the lack of clarity regarding the trade dynamics between Zimbabwe and Belarus, warning the agreement could be exploited by politically connected elites.\n\nWe also need to be worried when we end up having a trade agreement which can be manipulated and exploited by a few individuals who are connected, another MP added.\n\nAnother opposition MP criticized the imbalance in trade benefits, saying Zimbabwe would likely end up importing finished products such as tractors, while Belarus gained a foothold in local markets.\n\nMutsa Murombedzi, another CCC lawmaker, strongly cautioned against fast-tracking the deal without proper scrutiny.\n\nParliament should not become a rubber stamp for executive deals, Murombedzi said. Its a document that potentially grants disproportionate power to foreign capital with little accountability. I therefore call upon this house to defer the approval.\n\nThe backlash comes as President Mnangagwa continues a four-day state visit to Belarus, where he has signed several Memoranda of Understanding in areas such as health, agriculture, infrastructure, and economic cooperation.\n\nDespite the governments push to solidify ties with Minsk, the opposition remains firm that Parliament must conduct due diligence before endorsing such high-level international agreements.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition Members of Parliament from the Citizens Coalition for Change (CCC) have rejected a controversial investment agreement … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/mps-shoot-down-mnangagwa-belarus-deal/\">Continue reading<span class=\"screen-reader-text\"> \"MPs Shoot Down Mnangagwa Belarus Deal\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "Winky D Misguided by Poor Handlers: Chivayo Fires Shots at Dancehall Star…",
            "url": "https://www.zimeye.net/2025/05/18/winky-d-misguided-by-poor-handlers-chivayo-fires-shots-at-dancehall-star/",
            "content": "By A Correspondent\n\nControversial Zanu PF-linked businessman Wicknell Chivayo has stirred public debate once againthis time targeting award-winning dancehall icon Winky D, suggesting the artist is being led astray by poor handlers who are feeding him bad political advice.\n\nSpeaking in a social media post on Sunday, Chivayo addressed his alleged feud with the popular musician, claiming he has no personal issue with Winky D but believes those around him are the root of the tensions.\n\nI have never said handiterere music yaWinky, said Chivayo.\n\nHes a very good artist who commands a strong following. Problem nde yake hake aka tanga kundiimba iwe uno tenga butsu dzakawanda vamwe vasina sei?\n\nThe flamboyant businessmanknown for his lavish lifestyle and controversial statementshinted that Winky Ds past lyrics may have subtly criticized him for flaunting his wealth.\n\nIf he ever came and said, Mukoma wangu, we differ in our political party choice but please recognize my talent, ini hangu handina kana problem naye, Chivayo continued. His poor handlers are bad influence.\n\nThe comments have sparked backlash and debate across social media, with fans of the Gaffa President defending him as a socially conscious artist who speaks truth to power through his music. Others, however, echoed Chivayos sentiment that Winky Ds team may be pushing him toward unnecessary political controversy.\n\nWinky D has long been regarded as a fearless voice in Zimbabwean music, often using his lyrics to comment on corruption, inequality, and social injustice. However, his silence in response to these recent remarks has only added fuel to speculation about the state of his relationship with politically connected figures.\n\nAs tensions continue to simmer between influential voices in politics and the arts, this latest jab from Chivayo is unlikely to go unnoticed in Zimbabwes already heated cultural and political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF-linked businessman Wicknell Chivayo has stirred public debate once again—this time targeting award-winning dancehall icon … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/winky-d-misguided-by-poor-handlers-chivayo-fires-shots-at-dancehall-star/\">Continue reading<span class=\"screen-reader-text\"> \"Winky D Misguided by Poor Handlers: Chivayo Fires Shots at Dancehall Star…\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "We Are Not Your Toys, Opposition MP Tells Mnangagwa",
            "url": "https://www.zimeye.net/2025/05/18/we-are-not-your-toys-opposition-mp-tells-mnangagwa/",
            "content": "By A Correspondent\n\nCitizens Coalition for Change (CCC) legislator Mutsa Murombedzi has led a fierce pushback in Parliament against a proposed investment protection agreement between Zimbabwe and Belarus, warning that the deal would hand excessive power to foreign investors and turn Parliament into a mere rubber stamp.\n\nParliament should not become a rubber stamp for executive deals, Murombedzi said during debate in the National Assembly.\n\nThis is a document that potentially grants disproportionate power to foreign capital with little accountability. I therefore call upon this House to defer the approval.\n\nMurombedzis comments came amid growing resistance from CCC Members of Parliament, who have accused President Emmerson Mnangagwas administration of forcing through deals that lack transparency and primarily benefit politically connected elites.\n\nThe agreementinitially signed by Mnangagwa in 2023requires parliamentary ratification before it becomes legally binding. Deputy Minister of Foreign Affairs and International Trade, Sheila Chikomo, presented the memorandum to lawmakers, urging them to ratify it by May 31, 2025.\n\nThe agreement is intended to secure and protect investments from both countries, and to provide a framework for mutual economic cooperation, Chikomo said, arguing it would boost foreign investment and support Zimbabwes development agenda.\n\nA parliamentary foreign affairs committee also recommended its approval, claiming the agreement aligns with Zimbabwes economic priorities.\n\nBut opposition MPs remained unconvinced. One legislator accused the government of orchestrating the timing of the agreements presentation to coincide with Mnangagwas current state visit to Belarus.\n\nThe coincidence of the minister bringing this agreement before this August House was designed to be timed with the presidents official visit currently happening, the MP said.\n\nAnother opposition MP slammed the executives tactics: We are not your toys. Parliament must not be reduced to a rubber stamp for deals that benefit a politically connected elite.\n\nLawmakers also expressed concern about the lack of detailed trade information and warned that Zimbabwe risked becoming a dumping ground for Belarusian finished products like tractors.\n\nWe also need to be worried when we end up having a trade agreement which can be manipulated and exploited by a few individuals who are connected, one MP said.\n\nThe debate comes as Mnangagwa continues his four-day visit to Belarus, where he has overseen the signing of several Memoranda of Understanding in sectors including agriculture, infrastructure, health, and economic development.\n\nDespite the executives push to deepen relations with Belarus, CCC MPs have vowed to block any international agreements that bypass proper scrutiny and compromise Zimbabwes sovereignty and public interest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Citizens Coalition for Change (CCC) legislator Mutsa Murombedzi has led a fierce pushback in Parliament against a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/we-are-not-your-toys-opposition-mp-tells-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Not Your Toys, Opposition MP Tells Mnangagwa\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "Gayton McKenzie Orders Mass Purge of Foreign Workers Ignoring Huge Damage To Economy",
            "url": "https://www.zimeye.net/2025/05/18/gayton-mckenzie-orders-mass-purge-of-foreign-workers-ignoring-huge-damage-to-economy/",
            "content": "Pretoria  Sunday, 18 May 2025\n\nBy Dorrothy Moyo |\n\nSouth Africa, once Africas largest and most industrialised economy, has now slipped to fourth place  overtaken by Nigeria, Egypt, and Kenya  marking a dramatic reversal from its leading position in 1995. Economists and policy analysts attribute the sustained decline to a toxic combination of populist labour policies, deteriorating investor confidence, and hostile approaches toward foreign labour participation.\n\nOne of the critical factors has been aggressive political attacks on foreign professionals and skilled workers, particularly in sectors like mining, ICT, manufacturing, and finance. Over the past two decades, successive administrations  under mounting pressure from nationalist movements  increasingly enforced rigid local labour quotas, often at the expense of business continuity and specialised expertise.\n\nForeign talent, once a cornerstone of South Africas global competitiveness, was systematically pushed out under the guise of protecting local jobs. As a result, companies faced skills shortages, stalled innovation, and began relocating operations to more welcoming environments across the continent.\n\nThese labour protectionist policies were not matched with education and training reform, leaving a gap in critical capabilities across key industries. Combined with power cuts, corruption, and policy uncertainty, South Africas GDP growth stagnated while others surged ahead.\n\nThe economic fallout is stark:\n\nSouth Africas drop to the fourth-largest economy is symbolic of a broader structural failure. Analysts warn that unless the government rethinks its hostile stance on foreign staffing and rebuilds investor trust, the country risks falling further behind in Africas economic race.\n\nBut South Africas Minister of Sports, Arts and Culture, Gayton McKenzie, has triggered national debate and diplomatic concern after launching an explosive tirade demanding the immediate dismissal of all foreign workers from the Department and its entities  unless they possess special skills.\n\nSpeaking to top officials in a fiery address, McKenzie declared that no foreign national without a special skill would be allowed to work in the Department of Sports, Arts and Culture during his tenure, insisting that all such posts must be given to unemployed South Africans.\n\nThey must go, and you must replace them with South Africans. Even if it means the CEOs have to go so we can put CEOs that love South Africans. Nothing occupies my mind for the next three weeks like the foreigners working in your department. I want them out. I said it. I want them out. Get them out before I get you out, McKenzie said, visibly angry.\n\nHe continued:\n\nSouth Africas got the highest unemployment rate. Children and adults are committing suicide because they cant get jobs. Unemployment has the potential of causing massive riots in this country. And some of you have the audacity to hire foreigners instead of South Africans.\n\nMcKenzies remarks come just weeks after his appointment and have drawn comparisons to xenophobic rhetoric, with some officials warning of legal and diplomatic repercussions. However, the Minister dismissed such concerns:\n\nIt is not xenophobic. You are not a chairperson in Zimbabwe. You are not a chairperson in Angola. You can go to those countries and tell me if you find a South African working there without a special skill. We must leave this self-hate of our people.\n\nHe added that no one in the room had a special skill that couldnt be found locally and accused some of sabotaging unemployed citizens:\n\nImagine if somebody had given your job to a foreigner. Nobody in this room has a special skill. But you have a job. Why do you deny that same opportunity to South Africans?\n\nMcKenzie also read a message from a South African jobseeker who was allegedly sidelined in favor of a foreign national after an interview in 2021, using it as an example of systemic bias against locals.\n\nSome of you that hire foreigners will be gone in four weeks. I promise you that. Because South Africans are jobless. And if I have to choose between stopping this audit and keeping my job, I will resign.\n\nHe announced a five-week deadline for CEOs, boards, and chairpersons to remove all ineligible foreign workers:\n\nGo and get your house in order because the storm is coming. Youll receive letters tomorrow. Most of your entities have illegal foreigners. It stops today. Fix that thing. Because Im coming for you if you dont.\n\nMcKenzies comments have reignited long-standing tensions over immigration, job scarcity, and economic inequality. Human rights organisations are expected to respond in the coming days.\n\nBackground: Convicted Criminal Turned Cabinet Minister\n\nBefore entering politics, Gayton McKenzie was a convicted criminal who served over 10 years in prison for armed robbery and other offences. While incarcerated, he became a whistleblower, exposing widespread corruption in South African prisons, which eventually led to his early release.\n\nHis political career began with the founding of the Patriotic Alliance (PA), a party known for its populist and nationalist stance. Despite a checkered past, McKenzie rose to prominence as mayor of the Central Karoo District before being appointed as Minister in 2024.\n\nThis latest development may cement McKenzies status as one of the most controversial ministers in South Africas post-apartheid era.\n\nMore updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Pretoria – Sunday, 18 May 2025 By Dorrothy Moyo | South Africa, once Africa’s largest and most industrialised economy, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/gayton-mckenzie-orders-mass-purge-of-foreign-workers-ignoring-huge-damage-to-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Gayton McKenzie Orders Mass Purge of Foreign Workers Ignoring Huge Damage To Economy\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "Zanu PF Masvingo Councillor Demands Apology From Jah Prayzah For Abusing Masowe Song",
            "url": "https://www.zimeye.net/2025/05/18/zanu-pf-masvingo-councillor-demands-apology-from-jah-prayzah-for-abusing-masowe-song/",
            "content": "By A Correspondent\n\nZanu PF Councillor Sengerai Manyanga has lashed out at popular musician Jah Prayzah, accusing him of desecrating a sacred Johane Masowe Apostolic song in one of his recent studio productions.\n\nManyanga, who represents a Masvingo ward and identifies as a devout member of the Johane Masowe sect, said he was deeply offended by Jah Prayzahs rendition of Hosanna, a revered hymn traditionally used in prayer.\n\nJah Prayzah ngaakumbire ruregerero kuMweya Mutsvene nekuJohani Masowe dzese, Manyanga said. Akaresvera ngirozi  kuimba Hosanna muStudio here shuwa? Kuridzira Hosanna mbira, magitare neKutamba Muchongoyo paHosanna mukuru here?\n\n(Translation: Jah Prayzah must apologize to the Holy Spirit and to all Johane Masowe churches. He disrespected the angels  how can he sing Hosanna in a studio? Playing Hosanna with mbira, guitars, and dancing Muchongoyo to it  is that proper?)\n\nHe further demanded that the song be removed from all platforms, describing it as a spiritual violation.\n\nAnofanira kudzima zvaakaita. Hosanna mumamato. (He must take down what he did. Hosanna is for prayer.)\n\nManyangas comments come amid growing debate on social media, where opinions are split between those who view Jah Prayzahs song as artistic expression and those who see it as a profanation of sacred content.\n\nAs of now, Jah Prayzah has not publicly responded to the accusations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Councillor Sengerai Manyanga has lashed out at popular musician Jah Prayzah, accusing him of desecrating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/zanu-pf-masvingo-councillor-demands-apology-from-jah-prayzah-for-abusing-masowe-song/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Masvingo Councillor Demands Apology From Jah Prayzah For Abusing Masowe Song\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "Chivayo Says I Am Extremely Peaceful With My Money And My Extremely Huge Belly I’m Flapping",
            "url": "https://www.zimeye.net/2025/05/18/chivayo-says-i-am-extremely-peaceful-with-my-money-and-my-extremely-huge-belly-im-flapping/",
            "content": "Belly of the Beast: Wicknell Chivayo Flaunts Bloated Wealth in Shameless Power Pose\n\nBy Dorrothy Moyo | HARARE  In a brazen display of state-enabled arrogance, convicted fraudster and self-styled tenderpreneur Wicknell Chivayo has taken to social media to show off his bloated belly  both figuratively and literally  while announcing hes achieved extreme peace.\n\nClad in black designer loungewear emblazoned with the word fichetta, Chivayo poses proudly with his belly pushed out and chest high beside his ultra-luxury Rolls Royce, grinning with theatrical satisfaction. His post, dripping with sarcasm and contempt, declares hes unbothered by being called corrupt  instead, he celebrates it.\n\nYes yes indeed you are absolutely right, he writes mockingly. Then I just jump into one of my ROLLS ROYCE V12 or the full ELECTRIC one The next morning Im sitting in my PRIVATE JET going to have calamari & prawns for lunch in Mozambique and back in the evening\n\nBut its the visual symbolism of his belly thats causing a stir.\n\nAnalysts say Chivayos exaggerated physical posture is no accident  its political theatre. The inflated stomach, protruding with pride, acts as a metaphor for his gluttonous accumulation of wealth in a country where millions cant afford a loaf of bread.\n\nThe belly is a message, one political analyst noted. Hes saying: Ive eaten, and theres nothing you can do about it.\n\nChivayos choice of the word peaceful paired with images of cars worth millions and a private jet further reveals a disconnect from the lived reality of Zimbabweans. While civil servants beg for raises, hospitals crumble, and students go without textbooks, Chivayo gleefully announces, THE WORLD IS NOT KIND TO THE POOR  with emojis, for emphasis.\n\nWhats more disturbing is the silence from state leaders and spiritual figures like Apostle Eunor Guti, who has refused to publicly rebuke Chivayo despite receiving lavish gifts from him. Her Sunday sermon instead focused on telling church members to stay in church  while ignoring the gospel duty to speak truth to corrupt power.\n\nChivayo, with his belly as billboard, is not just bragging  hes taunting. His message is clear: I am untouchable.\n\nIn a nation looted into collapse, his stomach has become the altar of power  swollen not by grace, but by greed.\n\nAnd Zimbabwe watches, hungry.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "“Belly of the Beast”: Wicknell Chivayo Flaunts Bloated Wealth in Shameless Power Pose By Dorrothy Moyo | HARARE – In … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/chivayo-says-i-am-extremely-peaceful-with-my-money-and-my-extremely-huge-belly-im-flapping/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Says I Am Extremely Peaceful With My Money And My Extremely Huge Belly I’m Flapping\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        },
        {
            "title": "Fresh Details On Harare Monya Tregic Death",
            "url": "https://www.zimeye.net/2025/05/18/fresh-details-on-harare-monya-tregic-death/",
            "content": "By Showbiz Reporter-Zimbabwes fitness community is in deep mourning following the tragic death of popular fitness instructor and martial arts trainer, Sensei Mugove. The well-known health and wellness advocatereal nameMugove Muhambidied Saturday morning in a fatal head-on collision alongBorrowdale Roadin Harare.\n\nNews of his sudden passing has sent shockwaves across social media, with tributes pouring in from fans, public figures, and fellow fitness professionals. Affectionately known asSensei Mugo,he was admired across the country for his tireless efforts to promote fitness and healthy living through boot camps, personal training, and karate lessons for both children and adults.\n\nSensei Mugove was more than just a trainerhe was a mentor, motivator, and community pillar. His passion for physical fitness and mental discipline touched countless lives. Whether leading a weekend boot camp or instructing a class of young martial artists, he brought energy, compassion, and unwavering commitment to his work.\n\nAcross Zimbabwe, people from all walks of life have taken to social media to share their grief and pay tribute.\n\nUrban grooves artistTrevor Dongoalso expressed his devastation, writing that he was shattered and at a loss for words. His post reflected the pain felt by many who had been inspired by Sensei Mugoves positivity and determination.\n\nSensei Mugove was a regular fixture at fitness events in Harare and beyond, where he inspired hundreds with his infectious enthusiasm and powerful discipline. He built a strong following both online and in person, encouraging Zimbabweans to embrace healthier lifestylesphysically, mentally, and emotionally.\n\nHis death leaves a profound void in the fitness and martial arts community, where he was regarded not only for his skill and expertise but also for his kindness and generosity.\n\nAs tributes continue to flood in, Sensei Mugove will be remembered not only for his physical strength, but for the strength of spirit that uplifted so many.\n\nFuneral arrangements are yet to be announced.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Zimbabwe’s fitness community is in deep mourning following the tragic death of popular fitness instructor and martial arts … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/18/fresh-details-on-harare-monya-tregic-death/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh Details On Harare Monya Tregic Death\"</span></a></p>",
            "time": "06:42",
            "date": "19 May 2025"
        }
    ]
}