{
    "news": [
        {
            "title": "Chamisa Poster Shakes Zanu PF",
            "url": "https://www.zimeye.net/2025/07/13/chamisa-poster-shakes-zanu-pf/",
            "content": "By A Correspondent-Zanu PFs candidate in the upcoming Chikomba Ward 10 by-election, Tafadzwa Mukandi, has filed a complaint with the Zimbabwe Electoral Commission (Zec), accusing independent rival Tawanda Muchenje of misleading voters by using Nelson Chamisas image on campaign posters.\n\nThe July 26 by-election follows the death of Citizens Coalition for Change (CCC) councillor Amos Reza in a motorbike accident last month. Muchenjes posters feature both Chamisa and the late Rezaan approach Mukandi condemned as deceptive and politically opportunistic.\n\nMukandi raised the issue during a multi-party liaison meeting chaired by Zec in Chikomba, arguing that an independent candidate should not campaign using images of known political figures.\n\nIf he is truly independent, he should use his own picture, not ride on the popularity of others, Mukandi said. This confuses voters into thinking he is endorsed by Chamisa or CCC, which is false.\n\nThe incident reflects a growing trend where former CCC candidates, recalled during the 2023 factional fallout instigated by self-proclaimed secretary-general Sengezo Tshabangu, continue to identify with Chamisas image and political vision in their independent bids.\n\nIronically, Tshabangu himself has used Chamisas image in party communicationsdespite having dislodged him from the CCC leadership.\n\nMuchenjes campaign manager, Emmanuel Punungwe, dismissed the complaint, saying candidates can use various strategies to appeal to voters. Zec district officer Todd Chibengwa said the commission received no formal complaint and does not regulate campaign content unless it violates electoral laws.\n\nMukandi, who lost to Reza in the 2023 general election, is contesting the seat for the third time, having won it in a 2022 by-election.\n\nZec maintained that only those whose images are being used have the right to raise objections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Zanu PF’s candidate in the upcoming Chikomba Ward 10 by-election, Tafadzwa Mukandi, has filed a complaint with the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/chamisa-poster-shakes-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Poster Shakes Zanu PF\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "“Esther Drops Bombshell: Lungu Was Banned from Leaving Zambia the Same Month He Travelled to Zimbabwe to Inaugurate Mnangagwa”",
            "url": "https://www.zimeye.net/2025/07/13/esther-drops-bombshell-lungu-was-banned-from-leaving-zambia-the-same-month-he-travelled-to-zimbabwe-to-inaugurate-mnangagwa/",
            "content": "By A Correspondent | 13 July 2025\n\nIn a dramatic court filing before the South African High Court, former First Lady Esther Lungu has exposed a staggering contradiction: her husband, the late President Edgar Lungu, was officially blocked from travelling out of Zambia for medical treatment at the exact same time he was freely allowed to fly to Zimbabwe to attend Emmerson Mnangagwas controversial post-election inauguration.\n\nThe revelation came as part of a legal battle between the Lungu family and the Zambian Government over the burial arrangements for the late former President, who died of terminal oesophageal cancer in South Africa on 5 June 2025.\n\nEsther Lungu submitted that on 7 September 2023, Deputy Secretary to the Cabinet Dr Oliver Kalabo wrote to the former President refusing him permission to travel to South Africa for specialist medical reviewspermission that could have allowed for potentially life-saving surgery.\n\nYet, despite this official denial, Mr Lungu flew to Harare later that same month to attend the inauguration of Zimbabwes President Emmerson Mnangagwa, following a disputed election marred by regional outcry and allegations of fraud.\n\nHad the late President Lungu been afforded the opportunity to consult with doctors during 2023, or at the latest early 2024, they would in all probability have been able to remove the tumour timeously, Mrs Lungu submitted. Unfortunately, due to the delayed access, the tumour had progressed to an inoperable stage.\n\nThe former First Lady argues that the denial of travel for medical treatment in 2023 contributed to the fatal progression of Mr Lungus illness, ultimately leading to his death under palliative care in a Johannesburg hospital.\n\n Travel Ban Exposed\n\nThe explosive detail raises serious questions about how and why Mr Lungu was restricted from seeking medical help abroad while being simultaneously permitted to undertake political travel across borders.\n\nThe court has now been presented with two conflicting actions by the Zambian government in the space of weeks:\n\nLegal observers say this inconsistency may raise constitutional questions about selective enforcement of travel restrictions on former heads of state.\n\n Burial Tug-of-War\n\nThe new disclosures come amid a court showdown in South Africa, where Zambias Attorney General Mulilo Kabesha is seeking to compel the return of Edgar Lungus remains for a state funeral.\n\nBut Esther Lungu argues the application is legally unsustainable under South African law and that the state has no jurisdiction over burial rights on foreign soil.\n\nThe applicant has no legal standing or enforceable right in South African law to compel the repatriation, she insists.\n\nThe Lungu family prefers a private burial in South Africa, citing both Mr Lungus medical journey and ongoing tensions with the Zambian state.\n\nMrs Lungu insists that South African law must take precedence, and in the absence of explicit written instructions from Mr Lungu regarding burial, the next of kinherselfhas the legal right to decide.\n\n TAKEAWAYS:\n\n DEVELOPING\n\nMore revelations are expected as the court proceedings continue in Johannesburg. Questions remain over why medical access was denied to a former head of state while political travel was facilitated  and whether political motives played a role in the decisions that may have cost Edgar Lungu his life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | 13 July 2025 In a dramatic court filing before the South African High Court, former First … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/esther-drops-bombshell-lungu-was-banned-from-leaving-zambia-the-same-month-he-travelled-to-zimbabwe-to-inaugurate-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"“Esther Drops Bombshell: Lungu Was Banned from Leaving Zambia the Same Month He Travelled to Zimbabwe to Inaugurate Mnangagwa”\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "Ramaphosa places Mchunu on paid leave",
            "url": "https://www.zimeye.net/2025/07/13/ramaphosa-places-mchunu-on-paid-leave/",
            "content": "Breaking News\n\nPresident Ramaphosa establishes commission of inquiry to probe the allegations made by General Mkhwanazi.\n\nCommission will be led by acting deputy chief Justice Madlanga..\n\nInterim report expected within 3 to 6 months\n\nSenzo Mchunu placed on special leave.\n\nLawyer and member of ANC member Firoz Cachalia will be acting Police Minister..\n\nPresident Cyril Ramaphosa has placed Police Minister Senzo Mchunu on special leave, following explosive allegations of political interference and links to organised crime.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Breaking News President Ramaphosa establishes commission of inquiry to probe the allegations made by General Mkhwanazi. Commission will be led … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/ramaphosa-places-mchunu-on-paid-leave/\">Continue reading<span class=\"screen-reader-text\"> \"Ramaphosa places Mchunu on paid leave\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "Two Zimbos Die In Car Crash On Their Way to Jah Prayzah Concert",
            "url": "https://www.zimeye.net/2025/07/13/two-zimbos-die-in-car-crash-on-their-way-to-jah-prayzah-concert/",
            "content": "OTTAWA, Canada  Two Zimbabwean nationals based in Canada, Anotida Maziriri and Edmore Mafuwe, tragically lost their lives in a fatal car crash in Edmonton on Saturday night.\n\nAccording to preliminary reports, the pair was travelling to attend the Ndini Mukudzeyi concert by popular Zimbabwean musician Jah Prayzah when their vehicle reportedly failed to negotiate a curve, leading to a fatal accident. Both men died on the spot.\n\nThe tragic incident has sent shockwaves through the Zimbabwean diaspora community in Canada, with tributes pouring in on social media as friends and family mourn the untimely loss.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "OTTAWA, Canada – Two Zimbabwean nationals based in Canada, Anotida Maziriri and Edmore Mafuwe, tragically lost their lives in a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/two-zimbos-die-in-car-crash-on-their-way-to-jah-prayzah-concert/\">Continue reading<span class=\"screen-reader-text\"> \"Two Zimbos Die In Car Crash On Their Way to Jah Prayzah Concert\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "Machacha Throws Tagwirei Under the Bus as ZANU PF Factions Clash Over Central Committee Imposition",
            "url": "https://www.zimeye.net/2025/07/13/machacha-throws-tagwirei-under-the-bus-as-zanu-pf-factions-clash-over-central-committee-imposition/",
            "content": "By A Correspondent-ZANU PF Political Commissar Munyaradzi Machacha has  distanced the party leadership from the controversial co-option of President Emmerson Mnangagwas close business ally, Kudakwashe Tagwirei, into the ruling partys Central Committeedescribing him as nothing more than a party supporter.\n\nIn a heated interview withZimEyes Simba Chikanza, Machacha struggled to justify Tagwireis elevation, amid allegations of unconstitutional procedures and deep factional rifts between the Mnangagwa and Constantino Chiwenga camps.\n\nTagwireis appointment has sparked outrage both within the party and among the public, with critics accusing Mnangagwa of using ZANU PF structures to entrench his personal and business interests. The controversial businessmanwidely regarded as Mnangagwas financial enabler and frontman in opaque fuel deals and state tenderswas co-opted by Harare Province into the Central Committee, bypassing the constitutional requirement for long-standing and active membership.\n\nWhen pressed on the basis of Tagwireis co-option, Machacha deflected:\n\nHe has been a supporter of the party for many years; standing with the party through thick and thin he fought hard to make sure the economy stabilises, Machacha said.\n\nHowever, Chikanza challenged Machacha, citing ZANU PFs constitution and an internal circular dated 5 June 2025, which stipulates minimum qualifications for Central Committee appointmentsincluding demonstrable leadership service and structural membership. Machacha refused to acknowledge the document, dismissing it as from your own head, and failed to clarify whether Tagwirei met any formal party criteria beyond informal support.\n\nThe controversy has reignited internal tensions in ZANU PF, with speculation rife that Tagwireis forced inclusion was orchestrated by Mnangagwa loyalists and resisted by members aligned with Vice President Chiwenga. Chikanza hinted at previous incidents in which Tagwirei was ejected from party meetings and suggested that his presence in formal structures continues to provoke disquiet in the Chiwenga faction.\n\nWhen asked directly if Chiwenga opposed Tagwireis inclusion, Machacha claimed ignorance:\n\nMyself I am not aware that he is opposing he has not disclosed such to us. You seem to know so much better than us.\n\nThe interview ended abruptly after Machacha failed to answer questions about whether the party was circumventing its own constitutional processes to protect Mnangagwas business cronies.\n\nTagwireis entry into the Central Committee comes as Zimbabwes political elite prepare for a possible ZANU PF elective congress, where control of strategic party organs will be crucial in the succession battles unfolding behind closed doors. His presence is widely seen as an extension of Mnangagwas grip on the partyprovoking resistance from factions who view the businessmans influence as toxic to party unity and democratic procedures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-ZANU PF Political Commissar Munyaradzi Machacha has distanced the party leadership from the controversial co-option of President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/machacha-throws-tagwirei-under-the-bus-as-zanu-pf-factions-clash-over-central-committee-imposition/\">Continue reading<span class=\"screen-reader-text\"> \"Machacha Throws Tagwirei Under the Bus as ZANU PF Factions Clash Over Central Committee Imposition\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "Bosso back to winning",
            "url": "https://www.zimeye.net/2025/07/13/bosso-back-to-winning/",
            "content": "3points in the bag for Highlanders F.C\n\nFull time\n\nHighlanders 1-0 Green fuel\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "3points in the bag for Highlanders F.C Full time Highlanders 1-0 Green fuel",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "Chelsea, PSG Battle for Club World Cup Glory in New Jersey Showdown…",
            "url": "https://www.zimeye.net/2025/07/13/chelsea-psg-battle-for-club-world-cup-glory-in-new-jersey-showdown/",
            "content": "By A Correspondent\n\nEast Rutherford, New Jersey  All eyes will be on MetLife Stadium this Sunday as Chelsea and Paris Saint-Germain lock horns in the final of the inaugural expanded FIFA Club World Cup, with both Enzo Maresca and Luis Enrique aiming to cap their 2024-25 campaigns in style  and send an early warning to Europe ahead of the new season.\n\nIts more than just silverware on the line. For Maresca, its a chance to stamp his authority on the Chelsea project with a major international trophy just months into his tenure. For Enrique, the final offers the opportunity to showcase PSGs evolution beyond the Kylian Mbappe era and prove that Les Parisiens remain a global force.\n\nThe tactical duel between the two managers promises to be a fascinating one. Both teams have found form at the right time, and each coach will look to exploit key matchups and assert dominance in midfield.\n\nChelsea Predicted XI:\n\nWith Noni Madueke absent, Maresca is expected to keep things simple. Reece James is likely to start over Malo Gusto, while Trevoh Chalobah may get the nod ahead of Tosin Adarabioyo to partner Levi Colwill in defense.\n\nMoises Caicedo has reportedly passed a late fitness test and should join Enzo Fernandez in midfield.\n\nOne possible surprise? A double-striker setup featuring Joao Pedro and Liam Delap, with Pedro Neto operating from the right and Joao Pedro shifting left.\n\nPredicted Line-up:Sanchez; James, Chalobah, Colwill, Cucurella; Caicedo, Fernandez; Neto, Palmer, Joao Pedro; Delap\n\nPSG Predicted XI:\n\nLuis Enrique is expected to stick with his strongest lineup, having found a settled starting XI in recent weeks. The trio of Bradley Barcola, Ousmane Dembele, and Khvicha Kvaratskhelia have terrorized defenses, while Vitinha, Neves, and Ruiz bring balance to midfield.\n\nPredicted Line-up:Donnarumma; Hakimi, Beraldo, Marquinhos, Mendes; Vitinha, Neves, Ruiz; Doue, Dembele, Kvaratskhelia\n\nAs anticipation builds for this historic final, the stage is set for either Maresca or Enrique to make a defining statement  and to claim the first Club World Cup title of the new era.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent East Rutherford, New Jersey – All eyes will be on MetLife Stadium this Sunday as Chelsea and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/chelsea-psg-battle-for-club-world-cup-glory-in-new-jersey-showdown/\">Continue reading<span class=\"screen-reader-text\"> \"Chelsea, PSG Battle for Club World Cup Glory in New Jersey Showdown…\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "UK Judge: Olinda Chapel Unfairly Fired Worker After Complaining About Tytan’s Se***l Comments",
            "url": "https://www.zimeye.net/2025/07/13/uk-judge-olinda-chapel-unfairly-fired-worker-after-complaining-about-tytans-sel-comments/",
            "content": "By A Correspondent\n\nReading, UK  July 13, 2025\n\nA 30-year-old manager has won a landmark unfair dismissal case after she was abruptly fired just two days after accusing her bosss husband of sexual misconduct, a tribunal has ruled.\n\nAmber Stoter, a former employee of Gain Healthcare, told the Reading Employment Tribunal that she was stunned and devastated when CEO Olinda Chapel-Nkomo terminated her employment a mere 48 hours after she raised a formal complaint.\n\nAccording to tribunal documents, Ms Stoter alleged that Tytan Nkomohusband to Mrs Chapel-Nkomomade repeated inappropriate remarks toward her, including calling her my property and my girlfriend. In one documented incident, after she posted a work-related photo captioned working hard in the sun, Mr Nkomo replied:\n\nThats not the only thing you make go hard.\n\nMs Stoter reported the behaviour, expecting a professional resolution. Instead, the tribunal heard, she was called into a sudden meeting with Mrs Chapel-Nkomo and fired.\n\nIn its ruling, the tribunal found that the CEO viewed the complaint as a problem rather than addressing it with the seriousness it deserved. The dismissal, it concluded, was retaliatory and unlawful.\n\nThe dismissal was not only procedurally flawed but motivated by a desire to silence a complaint, the tribunal judge wrote.\n\nMs Stoter is now set to receive financial compensation for unfair dismissal, and she told reporters outside the tribunal:\n\nI stood up to protect myself from sexual harassment, and I was punished for it. Todays ruling proves that women deserve to be heard and protectednot fired.\n\nThis ruling comes just days after Mrs Chapel-Nkomo publicly announced she was walking away from her marriage with Tytan, calling the decision extremely heavy and brokenhearted, and accusing her husband of actions deemed unforgivable.\n\nWhile the couples personal drama has played out on social media, the tribunals decision now places a professional scandal squarely in the public spotlight, raising questions about workplace ethics and abuse of power in leadership roles.\n\nGain Healthcare has not yet responded to requests for comment.\n\nRELATED\n\nStory developing\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Reading, UK – July 13, 2025 A 30-year-old manager has won a landmark unfair dismissal case after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/uk-judge-olinda-chapel-unfairly-fired-worker-after-complaining-about-tytans-sel-comments/\">Continue reading<span class=\"screen-reader-text\"> \"UK Judge: Olinda Chapel Unfairly Fired Worker After Complaining About Tytan’s Se***l Comments\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "ZRP Officer Among Armed Robbers in Violent Gold Mine Heist in Mbire",
            "url": "https://www.zimeye.net/2025/07/13/zrp-officer-among-armed-robbers-in-violent-gold-mine-heist-in-mbire/",
            "content": "By A Correspondent\n\nMbire, Zimbabwe  A member of the Zimbabwe Republic Police (ZRP) is among ten suspects arrested for a daring armed robbery at MMC Mining Syndicate along the Katope River in Mbire, Mashonaland Central, in a case that has shocked authorities and the public alike.\n\nAccording to a police memorandum dated 11 July 2025, the suspectssome clad in full police uniform and armed with AK-47 riflesstormed the gold mine on the night of 9 July under the pretense of conducting official investigations.\n\nAt around 2000 hours, a vehicle approached the mine. Chadamoyo Rugwaja, the mine security officer, confronted the occupants. One of the men, dressed in full police uniform, claimed they were officers on official inquiry and demanded that all workers be gathered in one place, reads part of the police memo.\n\nThe gang, which included armed men and others in civilian clothing, rounded up the workers and demanded cash and gold from mine employee Chimanga, who handed over US$5,000 and 15 grammes of amalgamated gold under duress.\n\nThey then abducted two complainants, loaded approximately 50 kilogrammes of gold-laced carbon into a Honda Fit, and attempted to flee. A female mine worker managed to escape and alerted mine manager Bernard Arikadara, who quickly organised a pursuit.\n\nMine workers intercepted one of the gangs getaway vehicles, prompting three of the robbers to flee into nearby bushland. Another vehicle later arrived, and one of the suspects fired seven rounds, deflating two tyres on the pursuers vehicle and forcing them to abandon the chase.\n\nThe robbers eventually dumped the two abducted workers at Masoka turn-off before fleeing toward Mushumbi Pools. A police reaction team later intercepted one of the gangs vehicles on the Mushumbi-Kanyemba road. The suspects escaped on foot, abandoning the car with the keys still in the ignition.\n\nFurther investigations led to the arrest of Tawanda Chihwani, a serving member of the ZRP Support Unit. Chihwani is accused of stealing two AK-47 rifles and full police regalia from the New Parliament Support Unit base in Harare.\n\nHe later led investigators to a bushy area in Nyamhara Village, Chief Chitsungos area, where weapons, uniforms, nine stolen mobile phones, sacks of gold carbon, explosives, and other police-issued items were recovered. Also recovered were identity documents, a spent cartridge from the robbery, and 74 EMEX explosives.\n\nAuthorities say the total value of stolen property is estimated at US$7,650, with around US$1,000 worth recovered. A .303 rifle taken from the mine remains missing. Two Honda Fit vehicles used in the robbery were also recoveredone abandoned and extensively damaged by mine workers.\n\nPolice confirmed that several suspects remain at large, and efforts are ongoing to recover the remaining stolen property and apprehend the fugitives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mbire, Zimbabwe – A member of the Zimbabwe Republic Police (ZRP) is among ten suspects arrested for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/zrp-officer-among-armed-robbers-in-violent-gold-mine-heist-in-mbire/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Officer Among Armed Robbers in Violent Gold Mine Heist in Mbire\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        },
        {
            "title": "ZANU PF Commissar Admits Tagwirei Is Just A Supporter, Nothing More | FULL INTERVIEW",
            "url": "https://www.zimeye.net/2025/07/13/zanu-pf-commissar-admits-tagwirei-is-just-a-supporter-nothing-more-full-interview/",
            "content": "ZANU PF National Political Commissar Munyaradzi Machacha has announced saying the tenderpreneur, Kuda Tagwirei is nothing else beyond a party supporter.\n\nHe was speaking to ZimEyes Simba Chikanza when he said Tagwirei is a member and supporter. The following was the interview-\n\nChikanza: Sorry Comrade Machacha Ive woken you up. I wanted to ask you, on what basis you co-opting Mr Tagwirei, is it because of the car that you got?\n\nMachacha: who am I talking to who is talking nonsense?\n\nChikanza: youre talking with Simba Chikanza from ZimEye, you are co-opting him when it is not constitutional in the party called ZANU PF.\n\nMachacha: He was co opted, by Harare Province, if they choose the person that they want who are you to say he mustnt be co-opted?\n\nChikanza: But the documents (and the constitution )?of ZANU PF does not allow this.\n\nMachacha: Are you the one who now explains the constitution of ZANU PF, while you are ZimEye?\n\nChikanza: but it is written down.\n\nMachacha: Where?\n\nChikanza: It is written down.\n\nMachacha: Where?\n\nMachacha: Show me the records you keep referring to while failing to show me.\n\nChikanza: I am giving you. What about General Chiwenga; is he not opposing?\n\nMachacha: Ahh.\n\nChikanza: Yes I am not as ZANU PF person, what of Gen Chiwenga?\n\nMachacha: Myself I am not aware that he is opposing, he has not disclosed such to us. You seem to know so much better than us.\n\nChikanza: why was Tagwirei removed from the meeting last time?\n\nMachacha: because there is a date that has been set to do that.\n\nChikanza: Aaah Cde Machacha- 5 June 2025.\n\nMachacha: you are now knowing ZANU pf better than others.\n\nChikanza: Aah Cde Machacha, circular to all ZANU PF provinces,\n\nMachacha: when the process is done, it shall be told.\n\nChikanza: Cde Machacha, I have sent you documents, 5 June, qualifications for appointment to the central committee.\n\nMachacha: that is from your own head all that there is nothing like that.\n\nChikanza: are you telling me that this document is fake?\n\nMachacha: Which one?\n\nChikanza: this one which is instructing that these requirements need to be adhered to, of membership.\n\nMachacha: So who told you they not been adhered to?\n\nChikanza: What else has he been except that cell membership that you have been describing?\n\nMachacha: What did you say?\n\nChikanza: I said beyond that membership that you once said that he was a cell member of Borrowdale .\n\nMachacha: he has been a supporter of the party for many years; standing with the party through thick and thin in very difficult times when some of you were calling for sanctions, he fought hard to make sure the economy stabilises. So.\n\nChikanza: so all a person needs to enter is to become a supporter? So all some of us need to do is to just become supporters and we have entered the structures soon after that?\n\nPHONE CUT\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ZANU PF National Political Commissar Munyaradzi Machacha has announced saying the tenderpreneur, Kuda Tagwirei is nothing else beyond a party … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/13/zanu-pf-commissar-admits-tagwirei-is-just-a-supporter-nothing-more-full-interview/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Commissar Admits Tagwirei Is Just A Supporter, Nothing More | FULL INTERVIEW\"</span></a></p>",
            "time": "06:31",
            "date": "14 Jul 2025"
        }
    ]
}