{
    "news": [
        {
            "title": "Original ZAPU urges government to sincerely work on Matabeleland roads",
            "url": "https://www.zimeye.net/2025/08/19/original-zapu-urges-government-to-sincerely-work-on-matabeleland-roads/",
            "content": "Original ZAPU (O-ZAPU) has urged the government to complete the rehabilitation of Nkayi, Victoria Falls Roads and all roads in Matabeleland region.\n\nO-ZAPU said that for years since the early 80s the Nkayi, Matopo, Tsholotsho and Victoria Falls roads rehabilitation have been a cause for concern for Matebeleland people.In a statement, O- ZAPU said Nkayi , Beitbridge, Tsholotsho and Binga residents decried the roads rehabilitation and government only pretended to be fixing them during election time.This position made these communities think that government treated Matebeleland people as second class citizens which was highly unacceptable to them. When health and economic expects were asked to validate the concerns of the residents, the experts said that the residents concerns were real, pressing and had livelihoods and health implications. O- ZAPU said.\n\nO-ZAPU said the health experts across Matabeleland region have echoed the sentiments of the residents by saying the bad roads affected the physical health of the commuters and were notorious for causing accidents leading to injuries ranging from minor to trauma.They said that the commuters navigating these roads often suffered from back pain, spinal issues and posture related challenges due to the constant jolting and vibrations.In addition to that, bad roads led to bad cardiovascular health, hospitalization, disability and premature death. The need for constant attention to avoid potholes and unexpected obstacles could lead to increased stress and anxiety not only by the drivers but also by the passengers.The health experts said that well maintained roads could improve access to essential services like health care, education and employment opportunities for residents particularly ni the remote areas between Bulawayo -Nkayi and Bulawayo-Victoria Falls respectively.O-ZAPU said that the experts also said well maintained roads could reduce the risk of accidents and improve overall safety of drivers, passengers and pedestrians.The economic experts said that the rehabilitated roads could facilitate the movement of goods and services, potentially boosting local and regional trade and commerce .\n\nImproved infrastructure can attract new businesses and investments to the area, leading to economic growth and job creation.Road construction and maintenance of the roads can create jobs providing employment opportunities for local residents, O- ZAPU added.In some cases, good roads can help alleviate traffic congestion on existing routes improving traffic flow and reducing travel times.\n\nGood roads can improve access ot tourist destination, potentially boosting local tourism, industry and creating new opportunities for local businesses.\n\nArguments for lobbying to complete delaying road rehabilitation projects in Matebeleland range from an increase in road traffic accidents, unnecessary loss of life, reduced trade, high transportation costs, inaccessibility and poor quality of life for residents. Bad roads are therefore more than just a transportation issue but a significant public health concern that need ot be addressed. On the other hand, the rehabilitation of the Nkayi and Victoria Falls Road could include economic benefits like increased trade.Additionally, the rehabilitation of roads can stimulate local economies, create job and potentially attract new businesses.Currently, the government is working on Nkayi and Victoria Fall roads at a slow pace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Original ZAPU (O-ZAPU) has urged the government to complete the rehabilitation of Nkayi, Victoria Falls Roads and all roads in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/original-zapu-urges-government-to-sincerely-work-on-matabeleland-roads/\">Continue reading<span class=\"screen-reader-text\"> \"Original ZAPU urges government to sincerely work on Matabeleland roads\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "ZIFA Mourns Former Warriors Gunslinger Tendai Ndoro",
            "url": "https://www.zimeye.net/2025/08/19/zifa-mourns-former-warriors-gunslinger-tendai-ndoro/",
            "content": "By Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has expressed deep sorrow following the death of former Warriors striker Tendai Ndoro, describing him as one of the most talented forwards to don the national colors.\n\nIn a statement released on Tuesday, ZIFA said:The Zimbabwe Football Association is deeply saddened to learn of the untimely passing of former Warriors striker, Tendai Ndoro. Ndoro was a gifted forward who proudly represented our nation, donning the Warriors jersey with distinction. His talent, commitment, and passion for the game inspired many, and his contributions to Zimbabwean football will forever be remembered.\n\nNdoro, who also made his mark in South Africas Premier Soccer League, was widely admired for his sharp finishing and explosive style of play. He played for clubs including Orlando Pirates and Mpumalanga Black Aces, earning a reputation as a prolific goalscorer.\n\nZIFA added:On behalf of the ZIFA Executive Committee, the football family, and the entire nation, we extend our heartfelt condolences to Ndoros family, friends, and loved ones during this difficult time. May his soul rest in eternal peace.\n\nTributes have since poured in from across the football fraternity, with many describing Ndoro as not only a lethal striker but also a role model for aspiring players.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent The Zimbabwe Football Association (ZIFA) has expressed deep sorrow following the death of former Warriors striker Tendai … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/zifa-mourns-former-warriors-gunslinger-tendai-ndoro/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Mourns Former Warriors Gunslinger Tendai Ndoro\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "About Coccidiosis in Poultry",
            "url": "https://www.zimeye.net/2025/08/19/about-coccidiosis-in-poultry/",
            "content": "By Dr. Trywell Muzerengi\n\nTackling coccidiosis in poultry requires a combination of prevention, early detection, and treatment. Coccidiosis is a parasitic disease caused by Eimeria species, which infect the intestinal lining of birds, leading to poor growth, diarrhea (sometimes bloody), and, in severe cases, death. Heres how to manage it effectively:\n\n 1. Prevention (Best Approach)\n\nPreventing coccidiosis is far more effective than treating it. Focus on the following measures:\n\na. Maintain Good Hygiene and Biosecurity\n\nKeep litter dry: Coccidia thrive in warm, moist conditions.\n\nRegularly clean and disinfect feeders, drinkers, and equipment.\n\nAvoid overcrowding, as it increases stress and spreads infection faster.\n\nLimit visitors and disinfect footwear and tools to prevent introducing oocysts.\n\nb. Use of Coccidiostats (Preventive Medications)\n\nAdd coccidiostats (e.g., amprolium, monensin, salinomycin) to feed or water as a preventive measure.\n\nRotate different coccidiostats to prevent resistance.\n\nObserve withdrawal periods before slaughter.\n\nc. Vaccination\n\nAdminister coccidiosis vaccines to chicks at the hatchery or early in life.\n\nVaccination is common in breeder and layer operations and less so in broilers.\n\n 2. Early Detection\n\nRecognizing the signs early is critical:\n\nDroopiness and poor feed intake\n\nDiarrhea, often bloody or watery\n\nWeight loss and ruffled feathers\n\nHigh mortality in severe outbreaks\n\nRegularly inspect birds and litter to catch infections before they spread.\n\n 3. Treatment\n\nIf an outbreak occurs:\n\na. Medicated Treatment\n\nUse Amprolium (Corid) or Toltrazuril (Baycox) in drinking water.\n\nTreat for 35 days or as prescribed by a veterinarian.\n\nRemove coccidiostats from feed if using water-soluble medications to avoid overdosing.\n\nb. Supportive Care\n\nProvide electrolytes and vitamins, especially Vitamin A and K, to support recovery.\n\nIsolate affected birds if necessary to prevent further spread.\n\n 4. Post-Outbreak Clean-Up\n\nDeep clean poultry houses and replace bedding.\n\nUse disinfectants effective against oocysts, such as ammonia-based solutions or formalin (handle with care).\n\nAllow downtime between batches to ensure proper drying and thorough cleaning.\n\nThis version maintains the technical detail while improving readability, consistency, and professionalism for publication or advisory purposes.\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Tackling coccidiosis in poultry requires a combination of prevention, early detection, and treatment. Coccidiosis is a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/about-coccidiosis-in-poultry/\">Continue reading<span class=\"screen-reader-text\"> \"About Coccidiosis in Poultry\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "Zim Court Rejects DRC Refugee’s Urgent Bid for Release from Detention",
            "url": "https://www.zimeye.net/2025/08/19/zim-court-rejects-drc-refugees-urgent-bid-for-release-from-detention/",
            "content": "By A Correspondent | The High Court has dismissed an urgent application by a Congolese refugee who sought immediate release from Harare Remand Prison, ruling that his detention falls within the bounds of the Immigration Act.\n\nBenoit Ombeni Mupenzi, who claims refugee status in Zimbabwe, approached the court alleging he had been unlawfully detained without charge or explanation. He argued that his arrest contravenes the Constitution and the Immigration Act as he had not been furnished with the reasons for his detention or a valid warrant.\n\nMupenzi further told the court that his liberty was being arbitrarily restrained causing irreparable harm, insisting he was unaware of any offence committed.\n\nHowever, Justice Maxwell ruled that the detention was lawful under section 8(1) of the Immigration Act [Chapter 4:02], which allows authorities 14 days to verify an individuals identity, nationality and antecedents.\n\nThe detention of the applicant is in terms of a law which remains in our statute books, Justice Maxwell said. Until and unless section 8 of the Immigration Act is declared unconstitutional and such declaration is confirmed by the Constitutional Court, the courts hands are tied.\n\nThe Chief Immigration Officer opposed Mupenzis release, stating that his nationality was under investigation and that none of the documents he produced proved refugee status. Applicants identity and nationality status have been questioned by the countrys security apparatus, the court was told.\n\nJustice Maxwell acknowledged that Mupenzi may have a valid concern regarding the lack of reasons furnished for his arrest, but stressed that the legal remedy lay elsewhere. Whilst applicant might have a genuine grievance that he was not furnished with reasons for the arrest and detention forthwith, I am not persuaded that the remedy for that is his immediate release, he ruled.\n\nThe court dismissed the application with no order as to costs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | The High Court has dismissed an urgent application by a Congolese refugee who sought immediate release … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/zim-court-rejects-drc-refugees-urgent-bid-for-release-from-detention/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Court Rejects DRC Refugee’s Urgent Bid for Release from Detention\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "Mnangagwa Regime Faces Backlash Over Heroes Acre Renovation While Hospitals Decay",
            "url": "https://www.zimeye.net/2025/08/19/mnangagwa-regime-faces-backlash-over-heroes-acre-renovation-while-hospitals-decay/",
            "content": "By A Correspondent\n\nFormer Masvingo Central Constituency MP Jeffryson Chitando has condemned the Mnangagwa administration for spending government funds on renovating the Masvingo Provincial Heroes Acre while hospitals in the province continue to struggle.\n\nChitando said, It is unacceptable that government money is being spent on beautifying a cemetery when our hospitals lack basic equipment, medicines, and functional wards.\n\nCitizens are dying because our health facilities are under-resourced, yet the regime prioritises monuments over human lives.\n\nThe Masvingo Provincial Heroes Acre, situated next to Hillside Extension in Masvingo City, is home to 94 graves of individuals who played pivotal roles in Zimbabwes liberation struggle.\n\nDespite the symbolic importance of the site, critics argue that funds could have been better spent addressing pressing social services.\n\nNational Museums and Monuments of Zimbabwe (NMMZ) regional director, Mr Lovemore Mandima, told state media that the renovation aims to improve the facilitys appearance, enhance security, and boost tourism.\n\nThe Government has approved the final plans for the facelift of Masvingo Provincial Heroes Acre and we expect work to start soon, Mandima said. The project will entail improving security at the facility through the erection of a perimeter fence to better protect the site. We also intend to install water-borne ablution facilities and construct a large shed to accommodate visitors and crowds during official state events, such as Heroes Day commemorations. Everything is now set for work to begin, and we are optimistic that the new-look facility will befit the status of a Provincial Heroes Acre.\n\nMandima further commended the Second Republic under President Mnangagwa for prioritizing the dignity of Zimbabwes fallen heroes by upgrading shrines across the country. Memorialisation efforts are crucial in remembering the gallant sons and daughters who sacrificed their lives to liberate Zimbabwe from colonial rule, he said.\n\nThe government has also embarked on the renovation of other key liberation war sites, including Kamungoma Farm, now home to a Liberation War Shrine honouring 104 villagers and one freedom fighter massacred by Rhodesian forces during a night vigil in 1978. The upgraded Kamungoma Shrine, located about 75 km southeast of Mpandawana Growth Point, has since been declared a national monument.\n\nWhile the renovations underscore the governments focus on preserving national heritage, critics like Chitando maintain that such projects highlight the administrations misplaced priorities at a time when the health sector is struggling to meet basic needs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Masvingo Central Constituency MP Jeffryson Chitando has condemned the Mnangagwa administration for spending government funds on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/mnangagwa-regime-faces-backlash-over-heroes-acre-renovation-while-hospitals-decay/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Faces Backlash Over Heroes Acre Renovation While Hospitals Decay\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "Mnangagwa Loyalists Clash With ZIMRA Over Unnecessary Delays",
            "url": "https://www.zimeye.net/2025/08/19/mnangagwa-loyalists-clash-with-zimra-over-unnecessary-delays/",
            "content": "By A Correspondent\n\nZanu PF affiliate, Cross Border Traders 4ED association has called on authorities to remove multiple roadblocks and reduce repeated searches of travellers along the BeitbridgeMasvingo road, describing them as unnecessary and frustrating.\n\nSpeaking in Masvingo last week, DJ Masomere, representing the traders, criticized ZIMRA officials for causing delays that hinder commerce. Too many searches and roadblocks are unnecessary and are slowing down trade between Beitbridge and Masvingo, Masomere said.\n\nHe added that repeated checks from the border to Bubi, Rutenga, Ngundu, Chibi Turnoff, and Wimpy were excessive and counterproductive.\n\nWe are appealing for competent officials who can perform one thorough search instead of multiple stops that waste time and resources, he said.\n\nMasomere also called on Masvingos Minister of State for Provincial Affairs and Devolution, Ezra Chadzamira, to intervene and streamline border operations.\n\nWe urge the ministry to step in and ensure that traders can move freely without undue delays, he added.\n\nThe traders complaints highlight ongoing tensions between cross-border operators and regulatory authorities, with calls for improved efficiency and professionalism at key checkpoints along major trade routes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF affiliate, Cross Border Traders 4ED association has called on authorities to remove multiple roadblocks and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/mnangagwa-loyalists-clash-with-zimra-over-unnecessary-delays/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Loyalists Clash With ZIMRA Over Unnecessary Delays\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "Broke Mnangagwa Regime Desperate To Boost Revenue Through New Tax System…",
            "url": "https://www.zimeye.net/2025/08/19/broke-mnangagwa-regime-desperate-to-boost-revenue-through-new-tax-system/",
            "content": "By A Correspondent\n\nZimbabwe has officially launched the Tax and Revenue Management System (TaRMS), a modern platform intended to streamline tax administration and drive revenue collection.\n\nHowever, critics argue that the initiative reflects a government desperate to boost income amid a crumbling economy rather than genuinely improving service delivery.\n\nFinance, Economic Development and Investment Promotion Deputy Minister Kuda Mnangagwa described the system as a bold and transformative step in modernising the countrys tax administration. The system is designed to enhance tax revenue administration, improve taxpayer compliance and experience and lay a firm foundation for sustainable and inclusive economic growth, he said.\n\nDeputy Minister Mnangagwa also claimed the system would provide a strong, transparent and efficient tax management system and platform and serve as a launchpad for the governments ongoing digitalisation efforts.\n\nYet the launch comes amid growing skepticism about the governments capacity to implement reforms effectively.\n\nZIMRAs information and communication technology director, Mr Shami Moyo, admitted that the previous tax system had faced significant challenges, including inability to support key functions during peak periods, resulting in tax cumbersome manual tax clearance fraught with several bottlenecks.\n\nThe old system also failed to handle the countrys multi-currency environment since it was not optimised for such a dynamic tax environment, Moyo added.\n\nTaxpayers could not update their details independently, leading to outdated records due to capacity issues.\n\nDespite these glaring shortcomings in the past, officials are optimistic about TaRMS, which has been introduced in phases since 2023. It has adequate capacity and scalable platforms for an unlimited number of users and taxpayers and the system has been stress tested and has adequate capacity. In addition, the system is highly scalable to cater for future demands and growth, Moyo said.\n\nDeputy Minister Mnangagwa hailed the system as a tool to eliminate corruption and enhance transparency, claiming it will allow ZIMRA to customise the platform for Zimbabwes unique economic realities. Our financial system and economics are not like other nations, which means that we need something versatile and customisable, he said.\n\nWe already have feedback from taxpayers that have highlighted areas that need improvement, and as a responsive Government, we remain committed to progressive enhancement and providing that balance between taxpayer convenience and fiscal integrity.\n\nWhile officials describe TaRMS as a solution for streamlining tax processes and reducing evasion, critics point out that it primarily serves a government struggling to raise revenue. Ultimately, TaRMS will help reduce revenue leakages, widen the tax base, increase compliance and provide clear, faster and more efficient processes for both Government and taxpayers, Mnangagwa said.\n\nZIMRA Commissioner-General Mrs Regina Chinamasa also praised the system, noting it provides real-time updates on tax accounts, allowing taxpayers to track their payments and obligations with ease and will attract foreign investment by creating a more transparent and efficient tax environment.\n\nObservers, however, remain unconvinced, arguing that a technologically advanced system cannot mask broader economic mismanagement, rising informalisation, and declining purchasing power.\n\nAfDB country economist Mr Kelvin Bandai described TaRMS as part of the banks support to Zimbabwe in modernising tax systems. The TaRMS project is thus part of the banks efforts to support the Government of Zimbabwe in modernising its tax systems through automation, thereby enhancing tax compliance and reducing opportunities for fraud and errors, he said.\n\nWhile the government hails the new platform as a solution to fiscal woes, citizens and analysts question whether TaRMS will deliver genuine relief or merely intensify pressure on taxpayers in a country struggling under economic mismanagement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe has officially launched the Tax and Revenue Management System (TaRMS), a modern platform intended to streamline … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/broke-mnangagwa-regime-desperate-to-boost-revenue-through-new-tax-system/\">Continue reading<span class=\"screen-reader-text\"> \"Broke Mnangagwa Regime Desperate To Boost Revenue Through New Tax System…\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "Zanu PF Hardliner Claims Zimbabweans Want Mnangagwa Statue In Cities",
            "url": "https://www.zimeye.net/2025/08/19/zanu-pf-hardliner-claims-zimbabweans-want-mnangagwa-statue-in-cities/",
            "content": "By A Correspondent\n\nPopular Zanu PF online activist C.H. Mukungunugwa has claimed that Zimbabweans are calling on the government to erect a statue of President Emmerson Mnangagwa in recognition of his contributions to the liberation struggle and the countrys transformation.\n\nMukungunugwa posted on X on Monday, saying, A recent nationwide survey shows many Zimbabweans want the government to erect a statue of President Mnangagwa in major cities as a tribute to his role in the liberation struggle and Zimbabwes transformation.\n\nHe argued that the monument would serve as a lasting symbol of Mnangagwas leadership and achievements, reflecting public appreciation for his role in shaping the nations political and economic landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Popular Zanu PF online activist C.H. Mukungunugwa has claimed that Zimbabweans are calling on the government to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/zanu-pf-hardliner-claims-zimbabweans-want-mnangagwa-statue-in-cities/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hardliner Claims Zimbabweans Want Mnangagwa Statue In Cities\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "Farm of Death? Activist Betty Makoni Speaks Out After Murder of Business Tycoon “Mutangazi”",
            "url": "https://www.zimeye.net/2025/08/19/farm-of-death-activist-betty-makoni-speaks-out-after-murder-of-business-tycoon-mutangazi/",
            "content": "Ruwa, Zimbabwe  18 August 2025\n\nBy A Correspondent | ZimEye | Ruwa is reeling after the midnight slaying of flamboyant businessman Joseph Mutangazi Mutangadura  and now, shocking claims have emerged that the farm where he was gunned down has long been haunted by tragedy.\n\nIn an emotional social media post, Girl Child Network founder Princess Betty Makoni described Lisheen Estate  the very property where Mutangazi was shot dead  as a farm of sorrow, tying it to decades of personal grief and unresolved disputes.\n\nPafarm iri ndipo pakawira brother yangu mudhamu remvura akafa Takumbira his remains since 1983 zvaramba, Makoni revealed, saying her brother drowned at the farm more than forty years ago and the family has been denied access to retrieve his remains.\n\nShe went further, pointing to the death of her uncle, Eliah Marume Makoni, at the same farm under difficult circumstances. Since then, she said, the Makoni family has been blocked from reaching their ancestral graves.\n\nThis tragedy has brought back unbearable pain. We appeal for guidance on how to finally lay our relatives to rest at our family home, Makoni wrote.\n\nThe explosive claims come as police investigate Mutangaduras brutal killing. The businessman  known for Lisheen Estate, Mutangadura Hideout, and a chain of butcheries  was shot dead at his farmhouse shortly after midnight in a suspected armed robbery.\n\nBeyond the Headlines: An Investigative Lens\n\nWhile Mutangaduras murder has gripped the nation, Makonis revelations spotlight deeper, unresolved issues tied to Lisheen Estate  including contested land ownership, denial of burial rights, and family disputes stretching back decades.\n\nFor investigators, the questions now extend beyond the manhunt for Mutangaduras killers. The history of Lisheen Estate  from drownings and disputed graves to the latest murder  demands scrutiny into whether the farm has become a flashpoint for conflict and tragedy.\n\nAs the case unfolds, the police probe will not only seek justice for Mutangazis killers but may also open a reckoning with the past, giving voice to families like the Makonis who say they have been silenced for too long.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Ruwa, Zimbabwe – 18 August 2025 By A Correspondent | ZimEye | Ruwa is reeling after the midnight slaying of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/farm-of-death-activist-betty-makoni-speaks-out-after-murder-of-business-tycoon-mutangazi/\">Continue reading<span class=\"screen-reader-text\"> \"Farm of Death? Activist Betty Makoni Speaks Out After Murder of Business Tycoon “Mutangazi”\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        },
        {
            "title": "Mnangagwa Administration To Train 7000 Health Workers Annually But Question Is Will Broke Regime Pay Them Well?",
            "url": "https://www.zimeye.net/2025/08/19/mnangagwa-administration-to-train-7000-health-workers-annually-but-question-is-will-broke-regime-pay-them-well/",
            "content": "By A Correspondent\n\nHealth and Child Care Minister Douglas Mombeshora has announced plans to train 7,000 health workers annually in an effort to address Zimbabwes chronic shortage of medical professionals.\n\nSpeaking last week during a tour of hospitals in Bulawayo, Mombeshora said the programme aims to double the countrys health workforce by 2030, claiming it will ensure hospitals and clinics can adequately serve a population that has more than doubled since independence. He said:\n\nAt independence, our population was 7.5 million and in the last census, we project that we are around 16.5 million yet we have not increased our establishment. We currently have about 26 health workers per 100,000 people, but WHO recommends 46. That means we must double our workforce and while this cannot happen overnight, our target is to achieve it by 2030. There is an urgent need for a review more important than ever as the population has doubled in the past 45 years.\n\nDespite the ambitious plans, critics question whether the government will provide adequate funding and fair remuneration for the newly trained personnel. Staffing shortages remain severe, with specialist doctors among the hardest to find.\n\nAt United Bulawayo Hospitals (UBH), a major referral centre, there is not a single radiologist or pathologist on staff, while Ingutsheni Central Hospital, the countrys largest psychiatric facility, operates with just two psychiatrists.\n\nMombeshora toured UBH, Mpilo, Ingutsheni, and the new Cowdray Park Health Centre last week, highlighting the governments commitment to improving health services. Yet analysts warn that without competitive salaries and proper incentives, many of the trained health workers may seek employment abroad, undermining the programmes long-term goals.\n\nThe plan is good on paper, but the real question is whether the government will pay these health workers properly, one health sector analyst said. Training 7,000 staff a year is meaningless if they cannot be retained due to poor pay and working conditions.\n\nThe programmes success, therefore, hinges not only on training numbers but also on funding, policy implementation, and meaningful support for Zimbabwes overburdened health system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Health and Child Care Minister Douglas Mombeshora has announced plans to train 7,000 health workers annually in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/19/mnangagwa-administration-to-train-7000-health-workers-annually-but-question-is-will-broke-regime-pay-them-well/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Administration To Train 7000 Health Workers Annually But Question Is Will Broke Regime Pay Them Well?\"</span></a></p>",
            "time": "06:32",
            "date": "20 Aug 2025"
        }
    ]
}