{
    "news": [
        {
            "title": "Zanu PF Hooligans Bash Man For “Coordinating” Blessed Geza March …",
            "url": "https://www.zimeye.net/2025/12/07/zanu-pf-hooligans-bash-man-for-coordinating-blessed-geza-march/",
            "content": "Tinashe Sambiri Zanu PF supporters in Mwenezi reportedly attacked a local resident after he expressed support for opposition activist Blessed Geza, highlighting the ongoing climate of politically motivated violence in Masvingo Province.\n\nAccording to the Zimbabwe Peace Project (ZPP) October 2025 report, Masvingo recorded three major human rights violations in Gutu and Mwenezi districts, including forced displacement, harassment, and physical assault.\n\nIn Mwenezi Ward 4, a male resident was accused of organizing the 17 October march and was assaulted by ZANU PF supporters, sustaining injuries, illustrating politically motivated violence and the suppression of civic participation, the report states.\n\nThe ZPP report also documented other violations across the province. In Gutu Ward 6, a woman living with a disability was forcibly removed from her land by a traditional leader, exposing the vulnerabilities of marginalized residents. Additionally, in Gutu Ward 24, nurses at a medical facility were harassed and intimidated for accepting donated blankets without Zanu PF approval, demonstrating interference in professional and humanitarian activities.\n\nThe report notes that such violations affected a total of 2,531 individuals across Masvingo in October alone, including 1,360 women and 1,171 men. Among them, 58 women and 51 men were persons with disabilities.\n\nIn October 2025, ZPP documented a total of 116 human rights violations across the country, affecting 2,531 individuals, reads part of the report. The violations recorded included gross abuses such as forced displacements, hate-motivated violence, threats, and physical assault.\n\nThe report further highlighted broader infringements on civil liberties, noting that victims faced restrictions on freedom of assembly and association, curtailment of freedom of expression, unjustified arrests, and unequal access to government aid and essential social services.\n\nThe attack on the Mwenezi resident underscores the risks faced by citizens who express political opinions that diverge from the ruling partys interests. ZPP has called for urgent measures to protect individuals from politically motivated attacks and to uphold human rights across Masvingo and the rest of Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF supporters in Mwenezi reportedly attacked a local resident after he expressed support for opposition activist Blessed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/zanu-pf-hooligans-bash-man-for-coordinating-blessed-geza-march/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hooligans Bash Man For “Coordinating” Blessed Geza March …\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Catholic Church Prepares VP Chiwenga for Leadership",
            "url": "https://www.zimeye.net/2025/12/07/catholic-church-prepares-vp-chiwenga-for-leadership/",
            "content": "By a Correspondent  The Roman Catholic Church has elevated Vice PresidentConstantino Chiwengato the next stage of his Catholic guild formation, a development that is already generating political debate, given Zanu PFs intensifying succession battles and the historical role the Catholic Church has played in shaping Zimbabwes political leadership.\n\nOn Sunday, Chiwenga arrived atSt Gerard Catholic Churchin Harare with his wife, Colonel Miniyothabo Chiwenga, and other family members to formally transition from thegreen beltto thecream-and-blue belt, the second stage of the guilds spiritual formation process. The guild system guides lay Catholics to deepen their faith through prayer, education, and fellowship.\n\nDespite misconceptions circulating on social media, the Vice President is not joining the clergy but participating in a lay ministry structure open to ordinary parishioners.\n\nThis milestone follows his earlier induction in February 2025 at the Church of the Immaculate Conception at the House of Nazareth in Harare, where Chiwenga shared reflections on his lifelong Catholic identity.\n\nI was baptised soon after my birth on the 2nd of July 1956 and I have been a Catholic ever since, he said, recalling how he carried his rosary during the liberation war. When I went to the war of liberation in 1973, I never stopped my Catholicism. I went to war with my rosary and I came back with it.\n\nChiwenga said his spiritual life motivates his public duties: If I am not mistaken, I am one of the first people to be in the office. My commitment to the Church serves as a motivation to my work.\n\nHe also admitted that the demands of war, the military, and national leadership had often kept him from regular church attendance but said joining the guild was a fulfilment of a long-held desire. What I had not done was to join the guilds because of the nature of my job. Now I have decided to join and I will go through the entire process.\n\nFather Mark Chikuni, the St Gerard Parish Priest, presided over the induction mass.\n\nWhile the guild elevation is a routine Catholic rite, its timing is politically significant. Chiwenga is widely seen as PresidentEmmerson Mnangagwasmain rival in Zanu PFs unfolding succession battles, and every public gesture is being interpreted through the lens of internal power struggles.\n\nMnangagwas relationship with the Catholic Church has been strained, especially after the bishops issued strong pastoral letters criticising human rights abuses and authoritarian drift under his administration. In contrast, Chiwenga has consistently presented himself as a disciplined, devout Catholica contrast that some analysts say may help him cultivate moral legitimacy within sections of the public and the elite.\n\nChiwengas deep ties with the Catholic Church also echo Zimbabwes earlier political history. Former PresidentRobert Mugabewas shaped for decades by Jesuit education and mentorship at Kutama College, which he often credited for cultivating his intellectual discipline, nationalism, and political outlook. Jesuit grooming played a subtle but important role in preparing Mugabe for leadershipan influence that remained part of his political identity until his death.\n\nChiwengas growing visibility in Catholic structures has prompted comparisons, with some political observers suggesting that his guild progression may bolster his image as a principled, morally anchored leader at a time when Zanu PFs succession politics are still unsettled. It also sends a message to party structures that Chiwenga is consolidating not only political but also social and religious capital.\n\nThe religious ceremony comes as tensions quietly simmer within Zanu PF over who will eventually succeed Mnangagwa. Chiwengas military background, his role in the 2017 coup, and his current manoeuvres within political, military, and now religious spaces position him as a central figure in any future transition.\n\nAnalysts say Chiwengas guild elevation may be more than a spiritual gestureit may also be part of a broader repositioning strategy as the partys factions continue to reorganise ahead of the next congress cycle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent — The Roman Catholic Church has elevated Vice President Constantino Chiwenga to the next stage of his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/catholic-church-prepares-vp-chiwenga-for-leadership/\">Continue reading<span class=\"screen-reader-text\"> \"Catholic Church Prepares VP Chiwenga for Leadership\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "System Is Failing: Teachers Blame Govt Underfunding for Falling Grade Seven Results",
            "url": "https://www.zimeye.net/2025/12/07/system-is-failing-teachers-blame-govt-underfunding-for-falling-grade-seven-results/",
            "content": "Tinashe Sambiri Zimbabwes declining Grade Seven results have reignited criticism of the governments chronic underfunding of public schools, with educators saying the system is collapsing due to years of neglect and poor financial management.\n\nZimbabwe Rural Teachers Union president Martin Chaburumunda last week said the latest figures  a 48.49% national pass rate in 2025, down from 49.01% in 2024  reflect a worsening crisis caused by the states failure to adequately support the education sector. He said rural schools, which operate with the least resources, continue to suffer the most.\n\nThere is still a wide gap between rural schools and urban ones The most pressing issue is funding, he said, highlighting how low fees and poor government support leave rural schools without basic materials. Most rural schools lack essential learning materials There is no adequate stationery such as textbooks, exercise books, charts.\n\nChaburumunda condemned the governments repeated delays in releasing BEAM funds, saying the late disbursements cripple schools that rely on them to support vulnerable learners. BEAM funds are released very late, leaving schools exposed to serious funding gaps, he noted.\n\nGovernment officials have already admitted to mismanaging these funds. In February 2025, Primary and Secondary Education Minister Torerayi Moyo revealed that BEAM money meant for disadvantaged children was diverted to cover costs for the SADC Summit, causing school dropouts and absenteeism.\n\nThe situation has worsened, with Finance Minister Mthuli Ncube disclosing that schools are now owed US$98 million in unpaid BEAM allocations  a figure critics say exposes the governments lack of priority for education.\n\nChaburumunda urged authorities to urgently increase support for rural schools, modernise libraries, introduce science laboratories, improve infrastructure, and speed up the rollout of the school internet programme. He warned that rural learners walk an average of 5km daily to school, leaving them exhausted and with less time for homework.\n\nHe said the crisis is compounded by poor accommodation for teachers, lack of electricity, inadequate classrooms, and the absence of extra lessons in rural areas.\n\nGrade Seven results are very important because they build learners confidence, Chaburumunda said. But without immediate intervention, he warned, confidence  and the future of Zimbabwes children  will continue to erode under what teachers describe as a failing education system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zimbabwe’s declining Grade Seven results have reignited criticism of the government’s chronic underfunding of public schools, with educators … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/system-is-failing-teachers-blame-govt-underfunding-for-falling-grade-seven-results/\">Continue reading<span class=\"screen-reader-text\"> \"System Is Failing: Teachers Blame Govt Underfunding for Falling Grade Seven Results\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Gutu Nurses Living In Fear After Receiving Donated Blankets Without ZANU PF Approval",
            "url": "https://www.zimeye.net/2025/12/07/gutu-nurses-living-in-fear-after-receiving-donated-blankets-without-zanu-pf-approval/",
            "content": "Tinashe Sambiri Nurses at a medical facility in Gutu Ward 24 have reportedly faced harassment and intimidation for accepting donated blankets without obtaining approval from ZANU PF, highlighting ongoing political interference in professional and humanitarian activities in the district.\n\nAccording to the Zimbabwe Peace Project (ZPP) October 2025 report, Masvingo Province recorded multiple human rights violations, including forced displacement, physical assault, and politically motivated intimidation.\n\nIn Gutu Ward 24, nurses at a medical facility were harassed and intimidated for accepting donated blankets without ZANU PF approval, demonstrating interference in professional and humanitarian activities, the report states.\n\nOther incidents in the province included a woman with a disability being forcibly displaced from her land in Gutu Ward 6 and a male resident in Mwenezi Ward 4 being assaulted by ZANU PF supporters for allegedly organizing the Blessed Geza march on 17 October.\n\nThe report notes that these violations affected 2,531 individuals in Masvingo alone, including 1,360 women and 1,171 men, of whom 58 women and 51 men were persons with disabilities.\n\nIn October 2025, ZPP documented a total of 116 human rights violations across the country, affecting 2,531 individuals. The violations recorded included gross abuses such as forced displacements, hate-motivated violence, threats, and physical assault, reads part of the report.\n\nThe organization further highlighted infringements on civil liberties, including restrictions on freedom of assembly and association, curtailment of freedom of expression, unjustified arrests, and unequal access to government aid and essential social services.\n\nThe harassment of nurses in Gutu underscores growing concerns over the politicization of humanitarian aid and the suppression of independent professional actions in Zimbabwe.\n\nNurses in Zimbabwe \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Nurses at a medical facility in Gutu Ward 24 have reportedly faced harassment and intimidation for accepting donated … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/gutu-nurses-living-in-fear-after-receiving-donated-blankets-without-zanu-pf-approval/\">Continue reading<span class=\"screen-reader-text\"> \"Gutu Nurses Living In Fear After Receiving Donated Blankets Without ZANU PF Approval\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Rhodesian Armed Forces Parade",
            "url": "https://www.zimeye.net/2025/12/07/rhodesian-armed-forces-parade/",
            "content": "A Rhodesia Army Vets parade held on 9 Dec in JoBurg, waved an arguably neater national flag which is similar to Nigerias own and a red carpet thats not splattered with random colours of the Emmerson Mnangagwa type.\n\nThe senior soldiers wore simple apparel, that stands starkly opposite to the type the countrys new head of state Mnangagwa and his crop of generals put on. The colour displayalone might tell the story of Zimbabwes economic woes, that can be depicted by the priorities of squandering money on expensive things like apparel colours.\n\nRhodesias economy was one of the worlds fastest growing, and its peer, Nigeria is now the continents economy number one.\n\nA Rhodesia Army Vets parade held on 9 Dec in JoBurg, waved an arguably neater national flag which is similar to Nigerias own and a red carpet thats not splattered with random colours of the Emmerson Mnangagwa type.The senior soldiers wore simple apparel, that stands starklypic.twitter.com/M1a7eFWUNM\n\nA Rhodesia Army Vets parade held on 9 Dec in JoBurg, waved an arguably neater national flag which is similar to Nigerias own and a red carpet thats not splattered with random colours of the Emmerson Mnangagwa type.The senior soldiers wore simple apparel, that stands starklypic.twitter.com/M1a7eFWUNM\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Rhodesia Army Vets parade held on 9 Dec in JoBurg, waved an arguably neater national flag which is similar … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/rhodesian-armed-forces-parade/\">Continue reading<span class=\"screen-reader-text\"> \"Rhodesian Armed Forces Parade\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Zivhu Triggers Public Anger After Suggesting Mnangagwa Must Stay In Office Until 2034",
            "url": "https://www.zimeye.net/2025/12/07/zivhu-triggers-public-anger-after-suggesting-mnangagwa-must-stay-in-office-until-2034/",
            "content": "Tinashe Sambiri Controversial Zanu PF official Killer Zivhu has sparked widespread public outrage after suggesting that President Emmerson Mnangagwa should remain in office until 2034.\n\nOn Saturday Zivhu took to X:I am going to ask the President to consider staying in office until 2034. We believe that we dont need elections right now; what we want is to see continued development.\n\nHe further compared Mnangagwas potential extended tenure to that of former President Robert Mugabe, stating: Mugabe served for more than 40 years, so why should we refuse to allow Ed to serve for just 15 years?\n\nZivhus remarks have heightened tension within Zanu PF, with some party members reportedly uneasy about extending Mnangagwas term beyond constitutional limits. Critics argue that such proposals undermine democratic processes and could fuel political instability.\n\nEmmerson Mnangagwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Controversial Zanu PF official Killer Zivhu has sparked widespread public outrage after suggesting that President Emmerson Mnangagwa should … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/zivhu-triggers-public-anger-after-suggesting-mnangagwa-must-stay-in-office-until-2034/\">Continue reading<span class=\"screen-reader-text\"> \"Zivhu Triggers Public Anger After Suggesting Mnangagwa Must Stay In Office Until 2034\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Coup Attempt in Benin Foiled Amid Regional Instability – President Talon Safe, Plotters Cornered",
            "url": "https://www.zimeye.net/2025/12/07/coup-attempt-in-benin-foiled-amid-regional-instability-president-talon-safe-plotters-cornered/",
            "content": "By A Correspondent | ZimEye |Cotonou, Benin  December 7, 2025 In a dramatic but short-lived escalation of West Africas ongoing political turmoil, a small faction of Beninese soldiers briefly seized control of the state broadcaster early Sunday morning, proclaiming the overthrow of President Patrice Talon and the dissolution of all government institutions. However, within hours, loyalist forces loyal to the government swiftly reasserted control, surrounding the plotters at the television station and declaring the mutiny thwarted. The incident, described by officials as a small group operation involving fewer than a dozen mutineers, has been contained without widespread violence, though it underscores deepening fissures in the regions fragile democracies.\n\nThe failed bid for power  the first major coup attempt in Benin since the countrys return to multiparty democracy in 1991  unfolded against the backdrop of Talons impending departure from office in April 2026, following a decade in power marked by economic reforms, infrastructure booms, and accusations of authoritarian overreach. As the sun set over Cotonou, the capitals streets, initially gripped by panic from reported gunfire, began to normalize, with residents returning to markets and daily routines under heightened security.\n\nThe rapid-fire exchange of statements highlighted the chasm between the mutineers grandiose vision and the governments swift dismissal. Here are pivotal remarks from authoritative figures:\n\nBenin, a slender coastal nation of 13 million sandwiched between Nigeria and Togo, has long been hailed as West Africas democratic beacon  a stark contrast to its post-independence chaos. From 1960 to 1991, the country endured six coups and a Marxist dictatorship under Mathieu Krkou, who renamed it the Peoples Republic of Benin and aligned it with the Soviet bloc. The 1990 National Conference ushered in reforms, leading to peaceful power transitions and steady GDP growth under Talon, a cotton magnate turned reformer.\n\nYet, Talons tenure has not been without controversy. Elected in 2016 on promises of anti-corruption drives, he has overseen port expansions, digital governance, and poverty reduction from 40% to 18%. Critics, however, accuse him of stifling opposition: In 2019, he barred rivals from running, sparking protests; last month, parliament extended the presidential term from five to seven years (retroactively applying to Talon but capping at two terms total). Opposition leader Renaud Agbodjos recent disqualification from the 2026 race fueled unrest, while economic woes  inflation at 4.5%, youth unemployment at 25%  simmered amid global commodity slumps.\n\nAnalysts link the attempt to this Talon fatigue, exacerbated by the Sahels coup contagion. Benin was the firewall, said a West Africa expert at the International Crisis Group (speaking anonymously). This breach signals how even stable states are vulnerable to elite fractures and populist military narratives.\n\nThis is the third African coup bid in three months, following failed plots in Madagascar (October 2025) and Guinea-Bissau (November 2025). Since 2020, the wave has toppled governments in Mali (twice), Guinea, Chad, Sudan, Burkina Faso (twice), Niger, and Gabon  often justified as anti-corruption purges but yielding juntas mired in sanctions and jihadist threats.\n\nECOWAS, already strained by suspended members like Niger, faces a credibility test: Will it impose travel bans or asset freezes on the plotters? France, Benins top donor (200 million annually), has a stake too  its embassys lockdown advisory evoked colonial-era meddling claims on social media. U.S. State Department spokesperson Matthew Miller called it a disturbing reminder of democratic backsliding, urging restraint.\n\nIn Cotonous bustling Dantokpa Market, initial chaos gave way to wary optimism. We heard shots like fireworks, then nothing, said vendor Acha Kouassi, 42. Talons tough, but fair  if this was real, why only TV? Social media erupted with #BeninCoup hashtags: Videos of alleged street celebrations (later debunked as old footage) mixed with memes mocking the TV-only takeover. X users speculated wildly  from French orchestration (Why always when Talons anti-CFA?) to opposition plots  but official narratives dominated.\n\nAs night falls, Benins fate hangs on the station standoff. If resolved peacefully, it could reinforce Talons legacy; if not, it risks igniting the very instability the plotters decried. For now, the new era promised by the CMR remains a fleeting broadcast echo, drowned out by the republics resilient hum.\n\nThis report draws from on-the-ground dispatches and official statements as of 8:00 PM GMT. Updates expected as negotiations conclude.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Cotonou, Benin – December 7, 2025 – In a dramatic but short-lived escalation of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/coup-attempt-in-benin-foiled-amid-regional-instability-president-talon-safe-plotters-cornered/\">Continue reading<span class=\"screen-reader-text\"> \"Coup Attempt in Benin Foiled Amid Regional Instability – President Talon Safe, Plotters Cornered\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Zanu PF Squanders Over US$1 Million on Lavish Party Offices As Citizens Struggle",
            "url": "https://www.zimeye.net/2025/12/07/zanu-pf-squanders-over-us1-million-on-lavish-party-offices-as-citizens-struggle/",
            "content": "Tinashe Sambiri Zanu PFs Manicaland provincial leadership is facing criticism for allocating over US$1 million to build extravagant party offices and a conference centre, a move that has angered many Zimbabweans struggling with basic services.\n\nSpeaking to State media on Tuesday, Zanu PF provincial chairman Tawanda Mukodza defended the project, saying that construction is progressing and that building materials, including cement, bricks, and reinforcements, have already been delivered.\n\nWe are pleased to announce that building materials are now being delivered to the site, Mukodza said. He went on to thank President Mnangagwa, his investment advisor Dr Paul Tungwarara, and Zanu PF national chairperson Oppah Muchinguri-Kashiri for spearheading the development.\n\nMukodza described the project as a mega construction of multi-storey offices and a conference centre capable of hosting over 3,000 delegates. The total bill of quantity has been determined, and we are optimistic about the projects prospects, thanks to the strengthened unity within the party, he said.\n\nCritics have denounced the spending as an example of the party prioritizing luxurious offices over urgent public needs. While ordinary Zimbabweans are grappling with electricity cuts, fuel shortages, and poorly funded hospitals and schools, Zanu PF is funneling over US$1 million into party buildings, one observer commented.\n\nThe project, with 3D architectural designs approved and contractors already on site, is expected to show noticeable construction progress by Christmas, according to Mukodza. Many citizens, however, question the morality and necessity of such lavish spending in a country facing severe economic challenges.\n\nThis is yet another case of government and party leaders using public attention and resources to glorify themselves, while ordinary people continue to suffer, said a local resident.\n\nThe controversial construction highlights ongoing concerns about mismanagement of funds and the partys apparent disconnect from the pressing needs of ordinary Zimbabweans.\n\nZanu PF \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF’s Manicaland provincial leadership is facing criticism for allocating over US$1 million to build extravagant party offices … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/zanu-pf-squanders-over-us1-million-on-lavish-party-offices-as-citizens-struggle/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Squanders Over US$1 Million on Lavish Party Offices As Citizens Struggle\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Video- Airforce Boss Took Over CCC Politician’s Farm",
            "url": "https://www.zimeye.net/2025/12/07/video-airforce-boss-took-over-ccc-politicians-farm/",
            "content": "video loading helow\n\nAirForce officer based at Magama Tongogara Airbase in Gweru, Stafford Ncube and Zimbabwe Prisons and Correctional Services Officer Commanding Midlands, Somemore Gate allegedly took a tractor and ploughed down 2023 opposition Parliamentary candidate for Chirumhanzi Southhttps://t.co/KUzPdUcJIF\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading helow",
            "time": "09:38",
            "date": "08 Dec 2025"
        },
        {
            "title": "Tagwirei Falls",
            "url": "https://www.zimeye.net/2025/12/07/tagwirei-falls-2/",
            "content": "By A Correspondent ZANU PF has moved to clip the wings of President Emmerson Mnangagwas key ally and financier, businessman Kudakwashe Tagwirei, by banning him  and any other benefactors  from making direct vehicle donations to party structures. The new directive places exclusive authority for handing over vehicles in the hands of Mnangagwa alone, a dramatic attempt to curb factional mobilisation fuelled by Tagwireis politically charged generosity.\n\nParty insiders say the decision marks the clearest sign yet that ZANU PFs highest organs are unsettled by the scale and political impact of Tagwireis philanthropic activities, which have increasingly shaped internal power contests and fed succession speculation since the November 2017 coup. The directive, reportedly endorsed during a series of high-level meetings in Harare between Wednesday and Friday last week, was publicly presented as a measure to restore order. But senior officials confirmed its real purpose is to dismantle emerging parallel power networks built around wealthy businessmen who have been donating vehicles to politburo members, provincial leaders and the partys womens and youth structures.\n\nIn recent years, Tagwirei  through Sakunda Holdings and personal wealth  has donated fleets of top-of-the-range vehicles to senior ZANU PF officials, war veterans, chiefs and churches. Many of these donations coincided with sensitive political moments. Ahead of the 2023 elections, Tagwirei funded vehicles and logistics for ZANU PF campaigns. More recently, he and associate Wicknell Chivayo gifted luxury cars to central committee members and influential figures, often bypassing formal party processes. Some recipients openly expressed loyalty not to the party leadership but to the donors themselves, amplifying anxiety that Tagwirei was cultivating a personal patronage network at a time Mnangagwa approaches the end of his final constitutional term.\n\nSources toldThe Standardthat Mnangagwa instructed that all future vehicle donations must be processed through his office. The proposal was formally put forward by national chairperson Oppah Muchinguri-Kashiri at the politburo meeting, where she reportedly warned that uncontrolled donations were buying influence and transforming generosity into a political bargaining tool. A senior official summarised the politburos stance: There is one centre of power in ZANU PF, and it is President ED Mnangagwa. Vehicle and money donations were becoming divisive. From now on, any support must be channelled through the president, who will deploy resources fairly and according to party needs.\n\nThe clampdown follows Vice President Constantino Chiwengas recent public call for the arrest of businessmen accused of donating vehicles purchased using state or party funds  a statement widely interpreted as targeting Tagwirei and Chivayo. Within ZANU PF, the new ban is being read as Mnangagwas attempt to prevent Tagwirei from expanding his influence beyond the presidencys control and to disrupt factional mobilisation around alternative succession paths. A politburo member said Mnangagwa used last weeks meetings to reprimand ambitious new figures whom he accused of elevating themselves above party procedures. He cautioned against the rise ofnherwamukono individuals who, once elevated into central structures, behave as their own power centres.\n\nThis tightening of control comes amid deepening ZANU PF succession tensions. Some senior party members are quietly pushing for a two-year extension to Mnangagwas term beyond 2028, a proposal reportedly resisted by factions aligned to Chiwenga. Tagwirei, with his financial muscle, military ties and growing grassroots profile, has become central to these internal manoeuvres. His donations have been perceived as a means of shaping loyalties for the leadership race ahead, a perception he has repeatedly denied.\n\nDuring Fridays National Consultative Assembly, Mnangagwa reportedly startled delegates by chanting Pasi neZviganda!  a slogan popularised by Chiwenga to rebuke individuals accused of amassing wealth through state-linked deals. The remark instantly triggered speculation about whether Mnangagwa was directing criticism at Tagwirei, Chivayo or a wider circle of businessmen whose political influence has grown sharply.\n\nZANU PF spokesperson Christopher Mutsvangwa yesterday declined to confirm or deny the donation ban, saying he would address the media in a scheduled briefing.\n\nFor now, the message from ZANU PFs top leadership is unmistakable: Mnangagwa  and Mnangagwa alone  will control political largesse. Whether the new rule restores party cohesion or further intensifies internal rivalry remains uncertain as Zimbabwe edges closer to another contentious leadership transition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – ZANU PF has moved to clip the wings of President Emmerson Mnangagwa’s key ally and financier, businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/07/tagwirei-falls-2/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Falls\"</span></a></p>",
            "time": "09:38",
            "date": "08 Dec 2025"
        }
    ]
}