{
    "news": [
        {
            "title": "Obert Mpofu Defies ED",
            "url": "https://www.zimeye.net/2025/09/27/obert-mpofu-defies-ed/",
            "content": "By A Correspondent  Obert Mpofu has openly refused to obey President Emmerson Mnangagwas directive to step aside for his replacement, Speaker of Parliament Jacob Mudenda.\n\nMpofu, was fired from the partys secretary general post and reassigned to the less influential portfolio of Secretary for ICT after a heated Politburo meeting that embarrassed Mnangagwa in front of his deputy Constantino Chiwenga, has continued to issue official party correspondence under the powerful title ofSecretary-General.\n\nTwo letters written on 25 September 2025 exposed the widening rift. One, bearing Mpofus signature, confirmed the conferment of Liberation Hero status on the late Cde John Gowa. The other, signed by Mudenda, announced a State-Assisted Funeral for Cde Babongiwe Sikhonjwa. Both men used the titleSecretary-General, deepening confusion over who actually controls Zanu PFs administration.\n\nMnangagwa had announced Mpofus demotion this week in a broader reshuffle designed to weaken Chiwengas factional grip. Mudenda, a long-time Mnangagwa ally, was elevated to the post of Secretary-General, while Patrick Chinamasa and Ziyambi Ziyambi were strategically repositioned to consolidate the presidents loyalists.\n\nBut Mpofus continued use of the title has sent a clear signal: he will not go quietly. As one of Chiwengas strongest allies, his defiance is seen as a direct challenge to Mnangagwas authority and a show of solidarity with the vice presidents camp.\n\nThe open defiance comes at a time when tensions in Zanu PF have reached dangerous levels. Chiwengas presentation of an explosive anti-corruption dossier targeting Mnangagwas allies, including business tycoon Kudakwashe Tagwirei, has shaken the ruling party to its core. Intelligence warnings reportedly forced Mnangagwa to cancel his planned trip to the United Nations General Assembly, fearing his camp could be crippled in his absence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Obert Mpofu has openly  refused to obey President Emmerson Mnangagwa’s directive to step aside for his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/obert-mpofu-defies-ed/\">Continue reading<span class=\"screen-reader-text\"> \"Obert Mpofu Defies ED\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "VP Chiwenga favours Chinese Miners Above Local Zimbabweans, Mliswa Alleges",
            "url": "https://www.zimeye.net/2025/09/27/vp-chiwenga-favours-chinese-miners-above-local-zimbabweans-mliswa-alleges/",
            "content": "VP Chiwenga favours Chinese miners above local Zimbabweans,@TembaMliswaalleges\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Ex-Prisoner Turns Old Jail-Food Grudge Into Street Violence",
            "url": "https://www.zimeye.net/2025/09/27/ex-prisoner-turns-old-jail-food-grudge-into-street-violence/",
            "content": "By A Correspondent | A former inmate from Bulawayo has landed back in court after allegedly attacking a man over a years-old grievance about food portions in prison.\n\nBayethe Nyathi (32) of Cowdray Park appeared before West Commonage Magistrate Jeconia Prince Ncube facing two counts of robbery and one of assault. Prosecutors say Nyathi transformed a prison food dispute into a violent rampage on the streets of Cowdray Park.\n\nThe Prison Food Grudge\n\nAccording to prosecutor Cathrine Kuzu, the trouble began on 11 September at Mahweba Sports Bar. Nyathi ran into Washington Ncube (25), a former fellow inmate.\n\nInstead of greeting him, Nyathi allegedly accused Washington of serving him tiny food portions during their time in Bulawayo Prison. Witnesses say Washington laughed off the accusation  which only angered Nyathi further.\n\nNyathi then allegedly picked up a sharp object and struck Washington on the head and arm, shouting:\n\nYou thought I forgot those little plates you gave me in prison!\n\nWashington was taken to Mpilo Central Hospital for treatment. Police arrested Nyathi at the scene.\n\nEarlier Robbery\n\nProsecutors also revealed that on 27 August, weeks before the assault, Nyathi allegedly robbed another man, Armstrong Moyo (32), near AFM Church in Cowdray Park.\n\nHe is accused of grabbing Moyo by the collar, threatening to stab him, and stealing car keys, a Huawei phone, blue trousers, and US$120. He then reportedly smashed a beer bottle on Moyos head twice, leaving him with a deep cut. The stolen items, worth US$265, have not been recovered.\n\nCommunity Reaction\n\nNyathi has been remanded in custody. Residents of Cowdray Park have reacted with a mix of shock and dark humour over the revenge over rations attack.\n\nHe must have really been hungry in prison, one local quipped. Next time, give the man a bigger plate!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A former inmate from Bulawayo has landed back in court after allegedly attacking a man over … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/ex-prisoner-turns-old-jail-food-grudge-into-street-violence/\">Continue reading<span class=\"screen-reader-text\"> \"Ex-Prisoner Turns Old Jail-Food Grudge Into Street Violence\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Eight ZANU PF Affiliates in Mashonaland West Receive Over US$200,000 From Presidential Empowerment Fund",
            "url": "https://www.zimeye.net/2025/09/27/eight-zanu-pf-affiliates-in-mashonaland-west-receive-over-us200000-from-presidential-empowerment-fund/",
            "content": "Mashonaland West  A total of eight ZANU PF-aligned affiliate organisations in Mashonaland West have received more than US$200,000 from the Presidential Empowerment Fund, a revolving facility aimed at supporting grassroots empowerment and life-changing projects.\n\nAccording to provincial officials, VaPostori for ED and Children of War Veterans each received US$50,000, while the remaining six affiliates walked away with US$20,000 apiece to bankroll ongoing and new initiatives.\n\nThe fund is designed to provide capital for projects that create jobs, uplift marginalised groups, and feed into President Mnangagwas Vision 2030 agenda.\n\nThis support empowers a community that was once marginalised. As VaPostori, we are already engaged in self-empowerment initiatives, and this fund will strengthen our efforts to contribute meaningfully to national development, said Madzibaba Moses, National Chairperson of VaPostori for ED.\n\nProphetess Idirashe Dongo, National Chairperson of Pastors for ED, added: This is the emancipation of our sector, giving us the tools and confidence to participate fully in the national economy and in the Vision 2030 agenda.\n\nWe already have projects on the ground that require funding, and with this empowerment facility, we are now able to expand them with the view of creating more opportunities for young people, noted Mr Andrew Mugabe, Boyz dza Mdaras Mashonaland West Provincial Chairperson.\n\nMrs Colleen Chinovainzwa, Provincial Chairperson of Vendors 4 ED, weighed in: The empowerment fund will ensure that our members trade in compliance with national standards while improving their livelihoods and contributing to the wider economy.\n\nAccountability and OversightThe Mashonaland West provincial leadership underscored the importance of accountability and transparency in the use of the revolving fund.\n\nThis programme dovetails with the Presidential mantra of leaving no one and no place behind. Use of the fund will also push forward economic and social development of the province, said Mr Josphat Jaji, Permanent Secretary for Mashonaland West Provincial Affairs and Devolution.\n\nAs the ruling party, we will ensure that the funds are utilised effectively. There must be a close working relationship with affiliates, who should always consult and stay connected to the party, added Cde Mary Mliswa-Chikoka, ZANU PF Mashonaland West Provincial Chairperson.\n\nNational Development FocusLaunching the provincial fund, Presidential Investment Advisor Dr Paul Tungwarara said community empowerment remained central to Zimbabwes national development trajectory.\n\nThe empowerment vision is here to stay. We will continue to ensure that every affiliate benefits. We want to create an empowered community which anchors Vision 2030, Tungwarara said.\n\nThe eight affiliates that benefitted include Pastors for ED, VaPostori for ED, Vendors for ED, Boyz dzaMudhara, Health Ambassadors for ED, and Children of War Veterans, among others.\n\nOfficials said more disbursements are expected in coming months as the facility rolls out across other provinces.-state media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mashonaland West — A total of eight ZANU PF-aligned affiliate organisations in Mashonaland West have received more than US$200,000 from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/eight-zanu-pf-affiliates-in-mashonaland-west-receive-over-us200000-from-presidential-empowerment-fund/\">Continue reading<span class=\"screen-reader-text\"> \"Eight ZANU PF Affiliates in Mashonaland West Receive Over US$200,000 From Presidential Empowerment Fund\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Madam Boss in Court",
            "url": "https://www.zimeye.net/2025/09/27/madam-boss-in-court-2/",
            "content": "By Showbiz Reporter  Popular comedian and socialite Madam Boss, real name Tarisai Cleopatra Chikocho, was on Friday spotted at the Harare Magistrates Court where she was scheduled to testify in the ongoing fraud trial linked to the controversial E-Creator Ponzi scheme.\n\nMadam Boss, dressed in black, appeared alongside her associate Admire Mushambi  popularly known as Mama Vee  who was clad in a brown golf tee. The two were seen hastily leaving the court premises while attempting to avoid cameras from the press and curious onlookers.\n\nTheir appearance is tied to the trial of suspects accused of masterminding the E-Creator scandal, one of the biggest online fraud cases to rock Zimbabwe in recent years.\n\nThe scheme, which lured thousands of unsuspecting citizens with promises of lucrative returns through online investments, collapsed spectacularly in 2023, leaving many people counting their losses.\n\nE-Creator operated under the guise of a legitimate digital marketing and online services company but was later exposed as a classic Ponzi scheme.\n\nAt its peak, it attracted thousands of clients, mainly the unemployed, low-income earners, and young people desperate for quick money.\n\nWhen the scheme inevitably crumbled, victims accused social media influencers and celebrities  including Madam Boss and Mama Vee  of having promoted or associated themselves with the scheme, thereby lending it a false aura of credibility.\n\nAlthough the two entertainers have consistently denied any wrongdoing, they were summoned to testify as witnesses in the fraud case to clarify their role and relationship, if any, with the schemes operators.\n\nHowever, proceedings were once again postponed on Friday after the presiding magistrate indicated that a Chinese interpreter was not available.\n\nThis delay is significant given that one of the key accused persons in the matter is a Chinese national alleged to have orchestrated the multi-million-dollar fraud. The case has now been rescheduled to October 10.\n\nLegal experts say the trial will be closely watched not only for the potential justice it may bring to thousands of defrauded Zimbabweans but also for its implications on the accountability of social media personalities who endorse or promote financial schemes without due diligence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Popular comedian and socialite Madam Boss, real name Tarisai Cleopatra Chikocho, was on Friday spotted at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/madam-boss-in-court-2/\">Continue reading<span class=\"screen-reader-text\"> \"Madam Boss in Court \"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Harvest House Faces Closure",
            "url": "https://www.zimeye.net/2025/09/27/harvest-house-faces-closure/",
            "content": "By a Correspondent  The Harare City Council has threatened to shut down Harvest House, the iconic headquarters of the Movement for Democratic Change (MDC), after the party failed to settle arrears exceeding US$50,000 in unpaid rent and municipal charges.\n\nHarvest House, located in the heart of Harares central business district, has long been a symbol of opposition politics in Zimbabwe.\n\nThe building was seized by Douglas Mwonzoras faction in 2020 after a bitter leadership wrangle that saw him controversially installed as MDC president following a Supreme Court ruling that nullified Nelson Chamisas leadership of the party.\n\nMwonzoras takeover of Harvest House was marked by violent clashes between rival MDC factions, as he sought to consolidate his hold on the partys assets.\n\nHowever, since assuming control, Mwonzoras faction has struggled to manage the property. Reports indicate that no meaningful rentals or municipal dues have been paid for years, with debts ballooning to unsustainable levels.\n\nInsiders blame poor financial management, dwindling donor support, and massive defections from the party, which left the once-vibrant MDC without a clear funding base.\n\nThe latest development comes as the City of Harare intensifies its crackdown on institutions failing to honor their financial obligations.\n\nCouncil officials confirmed that unless Mwonzoras party clears the outstanding US$50,000 immediately, Harvest House will be closed and possibly auctioned to recover the debt.\n\nPolitical analysts argue that the looming closure symbolizes the dramatic decline of the MDC, once Zimbabwes most formidable opposition party under the late Morgan Tsvangirai.\n\nWhat was once a hub of democratic struggle risks being reduced to another derelict building in Harares skyline, a reflection of the partys internal fractures and Mwonzoras controversial leadership.\n\nFor Mwonzora, the possible loss of Harvest House would not only be a financial blow but also a devastating symbolic defeat, stripping him of the headquarters that gave his contested leadership a veneer of legitimacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent – The Harare City Council has threatened to shut down Harvest House, the iconic headquarters of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/harvest-house-faces-closure/\">Continue reading<span class=\"screen-reader-text\"> \"Harvest House Faces Closure\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Opposition Leader Declares “The Time For Change Is Now”",
            "url": "https://www.zimeye.net/2025/09/27/opposition-leader-declares-the-time-for-change-is-now/",
            "content": "By A Correspondent\n\nLeader of the Freedom Fighters for Change (FFC), Michael Makaza, delivered a passionate call to action on Thursday, urging Zimbabweans to unite and embrace change for the nations future.\n\nFellow Zimbabweans, do you like change? Change is certain, and its time for a new chapter in our nations history, Makaza said, emphasizing that the country could no longer remain trapped in cycles of stagnation and inequality.\n\nMakaza positioned himself as a symbol of hope in troubled times. Michael Makaza is the last hope, the beacon of light in the darkness. He embodies the spirit of freedom, justice, and equality, read part of the FFC statement.\n\nThe party insists that silence and fear are no longer options. We will not be silenced, we will not be deterred. We will rise up, unite, and demand a better future for ourselves and future generations, Makaza declared, calling on citizens to rally behind the FFC.\n\nHe urged Zimbabweans from all walks of life to join the political movement and take part in shaping a democratic, just, and united nation. The time is now! Join the movement, join the fight for change. Lets march forward with courage, determination, and unity, he said.\n\nThe FFC concluded by rallying the public with the hashtag #WeMove, inviting citizens to participate in political discourse and action. Lets make a difference, lets create a better Zimbabwe for all, Makaza affirmed.\n\nThe Freedom Fighters for Change can be followed on Facebook (FFC-zw) or contacted via email at[emailprotected].\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Leader of the Freedom Fighters for Change (FFC), Michael Makaza, delivered a passionate call to action on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/opposition-leader-declares-the-time-for-change-is-now/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition Leader Declares “The Time For Change Is Now”\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Observers Say Mnangagwa Dodged UN General Assembly to Shield Allies from Chiwenga",
            "url": "https://www.zimeye.net/2025/09/27/observers-say-mnangagwa-dodged-un-general-assembly-to-shield-allies-from-chiwenga/",
            "content": "By A Correspondent\n\nPresident Emmerson Dambudzo Mnangagwa has skipped the ongoing United Nations General Assembly in New York, officially citing pressing commitments at home. However, observers say the real reason lies in mounting political tension within Zanu PF and fears of persecution of his allies by his deputy, Vice President Constantino Chiwenga.\n\nOne political analyst noted, The statement about pressing commitments is a cover. The truth is Mnangagwa is under pressure. There is deep mistrust within Zanu PF, and he is wary of leaving the ground open for Chiwenga while he is away.\n\nAnother observer argued that Mnangagwas absence reflects growing instability in the ruling party. The factional battles are intensifying. He fears that while he is in New York, his loyalists could be politically targeted and sidelined by Chiwengas camp, the analyst said.\n\nMeanwhile, Zanu PF activist Levison Chambati publicly defended Mnangagwas decision. President Emmerson Dambudzo Mnangagwa is right to skip the UN General Assembly and focus on urgent national work at home. These gatherings are mostly ceremonial, with little attention given to Africas voice, Chambati wrote. He further added, Until Africa secures a permanent seat on the UN Security Council, our nations should consider sending senior officials instead of wasting resources on symbolic attendance. Its time Africa shows the world its dissatisfaction with this unequal setup.\n\nDespite Chambatis defense, questions remain about whether the presidents absence is truly about diplomatic protest or whether it reveals fractures at the heart of Zanu PF. As one analyst summed it up, This is less about the UN and more about survival in Harares corridors of power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Dambudzo Mnangagwa has skipped the ongoing United Nations General Assembly in New York, officially citing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/observers-say-mnangagwa-dodged-un-general-assembly-to-shield-allies-from-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Observers Say Mnangagwa Dodged UN General Assembly to Shield Allies from Chiwenga\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Can You Really Buy an Army? The Case of Zimbabwe’s Generals and the ‘Zvigananda’ Factor",
            "url": "https://www.zimeye.net/2025/09/27/can-you-really-buy-an-army-the-case-of-zimbabwes-generals-and-the-zvigananda-factor/",
            "content": "By Desmond Nleya | Rumours are swirling in Harare and across Zimbabwe: have senior military generals in the Zimbabwe National Army (ZNA) been bought by the so-called Zviganandashadowy, ultra-wealthy actors accused of amassing unexplained fortunes?\n\nAt first glance, the idea fits a familiar political script: money changes hands, loyalties shift, and power quietly follows. But Zimbabwes armyforged in the liberation struggle and steeped in military traditionis not a corporation you can simply bribe. It is a living institution, governed by layers of command, history, and internal loyalties. That complexity makes it both more resistant to simple corruption and more vulnerable to subtle forms of manipulation.\n\nWhat Does It Mean to Buy the Army?\n\nWhen people say the army has been bought, they usually mean one of two things:\n\nThese are fundamentally different claims. Paying a general to issue a command is not the same as ensuring that ordinary soldiers will carry it out. In fact, recent history suggests that control of operational unitsnot just top brassis what ultimately decides outcomes in moments of crisis.\n\nGenerals vs. the Ground: Where Power Really Lies\n\nModern military history, in Zimbabwe and beyond, shows that real power often lies not at the top but among junior officers and non-commissioned officers who control boots on the ground. Coups and political interventions are rarely successful without their support. A general without the loyalty of his subordinates is not empoweredhe is exposed.\n\nIn some cases, attempts to buy influence at the top can backfire. If soldiers suspect betrayal or collusion, they may reject the chain of command altogether. What looks like a strategic bribe can quickly become a liability.\n\nZimbabwes Military: Liberation Legacy Meets Political Reality\n\nThe Zimbabwe National Army is not a typical post-colonial army. Its leadership is deeply tied to the liberation struggle, and many top officers are former freedom fighters. That legacy adds layers of ideology and loyalty that are not easily bought or overridden.\n\nThe 2017 military intervention, Operation Restore Legacy, was publicly framed not as a coup but as a mission to protect Zimbabwes liberation heritage. It showcased how senior officers often act in the name of constitutionalism or national legacyeven while operating in a deeply politicised environment.\n\nAt the same time, decades of political entanglement have blurred the lines between professionalism and partisanship. Scholars of Zimbabwes civilmilitary relations note that influence often operates through long-term systems: promotions, unit deployments, and informal patronagenot just one-off payments.\n\nWhy Paying Generals May Be the Wrong Lever\n\nThere are two critical reasons why simply paying generals is unlikely to guarantee control:\n\nSystems, Not Individuals: The Danger of Thinking in Personal Terms\n\nArmies are not just collections of individualsthey are institutions with their own doctrines, training, culture, and internal economies. Influence that targets individuals, rather than systems, is usually short-lived.\n\nA more effectiveand more dangerousstrategy is long-term institutional capture: changing promotion patterns, allocating resources strategically, or embedding political operatives in command structures. These methods take time, but their effects are more durable.\n\nThe\n\nZvigananda\n\nRumours: Why They Matter\n\nThe rise of the term Zvigananda in Zimbabwes public discourse reflects growing anxiety over elite corruption, state capture, and the creeping influence of unexplained wealth. Whether or not specific payments to generals can be proven, the power of the rumour itself should not be underestimated.\n\nIt shows that many Zimbabweans believe money can influenceeven controlthe highest levels of the state. That belief, whether accurate or not, shapes perceptions of legitimacy and trust in institutions.\n\nBottom Line: Can the Army Be Bought?\n\nYes and no.\n\nYesbecause influence over the military can be bought, but only through long-term systemic patronage, not through briefcases of cash handed to a few generals. Over time, money can shape loyalty, career advancement, and internal cohesion.\n\nBut noyou cannot simply buy the army like a private company. Real power depends on whether orders are followed, and that hinges on cohesion, morale, and internal legitimacy across the ranks.\n\nZimbabwes experience, especially since 2017, shows that the military acts not just for money or power but for ideology, legacy, and institutional survival. Political influence over the army is realbut it is a process, not a transaction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Desmond Nleya | Rumours are swirling in Harare and across Zimbabwe: have senior military generals in the Zimbabwe National … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/can-you-really-buy-an-army-the-case-of-zimbabwes-generals-and-the-zvigananda-factor/\">Continue reading<span class=\"screen-reader-text\"> \"Can You Really Buy an Army? The Case of Zimbabwe’s Generals and the ‘Zvigananda’ Factor\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        },
        {
            "title": "Marry Mubaiwa’s Kids Hit 7 Years Blocked From Seeing Own Biological Mother",
            "url": "https://www.zimeye.net/2025/09/26/marry-mubaiwas-kids-hit-7-years-blocked-from-seeing-own-biological-mother/",
            "content": "The X app @grok last week propagated a false story that suggests Marry Mubaiwa has been reunited with her children shes for 7 years running been blocked from seeing by her ex husband Vice President Constantino Chiwenga.\n\nThe picture which was circulated by some people and by the @grok app is not at all of any of Marry Mubaiwas children.\n\nThe woman in the picture with her is a sister in law of Marry Mubaiwas, ZimEye Verify reports.\n\nShes not my daughter, she is my muroora, @MarryMubaiwa said.\n\nHer brother @MubaiwaPrincely also confirmed saying the woman with Marry Mubaiwa in the picture is his own wife.\n\nMarry Mubaiwas biological children remain blocked from seeing their mother 7 years running, contrary to tweets re-shared by many who include X users @LynneStactia @IanSmiththe3rd .\n\nOne of Marrys sons, Michael received a church confirmation ceremony last Sunday, with his step mum, Minnie Baloyi announcing this wasConfirmation of our son Michael at St Geralds Churchwe are making sure we teach him to live a Christ like life from a tender age.\n\nBaloyi totally omitted any mention of Michaels biological mother.\n\nThe Catholic Church also broke Biblical rules by conducting the function in the absence of the lads biological mother.\n\nI am being blocked from my children so that Constantino can play the father role and pretend their mother is someone else.\n\nI know the time will come when they will come for me. Whoever is playing a mother figure is simply playing maid to my children, said Marry Mubaiwa. -ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The X app @grok last week propagated a false story that suggests Marry Mubaiwa has been reunited with her children … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/marry-mubaiwas-kids-hit-7-years-blocked-from-seeing-own-biological-mother/\">Continue reading<span class=\"screen-reader-text\"> \"Marry Mubaiwa’s Kids Hit 7 Years Blocked From Seeing Own Biological Mother\"</span></a></p>",
            "time": "08:36",
            "date": "28 Sep 2025"
        }
    ]
}