{
    "news": [
        {
            "title": "Joy For Zimbos in Botswana",
            "url": "https://www.zimeye.net/2024/12/12/joy-for-zimbos-in-botswana/",
            "content": "Political ReporterBotswanas new President, Duma Boko, has initiated a groundbreaking program to document and regularize skilled Zimbabweans living there, bringing hope to the estimated 150,000 Zimbabweans.\n\nThe initiative, welcomed by Zimbabwean authorities, aims to formalize the status of undocumented individuals, enabling them to contribute to Botswanas economy while improving their access to services.\n\nZimbabwes Ambassador to Botswana, Henry Mukonoweshuro, praised the move, likening it to South Africas special dispensation granted to Zimbabweans in 2009.\n\nWe welcome President Bokos commitment to documenting our people. It ensures trust and traceability, allowing them to seek employment and contribute meaningfully, said Mukonoweshuro.\n\nHe added that discussions with Botswanas Ministry of Immigration are underway to turn the presidents pronouncement into action.\n\nAt the Zimbabwean Embassy in Gaborone, consular services are in high demand, with up to 150 Zimbabweans seeking assistance daily for passport renewals, birth certificates, and permits.\n\nThe embassy also compiles a comprehensive list of Zimbabweans in Botswana to streamline the documentation process.\n\nZimbabweans in Botswana, including professionals like Dr. Brighton Hurombo, a lecturer at the University of Botswana, have expressed satisfaction with the embassys services. I am pleased with the efficiency of the embassy. Their support ensures smoother processes for those of us traveling or renewing documents, he said.\n\nPresident Bokos initiative represents a significant step toward strengthening Botswana-Zimbabwe relations while addressing the needs of Zimbabwean expatriates.\n\nThis progressive approach acknowledges the skills and commitment of Zimbabweans and underscores the importance of inclusive policies in fostering regional stability and development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Political Reporter–Botswana’s new President, Duma Boko, has initiated a groundbreaking program to document and regularize skilled Zimbabweans living there, bringing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/joy-for-zimbos-in-botswana/\">Continue reading<span class=\"screen-reader-text\"> \"Joy For Zimbos in Botswana\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Magaya, Makandiwa Face Tax Clampdown Over Holy Hustle",
            "url": "https://www.zimeye.net/2024/12/12/magaya-makandiwa-face-tax-clampdown-over-holy-hustle/",
            "content": "By ReligionReporterTheZimbabwe Revenue Authority (ZIMRA) has announced that churches generating income fromthe sale ofmerchandiseincluding books, music, and so-called anointing oilwill now be subject to taxation.\n\nThis move targets religious figures like Walter Magaya and Emmanuel Makandiwa, who have long faced criticism for exploiting desperate followers through high-priced private consultations and selling purportedly sacred products.\n\nWhile donations, tithes, and offerings remain exempt from tax, ZIMRA clarified that proceeds from trading activities, such as selling branded items andartifacts, fall squarely under taxable income.\n\nThisincludes sales of anointing oils, which have become a lucrative venture for many charismatic churches.\n\nA ZIMRA notice emphasized compliance, urging churches to register and submit outstanding tax returns to avoid penalties. By voluntarily staying compliant, you contribute to a fair and sustainable tax system that supports national development, the authority stated.\n\nCritics argue that some churches exploit vulnerable congregants under the guise of faith.\n\nThe taxation ofcommercial activities within religious institutions is seen as a step toward curbing abuse while ensuring financial accountability.\n\nZIMRA plans to host a stakeholder engagement forum to discuss tax compliance further, with details tobe announced.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Religion Reporter–The Zimbabwe Revenue Authority (ZIMRA) has announced that churches generating income from the sale of merchandise—including books, music, and so-called anointing oil—will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/magaya-makandiwa-face-tax-clampdown-over-holy-hustle/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya, Makandiwa Face Tax Clampdown Over Holy Hustle\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Young Warriors Fall…",
            "url": "https://www.zimeye.net/2024/12/12/young-warriors-fall-2/",
            "content": "By A Correspondent\n\nThe Zimbabwe U-17 team has been eliminated from the 2025 U-17 Africa Cup of Nations (AFCON) qualifiers after a 2-0 defeat to Angola in the semifinals of the COSAFA Qualifier.\n\nThe Young Warriors conceded one goal in each half of the match, which was held at the University of Johannesburgs AW Muller Stadium.\n\nAngola, who topped Group C, secured the first qualification spot for the 2025 U-17 AFCON in Ivory Coast. The second qualifier will be determined after the second semifinal between South Africa and Zambia.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe U-17 team has been eliminated from the 2025 U-17 Africa Cup of Nations (AFCON) qualifiers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/young-warriors-fall-2/\">Continue reading<span class=\"screen-reader-text\"> \"Young Warriors Fall…\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "FIFA Announces Hosts for 2030 and 2034 World Cups",
            "url": "https://www.zimeye.net/2024/12/12/fifa-announces-hosts-for-2030-and-2034-world-cups/",
            "content": "Sports Correspondent\n\nFIFA has officially confirmed the host nations for the 2030 and 2034 World Cup tournaments.\n\nThe 2030 World Cup will be a historic event, co-hosted by Spain, Portugal, and Morocco. Additionally, Argentina, Paraguay, and Uruguay will each host one of the 104 matches. This South American collaboration will commemorate the 100th anniversary of the inaugural World Cup, which was held in Uruguay in 1930.\n\nThe 2034 World Cup will be hosted by Saudi Arabia, marking the second time a Middle Eastern country will host the prestigious tournament. Saudi Arabias bid was the only one submitted and received overwhelming support from over 200 FIFA member federations during a remote online meeting led by FIFA President Gianni Infantino in Zurich on Wednesday.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent FIFA has officially confirmed the host nations for the 2030 and 2034 World Cup tournaments. The 2030 World … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/fifa-announces-hosts-for-2030-and-2034-world-cups/\">Continue reading<span class=\"screen-reader-text\"> \"FIFA Announces Hosts for 2030 and 2034 World Cups\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Strive Masiyiwa Gets Tech-Honorary PhD",
            "url": "https://www.zimeye.net/2024/12/12/strive-mayiwa-gets-tech-honorary-phd/",
            "content": "Stellenbosch, South Africa Zimbabwean billionaire and telecommunications pioneer Strive Masiyiwa has been awarded an honorary Doctorate in Engineering by Stellenbosch University, recognising his transformative contributions to Africas telecoms sector and philanthropic endeavours.\n\nMasiyiwa received the prestigious accolade on December 10, 2024.\n\nA trailblazer in mobile telecommunications, his visionary leadership has propelled Africas digital infrastructure over the past four decades while uplifting communities across the continent through his philanthropy.Mr. Masiyiwa is an exemplary African leader who has not only achieved remarkable success but is now using his influence to improve lives,said Professor Wikus van Niekerk, Dean of the Faculty of Engineering.Born in Zimbabwe in 1961, Masiyiwa studied Electrical and Electronic Engineering at the University of Cardiff, graduating in 1983. His career began as a telecoms engineer in Zimbabwe before launching his first business in 1986. Today, he chairs Cassava Technologies, a pan-African and global technology group driving digital connectivity and innovation.\n\nWith ventures spanning Africa, Europe, and beyond, Cassava Technologies has laid over 110,000 kilometres of fibre, bridging the digital divide across the continent.\n\nIts portfolio includes African Data Centres, Liquid Intelligent Technologies, and Cassava AI.\n\nMasiyiwas philanthropic initiatives, spearheaded by the Higherlife Foundation and Delta Philanthropies, have provided over 300,000 scholarships, supported public health efforts, and empowered women, youth, and rural communities.\n\nHis humanitarian contributions have extended to tackling AIDS, cholera, and Ebola.\n\nInternationally celebrated, Masiyiwa has earned accolades from Forbes, Bloomberg, and Fortune, and in 2024, received the W.E.B. Du Bois Medal from Harvard University.\n\nHe has also served on numerous boards and advisory councils, including Netflix, the Bill & Melinda Gates Foundation, and Stanford University.\n\nMasiyiwas Stellenbosch University doctorate adds to a collection of honorary degrees from globally renowned institutions, reflecting his commitment to fostering innovation, connectivity, and social progress.-Sun\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Stellenbosch, South Africa – Zimbabwean billionaire and telecommunications pioneer Strive Masiyiwa has been awarded an honorary Doctorate in Engineering by Stellenbosch … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/strive-mayiwa-gets-tech-honorary-phd/\">Continue reading<span class=\"screen-reader-text\"> \"Strive Masiyiwa Gets Tech-Honorary PhD\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Mai Dhuterere In Court For Fraud",
            "url": "https://www.zimeye.net/2024/12/12/mai-dhuterere-in-court-for-fraud/",
            "content": "Mai Dhuterere, the wife of popular gospel musician Mambo Dhuterere, was arrested on fraud charges and appeared before the Harare Magistrates Court on Thursday morning. Dressed in a striking black-and-white outfit, she arrived at the court accompanied by police detectives.\n\nCourt officials confirmed the charges, though they withheld full details of the case.\n\nShe is an accused person in a fraud-related matter, said one official, who requested to remain anonymous.\n\nThe arrest has sent shockwaves through social media, where many fans have expressed disbelief at the allegations. I cant believe this is happening to Mai Dhuterere. She always seemed so humble, one fan commented, reflecting the sentiments of others who are struggling to come to terms with the news.\n\nAs of now, Mambo Dhuterere, the gospel stars husband, has not commented on his wifes arrest. His silence has only fueled the curiosity and speculation surrounding the case.\n\nMai Dhutereres arrest marks a significant turn in the public life of the gospel musicians family, known for their positive image within Zimbabwes gospel music scene. Fans and the public are eagerly awaiting more details regarding the case as it unfolds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mai Dhuterere, the wife of popular gospel musician Mambo Dhuterere, was arrested on fraud charges and appeared before the Harare … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/mai-dhuterere-in-court-for-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Mai Dhuterere In Court For Fraud\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Effects Of Distracted Driving…",
            "url": "https://www.zimeye.net/2024/12/12/effects-of-distracted-driving/",
            "content": "Distracted driving is doing another activity that takes the drivers attention away from driving.\n\nDistracted driving can increase the chance of a motor vehicle crash.\n\nThere are three types of driving distractionsAnything that takes your attention away from driving can be a distraction.\n\nSending a text message, talking on a cell phone, using a navigation system, and eating while driving are a few examples of distracted driving.\n\nAny of these distractions can endanger you, your passengers, and others on the road.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Distracted driving is doing another activity that takes the driver’s attention away from driving. Distracted driving can increase the chance … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/effects-of-distracted-driving/\">Continue reading<span class=\"screen-reader-text\"> \"Effects Of Distracted Driving…\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Machakaire, Paradza Exchange Harsh Words Over Reshuffling",
            "url": "https://www.zimeye.net/2024/12/12/machakaire-paradza-exchange-harsh-words-over-reshuffling/",
            "content": "By A Correspondent\n\nInfighting within the ZANU PF Youth League has escalated, as Youth League Secretary Tinoda Machakaire has demanded that his deputy, John Paradza, immediately retract a circular that he issued, which allegedly nullified a recent reshuffling of the national executive council.\n\nOn December 9, 2024, Machakaire announced the reshuffle of the ZANU PF Youth League, a move that was met with resistance from Paradza. Paradza argued that the reshuffle was unconstitutional and instructed the affected officials to remain in their positions.\n\nIn his response, Paradza referred to specific provisions within the partys constitution, asserting, May you acquaint yourself with the provisions of Article 26(340)(1)&(2) which provide for the functions and responsibilities of the Deputy Secretary for Youth Affairs. He emphasized that as Deputy Secretary for Youth Affairs, Machakaire had no right to interfere with the functions of the Secretary for Youth Affairs, stating that Machakaire had no constitutional basis for making such a move.\n\nParadza further challenged Machakaires actions, saying, In your letter, you have made vague reference to the composition of the Youth League National Executive Council without particularity on the provision you rely on in making your assertions. He pointed out that there had been no breach of the constitution in the reshuffle, as no official had been removed from the National Executive Council.\n\nMachakaire, in his own letter, defended the reshuffle, stating, Adjustments in the departmental leadership of the Youth League National Executive Council have been implemented purely for the purposes of enhancing the fulfilment of the Youth Leagues constitutional obligations and the execution of the National Peoples Conference Resolutions.\n\nHe also made it clear that the changes were in line with guidance from his principal, asserting, As head of the Youth League, I have communicated the adjustments as I have been duly guided by my Principal in terms of Article 10(88)(1), (2)&(13) and Article 26(339)(1)&(4).\n\nIn conclusion, Machakaire ordered Paradza to withdraw his circular immediately, warning that failure to do so would result in further disciplinary actions. Your much circulated and published correspondence contesting the communicated position is irregular and must be withdrawn forthwith, failing which the appropriate measures shall be set in motion, he stated.\n\nThe growing tension within the Youth League highlights deepening divisions within ZANU PF, with significant implications for the partys future cohesion.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Infighting within the ZANU PF Youth League has escalated, as Youth League Secretary Tinoda Machakaire has demanded … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/machakaire-paradza-exchange-harsh-words-over-reshuffling/\">Continue reading<span class=\"screen-reader-text\"> \"Machakaire, Paradza Exchange Harsh Words Over Reshuffling\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Another Zanu PF Youth Leader Arrested",
            "url": "https://www.zimeye.net/2024/12/12/another-zanu-pf-youth-leader-arrested/",
            "content": "By Political Reporter- Lewis Matutu, a former Zanu PF youth league secretary, has been arrested.\n\nMatutu appeared on Tuesday at the Harare Magistrates Court, facing a charge of fraud.\n\nHe is being accused of unlawfully transferring 240 ordinary shares to his name in a company he was entrusted to direct as part of a youth empowerment initiative.\n\nHe appeared before Harare provincial magistrate Isheanesu Matova and was remanded out of custody.\n\nThe complainant is Joseph Evurath Sibanda, a director and shareholder of Shusib Investments (Private) Limited.\n\nState prosecutor Takudzwa Jambawu said sometime in 2012, Sibanda and his relative Lyton Shumba successfully registered Shusib Investments (Pvt) Limited.\n\nThe company had 2 000 ordinary shares.The court heard that Sibanda later approached the Department of Parks and Wildlife for mineral exploration in the Shamva/Mufurudzi area.\n\nHe was granted a 25-year lease.\n\nSibanda and his partner then agreed to rope in youths in line with the governments youth empowerment agenda.\n\nIn the process, Sibanda engaged Matutu, who became a co-director of the company.\n\nPambili Investments Corporation, representing youths, was also engaged and allocated 240 ordinary shares.\n\nIn 2018, Matutu allegedly connived with Blessing Kusangaya, Tafadzwa Kusangaya, Muzimba Muhamba and Chikwasha Muhamba to steal shares from the company.\n\nThey prepared annual returns dated April 30, 2018, and forged signatures to change the shareholding structure, which made them majority shareholders.\n\nThe offence came to light on September 30 when Sibanda was informed by the Department of Parks and Wildlife Management that Matutu had instructed them to suspend mining operations.\n\nAs a result, Sibanda was prejudiced of US$150 000 and nothing was recovered.-Newsday\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- Lewis Matutu, a former Zanu PF youth league secretary, has been arrested. Matutu appeared on Tuesday at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/another-zanu-pf-youth-leader-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"Another Zanu PF Youth Leader Arrested\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        },
        {
            "title": "Varakashi Admit Loadshedding Now A Menace",
            "url": "https://www.zimeye.net/2024/12/12/varakashi-admit-loadshedding-now-a-menace/",
            "content": "By A Correspondent\n\nZanu PF hardliners, known as Varakashi, have finally acknowledged that the ongoing electricity load shedding has become a significant problem for the nation.\n\nIn a statement released on Wednesday, the Varakashi group, which runs the Operation Restore Legacy Facebook page, expressed their concerns over the worsening power situation.\n\nThey stated, A lot needs to be done for electricity load shedding to be a thing of the past. The government must engage the best companies or investors who can revive the Kariba Dam Hydro Power Plant.\n\nThe group also provided a visual explanation of the current state of the power supply. They shared two photos, with the first showing the turbines at the Kariba Dam, noting, These are our turbines, and only 2 out of 5 are working. Unfortunately, as of yesterday, only one turbine was functional.\n\nThe second photo depicted Zambias situation, which is similarly strained. Zambia also had only 2 turbines working. Water levels have decreased so much despite other challenges, they added.\n\nThe Varakashis comments highlight the growing frustration and urgency surrounding the ongoing power crisis in the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF hardliners, known as Varakashi, have finally acknowledged that the ongoing electricity load shedding has become … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/varakashi-admit-loadshedding-now-a-menace/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi Admit Loadshedding Now A Menace\"</span></a></p>",
            "time": "2024-12-12 20:47:02"
        }
    ]
}