{
    "news": [
        {
            "title": "ZIMSEC Announces 2025 Exam Fees",
            "url": "https://www.zimeye.net/2025/02/14/zimsec-announces-2025-exam-fees/",
            "content": "By Munacho Gwamanda-TheZimbabweSchool Examinations Council (ZIMSEC) has announced the examination fees and structure for the June and November 2025 sessions, maintaining the same fee structure as in previous years despite economic instability and currency fluctuations.\n\nIn a statement issued on Thursday, February 13, ZIMSEC confirmed that fees remain unchanged and urged candidates to adhere strictly to theirschoolsregistration dates and deadlinesset.\n\nThe 2025 Ordinary Level examination feeis setatUS$24 per subject.Candidates enrolled in publicschools, local authority schools, and non-profit mission schools will payUS$11, while the government will subsidize the remainingUS$13.\n\nHowever, privateschool,college, and independent candidates will not benefit from the subsidy and will be required to pay thefullUS$24 per subject.\n\nFor Advanced Level candidates, the examination fee isUS$48 per subject. Those in public, local authority, and mission schools will payUS$22, with the government coveringUS$26. Private candidates, including those in private schools and colleges, must pay thefullUS$48 per subject.\n\nThe subsidy applies only toa maximum of seven subjects for Ordinary Level candidatesandfoursubjectsfor Advanced Level candidates, including Communication Skills. Additionally,candidates retaking subjects are not eligible for the subsidy, nor does the BEAM programme cover retake examinations.\n\nParents and guardians can pay inUnited States Dollars (USD), South African Rand (ZAR), or Zimbabwe Gold (ZiG), thecountrysnewly introduced currency that replaced the Zimbabwean dollar (ZWL). For those opting to pay in ZiG, theinterbank exchange rate as of March 10, 2024 (for June exams) and March 24, 2024 (for November exams)will determine the exact amounts.\n\nZimbabweseconomic history hasbeen marredbyhyperinflation,which led to the collapse of the local currencymultiple times.The recent reintroduction of theZimbabwe Gold (ZiG) currencyis meantto stabilize the economy by anchoring it on mineral reserves.However, concerns remain overthevolatility of the exchange rate, making many parents hesitant to pay fees in ZiG, fearing depreciation before exam dates.\n\nAlthough ZIMSEC has kept fees unchanged,Zimbabwesinflationary pressures could erode affordability, particularly for families earning in local currency. Thegovernmentscontinued subsidy provides some relief, but with thecost of living rising, many parents may still struggle to afford multiple subjects, especially at the Advanced Level.\n\nEducation activists have raised concerns that the examination fees, particularly for private candidates, remain high relative to average incomes. They have urged the government toexpand subsidy eligibilityto ensure more students can sit for their exams without financial barriers.\n\nZIMSEC has advised candidates and guardians tovisittheir nearest school or examination centreto complete registration.The council emphasized thatall fees must be paidwithin the stipulated deadlines to avoid late penalties.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-The Zimbabwe School Examinations Council (ZIMSEC) has announced the examination fees and structure for the June and November 2025 sessions, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/zimsec-announces-2025-exam-fees/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMSEC Announces 2025 Exam Fees\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Morgan Tsvangirai, Epitome Of Democracy In Zimbabwe",
            "url": "https://www.zimeye.net/2025/02/14/morgan-tsvangirai-epitome-of-democracy-in-zimbabwe/",
            "content": "Today, we celebrate and eulogize the life of a true African hero, Dr. Morgan Richard Tsvangirai,affectionately known as Save.A champion and epitome of democracy, a warrior for justice, and a symbol of hope for the people of Zimbabwe.A face of courage!\n\nMorgan Tsvangirais life was a testament to his unwavering commitment to the fight for freedom and equality. He spent his life challenging the status quo, pushing boundaries, and inspiring generations to stand up for their rights.\n\nAs the leader of the Movement for Democratic Change, Morgan Tsvangirai faced unimaginable challenges and hardships. He was imprisoned, tortured, and persecuted, but he never lost faith in the struggle for a better Zimbabwe.\n\nMorgans legacy is not just about his own achievements; its about the countless lives he touched, the families he inspired, and the communities he empowered. He was a true servant-leader, always putting the needs of others before his own.\n\nAs we eulogize this remarkable man, we take comfort in the knowledge that his spirit will live on through us. We will continue to draw inspiration from his courage, his resilience, and his unwavering commitment to justice.\n\nMorgan Tsvangirai remained steadfast in his commitment to the struggle for democracy and freedom in Zimbabwe, even in the face of immense pressure and personal risk. He refused to compromise his values and principles, and continued to advocate for the rights and dignity of the Zimbabwean people.\n\nHis unwavering dedication to the cause earned him the respect and admiration of his fellow Zimbabweans, as well as the international community. He will always be remembered as a champion of justice, equality, and human rights.\n\nA social democrat who remained shining example of courage, integrity, and leadership, inspiring countless others to continue fighting for a better future for Zimbabwe.\n\nHis contribution and leadership in the Government of National Unity in 2009 helped to stabilize the economy, restore basic services, and promote national healing at a time Zimbabwe was grappling with an unprecedented crisis that threatened the very fabric of the nation. This earned him the moniker Mr $ for 2.\n\nMorgan Tsvangirais background as a trade unionist gave him a deep understanding of the struggles of working-class Zimbabweans and the importance of industrialization in driving economic growth and development.\n\nTsvangirai was well-versed in the issues affecting workers and the economy. He recognized that industrialization was key to creating jobs, stimulating economic growth, and reducing poverty.\n\nHis understanding of the importance of industrialization was a key aspect of his vision for Zimbabwes future, and it continues to inspire efforts to rebuild and revitalize the countrys economy.\n\nLong live the spirit of Dr. Morgan Richard Tsvangirai Save\n\nIgnatious G Sadziwa is the Executive Director of Zimbabwe Election Advocacy Trust (ZEAT)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Today, we celebrate and eulogize the life of a true African hero, Dr. Morgan Richard Tsvangirai,affectionately known as Save.A champion … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/morgan-tsvangirai-epitome-of-democracy-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Morgan Tsvangirai, Epitome Of Democracy In Zimbabwe\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "25 Perish In Beitbridge Horror Crash",
            "url": "https://www.zimeye.net/2025/02/14/25-perish-in-beitbridge-horror-crash/",
            "content": "By Crime and Courts-The police have confirmed the death of 25 people in a head-on collision in Beitbridge yesterday morning.\n\nThe accident occurred after the Urban Connect Bus erroneously overtook and collided head-on with a haulage truck near Beitbridge.\n\nBoth drivers survived but sustained critical injuries.\n\nThe Government has since declared the accident a national disaster.\n\nIn a statement yesterday, President Mnangagwa said: The death of fellow Zimbabweans in a head-on collision between an Urban Connect bus and a commercial truck along the Beitbridge-Masvingo highway this morning (yesterday), left me horrified and heartbroken.Fellow Zimbabweans, our nation does not deserve this at all, let alone experiencing such a bloody incident at the beginning of the year. We have to do all that is possible to curb this unjustified loss of life.The President appealed to drivers to exercise caution on the roads for the sake of fellow road users and themselves.All arms of Government responsible for ensuring safety on the roads have been directed to work around the clock and evoke all legal means and powers available to them to reduce road carnage.Added President Mnangagwa: Government has, therefore, declared this incident a national disaster and will accord victims of this horrendous crash State-assisted burial.As I express my deepest, heartfelt condolences to families and relatives who have lost their loved ones in this horrific crash, I also heartily and prayerfully reach out to all those injured and hospitalised, wishing them speedy recovery.Beitbridge district medical officer, Dr Lenos Samhere, said 17 passengers died on the spot while eight others who had sustained head injuries, died upon admission at the Beitbridge District Hospital.Fifty-three others were admitted for medical attention, with 10 of them who were critical, being transferred to Gwanda Provincial Hospital.Among the injured are 26 men and 30 women who have varied injuries and are admitted at the hospital, said Dr Samhere.Tragedy struck when the Beitbridge-bound Urban Connect bus collided head-on with a commercial truck travelling to Chirundu, carrying 34 tonnes of magnesium. The injured were rescued by other motorists, the police and other stakeholders working together with the local Civil Protection Committee.In a statement yesterday, Urban Connect Bus Company expressed condolences to the grieving families and the nation.The company pledged compassionate assistance of US$500 to each grieving family.As Urban Connect, we want to express our heartfelt condolences to families and relatives of our fellow Zimbabweans who passed on in the bus accident on Thursday 13 February 2025 near the Lutumba Tollgate along the Masvingo-Beitbridge Highway.We wish a speedy recovery to those injured. We will offer compassionate assistance to relatives of the departed and we have started rendering assistance to the injured.In addition, we pledge to cooperate with authorities in investigations into this accident, a company representative said.National police spokesperson, Commissioner Paul Nyathi, said the bodies of all victims had been taken to Beitbridge District Hospital mortuary for post-mortems.Police will release more details when available.When The Herald news crew arrived at the scene yesterday, the police, community members and the Municipality of Beitbridge emergency services were pulling out some bodies trapped in the wreckage of the bus.A crowd had also formed around the accident scene, with curious residents checking for possible relatives who could have been victims of the fatal accident.One of the first people to attend the scene, Mr Thomas Nhundu who works for a funeral parlour and was driving towards Beitbridge, said he, together with other people living close to the highway, retrieved some of the injured from the bus.The bus had just overtaken and when we arrived there were bodies all over the tarmac. The injured whom we pulled out of the wreckage were transported to the hospital by the police, other motorists and various Government agencies, said Mr Nhundu.Another witness, Mr Leonard Wanderson, a resident of Tshapfutshe said he rushed to the scene after hearing a loud bang near the tollgate.I had seen the bus passing through our business centre when suddenly I heard a loud bang and I rushed here. Together with other community members, we then started rescuing those who were injured and covering dead bodies with blankets and some clothes that were strewn all over the scene, he said.Mr Wanderson said most of the passengers who were sitting on the front seats were thrown on the tarmac on impact.Following the accident, some panic-stricken residents thronged the hospital to check on their relatives who were reported to have been travelling from Harare.Others said they were at the hospital to offer compassion to the bereaved and material support to the hospital.In separate interviews, some survivors said they were sleeping by the time of accident, only to wake up on the tarmac and later to hospital.I was awoken by the large bang and I saw a lot of bodies lying on the road. I became very scared and in a few moments, I was rushed to the hospital where medical staff attended to me and the other injured passengers, said Mr Tinsahe Chingo from Chitungwiza.Ms Tambudzai Mugasa said she became frightened after noticing that the bus was about to collide with the truck.I just stared at death haplessly and put everything in Gods hands when I noticed that the bus was about to collide with the truck. The next thing, I found myself outside the bus next to several dead bodies, she said.Environmental Management Agency spokesperson, Ms Amkela Sidange, said the magnesium that had spilled on the accident scene was likely to cause minimal effect on the environment.-State media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts-The police have confirmed the death of 25 people in a head-on collision in Beitbridge yesterday morning. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/25-perish-in-beitbridge-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"25 Perish In Beitbridge Horror Crash\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Blessed Geza And His Sugar-Washing Solution | WILBERT MUKORI",
            "url": "https://www.zimeye.net/2025/02/14/blessed-geza-and-his-sugar-washing-solution-wilbert-mukori/",
            "content": "Zimbabweans have a penchant for sugar-rush solutionsMnangagwa must goeven at the cost of retaining the dictatorship yet again.\n\nBy Wilbert Mukori | Zimbabwe is in desperate need of transformative leadership, not the routine recycling of failed politicians, argued Trevor Ncube. A change in leadership might offer temporary relief, but Zimbabwes issues run deeper, demanding a systemic overhaul.\n\nCould not agree with you more!\n\nGod only knows how many golden opportunities we have had to completely overhaul our failed political systemmost notably the 2008 to 2013 GNU and the 2017 military coupand yet, we have wasted them all. All because of greed, breathtaking incompetence, and, yes, our penchant for temporary relief. We would happily give up our freedoms, rights, and human dignity to appease the dictator on the off chance that he will have mercy on us, even when history tells us he will only demand more and double the abuse again and again.\n\nZimbabwe is a failed state because the nation has been stuck with this corrupt, incompetent, and tyrannical Zanu PF dictatorship for 45 years and counting. The party has enjoyed absolute power, including the power to rig elections, stay in power, and loot the nations wealth.\n\nRobert Mugabe and his Zanu PF cronies have bribed, cajoled, and even killed fellow Zanu PF nationalists, war veterans, and the nation at large to enforce the de facto Zanu PF one-party dictatorship. War veterans in the army, police, and other security forceswhether still in active service, retired, or demobilized in 1980have been brainwashed to believe that only Zanu PF leaders are fit to rule Zimbabwe and can be trusted to safeguard the nations independence and sovereignty. As a result, the army, police, and other security institutions have become departments of the party in all but name, serving the singular agenda of retaining absolute power at all costs.\n\nAs much as Blessed Geza and his faction of war veterans are right in condemning Mnangagwa as a corrupt and murderous dictator, they cannot deny that they played a part in imposing him through the 2017 military coup and the rigged elections that followed. They have toned down their criticism, hoping to see VP Chiwenga succeed Mnangagwa, but they will never accept that he must face the acid test of free, fair, and credible elections. Never!\n\nHow anyone can fail to see that swapping one dictator for another will solve nothingespecially after 45 years of rigged elections and bad governancebeggars belief!\n\nZanu PF will never reform itself out of power by accepting free and fair elections. The opposition MDC/CCC failed to implement even one token reform during the GNU, despite having a golden opportunity to do so. Mugabe bribed Morgan Tsvangirai and his MDC colleagues with the trappings of high office, and in return, they forgot about the reforms.\n\nSince the GNU debacle, MDC/CCC leaders have continued to participate in flawed elections, legitimizing Zanu PFs victory for the sake of a few gravy-train seats. They have conned their brain-dead followers into participating based on the idiotic claim that the opposition can win rigged elections. The very fact that millions of Zimbabweans have believed these lies time and time again, even after 45 years of rigged elections, explains why we are a failed state.\n\nYes, we need a complete systemic overhaul of our failed political system.\n\nThe only way forward, according to Ncube, is through a national, inclusive process that involves all stakeholders, including business leaders, civil society, the Church, labor, women, and youth. These groups must work together to rebuild the country, reported Bulawayo 24.\n\nSome might argue that the writing of the 2013 Constitution was an inclusive process. Yet, no one can deny that it was another wasted opportunity to dismantle the Zanu PF dictatorship and replace it with a healthy and functional democracy. A body of 50 or so technocrats could be tasked with drafting the nations new democratic constitution. They would only need to use the tried-and-tested constitutions of other nations as a starting pointno need to reinvent the wheel.\n\nIt would be deeply disappointing if the momentum built since Mnangagwa took over from Mugabe results in merely replacing one dictator with another. What we want is the end of the dictatorship, not just another fleeting sugar rush from seeing Mnangagwa goonly to be followed by years more of what Trevor Ncube aptly described as soul-crushing poverty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabweans have a penchant for sugar-rush solutions—“Mnangagwa must go”—even at the cost of retaining the dictatorship yet again. By Wilbert … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/blessed-geza-and-his-sugar-washing-solution-wilbert-mukori/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza And His Sugar-Washing Solution | WILBERT MUKORI\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Zanu PF Mobilizes Structures To Support 2030 Agenda ?",
            "url": "https://www.zimeye.net/2025/02/14/zanu-pf-mobilizes-structures-to-support-2030-agenda/",
            "content": "By A Correspondent\n\nZANU PF is reinforcing its grassroots structures through a cell verification exercise, an initiative that insiders suggest is also strategically positioned to bolster support for President Emmerson Mnangagwas potential third-term ambitions.\n\nThe ruling party has embarked on a nationwide cell restructuring program, aimed at ensuring the partys foundations are solidified with accurate and up-to-date data. The verification exercise, now in full swing, is seen as crucial in guaranteeing that the membership base is genuine and engaged, forming the backbone of ZANU PFs long-term strategy.\n\nDuring a Special Provincial Coordinating Committee meeting held at the partys Harare headquarters on Wednesday, ZANU PFs National Political Commissar, Cde Munyaradzi Machacha, emphasized the significance of the exercise for the partys future.\n\nCells are our foundation as ZANU PF, and if we have a weak foundation, then we will be shaken, Cde Machacha explained. This weekend, visitors from Mashonaland Central, led by Central Committee member Cde Douglas Mombeshora, will be in Harare to verify whether the cells are existent.\n\nThe verification process, which started in Bulawayo and is now underway in Harare, is set to expand to other provinces in March. Should discrepancies or poor-quality work be identified, those responsible will be required to rectify the situation, ensuring that only accurate data is maintained.\n\nIf it is realized that a shoddy job was done, those affected would have to redo it, Cde Machacha added.\n\nZANU PF Harare Province Chairperson, Cde Godwills Masimirembwa, spoke proudly of the provinces progress, revealing that they have successfully registered over 400,000 members through the exercise.\n\nWe are ready as a province to have this exercise done. We are sure of the work we did and I can say we managed to register over 400,000 members, Cde Masimirembwa stated.\n\nThis cell verification exercise serves not only as a tool for membership auditing but also aims to recruit new members, particularly from the youth demographic, aligning with ZANU PFs broader goal of consolidating support ahead of upcoming political events.\n\nWhile the exercise is officially framed as a way to strengthen the partys structure, some political insiders view it as a calculated move to secure widespread backing for Mnangagwas third-term aspirations and to ensure party loyalty is deeply embedded at every level.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF is reinforcing its grassroots structures through a cell verification exercise, an initiative that insiders suggest … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/zanu-pf-mobilizes-structures-to-support-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Mobilizes Structures To Support 2030 Agenda ?\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Zanu PF Hardliners Fight In Ramaphosa Corner",
            "url": "https://www.zimeye.net/2025/02/14/zanu-pf-hardliners-fight-in-ramaphosa-corner/",
            "content": "By A Correspondent\n\nIn a bold call for the complete removal of Western-imposed sanctions, supporters of Zimbabwes President Emmerson Mnangagwa are pushing for the lifting of restrictions, despite the ongoing issues of human rights violations, corruption, and looting of state resources in the country.\n\nThe Citizens Against Economic Sanctions Zimbabwe (CAESZ) held a media briefing in Harare on Wednesday, where the associations managing director, Cde Martin Zharare, expressed strong support for President Mnangagwas Vision 2030. He emphasized that the goal is to move the country towards an upper-middle-class society, but this can only be achieved if the illegal sanctions imposed by the United States and its Western allies are removed.\n\nWe are an anti-sanctions lobby group, and we are ready to promote President Mnangagwas Vision 2030 to achieve an upper-middle-class society, Zharare stated.\n\nHe also reiterated the groups unwavering stance on the removal of sanctions, asserting that Zimbabwe cannot discuss any progress until the Zimbabwe Democracy and Economic Recovery Act (ZIDERA) is repealed.\n\nWe will continue to call for the total removal of sanctions by the West on Zimbabwe, and until the Zimbabwe Democracy Economic Recovery Act, ZIDERA, is repealed, we cannot talk of the removal of sanctions; they must go in totality, Zharare insisted.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold call for the complete removal of Western-imposed sanctions, supporters of Zimbabwe’s President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/zanu-pf-hardliners-fight-in-ramaphosa-corner/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hardliners Fight In Ramaphosa Corner\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Auxillia Mnangagwa Causes Havoc In Masvingo",
            "url": "https://www.zimeye.net/2025/02/14/auxillia-mnangagwa-causes-havoc-in-masvingo/",
            "content": "By A Correspondent\n\nAuxillia Mnangagwa, the First Lady of Zimbabwe, caused major disruptions in Masvingo on Wednesday after instructing local schools to transport students to her rally at the Showgrounds, effectively halting normal school activities for the day.\n\nA school head confirmed the directive, saying, Yes, we were instructed to release our bus for the rally. Our students also participated in the First Ladys event. This unexpected move not only interrupted lessons but also created logistical chaos within the city.\n\nIn addition to the disruption in education, Mnangagwas security detail caused heavy traffic congestion throughout Masvingo. Observers noted that the high level of security surrounding the First Lady seemed to reflect growing tensions within the Zanu PF party.\n\nIn a separate incident, a ZUPCO bus, which was set to ferry Zanu PF supporters to the First Ladys rally, was swept away by strong floodwaters at Musavezi Bridge in Chivi Ward 3. The bus had not yet picked up passengers when the flooding occurred. The driver was forced to abandon the vehicle and swim to safety.\n\nDuring her rally, the First Lady took the opportunity to promote her philanthropic initiatives, including donating books to students across the province. I am proud of my philanthropic efforts, Mnangagwa said as she presented the books intended to benefit local learners.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Auxillia Mnangagwa, the First Lady of Zimbabwe, caused major disruptions in Masvingo on Wednesday after instructing local … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/auxillia-mnangagwa-causes-havoc-in-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa Causes Havoc In Masvingo\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Mighty Warriors Ready For Battle",
            "url": "https://www.zimeye.net/2025/02/14/mighty-warriors-ready-for-battle-2/",
            "content": "By Sports Correspondent\n\nThe final Mighty Warriors squad for the 2026 CAF Womens Africa Cup of Nations Qualifiers has been revealed, with Zimbabwe set to face Angola in the first round of the competition in February.\n\nCoach Sithethelelwe Sibanda has named a strong squad, featuring Australia-based forward Yolanda Kanyai, along with Emmaculate Msipa and Ruvimbo Mucherera, who both play in Israel. Notably, striker Rutendo Makore makes a return to the squad after a long absence.\n\nHere is the Mighty Warriors Squad:\n\nGOALKEEPERSVanessa Lunga, Precious Mudyiwa, Lindiwe Magwede.\n\nDEFENDERSEgness Tumbare, Sheila Antonio, Purity Mugayi, Nobukhosi Ncube, Alice Moyo, Fortunate Ngocho.\n\nMIDFIELDERSDaisy Kaitano, Morelife Nyagumbo, Ennetty Chemhere, Natasha Ndowa, Danai Bhobho, Emmaculate Msipa, Mavis Chirandu, Shyline Dambamuromo.\n\nSTRIKERSChristabel Katona, Rutendo Makore, Ethel Chinyerere, Yolanda Kanyai, Ruvimbo Mucherera.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent The final Mighty Warriors squad for the 2026 CAF Women’s Africa Cup of Nations Qualifiers has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/mighty-warriors-ready-for-battle-2/\">Continue reading<span class=\"screen-reader-text\"> \"Mighty Warriors Ready For Battle\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Relocated Buhera villager bashed  over land",
            "url": "https://www.zimeye.net/2025/02/14/relocated-buhera-villager-bashed-over-land/",
            "content": "By Own Correspondent\n\nA villager, Jobet Mupengo who was relocated from Ward 12, under Tagarira village following the establishment of Sabi Star Mine was whipped by two police officers over farming land.\n\nMupengo was summoned by the two police officers whose identities he did not name, at Bhidhiri station and was ordered to lie down before the officers took turns to whip him on his back using baton sticks over a land dispute.\n\nHe however indicated that given the chance, he can identify the two police officers.\n\nMupengo is one of the 44 Buhera families that were relocated and compensated early 2023 by the multi- million dollar lithium mine, Sabi Star Mine, partly owned by Chengxin Lithium Group of China which is operating in partnership with Max Mind Investment Zimbabwe Private Limited in Zimbabwe.\n\nMaxi Mind Investment Zimbabwe Private Limited of 15 Harare Drive Chisipite Harare is a company registered in Zimbabwe according to the Companies Act 24:03. Mr Liu Zheng is one of the companys shareholders. Sabi Star lithium mine is a subsidiary of Maxi mind Investment Zimbabwe.\n\nA 44 year old father of 4 who was born and bred in Tagarira village, Mupengo told this publication that the dispute over land emanated from failure by the mining firm Sabi Star mine to honour its promise and ensure that those who did not move to Murambinda growth point were compensated agricultural land.\n\nHe said after he was relocated, he struggled to get agricultural land and missed two farming seasons since his relocation to his new home as he did not have a field to plough his crops. His livelihood relied on farming.\n\nI struggled to get any land when I was relocated and I persisted until the village head gave me virgin land which I started clearing. As I was about to finish clearing the land of trees, I was approached by Wonder Mushowe and Mutandwa Makanyos families who told me that the land that l have been given by the village head belonged to them.\n\nMupengo said the two families claimed that the area he had been allocated was their ancestral land but he referred them back to village head Tagarira since he was the one who had given him the land.\n\nOur dispute degenerated into almost a physical fight where they confiscated my axe which I was using to clear the land. I reported the matter to Sabhuku Tagarira who summoned the duo to his traditional court but they did not come, he said.\n\nMupengo said the two families refused to attend the traditional leaders court after they were summoned by village head Tagariras policeman. The two families were in no show despite several attempts for a meeting at the traditional court.\n\nMupengo said he was shocked to be summoned by the police 2 days after the two families had refused to attend village head Tagariras traditional court. Village head Tagarira was also summoned to the police.\n\nI was shown my axe confiscated by the Makanyus and interrogated on why I was clearing their land. They queried who had given me the authority to clear that land and which law l had used for my actions. The policeman denigrated the village head and said he was not EMA and had no authority to allow anyone to cut down trees.\n\nMupengo said the police officers threatened him and the village head.\n\nEfforts to get a comment from the police were futile by the time of writing. Village head Tagariras mobile phone was also not reachable.\n\nHuman rights lawyer Paida Saurombe said the police should not be at the forefront of land disputes as this is the mandate of traditional leaders adding that land disputes are issues that should be dealt with by traditional leaders such as village heads and chiefs.\n\nHe said chiefs have their own police who have the mandate to summon the aggrieved so that their issues are resolved peacefully at a traditional level.\n\nBeating people and torturing them is not allowed at law. It is abuse of power when the police beat up civilians. It is also impunity if police officers engage in such because they have power. When they subject people to beatings, it is a violation of the Constitution, said advocate Saurombe.\n\nIt amounts to torture and a violation of ones human dignity because they are subjected to beatings. Communities whose rights are violated by the police should report these violations at other police stations or higher offices for redress. When they report, such police officers are charged with assault and in terms of the Police Act.\n\nEnds//\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Own Correspondent A villager, Jobet Mupengo who was relocated from Ward 12, under Tagarira village following the establishment of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/relocated-buhera-villager-bashed-over-land/\">Continue reading<span class=\"screen-reader-text\"> \"Relocated Buhera villager bashed  over land\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        },
        {
            "title": "Chitungwiza residents fume over hefty “durawall” fine",
            "url": "https://www.zimeye.net/2025/02/14/chitungwiza-residents-fume-over-hefty-durawall-fine/",
            "content": "By Own Correspondent\n\nChitungwiza residents have expressed shock over the latest move by their local authority for homeowners and businesses to regularize their precast walls or pay fines ranging between $150 and $200 or have them demolished.\n\nAccording to a notice issued by Chitungwiza municipality Acting Town Clerk, Japson Nemuseso dated 27 January 2024, homeowners and businesses with unapproved durawalls should complete the necessary approval processes before 28 February 2025 or pay stated penalty fines or have them demolished.\n\nRead the notice:\n\nPlease also note that those who are not within their boundaries should revert back to original pegs.\n\nThe council is waiving the US$200 penalty fee for each approval stage to people who respond to this call before 28 February 2025. Those who respond before the deadline will only pay US$150 approval fee.\n\nIn the notice, residents are advised that if compliance is not achieved within a month, the municipality will not hesitate to demolish the durawalls at a cost that will be met by their owners.\n\nThis notice was issued in terms of the Regional, Town and Country Plan- and the Roads Act (Chapter 13: 18), said Nemuseso.\n\nCitizens Coalition for Change (CCC) Ward 16 councilor, Michael Mukashi said while the move by the local authority to effect such hefty fines was harsh, the onus was also on residents to follow the existing by- laws regarding the construction and maintenance of durawalls.\n\nCouncil is on record issuing a directive to residents to ensure that weep holes are there on their precast walls to avoid inconveniencing other residents this rainy season. The same residents ignore such calls only to cry foul when council is taking measures to protect the same residents against flooding and encroaching on other peoples property.\n\nWeep holes in durawalls are small openings at the base of a wall that allow water to drain and prevent water from pooling behind the wall, which can cause structural damage, mold, and even collapse.\n\nMukashi said in Ward 16, there were residents who deliberately closed weep holes causing flooding at some houses while others closed water leeways that ensured proper drainage of roads and homes in the community.\n\nThe latest notice is informed by a local government ministry recommendation to reduce cases of flooding this rainy season. There are durawalls that have been constructed that encroach on roads and it is the duty of the city fathers to ensure compliance and adherence to the by-laws.\n\nHe said while residents were justified that the fines were hefty, residents should also comply with the by- laws to avoid being caught on the wrong side of the law.\n\nChitungwiza and Manyame Rural Residents Association (CAMERA) director, Marvelous Khumalo said since the establishment of the town of Chitungwiza (in 1996), the durawalls that were built during this time were built without any form of approval from council and the local authority did not take any action.\n\nChitungwiza municipality was sleeping on duty when these structures were being built and now they are coming to rectify that challenge because some of these structures were built encroaching on other peoples property and on roads, said Khumalo.He said for council to just come up and say everyone should regularize or pay a fine is a bit unfair.\n\nCouncil needs to sit down with the affected constituency and consult and dialogue with residents and their representatives first.\n\nThey should find out how best to deal with the challenge instead of just imposing fines.\n\nHe however said the regularisation fee of $150 was justified considering that anyone who needed to construct their structure was supposed to pay $200 stage approval fee.\n\nIf you build your structure without any approval there is a fine but what needs to be clear is if this figure is a once off fee.\n\nStakeholders involvement is key.Chitungwiza Residents Association (CHITREST) director Alice Kuvheya however said besides the fine being hefty, council management had misplaced priorities.\n\nThe fine is not justified at all. The council does not know where their priorities are. They are prioritizing on durawalls, instead of houses.\n\nWe have sewer flowing in our houses for months which is not attended to, workers are not being paid. They never consulted us because we only woke up to a social media notice on durawalls, said Kuvheya.\n\nResidents who spoke to this publication however expressed concern at the move by the local authority accusing the city fathers of prioritizing fundraising ahead of service delivery.\n\nSaid Monica Dube:\n\nCan Chitungwiza municipality prioritise service delivery ahead of fines. They are failing to give us water for years, collect refuse and repair roads yet they are very good at imposing hefty fines.\n\nAdded Mike Bhaureni:\n\nChitungwiza municipality has inherited the spirit of finance minister Mthuli Ncube who is in the habit of charging locals exorbitant figures of foreign currency as if we are foreigners. Muchatopaza Chitungwiza yose meaning you will have to demolish the whole of Chitungwiza.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Own Correspondent Chitungwiza residents have expressed shock over the latest move by their local authority for homeowners and businesses … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/chitungwiza-residents-fume-over-hefty-durawall-fine/\">Continue reading<span class=\"screen-reader-text\"> \"Chitungwiza residents fume over hefty “durawall” fine\"</span></a></p>",
            "time": "06:08",
            "date": "15 Feb 2025"
        }
    ]
}