{
    "news": [
        {
            "title": "Take a Break for a Safer Journey…",
            "url": "https://www.zimeye.net/2025/04/07/take-a-break-for-a-safer-journey/",
            "content": "Feeling tired behind the wheel? Its more than just uncomfortableits dangerous. Drowsy driving is a serious risk that can lead to accidents and harm, not only to you but also to others on the road.\n\nIf youre feeling fatigued, dont push through it. Take a break for a safer journey, is the crucial reminder from road safety experts. Whether youre on a long drive or simply feeling weary after a busy day, pulling over to rest can make all the difference.\n\nRemember, Every life matters. Fatigue impairs your reaction time, judgment, and focus, increasing the chances of making a critical mistake. Dont risk ittake a short break, stretch your legs, and recharge before continuing your journey.\n\nPrioritize safety, and let your well-being guide you to safer travels. If youre tired, stop, rest, and return to the road refreshed. It could save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Feeling tired behind the wheel? It’s more than just uncomfortable—it’s dangerous. Drowsy driving is a serious risk that can lead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/take-a-break-for-a-safer-journey/\">Continue reading<span class=\"screen-reader-text\"> \"Take a Break for a Safer Journey…\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Sean Mnangagwa Named De Facto President of Zimbabwe",
            "url": "https://www.zimeye.net/2025/04/07/sean-mnangagwa-named-de-facto-president-of-zimbabwe/",
            "content": "By A Correspondent | ZimEye | London, 7 April 2025  In a dramatic escalation of Zimbabwes internal political strife, a war veterans group has alleged that Major Sean Mnangagwa, son of President Emmerson Mnangagwa, has been appointed the de facto President of Zimbabwe, bypassing constitutional protocol and sidelining the incumbent Vice President, Constantino Chiwenga.\n\nThe accusation comes from a newly formed group calling itself the Defenders of Vice President Chiwenga and the Constitution of Zimbabwe  England Branch, led by self-described war veteran Cde Jekanyika. In a press release issued on 6 April in Luton, England, the group claims that Sean Mnangagwas rise is part of a broader parallel state orchestrated by First Lady Auxillia Mnangagwa and powerful business magnate Kudakwashe Tagwirei.\n\nAccording to the document, Sean Mnangagwa is now effectively controlling the affairs of the state through covert military and intelligence appointments, despite having no constitutional authority. The Zimbabwe National Army must designate Major Sean Mnangagwa a terrorist because he has a plan to attack critical infrastructures in order to put blame on a group of war veterans who are fighting against corruption, the groups statement reads.\n\nThe allegations come amid growing discontent within ZANU-PFs military-aligned factions, many of whom have grown increasingly vocal about what they describe as endemic corruption, economic collapse, and abuse of state power by the Mnangagwa family. The press release also alleges that President Mnangagwa, said to be in deteriorating health, is being manipulated by those close to him, including his wife and son.\n\nNotably, the veterans group calls for Vice President Chiwenga to assume leadership after Mnangagwas term ends in 2028 and contests the upcoming elections. They also call for Major Sean Mnangagwa to be stripped of any military authority, labelling him a terrorist.\n\nThe statement further highlights a litany of corruption scandals allegedly involving the Presidents family, including looting from national schemes such as the Command Agriculture programme, the Presidential goat scheme, and the controversial Gwanda solar project. It also condemns the arrests of over 100 anti-corruption protesters and the detention without trial of journalist Blessed Mhlanga.\n\nThis development marks one of the most significant intra-party challenges to Mnangagwas leadership since he seized power in 2017 through a military-assisted transition that sidelined Robert Mugabe.\n\nThere has been no official response from the Zimbabwean government or ZANU-PF at the time of publication.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | London, 7 April 2025 — In a dramatic escalation of Zimbabwe’s internal political strife, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/sean-mnangagwa-named-de-facto-president-of-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Sean Mnangagwa Named De Facto President of Zimbabwe\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Zanu PF Unleashes Violence in Glen View South",
            "url": "https://www.zimeye.net/2025/04/07/zanu-pf-unleashes-violence-in-glen-view-south/",
            "content": "By A Correspondent\n\nGlen View South was shaken by a wave of political violence on the night of April 5, 2025, when supporters of independent candidate Tonderai Chakaredza were targeted in a brutal attack.\n\nThe homes and vehicles of prominent opposition members, including Ward 23 Councillor Gaudencia Marera and Shadreck Rateiwa, were bombed by unknown assailants, believed to be politically motivated.\n\nThe attack occurs just days before the upcoming by-election on April 12, 2025, following the sudden passing of the Honorable Glandmore Hakata, which has created a political vacuum in the area and heightened tensions.\n\nCouncillor Gaudencia Marera, who resides at House Number 337 in Glen View 1 Extension, was left devastated after discovering that both his vehiclesa Nissan X-Trail (AGF6795) and a Honda Fit (AFL5622)were destroyed in the attack. Similarly, his fellow opposition ally, Shadreck Rateiwa, who lives at 737 Dare Rechimurenga in Glen View 4 Extension, found his home severely damaged by the bombing.\n\nThe bombings caused extensive damage, shattering windows, damaging walls, and compromising the roofs of both properties. Councillor Marera spoke to Change Radio, visibly shaken, saying, I am devastated by the bombing of my house and the destruction of my two cars. Politics should not resemble a life-and-death battle; rather, it is a contest aimed at representing the needs of our citizens. I vehemently condemn this violence and urge law enforcement to apprehend those responsible.\n\nRateiwa, equally distressed, shared his outrage over the damage to his home and the loss of valuables. My house was bombed, and countless valuables were lost. The damage amounts to thousands of U.S. dollars, he said. I am profoundly disappointed by the actions of these political thugs.\n\nBoth Marera and Rateiwa are vocal supporters of independent candidate Tonderai Chakaredza, who is vying to represent Glen View South in the upcoming by-election. This violent episode has raised serious concerns about potential voter intimidation tactics being used by opposing political factions.\n\nHonorable Eric Murai, the campaign leader for Chakaredza, condemned the violence and linked it directly to efforts to suppress support for his candidate. Before the bombing, Councillor Marera and Rateiwa were actively campaigning for Chakaredza. This act of violence is clearly an attempt to intimidate our supporters and instill fear, aiming to suppress their willingness to vote for him, Murai said.\n\nAccording to Murai, police are already on the scene and are investigating the incident.\n\nThe political landscape in Glen View South is further complicated by the presence of several other candidates, including independent candidates Tungamirai Madzokere and George Makwangwaidze, along with Perpetua Mukanda of the National Constitutional Assembly (NCA), and Tsitsi Tranquility Towomhera, representing Zanu PF.\n\nWith the by-election fast approaching, the community is left grappling with the consequences of the violent attacks. As residents brace for the upcoming vote, the hope for justice remains strong, but the fear of more violence looms, threatening to undermine the integrity of the democratic process.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Glen View South was shaken by a wave of political violence on the night of April 5, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/zanu-pf-unleashes-violence-in-glen-view-south/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Unleashes Violence in Glen View South\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Watch: Zanu PF Zealot Says Mnangagwa Must Stay Beyond 2040",
            "url": "https://www.zimeye.net/2025/04/07/watch-zanu-pf-zealot-says-mnangagwa-must-stay-beyond-2040/",
            "content": "By A Correspondent\n\nA Zanu PF youth league member has said Mr Emmerson Mnangagwa must stay in office beyond 2040.\n\nThis comes at a time war veteran Blessed Geza is pushing for the Zanu PF leaders impeachment.\n\nGeza wants Mnangagwa to resign with immediate effect as a result of incapacitation\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zanu PF youth league member has said Mr Emmerson Mnangagwa must stay in office beyond 2040. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/watch-zanu-pf-zealot-says-mnangagwa-must-stay-beyond-2040/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Zanu PF Zealot Says Mnangagwa Must Stay Beyond 2040\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Video Why Hopewell Will Write Lengthy Posts insulting Chamisa But Never Wicknell or Chief Jose: THEY’RE SAME GANG",
            "url": "https://www.zimeye.net/2025/04/07/video-why-hopewell-will-write-lengthy-posts-insulting-chamisa-but-never-wicknell-or-chief-jose-theyre-same-gang/",
            "content": "EDITORIAL: Hopewell Chinono will write lengthy posts insulting people like Chamisabut lately, anything that involves Chivayo he is ..Zvibvunzei kuti sei achinyarara?, asks Gamu\n\nHopewell will  write lengthy  posts  insulting  people  like Chamisabut lately,  anything  that  involves  Chivayo  he is ..Zvibvunzei kuti sei achinyarara?pic.twitter.com/GoaDRIqr9q\n\nThose better at O Level Maths already know the only difference between the two Daddy characters is Wick, and the journalism title, as they are part of the same UK Slough gang together with Chief Jose (Joseph Mhaka), who Chinono will never mention. Mhaka fled UK soon after conviction for high profile cheque fraud in 2008, and was not as lucky as Hopewell Chinono who left UK 7 yesrs earlier when Britains fingerprinting system was still to be integrated post 911 upgrade. As a result, Chinonos name change remains out of the cache, also because he was not convicted.However, his latest notorious operations were last year when he encouraged people to compromise airport security since 29 April 2024. One of the colleagues who Chinono encouragedis one Jennifer Banyure, who was encouraged by Chinono, to sabotage Gatwick Airports database on 26 Aug 2024.\n\nBanyure engaged a hacker on Chinonos encouragement to delete her other name she used to enter UK and then changed in the same year Chinono (previously surnamed Mukusha) changed his, 2001.\n\nBanyure was captured on camera inside Nottinghams St James Hotel with a hacker performing the hacking operation.\n\nUnder Chinonos encouragements and instructions, Banyure moved over to try and rob a senior engineer of his multi million pound property. She did this using the fake identity she shifted to in the same year Hopewell Chinono changed his.\n\nFollowing an investigation by ZimEye however, a Derby County Court judge Justice Pittman, has ruled a clean break resolution that blocks Banyure from her manoeuvres. This was after an identity fraud case was raised at court 2 weeks after the hacking attempt. The hacker was an undercover investigative journalist. WATCH THE FULL DOCUMENTARY HERE\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "EDITORIAL: Hopewell Chin’ono will write lengthy posts insulting people like Chamisa…but lately, anything that involves Chivayo he is 🤐..Zvibvunzei kuti … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/video-why-hopewell-will-write-lengthy-posts-insulting-chamisa-but-never-wicknell-or-chief-jose-theyre-same-gang/\">Continue reading<span class=\"screen-reader-text\"> \"Video Why Hopewell Will Write Lengthy Posts insulting Chamisa But Never Wicknell or Chief Jose: THEY’RE SAME GANG\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Journalist Blessed Mhlanga Denied Bail Again",
            "url": "https://www.zimeye.net/2025/04/07/journalist-blessed-mhlanga-denied-bail-again/",
            "content": "By A Correspondent\n\nZimbabwean journalist and political prisoner Blessed Mhlanga has once again been denied bail, marking the third time he has faced such a ruling.\n\nMhlanga, known for his critical reporting on President Emmerson Mnangagwas actions, is being persecuted for exposing the governments alleged wrongdoings. The Magistrate presiding over his case ruled that the bail application lacked merit.\n\nMhlanga is now scheduled to appear in court on 22 April 2025 for notification of his trial date.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean journalist and political prisoner Blessed Mhlanga has once again been denied bail, marking the third time … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/journalist-blessed-mhlanga-denied-bail-again/\">Continue reading<span class=\"screen-reader-text\"> \"Journalist Blessed Mhlanga Denied Bail Again\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Nelson Chamisa Hits Back at Naysayers",
            "url": "https://www.zimeye.net/2025/04/07/nelson-chamisa-hits-back-at-naysayers/",
            "content": "By A Correspondent\n\nOpposition leader Advocate Nelson Chamisa has made it clear that he will not be silenced by critics.\n\nThe MDC leader fired back at those attempting to undermine him, vowing to continue working towards his objectives despite the negative commentary.\n\nIn a statement issued on Sunday, Advocate Chamisa shared his thoughts, emphasizing that he would remain focused on his leadership journey.\n\nHe said:\n\nKEEP LEADINGWhen they talk bad about you everyday, either they fear you or they cant handle you, or both. They are terrified by you. Keep leading them anyway. Never stop leading. Blessed Sunday!\n\nChamisas statement reflected his determination to push forward, despite the ongoing criticism. His message to his supporters was clear: he will not be deterred by negativity and will continue to lead with strength and resolve.\n\nThe opposition leaders remarks underline his resilience and commitment to his political agenda, even as he faces mounting challenges from his detractors.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Advocate Nelson Chamisa has made it clear that he will not be silenced by critics. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/nelson-chamisa-hits-back-at-naysayers/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Hits Back at Naysayers\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Zanu PF Agents Bomb Opposition Supporters in Glen View South Ahead of By-Election",
            "url": "https://www.zimeye.net/2025/04/07/zanu-pf-agents-bomb-opposition-supporters-in-glen-view-south-ahead-of-by-election/",
            "content": "By A Correspondent\n\nGlen View South was rocked by a violent attack on the night of April 5, 2025, when supporters of independent candidate Tonderai Chakaredza were targeted in a bomb assault. The homes and vehicles of prominent opposition members, including Ward 23 Councillor Gaudencia Marera and Shadreck Rateiwa, were destroyed by unknown assailants believed to be politically motivated.\n\nThis attack comes just days before the April 12, 2025, by-election, triggered by the sudden death of Honorable Glandmore Hakata, creating a political vacuum and escalating tensions in the area.\n\nCouncillor Gaudencia Marera, who resides at House Number 337 in Glen View 1 Extension, was left devastated when he discovered that his two vehiclesa Nissan X-Trail (AGF6795) and a Honda Fit (AFL5622)had been bombed. His fellow opposition ally, Shadreck Rateiwa, living at 737 Dare Rechimurenga in Glen View 4 Extension, also found his home severely damaged in the attack.\n\nThe bombings left extensive damage, shattering windows, damaging walls, and compromising the roofs of both properties. Councillor Marera spoke to Change Radio, visibly shaken, saying, I am devastated by the bombing of my house and the destruction of my two cars. Politics should not resemble a life-and-death battle; rather, it is a contest aimed at representing the needs of our citizens. I vehemently condemn this violence and urge law enforcement to apprehend those responsible.\n\nRateiwa, equally distraught, expressed his outrage over the destruction and the loss of his valuables. My house was bombed, and countless valuables were lost. The damage amounts to thousands of U.S. dollars, he lamented. I am profoundly disappointed by the actions of these political thugs.\n\nBoth Marera and Rateiwa are vocal supporters of independent candidate Tonderai Chakaredza, who is campaigning to represent Glen View South in the upcoming by-election. The violence has raised significant concerns about voter intimidation tactics being used by political adversaries.\n\nHonorable Eric Murai, campaign leader for Chakaredza, condemned the attack, calling it a clear attempt to suppress support for his candidate. Before the bombing, Councillor Marera and Rateiwa were actively campaigning for Chakaredza. This act of violence is clearly an attempt to intimidate our supporters and instill fear, aiming to suppress their willingness to vote for him, Murai said.\n\nMurai also confirmed that police are on the scene and conducting an investigation into the attack.\n\nThe political dynamics in Glen View South are further complicated by the presence of other candidates, including independent contenders Tungamirai Madzokere and George Makwangwaidze, along with Perpetua Mukanda of the National Constitutional Assembly (NCA), and Tsitsi Tranquility Towomhera, representing Zanu PF.\n\nAs the by-election approaches, the community is grappling with the aftermath of the violence. With residents bracing for the vote, there are growing concerns about the potential for more violence, casting a shadow over the integrity of the democratic process and the hope for justice in Glen View South.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Glen View South was rocked by a violent attack on the night of April 5, 2025, when … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/zanu-pf-agents-bomb-opposition-supporters-in-glen-view-south-ahead-of-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Agents Bomb Opposition Supporters in Glen View South Ahead of By-Election\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Dorcas Moyo Accepts A Tokoloshi’c Car From Wicknell Chivayo | PICTURES",
            "url": "https://www.zimeye.net/2025/04/07/dorcas-moyo-accepts-a-tokoloshic-car-from-wicknell-chivayo/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:09",
            "date": "08 Apr 2025"
        },
        {
            "title": "Mnangagwa Loyalists Invade Glen View South Constituency Ahead of By-Election…",
            "url": "https://www.zimeye.net/2025/04/07/mnangagwa-loyalists-invade-glen-view-south-constituency-ahead-of-by-election/",
            "content": "By A Correspondent\n\nZanu PF hardliners descended on Glen View South Constituency over the weekend, gearing up for the April 12 by-election.\n\nHowever, residents of the constituency have vowed to reject the Zanu PF candidate in favour of an independent candidate.\n\nIn a statement issued on Sunday, Citizens Against Economic Sanctions (CAES) expressed their support for the candidate Tsitsi Tawomhera and highlighted their commitment to the development of the constituency\n\nBehind Tsitsi Tawomhera for Glen View South By-Election\n\nCitizens Against Economic Sanctions (CAES) Zimbabwe attended a pivotal meeting in Glen View South Constituency in support of candidate Tsitsi Tawomhera, which saw a strong turnout from party supporters and key political figures.\n\nThe gathering, held at PA D.O Pa Ground Pa Mapostori, emphasized the growing momentum behind her candidacy and the partys commitment to the constituencys development.\n\nThe event was graced by notable dignitaries, including Zanu PF National Political Commissar Munyadrazi Machacha, the Minister of Provincial Affairs and Devolution for Harare Metropolitan Province Senator Charles Tawengwa, and Special Presidential Adviser Dr. Paul Tungwarara.\n\nTheir attendance underscored the importance of the meeting and the role of Glen View South in the broader political context.\n\nLeaders from CAES Zimbabwe, both at the Harare Provincial and National levels, were also present, demonstrating their strong support for Tsitsi Tawomhera as the candidate poised to bring positive change.\n\nA significant moment during the gathering was the announcement of a US$200,000 Presidential Revolving Fund allocation for Glen View South Constituency, facilitated by Dr. Tungwarara on behalf of His Excellency Dr. Emmerson Dambudzo Mnangagwa.\n\nThe funds are expected to drive local development initiatives, improve infrastructure, and create new economic opportunities for the constituencys residents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF hardliners descended on Glen View South Constituency over the weekend, gearing up for the April … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/07/mnangagwa-loyalists-invade-glen-view-south-constituency-ahead-of-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Loyalists Invade Glen View South Constituency Ahead of By-Election…\"</span></a></p>",
            "time": "06:09",
            "date": "08 Apr 2025"
        }
    ]
}