{
    "news": [
        {
            "title": "Prisons Reunite Inmates With Their Families",
            "url": "https://www.zimeye.net/2025/05/04/prisons-reunite-inmates-with-their-families/",
            "content": "By Crime and CourtsReporter-The ZimbabwePrisons and Correctional Services (ZPCS)this weekheld its annual Family Week, a heartwarming initiative that allows inmates to reconnect with their loved ones.\n\nAt Gwanda Prison, the atmosphere was filled with emotion as inmates embraced their children and partners, sharing laughter, meals, and meaningful conversations.\n\nThe event aims to strengthen family bonds and support the rehabilitation and reintegration of inmates into society.\n\nFor Thulani Mlilo (25), serving a reduced 16-month sentence, the highlight was holding his 11-month-old daughter, whom he hadnt seen since she was five months old. Itreallywarmed my heart to see my family again, especially my children. Playing with them gave me hope and reminded me that we are still seen as human beings, he said.\n\nMitchel Dube (23), who is on remand for murder, also welcomed the chance to reconnect with his wife and two young children, aged eight months and three years. Being around children and seeing people come and go reminds us that we are still part of the world outside. Thisprogrammemeans a lot, he said.\n\nHis wife, Rejoice Moyo, said the visit allowed the family to reconnect and discuss important matters,bringing her relief.\n\nSuperintendent Ishmael Madzimbamuto, Officer-in-Charge at Gwanda Prison, said theprogrammereceived a strong response, with around 100 visitors received daily. Family Week is an essential part of rehabilitation. It helps inmates find closure, seek forgiveness, and remain connected to home, he said.\n\nHe added that the initiativealsosupports inmates mental health and encourages their reintegration after release.\n\nFamilies were informed through various platforms, and officials expect most inmates to have received visitors by the end of the week.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-The Zimbabwe Prisons and Correctional Services (ZPCS) this week held its annual Family Week, a heartwarming initiative that allows inmates … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/prisons-reunite-inmates-with-their-families/\">Continue reading<span class=\"screen-reader-text\"> \"Prisons Reunite Inmates With Their Families\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Friday Aborted Zanu PF Politburo Meeting, Fresh Details Emerge",
            "url": "https://www.zimeye.net/2025/05/04/friday-aborted-zanu-pf-politburo-meeting-fresh-details-emerge/",
            "content": "By Tinashe Sambiri-Zanu PF party last week, Thursday, cancelled its Politburo meeting scheduled for the following day to allow the burial of national heroine  Air Vice Marshal (Rtd) Winnie Mandeya, who passed away on Monday, April 28.\n\nIn a terse statement issued late Thursday, Zanu PF spokesperson Christopher Mutsvangwa announced the cancellation, attributing the decision to instructions from Secretary General Obert Mpofu.\n\nThe Secretary General of ZANU PF, Cde. Dr. Obert Mpofu, hereby advises all members of the postponement of the Politburo meeting announced for Friday 2nd May 2025. The meeting will be heldon a later dateto be advised, read the statement.\n\nNo explanation was given at the time.\n\nHowever, it later emerged that the decision coincided with the sudden scheduling of the burial of national hero Air Vice Marshal (Rtd) WinnieMandeya, who passed away on Monday, April 28.\n\nThe burial, held on Friday at the National Heroes Acre, caught many by surprise  not only for itstiming,butfor the speed at which preparations were made,effectivelyoverridingwhat had been billed as a key Politburo session.\n\nMandeya, a respected liberation war veteran and long-serving military officer, had only been declared a national hero on Wednesday evening.\n\nGovernment sources say her burial date was not initially fixed for Friday, raising questions about whether the event was used as a pretext to cancel the high-stakes Politburo gathering.\n\nThe sudden cancellation has fueledrumoursof serious behind-the-scenes wrangling within the party.\n\nWith no clear explanationprovided, insiders suspect the meeting was shelved due to unresolved tensions over critical issues  including succession dynamics, power consolidation, and realignments within the Central Committee and Politburo.\n\nThe Politburo is the highest decision-making body in Zanu PF outside of Congress, and it plays a crucial role in determining national policy direction and internal party strategy.\n\nSources had anticipated heated discussions over recent electoral performance critiques, growing grassroots dissatisfaction, and President Mnangagwas reported succession plans.\n\nThe postponement, coupled with the rushed burial ofMandeya, has led some political analysts to conclude that the party may be struggling to maintain internal cohesion amid rising factionalism.\n\nThere is no doubt the Politburo meeting was set to be contentious, said one political commentator. Cancelling it infavourof a hastily-arranged burial for a hero who died four days earlier suggests the leadership needed to defuse a looming confrontation  or at least buy time.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri-Zanu PF party last week, Thursday, cancelled its Politburo meeting scheduled for the following day to allow the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/friday-aborted-zanu-pf-politburo-meeting-fresh-details-emerge/\">Continue reading<span class=\"screen-reader-text\"> \"Friday Aborted Zanu PF Politburo Meeting, Fresh Details Emerge\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Leeds United Return To Premier League",
            "url": "https://www.zimeye.net/2025/05/04/leeds-united-return-to-premier-league/",
            "content": "By A Correspondent\n\nIn a thrilling finale to the season, Leeds United secured their return to the Premier League with a dramatic 2-1 victory over already-relegated Plymouth.\n\nThe win, fueled by a brilliant stoppage-time winner from Manor Solomon, propelled Leeds to the championship title on goal difference, with both Leeds and Burnley finishing the season on an impressive 100 points.\n\nThe stakes were high for Leeds, knowing a win was necessary to overtake Burnley in the standings. Despite falling behind, Leeds rallied to score two goals, with Solomon sealing the deal in stoppage time. His decisive goal came after latching onto a through ball from Wilfried Gnonto, beating defender Nikola Katic, and firing a low shot past Plymouth goalkeeper Conor Hazard.\n\nThis victory marks a triumphant return to the Premier League for Leeds United, capping off an outstanding season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a thrilling finale to the season, Leeds United secured their return to the Premier League with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/leeds-united-return-to-premier-league/\">Continue reading<span class=\"screen-reader-text\"> \"Leeds United Return To Premier League\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Police Nab Two In Broncleer Drug Bust",
            "url": "https://www.zimeye.net/2025/05/04/police-nab-two-in-broncleer-drug-bust/",
            "content": "By A CorrespondentTwo men have been arrested after police found them in possession of 100 bottles of Broncleer cough syrupan illegal, codeine-based substance commonly abused for its intoxicating effectsworth an estimated US$1,000 on the street.\n\nDetectives from the Criminal Investigation Department (CID) Drugs Section intercepted a white Toyota Quantum at Esigodini Tollgate, following a tip-off about suspected drug trafficking.\n\nCID Drugs received information that a white Toyota Quantum travelling from South Africa was carrying suspected illegal substances, said Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele. Detectives intercepted the vehicle at Esigodini Tollgate and, upon searching it, discovered a Maq surf box and a black cooler bag containing 100 bottles of Broncleer cough syrup.\n\nDuring interrogation, one occupant of the vehicle claimed the parcel was for King Denara, a known alias for Dennis Ndlovu of Efusini, Tsholotsho. Police conducted a controlled delivery operation, which resulted in Ndlovus arrest when he attempted to collect the parcel.\n\nNdlovu implicated Edward Phiri as the owner of the drugs. He also revealed that the cough syrup had been brought from South Africa by his sister, Sithabile Sibanda, said Asst Insp Msebele.\n\nNdlovu (26) and Edward Phiri (32), of Makokoba suburb, were both charged with unlawful possession of dangerous drugs. The seized Broncleer is banned in Zimbabwe unless prescribed, and is known for its addictive properties and links to mental health issues.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A CorrespondentTwo men have been arrested after police found them in possession of 100 bottles of Broncleer cough syrup—an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/police-nab-two-in-broncleer-drug-bust/\">Continue reading<span class=\"screen-reader-text\"> \"Police Nab Two In Broncleer Drug Bust\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Release Dhara, Community Newspapers Association Challenges Government",
            "url": "https://www.zimeye.net/2025/05/04/release-dhara-community-newspapers-association-challenges-government/",
            "content": "Tinashe Sambiri\n\nThe Community Newspapers Association of Zimbabwe (CNAZ) has called on the government to immediately release jailed journalist Blessed Mhlanga, describing his continued detention as a direct attack on press freedom.\n\nIn a strongly worded statement issued on World Press Freedom Day, CNAZ Chairman Matthew Takaona condemned the journalists prolonged incarceration, now stretching to 69 days without trial.\n\nCognisant that Zimbabwe is a signatory to various international conventions upholding Freedom of the Press and aware that Press Freedom is a right in our own country enshrined in the Constitution of Zimbabwe we members of the Community Newspapers Association of Zimbabwe (CNAZ) dedicate this day to the freedom of HStv Senior Journalist Blessed Mhlanga, the association said.\n\nThe association emphasised that Mhlanga is being punished not for a crime, but for his commitment to exposing corruption and holding those in power accountable.\n\nWe are convinced that Mhlanga has not committed any crime but is being punished for his bravery in fighting corruption and speaking truth to power, said Takaona.\n\nCNAZ called on both local and international actors to increase pressure on the Zimbabwean government. We therefore ask for the immediate release for Mhlanga, the statement read, urging action from lawyers, human rights groups, media organisations, parliamentarians, and foreign governments.\n\nThe statement also demanded bail for the journalist and reiterated that Journalism is not a crime and Press Freedom is a pillar of democracy.\n\nCNAZ concluded its statement with a reminder that the right to practice journalism is enshrined in Zimbabwes Constitution and that journalism is an enabler for the enjoyment of all other rights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri The Community Newspapers Association of Zimbabwe (CNAZ) has called on the government to immediately release jailed journalist Blessed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/release-dhara-community-newspapers-association-challenges-government/\">Continue reading<span class=\"screen-reader-text\"> \"Release Dhara, Community Newspapers Association Challenges Government\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Geza Demo: Pro-Chamisa Activist Gets Partial Freedom",
            "url": "https://www.zimeye.net/2025/05/04/geza-demo-pro-chamisa-activist-gets-partial-freedom/",
            "content": "By A Correspondent\n\nA young activist from Masvingo has been granted bail after facing charges of inciting public violence ahead of Blessed Gezas March 31 protests.\n\nCalvin Tinarwo, 21, from Rujeko, appeared before a Masvingo Magistrate and was released on $50 bail.\n\nTinarwo, who presented himself as the commander of the Masvingo Youth Task Force, is accused of mobilizing the community to participate in the March 31st demonstration, which aimed to remove President Emmerson Mnangagwa from office.\n\nHe allegedly posted a message on a WhatsApp group urging people to join the protest, stating it was a crucial moment for the countrys democracy and constitution.\n\nThe court heard that Tinarwo was apprehended on April 1 by detectives led by Assistant Inspector Archbold Muyambi. He is represented by Martin Mureri of Mureri and Matutu Legal Practitioners.\n\nTinarwos case has been adjourned to May 16. He faces charges under Section 36(1) of the Criminal Law (Codification and Reform) Act Chapter 9:23, which defines incitement to commit public violence.\n\nThe post attributed to Tinarwo emphasized the importance of standing up for democracy and constitutional rights, calling on citizens to participate in the peaceful demonstration.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A young activist from Masvingo has been granted bail after facing charges of inciting public violence ahead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/geza-demo-pro-chamisa-activist-gets-partial-freedom/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Demo: Pro-Chamisa Activist Gets Partial Freedom\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Zanu PF Grabs Tugwi-Mukosi Project",
            "url": "https://www.zimeye.net/2025/05/04/zanu-pf-grabs-tugwi-mukosi-project/",
            "content": "By A Correspondent\n\nZanu PF heavyweights have reportedly taken control of the Tugwi-Mukosi Combination Master Plan, raising alarm over the politicisation of a national development project meant to benefit communities in Masvingo Province.\n\nSources within government offices at Benjamin Burombo Building in Masvingo allege that Provincial Affairs Minister Ezra Chadzamira is handpicking Zanu PF loyalists to head key committees managing the project.\n\nEzra Chadzamira is busy allocating key committees to his Zanu PF friends and bootlickers, said one senior government official, who requested anonymity.\n\nThe Tugwi-Mukosi Master Plan, as outlined by the Ministry of Information, is a comprehensive development blueprint that includes major infrastructure projects such as irrigation schemes, tourism development, energy generation, and the establishment of a new resort town.\n\nAmong the plans top priorities are:\n\nEstablishing irrigation schemes in Gororo (Chivi Ward 24) and Masvingo Ward 34\n\nRehabilitating the Banga Irrigation Scheme\n\nBuilding a hotel and lodges on an island to boost tourism\n\nUpgrading road infrastructure, including the Old Chiredzi Road Bridge\n\nConstructing a water treatment plant and improving sewer systems\n\nDeveloping both photovoltaic and hydroelectric power plants\n\nEstablishing an airport and promoting industrial growth in the region\n\nThe master plan is intended to stimulate economic activity, protect the environment, and uplift surrounding communities in Chivi, Mwenezi, and the broader Lowveld region.\n\nHowever, insiders say the plans noble goals are being overshadowed by political interference.\n\nThe whole project is now captured by Zanu PF, another source claimed. Its no longer about development for the people, its about rewarding political allies.\n\nThere are growing fears that public resources and opportunities meant to empower local communities could instead be redirected to serve partisan interests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF heavyweights have reportedly taken control of the Tugwi-Mukosi Combination Master Plan, raising alarm over the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/zanu-pf-grabs-tugwi-mukosi-project/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Grabs Tugwi-Mukosi Project\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Prophet Wutaunashe Threatens To Attack Britain With Flood-Destruction After Losing Tithe Money Donations Over Adultery-Scandal",
            "url": "https://www.zimeye.net/2025/05/04/prophet-wutaunashe-threatens-to-attack-britain-with-flood-destruction-after-losing-tithe-money-donations-over-adultery-scandal/",
            "content": "In 2021, he publicly accused UK Govt saying it has no conscience for Zimbabwes poor.\n\nLeeds, West Yorkshire  By A Correspondent | ZimEye | Descending into religious-hate-speech against the country he has visited, Family Of God Church founder Prophet Andrew Wutaunashe, yesterday expressed dismay over his UK based congregations complete cessation of tithing, forcing him to cite financial examples from non-members back in Zimbabwe, 6,000 miles away, during his sermon.\n\nWutaunashe, previously spotted entering a disabled toilet with a girlfriend near Leeds Bus Station, addressed his followers on Saturday, highlighting the impact of their lack of offerings. He explained that the absence of tithes has left him unable to reference a standard contribution amount, compelling him to draw on anecdotes from secular figures in Zimbabwes economy.\n\nProphet Wutaunashe threatens to attack Britain with flood and earthquake after losing tithe money.By A Correspondent | ZimEye | Descending into religious-hate-speech against the country he has visited, Family Of God Church founder Prophet Andrew Wutaunashe, yesterday expressedpic.twitter.com/VvcmusnVnw\n\nThe development comes at a time when the preacher has also revealed that his church has split up in Botswana, following another damning scandal that erupted soon after he demanded a brand new car from church-folk. (Video).\n\nOpen your eyes. Hallelujah, open your minds, become aggressive. One of the things were seeing in Zimbabwe is people with no relationship with God playing with money. Amen. And people get angry and say, They stole that money, whenever they see someone with wealth, Wutaunashe, who was religiously initiated into the TB Joshua cults in the late 1970s, told his congregation. \n\nDont fool yourself into thinking it was all stolen. Yes, some stealI know that. But there are many in Zimbabwe who have real moneynot in a suitcase, but in a room, stacks of cash halfway up the wall. And its not stolen; theyre selling gold every week. Amen.\n\nHe continued, I mean, whats the goal? Youre here, working for a month, and I dont even know your take-homebecause most of you dont tithe, anyway, you understand? If you did, I could calculate. But look: someone back in Zimbabwe, in that economy, is walking with his people, in awe. Someone like you. Every week. And when he has a little money, he comes back from where they sell it with USD 100,000in one week!\n\nThe prophets remarks have stirred debate among his followers. Some interpret his sermon as a plea for renewed financial commitment, while others view it as an attempt to shame congregants into giving. His references to Zimbabwes gold trade and wealth accumulation have also sparked skepticism, given the economic challenges facing that nation and the disconnect with his UK-based audience.\n\nWutaunashes church, once a focal point for Zimbabwean expatriates in Leeds, has seen declining attendance in recent years, a trend some link to his past controversies. It remains unclear whether his latest appeal will inspire a return to tithing, but for now, the prophet relies on distant examples to underscore his message.\n\nZimEye observed the man addressing a house stashed with congregants who are well known business and various professionals based in West Yorkshire, as they sat in between empty chairs for over 7 hours on Saturday.\n\nHe later descended into hate speech against the UK, threatening the country he has visited with destruction.\n\nHe stated as follows:\n\nAmen. But I wanted you to understanddont wait for thefires to come. You hear people screaming and praying, shouting hallelujah when the fires are already at their door. Amen.\n\nhttps://x.com/zimeye/status/1918993967263154658?s=46\n\nAnd I know sometimes we depend on little countries like this one to come and hide. But this country is a dangerous place. The problem with this countryyesterday, when I was with Bishop Majonga, he showed me a bridge. When I was here last time, I said, Lets pray against the pestilence of the last days. Remember? The next day, there were floods in Leeds.\n\nIn case you dont know where Leeds isThats where we are right now. So Bishop Majonga told me, Gods telling me to move to the left lane. And you know those bridges that are above your head, the ones you pass under? The water was reaching the top. Thats what hes sayingthis island can disappear in one day.\n\nJust one serious flood,and youll find pieces of Britain washing up in South Africa.\n\nDont have false security.The UK is not our fortress. It is not our refuge. God is our refuge.\n\nWutaunashes campaign against UK is not the first, and in 2021, he publicly told the Archbishop Of Canterbury that the British Govt has no conscience for the poor.\n\nCommenting over this, news analyst Howard Nyoni stated as follows-\n\nHoward Nyoni: When a man lives in Zimbabwe, comes to the UK, and then makes a negative statement about the UKits not a godly act. Why threaten a country that has done you no wrong? He should be focusing on Zimbabwe. What exactly has the UK done to him for him to wish it a flood or some catastrophic event?\n\nFrankly, theres no point in him continuing as a preacher or as a so-called man of God if he spreads negativity like this. A preacher should bring hope, not doom. What connection do floods have with the UK in this context? Again I ask: what has the UK done to deserve such statements?\n\nInterviewer: He claims to have accurately prophesied a flood that affected a bridge in Leeds. Doesnt that at least lend some credibility to what hes saying now?\n\nNyoni:\n\nLook, even if he mentioned a specific bridge in Leeds and says it happened, I dont buy it. I know him as a false prophet. Whatever he utters will never truly come to pass. Hes using biblical languagesurebut floods are not unique to the UK. The Bible itself states that in the last days, floods will occur everywhere: Zimbabwe, the UK, America, Pakistan, Australiayou name it. This is not exclusive to his prophetic insight.\n\nFloods are a global phenomenon. Theyre not tied to one mans spiritual authority or his supposed powers.\n\nInterviewer: Are you saying he has an agenda behind these declarations? Or are you simply calling him out for being false?\n\nNyoni: In conclusion, most preachers who push a negative narrative about the UK do so because they fundamentally dislike it. Let me be blunt: Satan himself hates the UK. Why? Because in the UK, theres freedomfreedom of speech, freedom of expression, real democracy. Elections here are transparent. Things are open in a way they are not in Zimbabwe.\n\nSo when someone like Andrewthis so-called prophetstarts attacking the UK, its not just about weather events. He has a negative agenda. He knows that Zimbabweans in the UK are exposing his dirty tricks. Thats his real issue.  ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In 2021, he publicly accused UK Govt saying it has no conscience for Zimbabwe’s poor. Leeds, West Yorkshire – By … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/prophet-wutaunashe-threatens-to-attack-britain-with-flood-destruction-after-losing-tithe-money-donations-over-adultery-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Wutaunashe Threatens To Attack Britain With Flood-Destruction After Losing Tithe Money Donations Over Adultery-Scandal\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "How Old Was the Late Zanu PF Youth League Official Declared a Liberation War Heroine by Mnangagwa?",
            "url": "https://www.zimeye.net/2025/05/04/how-old-was-the-late-zanu-pf-youth-league-official-declared-a-liberation-war-heroine-by-mnangagwa/",
            "content": "By A Correspondent\n\nQuestions have been raised about the age of the late Zanu PF Youth League official, Beatrice Kamuche, who passed away last week and was declared a Liberation War Heroine by President Emmerson Mnangagwa. Kamuches relatively young age has sparked public curiosity, as many wonder how she qualified for a war hero status typically reserved for those with a record of direct participation in the liberation struggle.\n\nWe laid to rest our colleague Beatrice Kamuche in Mudzi, Mutoko. Beatrice was one of the long-serving members of the Zanu PF Youth League, having been part of the National League from 2017 to date, said Zanu PF activist Tendai Chirau.\n\nSpecial mention to the Secretary of Youth Affairs Hon. Tino Machakaire for ensuring that our late cadre received a befitting send-off, Chirau added, acknowledging the efforts of several Youth League leaders and members.\n\nOn social media, Zanu PF activist Mairosi Watungwa expressed gratitude for the national honor bestowed on Kamuche: As we mourn Cde Beatrice Kamuche, who was the National Deputy Secretary for Lands in the Youth League National Executive, we thank His Excellency our President and First Secretary Cde Dr Emmerson Mnangagwa for declaring her a Liberation War Heroine.\n\nDespite the praise and tributes, the question of whether Kamuche had any direct involvement in Zimbabwes 1970s liberation wargiven her ageremains unanswered.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Questions have been raised about the age of the late Zanu PF Youth League official, Beatrice Kamuche, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/how-old-was-the-late-zanu-pf-youth-league-official-declared-a-liberation-war-heroine-by-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"How Old Was the Late Zanu PF Youth League Official Declared a Liberation War Heroine by Mnangagwa?\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        },
        {
            "title": "Horror As 15 Die In Head-on Collision",
            "url": "https://www.zimeye.net/2025/05/04/horror-as-15-die-in-head-on-collision/",
            "content": "By Tinashe Sambiri\n\nA devastating head-on collision on the R63 between Adelaide and Maqoma in the Eastern Cape has claimed 15 lives, with five others seriously injured. The accident involved a fully loaded minibus taxi and a bakkie.\n\nAccording to Unathi Binqose, Provincial Transport Department Spokesperson, the Toyota Quantum taxi was traveling from Qonce to Cape Town, while the bakkie was heading in the opposite direction. Both drivers died on the scene, along with 13 passengers. One passenger succumbed to injuries at the hospital.\n\nThe severity of the crash has prompted an investigation, with police opening an inquest docket. Binqose described it as one of the deadliest crashes in the Eastern Cape in recent times.\n\nThe MEC for Transport in the Eastern Cape, Mr. Xolile Nqatha, says our thoughts and prayers are with those families that have lost their loved ones, and we are calling for investigators to leave nothing to chance, Binqose added. The incident has left the community in shock, with many calling for thorough investigations to determine the cause of the tragic accident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri A devastating head-on collision on the R63 between Adelaide and Maqoma in the Eastern Cape has claimed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/04/horror-as-15-die-in-head-on-collision/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As 15 Die In Head-on Collision\"</span></a></p>",
            "time": "09:32",
            "date": "05 May 2025"
        }
    ]
}