{
    "news": [
        {
            "title": "Zanu PF MP Caught With A Fake PhD",
            "url": "https://www.zimeye.net/2025/02/05/zanu-pf-mp-caught-with-a-fake-phd/",
            "content": "By Munacho Gwamanda-Shackmore Wellington Timburwa, the Zanu PF Member of Parliament for Chegutu West, has been exposed for fraudulently claiming a doctoral degree.\n\nTimburwa, who goes by the name Shacky Timburwa, staged a fake graduation ceremony in 2023, where he posed in academic regalia and declared himself a PhD graduate.\n\nHe took to social media, celebrating what he called the culmination of years of hard work, late nights, and endless research.\n\nHowever, investigations have since revealed that his doctorate is entirely fictitious.\n\nAn investigative news portal, Dug-Up, exposed Timburwas deceit, linking him to a broader scam involving multiple socialites, including a Zimbabwean legislator and Malawian personalities.\n\nOn November 4, 2023, the group participated in an elaborate scheme at the University of South Africa (UNISA), receiving counterfeit degrees.\n\nAlthough they donned graduation gowns and held maroon placards with the word Graduation, UNISA later clarified that it had no record of awarding them any degrees.\n\nThe entire event was a staged fraud designed to lend an air of legitimacy to their fake academic credentials.\n\nUNISA quickly disowned the Malawian recipients of the fraudulent doctorates, but Timburwa seemingly evaded scrutiny despite attending the same event.\n\nSince then, he has continued to use the title Dr. in official engagements, misleading the public and his constituents.\n\nThe issue of fake academic credentials has also entangled other high-profile Zimbabweans, including controversial preacher Walter Magaya.\n\nFacing potential jail time for academic fraud, Magaya is being investigated by the Zimbabwe Anti-Corruption Commission (ZACC) after allegedly submitting a forged UNISA diploma in his bid to contest the ZIFA presidency and in a High Court challenge.\n\nUNISA has categorically denied that Magaya was ever a student or graduate of the institution.\n\nDespite the scandal, Magayas loyal followers remain unwavering in their support.\n\nDuring a recent church service at his Prophetic Healing and Deliverance (PHD) Ministries in Harare, Magaya broke down in tears, overwhelmed by the solidarity of his congregation.\n\nThey erupted into a song, Siyanai naye Magaya (Leave Magaya alone), demonstrating their allegiance.\n\nWhile Magaya refrained from addressing the allegations, his followers dismissed the accusations as a smear campaign.\n\nThis is not the first time Magaya has faced accusations of fraud.\n\nIn 2016, he was arrested for falsely claiming to have discovered a cure for HIV/AIDS, a claim he later retracted under government pressure.\n\nHis failed housing project also left thousands of congregants stranded, leading to legal battles. His controversial attempt to enter football administration has only fueled further skepticism about his intentions.\n\nZACC has since requested documentation from ZIFA and the High Court to verify Magayas academic claims.\n\nIf convicted of forging qualifications, he could face criminal charges, further damaging his already controversial reputation.\n\nZimbabwe has seen a surge in individuals, particularly politicians and socialites, seeking honorary or outright fake PhDs to bolster their public image.\n\nThe obsession with academic titles reflects deep-seated societal pressures where credentials often translate to power and influence.\n\nWhile genuine academic achievements require years of rigorous study, some opt for shortcuts, acquiring fraudulent degrees to gain prestige and credibility.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Shackmore Wellington Timburwa, the Zanu PF Member of Parliament for Chegutu West, has been exposed for fraudulently claiming … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/zanu-pf-mp-caught-with-a-fake-phd/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF MP Caught With A Fake PhD\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mighty Warriors Date Arch Rivals Angola",
            "url": "https://www.zimeye.net/2025/02/05/mighty-warriors-date-arch-rivals-angola/",
            "content": "Sports Correspondent\n\nThe Zimbabwe womens national football team, the Mighty Warriors, have officially regrouped for their preparations for the 2026 Womens Africa Cup of Nations (WAFCON) qualifiers, with a 29-member squad reporting to camp this Sunday.\n\nThe Mighty Warriors are set to face regional rivals Angola on the 20th of the month in Luanda, before meeting them again a week later at the Lucas Moripe Stadium in South Africa.\n\nAhead of these crucial encounters, coach Sithethelelwe Sibanda expressed her satisfaction with the players readiness and enthusiasm. We are excited to start our preparations for the AFCON qualifiers, and we are confident that with the talent and dedication of our players, we can achieve great things, Sibanda said in a statement released by ZIFA.\n\nZIFA President Nqobile Magwizi also pledged full support for the Mighty Warriors, vowing to provide everything necessary to ensure the teams success. We stand behind the Mighty Warriors and will ensure they have all the support they need to excel, Magwizi said.\n\nThe teams first target is to overcome Angola and advance to the second round, where they will face the winner of the tie between Malawi and Congo. The ultimate goal remains securing one of the 12 spots available for the final tournament, which is set to take place in Morocco.\n\nThe Mighty Warriors are determined and ready to fight for a spot in the prestigious continental competition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe women’s national football team, the Mighty Warriors, have officially regrouped for their preparations for the 2026 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/mighty-warriors-date-arch-rivals-angola/\">Continue reading<span class=\"screen-reader-text\"> \"Mighty Warriors Date Arch Rivals Angola\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "Will War Veterans Accept Mnangagwa Cash Bribe?",
            "url": "https://www.zimeye.net/2025/02/05/will-war-veterans-accept-mnangagwa-cash-bribe/",
            "content": "By A Correspondent\n\nIn a bid to quell dissent among war veterans, particularly outspoken critics like Blessed Geza, President Emmerson Mnangagwa has rolled out a US$1.5 million fund aimed at empowering former freedom fighters. The initiative is seen as a strategic move to silence those opposing his third-term agenda.\n\nThe Presidential War Veterans Fund, part of Mnangagwas broader Leaving No One and No Place Behind philosophy, seeks to recognize and reward the contributions made by war veterans, ex-political prisoners, detainees, restrictees, non-combatant cadres, and war collaborators to Zimbabwes independence and nation-building.\n\nA beneficiary of the fund expressed gratitude, saying, This is unheard of since 1980. We applaud the President for remembering us in such an impactful way. The money will be put to good use and will ensure that every waiver in the constituency benefits and has the chance to start a project or business of their choice.\n\nAnother recipient of the fund added, Im speechless, I never expected to witness this in my old age. The President has done something we never anticipated would happen. I already wanted to start a poultry project, and now I have the chance. I am going to ensure it is a success, and the fund keeps revolving.\n\nThe programme has already been launched in three provinces, and its reach is expected to expand further. Chikomba West legislator, Honourable Tatenda Mavetera, lauded the initiative, emphasizing, The President has shown he is a leader who incorporates everyone for economic development. One cannot deny the work he has done to uplift youths, women, and now war veterans. Im excited about the programmes that are going to be implemented this year through this fund, and whats amazing is how the President has said no interest will be charged to those who will access the fund. What more can you want from our President?\n\nMasvingos Minister of State for Provincial Affairs and Devolution, Honourable Ezra Chadzamira, added, This is a programme that will not only capacitate our veterans but will ensure that they contribute economically to the countrys vision through various initiatives they will implement from the fund. Everyone is set to benefit, and systems are being put in place to ensure transparency and accountability.\n\nThe War Veterans League Secretary, Cde Douglas Mahiya, stated that a Trust would be created for the distribution of the funds across provinces. He also emphasized, The President is a man who walks the talk. He has assured war veterans that they will be capacitated and cushioned against the economic challenges facing the country, and he has lived to his word. Today, Masvingo and Mashonaland Central have received their share, and other provinces will follow suit. The National Executive has approved the Trust that will see them borrowing money, which will be used as collateral.\n\nThis strategic move, intended to ensure loyalty and maintain the support of war veterans, is yet another example of Mnangagwas efforts to consolidate his power and secure his political agenda.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bid to quell dissent among war veterans, particularly outspoken critics like Blessed Geza, President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/will-war-veterans-accept-mnangagwa-cash-bribe/\">Continue reading<span class=\"screen-reader-text\"> \"Will War Veterans Accept Mnangagwa Cash Bribe?\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "Zapu Dismisses Mnangagwa Third Term Agenda",
            "url": "https://www.zimeye.net/2025/02/05/zapu-dismisses-mnangagwa-third-term-agenda/",
            "content": "By A Correspondent\n\nZAPU President Sibangilizwe Nkomo has issued a stern warning against any attempts by President Emmerson Mnangagwa to extend his tenure beyond 2028, vowing strong resistance from his party.\n\nNkomo emphatically rejected the notion of a coup, but insisted that ZAPU demands fair and transparent elections in 2028, emphasizing that Mnangagwa must step down once his second and final term expires.\n\nSpeaking to the press in Bulawayo recently, Nkomo condemned the current presidents attempts to prolong his rule, calling them the grandfather of all illegalities.\n\nHe asserted: Mnangagwa sneaked into power on the back of a military coup in 2017 and now seeks to extend his rule by staging another coup against the constitution of Zimbabwe. It is a treasonous ambition that no patriotic Zimbabwean should entertain.\n\nNkomo criticized the ruling ZANU PF party, claiming that since Zimbabwes independence in 1980, they have continually taken the countrys citizens for granted. He added, We categorically reject claims that Zimbabweans wish to endure more suffering beyond 2028.\n\nOnly the merchants of death and suffering can agitate for the extension of Mr Mnangagwas presidential term even by a week.\n\nFurthermore, Nkomo called on Zimbabweans to withdraw their consent for Mnangagwas government, stating, We also call on the people of Zimbabwe to withdraw their consent and refuse to be governed by Mr Mnangagwas government beyond 2028.\n\nNkomo promised that ZAPU would take bold action in response to any attempt to extend Mnangagwas rule. Mnangagwas administration will see a side of us they have never witnessed before. We will take the lead in making this country ungovernable as long as there is no electoral mandate from the people.\n\nThe ZAPU leader warned that civil disobedience would be encouraged and further steps to undermine Mnangagwas government would be considered if the regime foolishly chooses to dig in. Nkomo added, His first term, powered by a military coup, and the second one, secured from a stolen mandate in August 2023, have been disastrous enough for the people.\n\nHe criticized Mnangagwas leadership, claiming that there is no vision for Zimbabwes future. There is no iota of evidence to suggest that in 2030, Zimbabwe will provide upper-middle income for ordinary Zimbabweans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZAPU President Sibangilizwe Nkomo has issued a stern warning against any attempts by President Emmerson Mnangagwa to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/zapu-dismisses-mnangagwa-third-term-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Zapu Dismisses Mnangagwa Third Term Agenda\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "“Chigananda” Chivayo Continues To Splash Looted Cash",
            "url": "https://www.zimeye.net/2025/02/05/chigananda-chivayo-continues-to-splash-looted-cash/",
            "content": "By A Correspondent\n\nControversial Zanu PF businessman Wicknell Chivayo has once again made headlines by giving comedian Bhutisi, whose real name is Admire Kuzhangaira, a brand new motor vehicle.\n\nThis marks another controversial gesture from Chivayo, whose wealth and business dealings have often been surrounded by mystery.\n\nChivayo, who has close ties with President Emmerson Mnangagwa, has been at the centre of public attention due to his business dealings, which have raised eyebrows.\n\nRecently, Vice President Constantino Chiwenga publicly criticized Chivayo, accusing him of looting State funds, adding fuel to the controversy surrounding the businessman.\n\nDespite the mounting pressure and criticism, Chivayo remains defiant.\n\nIn a Facebook post on Monday, he celebrated his gift to Bhutisi and further fueled his public image as a benefactor.\n\nChivayo shared an enthusiastic message with his followers:\n\nAfter an OVERWHELMING and record-breaking response from the comment section, I say a big CONGRATULATIONS to prominent comedian BHUTISI\n\nPlease go and see Madzibaba Chipaga at ENTERPRISE CAR SALES and collect your C200 and 5000 USD cash Zvisinei COMMENT SECTION yapopota saka usasiye mumiriri wako we Mweya he must also get an AQUA and 1000 USD The phrases ISHE VANO SEKA ZVAVO and ISHE VANODZOKORODZA ZVAVO were just hilarious and got me laughing all weekend .\n\nChivayo continued to express his admiration for Bhutisis success, writing, To you my brother BHUTISI, you started off with a TOYOTA AQUA and now you are a proud owner of a Mercedes Benz C200. May this be a sign that God loves you, and if you give thanks and praise up above, NOTHING IS IMPOSSIBLE Keep working hard, you are destined for GREATNESS WELL DONE\n\nThis latest act comes amidst ongoing public scrutiny of Chivayos wealth and his connections to Mr Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF businessman Wicknell Chivayo has once again made headlines by giving comedian Bhutisi, whose real … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/chigananda-chivayo-continues-to-splash-looted-cash/\">Continue reading<span class=\"screen-reader-text\"> \"“Chigananda” Chivayo Continues To Splash Looted Cash\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "David Alaba Struggles for Match Fitness",
            "url": "https://www.zimeye.net/2025/02/05/david-alaba-struggles-for-match-fitness/",
            "content": "Sports Correspondent\n\nReal Madrid has been handed a setback as central defender David Alaba continues to struggle with match fitness after picking up an injury. The club released an official update on his condition following tests conducted by their medical team on Tuesday.\n\nThe statement from Real Madrid confirmed the issue, stating, Following tests carried out on our player David Alaba by Real Madrid Medical Services, he has been diagnosed with an adductor injury in his left leg. The club assured fans that Alabas recovery is being closely monitored, as he works to regain full fitness and return to action.\n\nAlaba, who has played a vital role in Real Madrids defense since joining from Bayern Munich, has been struggling for match sharpness in recent weeks. Despite this, he was brought on for a few minutes in Madrids recent game, which underlined his ongoing battle to regain full fitness after a period of recovery.\n\nThis injury is a further setback for Alaba, who had been working to regain his spot in the starting lineup. His experience, leadership, and versatility have been crucial for the team, making his absence a worrying prospect for both Real Madrid and their supporters.\n\nThe official statement did not specify a timeline for Alabas return, leaving fans uncertain about how long the Austrian international will be sidelined. However, the clubs medical staff will continue to assess his condition as they manage his rehabilitation and recovery.\n\nWhile Alabas absence leaves a gap in the defense, Real Madrid will look to other members of the squad to step up in his place. The club is expected to provide further updates on his progress as more information becomes available, with fans hoping for a quick recovery as the defender works towards full fitness.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Real Madrid has been handed a setback as central defender David Alaba continues to struggle with match fitness … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/david-alaba-struggles-for-match-fitness/\">Continue reading<span class=\"screen-reader-text\"> \"David Alaba Struggles for Match Fitness\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "Warriors Star Moves To Wolverhampton Wanderers",
            "url": "https://www.zimeye.net/2025/02/05/warriors-star-moves-to-wolverhampton-wanderers/",
            "content": "Sports Correspondent\n\nZimbabwean midfielder Marshall Munetsi has completed a high-profile transfer to Premier League club Wolverhampton Wanderers in a deal reportedly worth 16 million (20 million). The move sees Munetsi depart French Ligue 1 side Stade Reims, setting a new record for the most expensive Zimbabwean player in history.\n\nThe combative midfielder has signed a three-and-a-half-year contract with Wolves, marking a major step forward in his career. This transfer provides Munetsi with the opportunity to test his abilities in one of the worlds most competitive leagues. His consistent and impressive performances in France have caught the attention of the Premier League, and Zimbabwean football fans are eagerly awaiting his debut in England.\n\nMunetsi underwent his medical in Paris on the day prior to the announcement, finalizing the transfer after both clubs reached an agreement.\n\nThe move also reunites him with former Reims teammate Emmanuel Agbadou, who made the same move to Wolverhampton Wanderers for a similar 20 million fee.\n\nThe reunion adds a familiar face for Munetsi in the English top flight, as the two players look to make an impact in the Premier League together.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean midfielder Marshall Munetsi has completed a high-profile transfer to Premier League club Wolverhampton Wanderers in a deal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/warriors-star-moves-to-wolverhampton-wanderers/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Star Moves To Wolverhampton Wanderers\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mighty Warriors Ready For Battle",
            "url": "https://www.zimeye.net/2025/02/05/mighty-warriors-ready-for-battle/",
            "content": "Sports Correspondent\n\nThe Zimbabwe womens national football team, the Mighty Warriors, have officially regrouped for their preparations for the 2026 Womens Africa Cup of Nations (WAFCON) qualifiers, with a 29-member squad reporting to camp this Sunday.\n\nThe Mighty Warriors are set to face regional rivals Angola on the 20th of the month in Luanda, before meeting them again a week later at the Lucas Moripe Stadium in South Africa.\n\nAhead of these crucial encounters, coach Sithethelelwe Sibanda expressed her satisfaction with the players readiness and enthusiasm. We are excited to start our preparations for the AFCON qualifiers, and we are confident that with the talent and dedication of our players, we can achieve great things, Sibanda said in a statement released by ZIFA.\n\nZIFA President Nqobile Magwizi also pledged full support for the Mighty Warriors, vowing to provide everything necessary to ensure the teams success. We stand behind the Mighty Warriors and will ensure they have all the support they need to excel, Magwizi said.\n\nThe teams first target is to overcome Angola and advance to the second round, where they will face the winner of the tie between Malawi and Congo. The ultimate goal remains securing one of the 12 spots available for the final tournament, which is set to take place in Morocco.\n\nThe Mighty Warriors are determined and ready to fight for a spot in the prestigious continental competition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe women’s national football team, the Mighty Warriors, have officially regrouped for their preparations for the 2026 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/mighty-warriors-ready-for-battle/\">Continue reading<span class=\"screen-reader-text\"> \"Mighty Warriors Ready For Battle\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mnangagwa Bribes War Veterans With USD 1,5 Million Cash",
            "url": "https://www.zimeye.net/2025/02/05/mnangagwa-bribes-war-veterans-with-usd-15-million-cash/",
            "content": "In a bid to quell dissent among war veterans, particularly outspoken critics like Blessed Geza, President Emmerson Mnangagwa has rolled out a US$1.5 million fund aimed at empowering former freedom fighters. The initiative is seen as a strategic move to silence those opposing his third-term agenda.\n\nThe Presidential War Veterans Fund, part of Mnangagwas broader Leaving No One and No Place Behind philosophy, seeks to recognize and reward the contributions made by war veterans, ex-political prisoners, detainees, restrictees, non-combatant cadres, and war collaborators to Zimbabwes independence and nation-building.\n\nA beneficiary of the fund expressed gratitude, saying, This is unheard of since 1980. We applaud the President for remembering us in such an impactful way. The money will be put to good use and will ensure that every waiver in the constituency benefits and has the chance to start a project or business of their choice.\n\nAnother recipient of the fund added, Im speechless, I never expected to witness this in my old age. The President has done something we never anticipated would happen. I already wanted to start a poultry project, and now I have the chance. I am going to ensure it is a success, and the fund keeps revolving.\n\nThe programme has already been launched in three provinces, and its reach is expected to expand further. Chikomba West legislator, Honourable Tatenda Mavetera, lauded the initiative, emphasizing, The President has shown he is a leader who incorporates everyone for economic development. One cannot deny the work he has done to uplift youths, women, and now war veterans. Im excited about the programmes that are going to be implemented this year through this fund, and whats amazing is how the President has said no interest will be charged to those who will access the fund. What more can you want from our President?\n\nMasvingos Minister of State for Provincial Affairs and Devolution, Honourable Ezra Chadzamira, added, This is a programme that will not only capacitate our veterans but will ensure that they contribute economically to the countrys vision through various initiatives they will implement from the fund. Everyone is set to benefit, and systems are being put in place to ensure transparency and accountability.\n\nThe War Veterans League Secretary, Cde Douglas Mahiya, stated that a Trust would be created for the distribution of the funds across provinces. He also emphasized, The President is a man who walks the talk. He has assured war veterans that they will be capacitated and cushioned against the economic challenges facing the country, and he has lived to his word. Today, Masvingo and Mashonaland Central have received their share, and other provinces will follow suit. The National Executive has approved the Trust that will see them borrowing money, which will be used as collateral.\n\nThis strategic move, intended to ensure loyalty and maintain the support of war veterans, is yet another example of Mnangagwas efforts to consolidate his power and secure his political agenda.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In a bid to quell dissent among war veterans, particularly outspoken critics like Blessed Geza, President Emmerson Mnangagwa has rolled … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/05/mnangagwa-bribes-war-veterans-with-usd-15-million-cash/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Bribes War Veterans With USD 1,5 Million Cash\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        },
        {
            "title": "Military Announcement: Justice Minister Finally Responds To ZDF Threat To Stop ED From Violating Constitution | EXCLUSIVE",
            "url": "https://www.zimeye.net/2025/02/04/military-announcement-justice-minister-finally-responds-to-zdf-threat-to-stop-ed-from-violating-constitution-exclusive/",
            "content": "Justice Minister Responds to Military Threat Against Mnangagwa\n\nBy Special Correspondent | ZimEye | Zimbabwes Justice Minister, Ziyambi Ziyambi, has dismissed claims that he advised President Emmerson Mnangagwa to fire his deputy, Constantino Chiwenga, amid growing political tensions that have now escalated to a military threat to remove Mnangagwa. His remarks come after a leaked viral unofficial press conference featuring a member of the Zimbabwe Defence Forces (ZDF) warning against any move to push Chiwenga out of power.\n\nSpeaking exclusively to ZimEye around 8 PM, Ziyambi strongly denied orchestrating efforts to sideline Chiwenga, dismissing allegations that he instructed ZANU PF structures to threaten the Vice President with crocodile milka euphemism for poison. Its not a crime, but its criminal to lie about what was never discussed, he said, referring to claims that he directed Mnangagwa to pretend ignorance over calls for an unconstitutional amendment to prolong his rule.\n\nHowever, when presented with a video clip from an official ZANU PF meeting where the pronouncements were made, Ziyambi evaded direct answers. Videos never speak about VP, he responded when confronted with footage of himself issuing directives.\n\nAs tensions within ZANU PF mount, concerns have risen over whether Mnangagwa intends to extend his stay in power beyond constitutional limits. When asked whether the constitutional amendment is aimed at eliminating Chiwenga from succession, Ziyambi countered, From where? Congress elects a successor. Has congress sat yet? Who said he [Chiwenga] cannot be elected in 2030?\n\nThe leaked press conference by the ZDF member, now circulating widely, underscores the militarys resistance to any move that would betray the long-standing agreement between war veterans and the ruling party, particularly the so-called Soko naShumba pact. This agreement is believed to outline power-sharing arrangements between Mnangagwa and Chiwenga.\n\nZiyambi further downplayed threats against Chiwenga, insisting that declarations from Mashonaland West leaderswho were caught on video chanting about feeding Chiwenga crocodile milkdid not amount to a political directive. Where did Mash West sing that song? I am not aware of ZANU PF issues being confined to agreements between two people. I thought we go to congress? he argued.\n\nDespite his denials, he was confronted with video evidence showing a Mashonaland West provincial chairperson making statements advocating for Chiwengas poisoning. Shortly after, Ziyambi abruptly terminated the conversation and left the interview at around 8:30 PM.\n\nThe Justice Ministers response does little to ease growing fears of an internal power struggle that has now drawn the attention of Zimbabwes military. With war veterans and army officials reportedly taking a firm stance against any betrayal of their agreement with Chiwenga, the political landscape remains volatile.\n\nFollow ZimEye for more updates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Justice Minister Responds to Military Threat Against Mnangagwa By Special Correspondent | ZimEye | Zimbabwe’s Justice Minister, Ziyambi Ziyambi, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/military-announcement-justice-minister-finally-responds-to-zdf-threat-to-stop-ed-from-violating-constitution-exclusive/\">Continue reading<span class=\"screen-reader-text\"> \"Military Announcement: Justice Minister Finally Responds To ZDF Threat To Stop ED From Violating Constitution | EXCLUSIVE\"</span></a></p>",
            "time": "20:34",
            "date": "05 Feb 2025"
        }
    ]
}