{
    "news": [
        {
            "title": "Wicknell Chivhayo Rubbishes General Chiwenga",
            "url": "https://www.zimeye.net/2025/02/03/wicknell-chivhayo-rubbishes-general-chiwenga/",
            "content": "By Munacho Gwamanda- Zanu PF sympathizer, acontroversial businessman, and convicted fraudster Wicknell Chivhayo has once again defied Vice President Constantino Chiwenga, proceeding with his extravagant financial pledges despite growing political tensions and allegations of corruption.\n\nChivhayo, a self-styled benefactor known for his ostentatious generosity towards celebrities and public figures, has now shifted his focus to Zimbabwean football, where his involvement in the recent Zimbabwe Football Association (ZIFA) presidential election has sparked widespread controversy.\n\nChivhayohas longbeen associatedwith dubious business dealings, state contracts, and allegations of financial misconduct.\n\nHis controversial past includes a 2005 fraud conviction and his involvement in the failed 100-megawatt Gwanda solar project, where hewas awardeda US$172 million tender but failed todeliver,despite receiving an advance payment of US$5 million from the Zimbabwe Power Company (ZPC).\n\nDespite numerous accusations of corruption and close ties to ruling party elites, Chivhayo has remained a high-profile businessman, often flaunting his wealth on social media and cultivating relationships with influential figures.\n\nVice President Chiwenga recentlyissued a stern warningagainst individuals leveraging their political connections for self-enrichment, condemning them for accumulating wealth through illicit means.\n\nSpeaking at the National Heroes Acre last week, Chiwengawithout naming Chivhayo directlycriticizedcertainfigures within ZANU-PF who hadgrown big tummies through corruption.The remarkswere widely interpretedas a direct rebuke ofChivhayosactivities and his growing influence.\n\nIn response, Chivhayo indirectly fired back at Chiwenga, dismissing him as afailed politician.His defiance signals a broader power struggle within the ruling elite, with Chivhayo seemingly enjoying protection from other high-ranking officials who benefit from his financial muscle.\n\nChivhayoslatest controversycentersaround the ZIFA presidential election held on January 25, where he faces accusations of vote-buying.\n\nHis financial backing of newly elected ZIFA president Nqobile Magwizi has drawn scrutiny, with critics alleging that his promises of US$10 million and 78 brand-new vehicles to ZIFA voting delegates amounted to undue influence.\n\nDespite the backlash, Chivhayo remains defiant. In a statement on X (formerly Twitter), he dismissed the allegations asbaseless and misleading,arguing that he holds no official role within ZIFA andis not boundbyFIFAsCode of Ethics. He further stated:\n\nIf the losing candidates are so heartbroken,Imhappy to meet them, apologize, and agree on agentlemansprivate settlement, rather than have them tarnish my precious name over unfounded allegations.\n\nTwine Phiri andPhillemonMachana, the losing candidates in the ZIFA presidential election, have escalated the matter to the Court of Arbitration for Sport (CAS), contestingMagwizisvictory.\n\nMagwizi secured a decisive win with 61 out of 77 votes (80%), while Machana and Phiri received six and four votes, respectively.\n\nIn their CAS submission filedon January 29, Phiri and Machana demand the annulment of the election results and call for fresh polls within 30 days.\n\nThey further seek to bar Magwizi from contesting again, accusing him of failing to distance himself from external financial backers like Chivhayo.\n\nTheir petition highlights alleged breaches of ZIFA statutes, including claims that Youth Minister Tino Machakaire improperly endorsed Magwizi before the election.\n\nAdditionally, one delegate reportedly photographed their ballot under duress, raising concerns over the credibility of the voting process.\n\nPhiri and Machana argue that ZIFA statutes mandate immediate reporting of undue influence to FIFA and the Confederation of African Football (CAF),a requirement they claim was blatantly ignored.\n\nIf CAS rules in theirfavor, Zimbabwean football could face further turmoil, potentially leading to FIFA sanctions.\n\nChivhayoscontinued defiance of Chiwenga and his involvement in the ZIFA elections underscore his enduring influence despite a history of controversy.\n\nAs the legal battle unfolds, the case could expose deeper rifts withinZimbabwespolitical and business elite, with Chivhayo seemingly positioning himself as an untouchable figure.\n\nWhetherChiwengaswarnings will translate into tangible action against him remains to be seen, but for now,Chivhayosflamboyant defiance continues to dominate headlines.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Zanu PF sympathizer, a controversial businessman, and convicted fraudster Wicknell Chivhayo has once again defied Vice President Constantino … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/wicknell-chivhayo-rubbishes-general-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Wicknell Chivhayo Rubbishes General Chiwenga\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Chiwenga Invades Roman Catholic Church Service",
            "url": "https://www.zimeye.net/2025/02/03/chiwenga-invades-roman-catholic-church-service/",
            "content": "James Gwati Vice President Constantino Chiwenga and his wife, Colonel Miniyothabo, attended a Roman Catholic Church service in Harare on Sunday.\n\nDuring the church service, Chiwenga joined the Catholics guide wing and became a volunteer.\n\nDressed in formal attire before donning the guilds robe with the help of his wife, Colonel Miniyothabo Chiwenga, the former military general attended the service in a display that sparked speculation about his political and personal trajectory.\n\nA Catholic guild is a group of faithful united by their Catholic beliefs, often working together to support their local community.\n\nSome guilds are occupational, while others focus on specific church activities.\n\nChiwengas membership comes at a time of heightened political tension within the ruling ZANU-PF, where he remains locked in a power struggle with President Emmerson Mnangagwa.\n\nChiwenga, a career soldier who rose to become the Commander of the Zimbabwe Defence Forces (ZDF), played a pivotal role in Zimbabwes political history.\n\nA battle-hardened veteran of the liberation war, he steadily climbed the ranks in the Zimbabwe National Army (ZNA), eventually becoming a close ally of then-President Robert Mugabe before turning against him in 2017.\n\nHis defining moment came in November 2017, when he led a military coup under the pretense of restoring order within ZANU-PF.\n\nDubbed Operation Restore Legacy, the coup ousted Mugabe after 37 years in power, paving the way for Mnangagwawho had just been fired as Vice Presidentto assume the presidency.\n\nChiwenga was rewarded with the Vice Presidency and the powerful post of Minister of Defence, signalling the militarys grip on civilian politics.\n\nDespite their alliance during the coup, Chiwengas relationship with Mnangagwa has since soured.\n\nThe two men represent different factions within ZANU-PF: Mnangagwa leads the civilian political elite, while Chiwenga embodies the military-backed old guard.\n\nOver the years, their rivalry has played out through political maneuvering, purges, and even suspected assassination attempts.\n\nChiwengas mysterious health ailments, which led him to seek medical treatment in China, fueled speculation that he was being targeted.\n\nAt the same time, Mnangagwa has moved to consolidate power by sidelining military-linked figures and appointing loyalists to key positions, including within the security sector.\n\nIn ZANU-PF circles, Chiwenga is often viewed as the biggest internal threat to Mnangagwas grip on power.\n\nSome analysts believe he is strategically positioning himself to take over through the 2028 elections or another internal party shake-up.\n\nChiwengas decision to publicly embrace his Catholic faith may be more than just a personal commitmentit could also be a calculated political move.\n\nThe church holds significant influence in Zimbabwean society, and aligning with religious institutions has long been a tactic for politicians seeking broader appeal beyond their traditional support bases.\n\nFor a man who has spent most of his life in the barracks and political corridors, the rare sight of Chiwenga in church adds an intriguing layer to his political manoeuvring.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "James Gwati– Vice President Constantino Chiwenga and his wife, Colonel Miniyothabo, attended a Roman Catholic Church service in Harare on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/chiwenga-invades-roman-catholic-church-service/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Invades Roman Catholic Church Service\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Gutu East MP Ganyiwa Faces Expulsion From Zanu PF",
            "url": "https://www.zimeye.net/2025/02/03/gutu-east-mp-ganyiwa-faces-expulsion-from-zanu-pf/",
            "content": "By A Correspondent\n\nZANU PF is preparing for a by-election in Gutu East following the expulsion of MP Benjamin Ganyiwa, marking another chapter in the ongoing internal power struggles within the ruling party. The partys officials have been making the rounds in the constituency, informing supporters of Ganyiwas expulsion and upcoming recall from Parliament.\n\nGanyiwas expulsion comes after a disciplinary hearing where he was charged with multiple offenses. He faced four key allegations: failing to control party supporters who attacked leadership on a WhatsApp group, holding unauthorized meetings that defied provincial leadership, and demonstrating insubordination to higher party officials.\n\nThe tensions surrounding Ganyiwas expulsion are further heightened by ongoing factional divisions within ZANU PF, with factions aligned to both President Emmerson Mnangagwa and Vice President Constantino Chiwenga at odds. This ongoing infighting has become a prominent feature of the partys internal politics, leading to actions like Ganyiwas dismissal.\n\nA local ZANU PF official in Gutu East made it clear on Saturday that the party would not tolerate insubordination. If you dont respect the party leadership, you are gone, the official stated. Ganyiwa is gone, we are preparing for a by-election here.\n\nBenjamin Ganyiwas expulsion is not an isolated case. Roy Bhila, an MP from Chiredzi, is also facing similar actions after appearing before a disciplinary committee. These moves underscore the partys growing intolerance for any perceived defiance against its leadership, as divisions continue to play out in the public eye.\n\nWith the by-election now in the pipeline for Gutu East, the dispute over leadership within ZANU PF is far from over, and it remains to be seen how these internal battles will affect the partys broader political strategy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF is preparing for a by-election in Gutu East following the expulsion of MP Benjamin Ganyiwa, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/gutu-east-mp-ganyiwa-faces-expulsion-from-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Gutu East MP Ganyiwa Faces Expulsion From Zanu PF\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Herald Subtly Positions Chiwenga as Head of State Figure Amid Mnangagwa Rift",
            "url": "https://www.zimeye.net/2025/02/03/herald-subtly-positions-chiwenga-as-head-of-state-figure-amid-mnangagwa-rift/",
            "content": "By Dorrothy Moyo | ZimEye | Harare, Zimbabwe  Zimbabwes state-controlled newspaper, The Herald, has sparked intense political speculation after publishing an article that subtly elevates Vice President Constantino Chiwengas public image, portraying him as a statesman of presidential stature while downplaying President Emmerson Mnangagwas authority.\n\nIn an article covering Chiwengas induction into the Roman Catholic guild, The Herald meticulously crafted an image of a deeply principled, God-fearing, and hardworking leader, a move that analysts see as a deliberate attempt to prepare the public for a potential transition of power.\n\nChiwenga as a National Leader: The Subtext in The Heralds Coverage\n\nRather than portraying Chiwenga in his capacity as Vice President, the state-run paper framed him as a head-of-state figure, highlighting his commitment to national service, discipline, and Christian values.\n\nKey phrases used in the article emphasize:His selfless dedication to the country.His discipline and work ethic, suggesting a leader who is first in the office and committed to national duty.His spiritual and moral grounding, aligning him with Zimbabwes traditional values.\n\nPolitical analysts argue that these strategic portrayals are rarely accidental in Zimbabwes tightly controlled state media. Instead, they reflect a broader political narrative being shaped behind closed doors.\n\nMnangagwas Absence: A Deliberate Omission?\n\nOne of the most striking aspects of the article is the complete absence of Mnangagwas name or reference to his leadership. In state media, particularly The Herald, major political figures are rarely given significant coverage without some mention of the sitting president to reinforce the established power structure.\n\nBy presenting Chiwenga as a dedicated national servant without acknowledging Mnangagwas leadership, The Herald has inadvertentlyor deliberatelysuggested that the Vice President is more aligned with the nations values and future.\n\nA Signal of Power Shift?\n\nThis latest coverage comes at a time when Mnangagwa is facing growing resistance over his controversial attempt to extend his presidency to 2030 by manipulating the Constitution. Reports of an internal power struggle within ZANU-PF and the military have intensified, with Chiwenga seen as the primary contender to challenge Mnangagwas rule.\n\nSeveral key observations suggest that this article is part of a larger effort to reshape public perception:1.Chiwengas Portrayal as a Statesman: The article focused on his leadership qualities rather than his party role, a stark contrast to past portrayals of Mnangagwa as the sole authority.2.Alignment with the Church: Zimbabwes history has shown that political leaders often seek religious endorsements to solidify their public support. The emphasis on Chiwengas Catholic faith suggests an effort to present him as a leader of integrity and morality.3.Work Ethic and National Duty: Statements about his early office hours and national dedication create an implicit comparison with Mnangagwa, who has faced criticism over alleged corruption and ineffective leadership.\n\nThe Mnangagwa-Chiwenga Rivalry: A Political Volcano Ready to Erupt?\n\nThis portrayal of Chiwenga comes amid growing speculation that he is positioning himself to replace Mnangagwa, either through a negotiated transition or a more forceful political maneuver.Recent military movements and Mnangagwas increasingly tight security measures have fueled rumors that the president is operating under virtual house arrest.The war veterans, a historically powerful force in ZANU-PF politics, have also begun questioning Mnangagwas legitimacy, further isolating him within the party.The resurfacing of Chiwengas 2017 military credentials in state media has been interpreted as a subtle reminder of who orchestrated Mugabes removaland who could do it again.\n\nIs The Herald Preparing Zimbabwe for a Post-Mnangagwa Era?\n\nIf The Heralds Chiwenga-focused narrative continues, it may indicate that state-controlled media is laying the groundwork for an impending leadership transition.\n\nThis strategic public relations move is reminiscent of how Mugabes exit was foreshadowed in the media before the 2017 coup. The gradual glorification of Chiwenga, coupled with the silence on Mnangagwa, suggests that political forces within ZANU-PF are subtly signaling a shift in power.\n\nWhat Next?\n\nZimbabwe now stands at a pivotal moment, with multiple scenarios unfolding:1.Chiwenga consolidates military and party backing, forcing Mnangagwa out.2.Mnangagwa retaliates, attempting to neutralize Chiwenga before losing full control.3.A negotiated settlement emerges, paving the way for a soft transition.\n\nWith state media playing an increasingly transparent role in shaping this narrative, Zimbabweans are watching closelybecause when The Herald starts rewriting history, a new chapter in the countrys leadership is never far behind.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | Harare, Zimbabwe – Zimbabwe’s state-controlled newspaper, The Herald, has sparked intense political speculation after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/herald-subtly-positions-chiwenga-as-head-of-state-figure-amid-mnangagwa-rift/\">Continue reading<span class=\"screen-reader-text\"> \"Herald Subtly Positions Chiwenga as Head of State Figure Amid Mnangagwa Rift\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Mnangagwa Left With Days After Changing Constitution To Rule to 2030",
            "url": "https://www.zimeye.net/2025/02/03/mnangagwa-left-with-days-after-changing-constitution-to-rule-to-2030/",
            "content": "Mnangagwa Risks Ouster Over Constitution Manipulation as ZANU-PF Pushes Term Extension\n\nHarare, Zimbabwe  President Emmerson Mnangagwa is facing mounting resistance within Zimbabwes ruling ZANU-PF and beyond, as his controversial bid to extend his rule until 2030 has sparked outrage over allegations of constitutional mutilation. The move, now in its implementation phase, has exposed deep fractures within the party and intensified speculation that Mnangagwas grip on power is rapidly weakening.\n\nMnangagwas Constitutional Gamble\n\nZANU-PF has escalated its push for a Constitutional Amendment that would delay the 2028 elections by two yearseffectively extending Mnangagwas term without public consent. The party, which passed this resolution during its 21st Annual National Peoples Conference in Bulawayo, is now executing it through Parliament, sidestepping a referendum.\n\nThere is no going back in implementing the resolution, declared ZANU-PF National Political Commissar Munyaradzi Machacha, signaling that the party has already instructed Parliament to proceed with the amendment.\n\nHarare Provincial Chairman Godwills Masimirembwa further claimed that the extension does not interfere with Zimbabwes constitutional term limits since it merely postpones elections rather than granting Mnangagwa an additional term. However, legal experts and opposition leaders argue that this is an outright subversion of the Constitution, designed to entrench Mnangagwa in power beyond his mandated two terms.\n\nGrowing Resistance from ZANU-PF and the Military\n\nDespite party officials insisting on the legitimacy of this move, dissent is rapidly growing within ZANU-PF, the military, and war veteransthree critical pillars that historically determine Zimbabwes leadership transitions.\n\nRecent public appearances and political maneuvers by Vice President Constantino Chiwenga have fueled speculation that the military might be positioning itself to challenge Mnangagwas rule. Last week, Chiwengas grand entrance at the National Heroes Acrewhere a massive crowd erupted in chants of a pro-opposition Nelson Chamisa songwas interpreted as a powerful statement that Mnangagwas authority is under siege.\n\nAnalysts now warn that Zimbabwe is on the verge of a political showdown, with Chiwenga emerging as the key alternative power center.\n\nVirtual House Arrest? Mnangagwas Movements Under Scrutiny\n\nRumors have intensified that Mnangagwa is under virtual house arrest, with increasing reports that he is heavily guarded inside his roaming motorcade, unable to move freely due to security concerns.\n\nWhile government officials have dismissed such claims as opposition propaganda, a closer look at the presidents recent public engagements suggests heightened security measures and a reduction in unscripted appearancesa sign that he may no longer be fully in control.\n\nPolitical insiders reveal that Mnangagwas declining influence within ZANU-PF has driven him into a defensive posture, relying on an ever-tightening inner circle as pressure mounts from both the military and key party figures.\n\nChiwengas Power Play: A Silent Coup in Motion?\n\nSources indicate that Chiwenga, a former military commander who led the coup against Robert Mugabe in 2017, is now maneuvering behind the scenes to challenge Mnangagwas legitimacy. If he consolidates military and party support, Mnangagwas position could become untenable within weeks, if not days.\n\nA recent public poll on Mnangagwas political survival paints a grim picture for the embattled leader:61% believe he will last only three days once military backing shifts fully to Chiwenga.18% predict a three-week survival period.14% give him at most three months.Only 7% think he could remain in power for another three years.\n\nThese statistics underscore the widespread belief that Mnangagwa is running out of time.\n\nFallout from Mnangagwas Alleged Plans to Fire Chiwenga\n\nAdding to the tension is speculation that Mnangagwa intends to dismiss Chiwenga in a desperate attempt to neutralize his growing influence. However, such a move could backfire catastrophically, accelerating Mnangagwas downfall rather than securing his position.\n\nThe presidents recent warnings that anyone attempting to replace him must go through the death row or take poison first suggest that he recognizes the existential threat posed by Chiwenga and is bracing for a last-ditch battle.\n\nWar Veterans Join the Resistance\n\nThe once-loyal war veterans association, which played a pivotal role in bringing Mnangagwa to power in 2017, has now openly questioned his leadership. Their recent challenge to Mnangagwa and controversial businessman Maxwell Chikumbutso suggests that the faction is preparing to withdraw support altogether.\n\nThe veterans have raised several key demands, including:1.Proof that Mnangagwa was poisoned in 2017, a claim he has often used to justify political purges.2.Evidence that Chikumbutsos endless electricity invention is legitimate and not a scam.3.Clarification on why Mnangagwa appointed convicted armed robber Paradzayi Kutyauripo to a government position.4.An explanation of when Mnangagwa allegedly ceased working for the Rhodesian security services.\n\nThese pointed questions indicate that Mnangagwas long-standing allies are now turning against him, further weakening his position.\n\nThe Unfolding Coup: Will Mnangagwa Survive?\n\nThe current political climate bears striking similarities to the events leading up to Robert Mugabes 2017 ouster. If Mnangagwa has truly lost the support of the military and party elites, his removal could be swift and decisive, much like Mugabes.\n\nWhile Mnangagwas inner circle insists he remains in control, opposition leaders and independent observers believe Zimbabwe is on the brink of another leadership shake-up.\n\nWhats Next?\n\nWith constitutional amendments underway, military tensions rising, and war veterans distancing themselves from Mnangagwa, the next few weeks could determine Zimbabwes political future.\n\nThree potential scenarios could unfold:1.Mnangagwa successfully pushes through the constitutional amendment and clings to power until 2030.2.Chiwenga consolidates military and party control, forcing Mnangagwa to resign or flee.3.A negotiated transition emerges, allowing a compromise leadership shift without a full-scale coup.\n\nRegardless of the outcome, one thing is clear: Zimbabwe is entering a new era of political uncertainty.\n\nIs This the End for Mnangagwa?\n\nFor now, Mnangagwa faces his biggest political crisis since taking power in 2017. His bid to manipulate the Constitution to extend his rule has sparked internal rebellion, alienated key allies, and emboldened his political enemies.\n\nWith Zimbabweans already predicting his imminent downfall, the country could soon witness a dramatic shift in leadershipwhether through a coup, a backroom deal, or an unprecedented resignation.\n\nAs the crisis deepens, all eyes are on Harare to see if Mnangagwa can surviveor if history is about to repeat itself.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mnangagwa Risks Ouster Over Constitution Manipulation as ZANU-PF Pushes Term Extension Harare, Zimbabwe – President Emmerson Mnangagwa is facing mounting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/mnangagwa-left-with-days-after-changing-constitution-to-rule-to-2030/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Left With Days After Changing Constitution To Rule to 2030\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Woman Sentenced to Five Years for Trafficking Newborn from South Africa to Zimbabwe",
            "url": "https://www.zimeye.net/2025/02/03/woman-sentenced-to-five-years-for-trafficking-newborn-from-south-africa-to-zimbabwe/",
            "content": "Woman Sentenced to Five Years for Trafficking Newborn from South Africa to Zimbabwe\n\nHarare, Zimbabwe  A Zimbabwean woman convicted of trafficking a two-day-old baby from South Africa to Zimbabwe with the intent of selling the child for adoption outside Africa has been sentenced to five years in prison.\n\nJanet Marimo, who conspired with the infants mother, Pauline Maganga, paid R25,000 to purchase the child before attempting to arrange an illegal adoption abroad. However, authorities foiled her plan, arresting her in Harare before the transaction could be completed.\n\nPresiding over the case, Magistrate Donald Ndirowei acknowledged that standard sentencing guidelines for such crimes typically carry a 10-year prison term. However, he ruled that special circumstances warranted a reduction.\n\nThe court found the accused was bona fide in her mistaken understanding of adoption laws in both South Africa and Zimbabwe, Magistrate Ndirowei stated. Her ignorance of the law and lack of sophistication were deemed special circumstances.\n\nThe court also took into consideration the role of Maganga, the babys biological mother, who was sentenced to 10 years in May 2024. Maganga testified that she first connected with Marimo through a Facebook adoption group in March 2023.\n\nMarimo, who administered the online group, facilitated discussions about adoption among its six members, including individuals from South Africa, Zimbabwe, and the United States. It was through this platform that she engaged with Maganga, leading to the illicit arrangement that ultimately resulted in their arrests.\n\nAuthorities have warned that illegal adoption networks continue to pose a significant threat, with law enforcement agencies ramping up efforts to dismantle such operations. The case has sparked renewed calls for stricter regulations and public awareness on legal adoption procedures to prevent further exploitation of vulnerable children.\n\nThis developing story highlights the complex intersection of poverty, desperation, and legal loopholes that traffickers exploit to facilitate illegal adoptions. Authorities urge the public to report suspicious adoption activities to prevent similar cases.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Woman Sentenced to Five Years for Trafficking Newborn from South Africa to Zimbabwe Harare, Zimbabwe – A Zimbabwean woman convicted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/woman-sentenced-to-five-years-for-trafficking-newborn-from-south-africa-to-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Sentenced to Five Years for Trafficking Newborn from South Africa to Zimbabwe\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Zim Economic Crisis : Will Mthuli’s Plan Make A Difference?",
            "url": "https://www.zimeye.net/2025/02/03/zim-economic-crisis-will-mthulis-plan-make-a-difference/",
            "content": "By A Correspondent\n\nZimbabwes economic crisis continues to worsen, and Finance and Investment Promotion Minister Mthuli Ncubes recent remarks about the role of the informal sector offer little hope for resolution.\n\nNcube placed blame on the informal sector for the difficulties supermarkets are facing, claiming it is the competition from the informal sector that is exacerbating the situation. However, this explanation fails to address the deeper systemic issues at play.\n\nIn a statement released on Friday, Ncube argued that the economic troubles stem from informal traders who are bypassing formal retail channels. Since the beginning of 2023, some manufacturers have been opting to supply their goods directly to customers and informal retailers, bypassing wholesalers and retailers, he said. According to Ncube, this practice has put formal businesses in direct competition with the informal sector, which operates outside of formal regulations, including taxes and labour laws. This, he asserts, has led to the closure of some supermarkets and stores.\n\nHowever, while Ncubes comments focus heavily on the informal sector, they overlook the internal failures of formal businesses. He acknowledged that poor management and poor corporate governance have contributed to the struggles of some large retail chains, leading to business closures. This raises the question: is it fair to solely blame informal traders for the crisis when formal businesses are also facing significant challenges due to mismanagement?\n\nNcubes statements come in the context of a worsening economic situation in Zimbabwe, where rising inflation, high unemployment, and unsustainable living costs continue to drive many businesses and individuals toward the informal economy. Despite efforts by the government to tackle the issue, such as the introduction of a 5% withholding tax on unregistered micro and small enterprises (MSMEs) and a reduction in the VAT registration threshold, the informal sector remains a substantial force in the economy.\n\nTo address the impact of informal trading, Ncube outlined measures in the 2024 Mid-Term Budget and the 2025 National Budget, including the mandatory use of Point-of-Sale (POS) machines by all informal traders and a crackdown on goods deemed smuggled. While these measures may contribute to improving compliance, they fail to address the underlying issues facing both formal and informal sectors. In his statement, Ncube also proposed additional actions, such as leveling the playing field between formal and informal businesses and enforcing collaboration between Local Authorities and Central Government in the licensing and enforcement processes.\n\nYet, the central issue remains unaddressed: the governments failure to create an environment where formal businesses can thrive, and where the informal economy is better integrated into the national economy rather than treated as a scapegoat.\n\nResearch and consultations indicate that some of the reasons formal businesses are experiencing distress include competition from the informal sector, poor management, and poor corporate governance, Ncube said. Yet, the constant focus on competition from the informal sector diverts attention from the real need for a comprehensive economic overhaul.\n\nThe governments proposals include enforcing international best practices for tax compliance, strengthening enforcement through a Domestic Interagency Enforcement Team, and introducing additional incentives to support local industry. However, these measures might not be enough to tackle the root causes of Zimbabwes ongoing economic crisis.\n\nIn conclusion, while Mthuli Ncube has proposed several steps aimed at formalizing the informal sector and promoting tax compliance, the economic crisis in Zimbabwe cannot be solved by simply blaming the informal economy. A more holistic approach is neededone that addresses poor governance, supports business growth in both the formal and informal sectors, and ultimately creates a sustainable economic environment for all Zimbabweans. As the country moves toward Vision 2030, it is clear that without deeper structural reforms, the crisis will persist.\n\nMinister Mthuli Ncubes focus on external factors, while important, misses the bigger picture, and its time for a shift in focus toward real economic solutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s economic crisis continues to worsen, and Finance and Investment Promotion Minister Mthuli Ncube’s recent remarks about … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/zim-economic-crisis-will-mthulis-plan-make-a-difference/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Economic Crisis : Will Mthuli’s Plan Make A Difference?\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Warriors Coach Nees  Ready for AFCON",
            "url": "https://www.zimeye.net/2025/02/03/warriors-coach-nees-ready-for-afcon/",
            "content": "Soorts Correspondent\n\nZimbabwe Warriors coach Michael Nees has returned from his holiday break, re-energized and focused on achieving success in both the AFCON finals and World Cup qualifiers.\n\nWith the AFCON finals looming in December and World Cup qualifiers resuming in March, Nees is aware of the challenges ahead. We have a double project, he said. On one hand, we have to develop towards the AFCON finals, while on the other, we have to immediately perform well in the World Cup qualifiers.\n\nNees attended the AFCON draw in Rabat, Morocco, where Zimbabwe was grouped with Egypt, South Africa, and Angola in Group B. Despite the tough draw, Nees is confident that the Warriors can hold their own. We need to peak at the AFCON finals, not before, he said. We have to prepare well and make sure we bring maximum performance on the pitch.\n\nThe German coach also met with new ZIFA president Nqobile Magwizi in Rabat, describing their conversation as very positive. Nees acknowledged that the World Cup qualifiers are crucial but believes that Zimbabwe still has a chance to turn things around.\n\nThe Warriors will resume their World Cup qualifying campaign in March with matches against Benin and Nigeria. Nees is looking forward to the challenge, saying, We will do our best. Whatever comes, we will do our best.\n\nWith the AFCON finals in December, Nees is targeting a spot in the knockout stage. Our goal is to progress to the second round and then see how far we can go, he said. Nees also praised Angola, describing them as a team with very skilful players.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Soorts Correspondent Zimbabwe Warriors coach Michael Nees has returned from his holiday break, re-energized and focused on achieving success in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/warriors-coach-nees-ready-for-afcon/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Coach Nees  Ready for AFCON\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Zanu PF Internal Power Struggles Continue",
            "url": "https://www.zimeye.net/2025/02/03/zanu-pf-internal-power-struggles-continue/",
            "content": "By A Correspondent\n\nZANU PFs Midlands Province has called for the immediate expulsion of Blessed Geza from the ruling partys Central Committee, citing his recent actions and affiliations.\n\nDuring a meeting, Midlands Provincial Chairperson Edson Chiherenge announced that the decision to remove Geza had been unanimously supported by all ten provinces and is now awaiting implementation. We stand firm against Geza. All provinces have endorsed his removal from the Central Committee, Chiherenge declared, leading the crowd in chants of Pasi naGezi, which translates to Down with Geza.\n\nChiherenge continued, emphasizing that Geza has aligned himself with opposition forces.\n\nGeza has shown no loyalty to the party. He has been associating with Chamisa and Kasukuwere, he said, signaling the partys dissatisfaction with Gezas actions.\n\nThis call for Gezas expulsion follows his recent involvement in leading a press conference with a faction of war veterans, where they demanded the resignation of President Emmerson Mnangagwa. The group accused Mnangagwa of nepotism, corruption, and economic mismanagement, issues that have sparked controversy within the ruling party.\n\nIn response to the move to oust him, former ZANU PF member Saviour Kasukuwere, who has been a vocal critic of Mnangagwas administration, fired back, saying the plotters actions were futile. Its too late now, Kasukuwere stated defiantly. When theyve failed to improve the healthcare system, failed pensioners, failed the army, failed the police, and brought hunger and misery to the people, they resort to insults. Get ready, its over now.\n\nThe growing rift within the party signals a turbulent road ahead for ZANU PF as the internal power struggles continue to unfold.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF’s Midlands Province has called for the immediate expulsion of Blessed Geza from the ruling party’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/zanu-pf-internal-power-struggles-continue/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Internal Power Struggles Continue\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        },
        {
            "title": "Mnangagwa Minister Says Zimbabweans In America Must Return Home",
            "url": "https://www.zimeye.net/2025/02/03/mnangagwa-minister-says-zimbabweans-in-america-must-return-home/",
            "content": "By A Correspondent\n\nThe callous comments by Minister of Local Government and Public Works, Daniel Garwe, during a recent civil servants meeting in Masvingo have raised concerns across the nation.\n\nGarwe not only threatened action against war veteran Blessing Geza but also endorsed U.S. President Donald Trumps controversial plan to deport Zimbabweans living in the United States.\n\nAddressing civil servants and ZANU PF supporters at Masvingo Polytechnic on Thursday, Garwe began by discussing Geza, who last week made headlines with a press conference attacking government officials, including President Emmerson Mnangagwa. Garwe took aim at Geza, saying, Blessing Geza ndiBhoki, saka takurova Bhoki tiwone kuti akatumwa nani. Pane akatuma Bhoki kuti ataure zvisina basa, meaning Blessing Geza is a puppet, so we will deal with him and see who sent him. Someone is controlling him to speak nonsense.\n\nWhile Geza refrained from naming the individuals behind his comments, Garwe was clear in his assertion that Geza was not acting independently. Geza is being controlled by a master, and he is going to be jailed over corruption, Garwe continued, hinting at the possibility of legal repercussions for the war veteran.\n\nIn a surprising turn, Garwe also took the opportunity to comment on U.S. immigration policy, praising President Trumps move to deport 504 Zimbabweans believed to be illegally staying in the United States.\n\nLet them come back home, Garwe declared, adding that these individuals had been actively attacking Mnangagwa on social media. His words sparked alarm, with critics labeling the ministers comments as both callous and politically charged.\n\nGarwes statements have been met with concern by many, with some questioning the ethics of using the deportation issue to target political adversaries. The ministers rhetoric, especially regarding the deportation of Zimbabweans, seems to blur the lines between domestic politics and international relations, raising further questions about the priorities of the government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The callous comments by Minister of Local Government and Public Works, Daniel Garwe, during a recent civil … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/03/mnangagwa-minister-says-zimbabweans-in-america-must-return-home/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister Says Zimbabweans In America Must Return Home\"</span></a></p>",
            "time": "20:25",
            "date": "03 Feb 2025"
        }
    ]
}