{
    "news": [
        {
            "title": "VP Chiwenga Globe-Trots Again, Returns To Rome",
            "url": "https://www.zimeye.net/2025/05/01/vp-chiwenga-globe-trots-again-returns-to-rome/",
            "content": "ByMunacho GwamandaVice President Constantino Chiwenga has flown back to Italy, continuing a series of international travels that have sparked renewed debate over the governments lack of transparency regarding high-level foreign trips and their associated costs.\n\nState media reported that Chiwenga, who was in Rome last week to attendthe funeral of Pope Francisbeforetravellingto Iran, has now returned to Italy for whataredescribed as high-level meetings with theleadership of theRoman Catholic Church.\n\nZimbabwes Ambassador to the Vatican, Sekai Nzenza, confirmed the Vice Presidents presence in Rome.\n\nVice President Chiwengas attendance at Pope Franciss funeralclearlysignified the strong relationship between Zimbabwe and the Vatican, said Ambassador Nzenza. The Catholic Church has had a long-standing presence in Zimbabwe, even during the liberation struggle. Ive had the privilege of meeting Pope Francis twicein December and Januaryand held talks with the Vatican Secretary of State.\n\nAccording to Nzenza, the Vatican is keen to engage Zimbabwe on key social issues.\n\nOur discussions focused on the Vaticans commitment to youth development andthe empowerment of womenthrough education. The Catholic Church has long contributed to education and healthcare in Zimbabwe, and those conversations will continue, she said. We intendto further exploreissues ofsocial justice, inequality, education for girls, youth development, health, and climate change.\n\nHowever, Chiwengas frequent international travels, often under the guise of diplomacy, have long drawn scrutiny, especially given the opacity surrounding their purpose and cost.\n\nSince undergoing major treatment in China in 2019 after a prolonged and mysterious illness, Chiwenga has made regular visits to Asia for what officials describe as routine medical check-ups.\n\nHis recurring foreign trips, many of which are not clearly explained to the public, have invited comparisons to former President Robert Mugabe, who was widelycriticisedfor spending vast amounts of state resources on overseas medical care while neglecting the countrys healthcare system.\n\nCritics argue that Chiwenga, like Mugabe before him, has effectively become an airborne leader, spending significant time abroad at taxpayer expense, with little to no disclosure of the financial or policy implications of these journeys.\n\nThe Zimbabwean government continues to withhold details on the costs and frequency of presidential and vice-presidential trips, prompting calls for greater accountability.\n\nDespite demands from civil society and opposition leaders, there has been no official breakdown of travel-related expenses, leaving citizens in the dark about how much of the national budget isbeingconsumed by elite medical and diplomatic excursions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda–Vice President Constantino Chiwenga has flown back to Italy, continuing a series of international travels that have sparked renewed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/vp-chiwenga-globe-trots-again-returns-to-rome/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Globe-Trots Again, Returns To Rome \"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "Former Miss Zimbabwe Dies",
            "url": "https://www.zimeye.net/2025/05/01/former-miss-zimbabwe-dies/",
            "content": "By Showbiz Reporter-Former Miss Zimbabwe 1982, CarolineMurinda,has died.\n\nShe was 65.\n\nMurinda, who was crowned just two years after the countrys independence, passed away on Tuesday afternoon at a hospital in South Africa, where she had been receiving medical treatment.\n\nA family spokesperson confirmed her passing, saying:\n\nShe died today after beinghospitalisedin South Africa. She had been living there with her family. We are still awaiting further details regarding her burial.\n\nThe spokesperson added that family elders are currently deliberating on funeral arrangements.\n\nI will provide more information as soon as it becomes available, she said.\n\nMurinda is survived by her two children.\n\n H-Metro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Former Miss Zimbabwe 1982, Caroline Murinda, has died. She was 65. Murinda, who was crowned just two years after the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/former-miss-zimbabwe-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Former Miss Zimbabwe Dies\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "Barcelona, Inter In Explosive Draw",
            "url": "https://www.zimeye.net/2025/05/01/barcelona-inter-in-explosive-draw/",
            "content": "Sports Correspondent\n\nBarcelona and Inter Milan played out a thrilling 3-3 draw in the first leg of their Champions League semifinal at the Olympic Stadium in Montjuc on Wednesday, with both sides exchanging blows in a high-octane encounter.\n\nInter stunned the hosts early, taking the lead inside the first minute through a clever back-heel finish by Marcus Thuram. The Italian side doubled their advantage in the 21st minute when Denzel Dumfries executed a spectacular volley from a corner to silence the Barcelona crowd.\n\nBut Barcelona quickly responded through teenage sensation Lamine Yamal, who cut in from the right and fired a precise strike into the net just three minutes later. The momentum shifted further when Ferran Torres equalized in the 38th minute, converting a one-touch finish after Yamal struck the post moments earlier.\n\nInter regained the upper hand midway through the second half, with Dumfries heading home his second of the night from yet another corner in the 64th minute. However, Barcelona answered back almost immediately when Raphinhas powerful shot from distance ricocheted off the post, struck goalkeeper Yann Sommers back, and rolled in for the hosts third goal.\n\nWith the tie finely poised, all eyes now turn to the return leg at the San Siro next Tuesday, where the winner will earn a coveted spot in the Champions League final in Munich against either Arsenal or Paris Saint-Germain.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Barcelona and Inter Milan played out a thrilling 3-3 draw in the first leg of their Champions League … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/barcelona-inter-in-explosive-draw/\">Continue reading<span class=\"screen-reader-text\"> \"Barcelona, Inter In Explosive Draw\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "First Female AirForce General Declared National Heroine",
            "url": "https://www.zimeye.net/2025/05/01/first-female-airforce-general-declared-national-heroine/",
            "content": "By Munacho GwamandaThe ruling Zanu PF party has conferred national heroine status on Retired Air Vice Marshal (AVM) WinnieMandeya, marking a historic moment as she becomes the first femaleAir Vice Marshalto be accorded such anhonourin Zimbabwe.\n\nThe rank of Air Vice Marshal is equivalent to that of a Major General in the Zimbabwe National Army.\n\nThe announcement was delivered byZanu PF national political commissar Munyaradzi Machacha, whoinformed her family on Tuesday evening.\n\nHe said the Government was prepared tointerher at the National Heroes Acre in Harare on Thursday, May 2, pending the familys consent.\n\nThe national heroine has been granted the highest recognition, and she will be laid to rest among other distinguished heroes and heroines of our country at the National Heroes Acre, Machacha said. If the family is comfortable with that, thenGovernmentwill begin making the necessary arrangements.\n\nAVM Mandeya died at the age of 64.\n\nA liberation war veteran and a trailblazing officer, she joined the struggle for independence on September 29, 1975, undergoing military training at Nachingweya in Tanzania.\n\nShe was later deployed to Gaza Province where she operated until 1978,before beingselected to undertake a nursing course.\n\nFollowing Zimbabwes independence in 1980, she began her post-war career in the Presidents Department,where she contributedto the 1981 Commission of Inquiry intomissing persons.\n\nOn July 1, 1984, she joined the Air Force of Zimbabweand rosethrough the ranksto become one of its most respected officers, eventually attaining the rank of Air Vice Marshala position equivalent to Major General in the Zimbabwe National Armybefore retiring.\n\nAVM Mandeyas death comes at a time when the country continues to witness the passing of numerous senior military and intelligence officialssome under circumstances that have sparked widespread speculation.\n\nSince the 2017 military coup that ousted long-time leader Robert Mugabe and elevated Emmerson Mnangagwa to the presidency with the support of the Zimbabwe Defence Forces, a string of high-profile deaths has cast a long shadow over the countrys security sector.\n\nAmong the most notable wasMajor General Trust Mugoba, who died in September 2019 shortly after being recalled from the African Union.\n\nHis death was followed weeks later by that ofLieutenant General Edzai Chimonyo, commander of the Zimbabwe National Army, who succumbed to cancer in July 2021.\n\nAlso on the list and yet to be eliminated is Lieutenant General Engelbert Rugeje, a key figure in the 2017 coup, who was quietly retired from the army and removed from the Zanu PF politburo, fading from public life before his reported health complications.\n\nSeveral generals also died within a short span, prompting whispers of a silent purge or targeted neglect of those once central to the post-coup power realignment.\n\nWhile some of the deaths have been attributed to natural causes such as cancer and COVID-19, critics argue the sheer frequency and political significance of the deceased point to deeper undercurrents of mistrust and rivalry within the military and political elite.\n\nIn this tense environment, the conferring of national heroine status on AVM Mandeya is seen not just as a celebration of her contributions to Zimbabwes liberation and post-independence statecraft, but also as part of a broader effort to maintain loyalty within the security establishment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda –The ruling Zanu PF party has conferred national heroine status on Retired Air Vice Marshal (AVM) Winnie Mandeya, marking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/first-female-airforce-general-declared-national-heroine/\">Continue reading<span class=\"screen-reader-text\"> \"First Female AirForce General Declared National Heroine\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "Blessed Geza Issues Urgent Announcement To Expose Fake Account",
            "url": "https://www.zimeye.net/2025/05/01/blessed-geza-issues-urgent-announcement-to-expose-fake-account/",
            "content": "1 May 2025  Harare\n\nAnti-corruption activist Comrade Blessed Geza has issued an urgent warning to the public, disowning a fraudulent Twitter account impersonating him and falsely announcing a public address scheduled for this evening.\n\nIn a post made just moments ago from his verified handle @BlessedGeza, Geza categorically denied having any scheduled appearance today and clarified that he operates no other social media accounts besides the one currently in use.\n\nPlease ignore this fake account. I dont have an address today. I dont have any other channel except this one, wrote Geza, alongside a screenshot of the impostor accounts post. The fake account, using the handle @blessedrgeza1, falsely announced a YouTube address set for 20:30hrs today, misleading thousands of followers. The post had already garnered over 13,000 views before Geza responded.\n\nThis incident comes amid heightened public interest in Gezas anti-corruption initiatives, which have earned him both national and international attention. His growing influence appears to have made him a target for impersonation and disinformation attempts.\n\nGezas team has not yet confirmed whether legal action will be taken, but the activists warning has reignited conversations around social media identity theft and online accountability in Zimbabwes political and civic discourse.\n\nCitizens are urged to verify information only from Gezas official channels and to report any suspicious accounts attempting to impersonate public figures.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "1 May 2025 – Harare Anti-corruption activist Comrade Blessed Geza has issued an urgent warning to the public, disowning a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/blessed-geza-issues-urgent-announcement-to-expose-fake-account/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza Issues Urgent Announcement To Expose Fake Account\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "Mnangagwa Administration Caught In Embarrassing Lie Over Victoria Falls Road Project",
            "url": "https://www.zimeye.net/2025/05/01/mnangagwa-administration-caught-in-embarrassing-lie-over-victoria-falls-road-project/",
            "content": "By Tinashe Sambiri\n\nIn an embarrassing about-face, Zimbabwes Ministry of Transport and Infrastructural Development has publicly retracted a false claim that road construction contractors were already on site for the much-anticipated Victoria Falls project. The Ministry has since admitted that the tender process is still underway and no contractors have been deployed.\n\nThe blunder, disseminated via the Ministrys official Twitter account on April 29 at 9:18 a.m., cited a state media report titled Victoria Falls contractors on site  a claim that turned out to be inaccurate. After facing swift backlash, the Ministry issued a formal apology and explanation, attributing the misinformation to a breach of internal protocol.\n\nIn its public statement, the Ministry wrote:\n\nThe Ministry of Transport and Infrastructural Development wishes to unreservedly apologise to members of the public and all its stakeholders for posting a twitter message containing wrong information on 29 April 2025 at 0918 Hours.\n\nThe Ministry explained that the false information had been posted without proper verification from technical officials:\n\nOne of the officers assigned the duty to manage the Ministrys twitter handle conceded and acknowledged that she breached the internal Standard Operating Procedures of information verification, the statement read.\n\nSetting the record straight, the Ministry clarified the actual status of the project:\n\nThe tender which was issued on 17 April 2025 closed on 29 April 2025 at 1100 Hours. After the closure of the bidding period, an evaluation committee will sit, whereupon the outcome will be sent to the Special Procurement Oversight Committee for oversight of the tender process before awarding the same to successful bidders.\n\nPermanent Secretary Eng. P.J. Makumbe, who signed off on the statement, reinforced the Ministrys commitment to accurate public communication:\n\nThe Ministry remains committed to the need for sharing correct information to members of the public.\n\nThe incident has reignited criticism of the governments infrastructure communication strategies, with observers raising concerns about professionalism and transparency within key departments.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri In an embarrassing about-face, Zimbabwe’s Ministry of Transport and Infrastructural Development has publicly retracted a false claim … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/mnangagwa-administration-caught-in-embarrassing-lie-over-victoria-falls-road-project/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Administration Caught In Embarrassing Lie Over Victoria Falls Road Project\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "Parents Threaten To Bewitch School Head Over Fees Hike",
            "url": "https://www.zimeye.net/2025/05/01/parents-threaten-to-bewitch-school-head-over-fees-hike/",
            "content": "By A Correspondent\n\nTensions are running high at Musenyereki Primary School in Zaka, Zimbabwe, over a fee hike and alleged maladministration.\n\nSchool teachers have spoken out about the situation, revealing a deep-seated conflict between the school head and parents.\n\nAccording to the teachers, the school head agreed to raise fees from $30 to $40 to cover additional costs such as a computer levy, security guard, and school feeding program.\n\nHowever, parents are unhappy with the lack of transparency regarding the computer levy.\n\nParents were furious that she kept unpaid learners in one class all day instead of sending them home, said one teacher.\n\nShe also allegedly failed to account for the computer levy at the AGM, angering parents.\n\nThe situation escalated when parents threatened the school head with witchcraft over the fee hike. In a leaked audio, a parent is heard ranting, Today, we couldnt drink marula brew or work in our fields because of you Dont push us to do what we shouldnt. Were coming, and youll answer to our goblins at night or leave, the parent warned.\n\nThe anonymous teachers expressed concerns about the school heads management style, saying she struggles with diplomacy in a rural setting. She cites statutes that parents dont understand, said one teacher. She needs to balance legal requirements with community understanding.\n\nAnother teacher revealed that the school heads approach has strained relations with teachers, who frequently transfer due to her management style. Teachers are involved in her clashes with parents, the teacher said. She runs the school like her personal shop, which frustrates teachers who collude with parents to oust her.\n\nOne parent called for the school heads transfer, arguing that the situation harms learners. She should humble herself and convince parents, not impose herself, the parent said. If she cant, she should transfer. Working where parents dont want you is challenging.\n\nThe school head was unavailable for comment, and the Zaka District Schools Inspector was not immediately available for a response.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tensions are running high at Musenyereki Primary School in Zaka, Zimbabwe, over a fee hike and alleged … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/parents-threaten-to-bewitch-school-head-over-fees-hike/\">Continue reading<span class=\"screen-reader-text\"> \"Parents Threaten To Bewitch School Head Over Fees Hike\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "Auxillia Mnangagwa Says I Am Not A Danger To Military Generals",
            "url": "https://www.zimeye.net/2025/05/01/auxillia-mnangagwa-says-i-am-not-a-danger-to-military-generals/",
            "content": "By Political Correspondent | ZimEye\n\nHARARE  First Lady Auxillia Mnangagwa has publicly denied accusations that she is a danger to the lives of military generals or that she orchestrated a military-style takeover to install her convicted armed robber brother as Chief Negomo in Chiweshe, saying she never took part in the ceremony and was merely sitting at the back row.\n\nDear General Valerio Sibanda, how do you assure the nation that youre not alive because youre a Mnangagwa 2030 sloganeerer, with all this video evidence of the presidents intention to end the lives of non-2030 sloganeers? Kindly answer the nation. Signed-Simba Chikanzapic.twitter.com/R3ocReZIUN\n\nThe denial comes amid growing evidence, including video footage and eyewitness accounts, suggesting otherwise.\n\nNo, no, no, I dont fight anyone. I actually expect you to call me when there is something that you need, Auxillia Mnangagwa told journalist Simba Chikanza in an exclusive recorded exchange. You used to phone me over the Negomo stories. And I didnt even go with those soldiers; I never didnt even; I was actually sitting at the back row, and I didnt even participate.\n\nEmmerson Mnangagwa and his just awarded hospitality-degree-holder wife, Auxillia is since 2021 assembling their own army of armed robbers to ward off [Vice President] Constantino Chiwengas military, this investigation reveals.This is a developing security nexus showing thepic.twitter.com/H5i5mARY7j\n\nThe allegations are explosive. Investigations by ZimEye reveal that President Emmerson Mnangagwa and his newly graduated wifewho was controversially awarded a PhD in Tourism and Hospitality by Midlands State Universityhave been assembling a parallel power structure since 2021, reportedly involving a network of former criminals and armed actors. The motive? To fortify themselves against Vice President Constantino Chiwengas military influence, which remains entrenched from the Mugabe era.\n\nThe moment Auxillia Mnangagwa descended onto Chiweshe to force her own brother, an armed robber (Paradzai Kutyauripo) as new Chief Negomopic.twitter.com/JtOlpxoQE9\n\nAt the center of the current firestorm is Paradzai Kutyauripo, a former armed robber turned state official, now controversially crowned as Chief Negomo. Kutyauripo, who previously served four years at Chikurubi Maximum Prison for armed robbery, was released early under a presidential amnesty signed by Mnangagwa when he was Justice Minister. He now also holds the post of Director of State Residences, placing him in one of the most sensitive security portfolios in government.\n\nIs the nation safe? asked Chikanza in the footage. This is just one armed robber. What about his large network of accomplices, partners in crime? Now, he takes over the post of Chief Negomo. He also has another post that Emmerson Mnangagwa has given himDirector of all State Residences across the country. What does this mean? Any armed robber in the future who is running away from the police will simply seek refuge inside the State House, and that will be the end of any investigation.\n\nDespite the First Ladys denials, multiple sources and video footage contradict her version of events. State media coverage shows her at the front row during the inauguration, not in the background as she claimed. One clip shows her addressing the gathered crowd with a microphone in hand. Other footage from the earlier military-led takeover depicts her arriving in a motorcade accompanied by soldiers, police, and Central Intelligence Organisation (CIO) officers.\n\nCommunity members say Auxillias entourage used intimidation tactics. Chief Negomos wife is seen crying on camera, alleging that Auxillias people attempted to seize her belongings.\n\nShe [Auxillia] is out of her depth on what is happening, said a relative of the chief. She declared to everyone, If you all dont want this to happen, I will take the pin myself and wear it.\n\nIn response to this, Auxillia spoke to Chikanza for over 35 minutes, assuring the nation that she was not behind the incident.\n\nThe revelations are part of a wider investigation into power struggles within Zimbabwes ruling elite. The Mnangagwa-Chiwenga rivalry has long simmered beneath the surface, but this new chapter introduces a third axis of powerAuxillia Mnangagwawielding influence without precedent for a First Lady.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Correspondent | ZimEye HARARE – First Lady Auxillia Mnangagwa has publicly denied accusations that she is a danger … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/auxillia-mnangagwa-says-i-am-not-a-danger-to-military-generals/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa Says I Am Not A Danger To Military Generals\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "No Relief For Suffering Workers As Mnangagwa Delivers Empty Rhetoric On May Day",
            "url": "https://www.zimeye.net/2025/05/01/no-relief-for-suffering-workers-as-mnangagwa-delivers-empty-rhetoric-on-may-day/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas Workers Day message has been widely criticized as hollow and lacking substance, with observers accusing him of offering platitudes instead of concrete action to address the worsening conditions faced by Zimbabwean workers.\n\nAs inflation continues to erode salaries and the cost of living soars, many had expected the president to outline clear policy steps to tackle issues such as low wages, job insecurity, and deteriorating working conditions in both the public and private sectors. Instead, his brief statement made no mention of any tangible plans or interventions by his administration.\n\nBelow is the full text of Mnangagwas statement, posted on social media:\n\n**As we commemorate Workers Day, let us remain inspired by our national development philosophy #NyikaInovakwaNeveneVayo. Zimbabwe reaffirms its commitment to safeguarding the welfare, rights, and dignity of workers. With these remarks, it is my pleasure and honour to wish you all  Zimbabweans at home and abroad  a happy Workers Day.\n\nThe message, which emphasized patriotism over policy, was met with swift backlash from labour unions and civil society groups. Critics argue it reflects a continued detachment from the daily struggles of workers who face stagnant wages, high unemployment, and a weakened social safety net.\n\nNo mention of salary reviews, pension reforms, or workplace protections  just empty slogans, said one union leader.\n\nMnangagwas administration has come under increasing pressure to respond to widespread discontent within the workforce, particularly in the health, education, and civil service sectors, where strikes and protests have become common in recent years.\n\nYet, on a day meant to honour workers, the presidents silence on key labour concerns has only deepened frustration.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s Workers’ Day message has been widely criticized as hollow and lacking substance, with observers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/no-relief-for-suffering-workers-as-mnangagwa-delivers-empty-rhetoric-on-may-day/\">Continue reading<span class=\"screen-reader-text\"> \"No Relief For Suffering Workers As Mnangagwa Delivers Empty Rhetoric On May Day\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        },
        {
            "title": "Teachers Refuse To Eat Cakes While Families Are Suffering",
            "url": "https://www.zimeye.net/2025/05/01/teachers-refuse-to-eat-cakes-while-families-are-suffering/",
            "content": "By A Correspondent\n\nThe Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has strongly rejected the government-led Workers Day celebrations held in Harare, accusing the Public Service Commission (PSC) of staging a symbolic event detached from the daily realities of suffering public sector employees.\n\nIn a statement issued on May 1, ARTUZ denounced the PSC-organized event  which took place at Allan Wilson High School in collaboration with the Zimbabwe Confederation of Public Sector Trade Unions (ZCPSTU)  as a tone-deaf spectacle orchestrated to mask the governments failure to address genuine labour grievances.\n\nDescribing the gathering as elitist and insincere, the union said:Good to see Employers sweetheart Unions and the boss opting for air conditioned boardrooms for May Day commemorations coffee. Celebrating selling out for a whole year should never be taken to crowds. Enjoy the closed door romance.\n\nThe PSC, in its promotional message ahead of the event, had framed the celebration as an inclusive occasion, stating:Be part of the May Day Commemorations at Allan Wilson High School in Harare where the Zimbabwe Confederation of Public Sector Trade Unions (ZCPSTU) and its affiliate Labor Unions in partnership with the PSC host public sector workers in Workers Day celebrations on 1 May 2025.\n\nHowever, ARTUZ maintained that the event failed to reflect the dire working conditions endured by teachers and other civil servants, particularly in rural areas, where poor pay, lack of resources, and deteriorating infrastructure remain unaddressed.\n\nBy distancing itself from what it called a romanticized celebration, ARTUZ underscored growing tensions between independent unions and government-aligned labour groups, with the former demanding authentic engagement and action on long-standing issues affecting public sector workers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has strongly rejected the government-led Workers’ Day celebrations held … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/01/teachers-refuse-to-eat-cakes-while-families-are-suffering/\">Continue reading<span class=\"screen-reader-text\"> \"Teachers Refuse To Eat Cakes While Families Are Suffering\"</span></a></p>",
            "time": "18:39",
            "date": "02 May 2025"
        }
    ]
}