{
    "news": [
        {
            "title": "Alarm As Mnangagwa Regime Announces Massive Betting Tax…",
            "url": "https://www.zimeye.net/2025/11/28/alarm-as-mnangagwa-regime-announces-massive-betting-tax/",
            "content": "Tinashe Sambiri Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has announced a dramatic and controversial hike in taxes on Zimbabwes rapidly growing betting and gambling sector, sparking alarm among operators and punters alike. The primary Bookmakers Tax will soar from 3 percent to a staggering 20 percent of gross revenues, effective January 1, 2026.\n\nThe industry has expanded rapidly, but this growth has brought with it severe social consequences, Minister Ncube told Parliament. Addiction, indebtedness, suicide and loss of productive hours have outpaced existing regulatory controls. Widespread profit-shifting and under-declaration of revenues mean the sector has been significantly under-taxed.\n\nIn a move critics describe as punitive, the withholding tax on individual winnings will more than double, climbing from 10 percent to 25 percent. This will hit everyday punters hard, raising fears that ordinary Zimbabweans who engage in legal betting could be squeezed further amid rising living costs.\n\nThe new 20 percent levy on operators gross revenues will be treated as a final tax, exempting companies from Corporate Income Tax. While Ncube framed the measure as necessary for fairness and regulatory alignment with global trendsciting the UKs 21 percent tax on remote gaming and New Zealands 12 percent offshore duty on online gamblingcritics argue it could cripple the industry.\n\nPunters and operators are already struggling under high costs and dwindling disposable incomes, said one industry analyst. A jump like this will push many out of the legal market, driving betting underground and reducing overall revenue, while punters bear the brunt.\n\nThe announcement comes as the betting sector has seen consistent annual growth of 8 to 10 percent from 2023 to 2024, making it one of Zimbabwes few booming industries. Many fear that the new tax measures, rather than curbing social ills, may instead stifle economic activity and push more gamblers into the unregulated informal market.\n\nThis policy is not just a tax; it is a hammer on an industry that provides employment and entertainment to thousands, the analyst added. The government risks punishing ordinary citizens while failing to effectively address the underlying social issues it claims to target.\n\nAs Zimbabwe prepares for the sweeping changes next year, operators and punters are left questioning whether the tax hike will achieve its intended goalsor simply deepen financial pressure on an already vulnerable population.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has announced a dramatic and controversial hike in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/alarm-as-mnangagwa-regime-announces-massive-betting-tax/\">Continue reading<span class=\"screen-reader-text\"> \"Alarm As Mnangagwa Regime Announces Massive Betting Tax…\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Just In: Grade Seven Examination Results Out",
            "url": "https://www.zimeye.net/2025/11/28/just-in-grade-seven-examination-results-out/",
            "content": "Tinashe Sambiri The Zimbabwe School Examinations Council (ZIMSEC) has officially released the 2025 Grade Seven examination results, marking an important moment for thousands of learners across the country.\n\nAccording to ZIMSEC, the results are now accessible to candidates and schools, allowing pupils, parents, and teachers to begin reviewing performance and preparing for the transition to secondary education.\n\nMore details on pass rates, performance trends, and regional statistics are expected to be shared by the examination body in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– The Zimbabwe School Examinations Council (ZIMSEC) has officially released the 2025 Grade Seven examination results, marking an important … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/just-in-grade-seven-examination-results-out/\">Continue reading<span class=\"screen-reader-text\"> \"Just In: Grade Seven Examination Results Out\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Former Zim-Brazil Envoy Dies",
            "url": "https://www.zimeye.net/2025/11/28/former-zim-brazil-envoy-dies/",
            "content": "By A Correspondent  Former Zimbabwe Ambassodor to Brazil  and one of President Robert Mugabes first press officers and war veteran, Ambassador Thomas Bvuma, has died.\n\nBorn and raised in Manicaland, Ambassador Bvuma attended St Augustines School in Penhalonga before enrolling at the then University of Rhodesia.\n\nIn 1976, during his second year of study, he left the country to join the liberation struggle, crossing into Mozambique and arriving at Doroi Refugee Camp.\n\nHe later moved to Chimoio Military Base for politico-military training and was selected for advanced ideological instruction at the Chitepo Ideological College.\n\nAs the Second Chimurenga intensified, ZANU leaders identified him as part of the group that would be educated for post-independence national reconstruction.\n\nIn 1977, he was sent to Eduardo Mondlane University in Maputo to continue his studies.\n\nFollowing Independence in 1980, Bvuma was appointed to the Office of the President and Cabinet as Chief Press Officer, becoming one of Mugabes first official press officers during the formative years of the new government.\n\nHe later joined the Ministry of Foreign Affairs and International Trade.\n\nAmbassador Bvuma went on to serve as Zimbabwes representative to Brazil, where he played a key diplomatic role during the period of Western-imposed sanctions following the land reform programme.\n\nHis work helped secure the More Food for Africa programme, a cooperation deal through which Brazil supplied agricultural equipment to Zimbabwe, helping boost productivity amid economic pressure.\n\nHe later served as Vice-Chairman of the Zimbabwe Broadcasting Corporation, his final public appointment.\n\nBeyond government service, Ambassador Bvuma was also a published writer and one of the few liberation fighters to document the struggle from an insiders viewpoint.\n\nLast year, the Institute of African Knowledge/Museum of African Liberation launched his historical bookThe Chosen Generation, adding to his earlier poetry collectionThe Tale That Turns.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —  Former Zimbabwe Ambassodor to Brazil and one of President Robert Mugabe’s first press officers and war … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/former-zim-brazil-envoy-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Former Zim-Brazil Envoy Dies\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Tasila Lungu Removed From Parliament; ECZ To Call By-Election",
            "url": "https://www.zimeye.net/2025/11/28/tasila-lungu-removed-from-parliament-ecz-to-call-by-election/",
            "content": "Speaker Declares Chawama Seat Vacant  Tasila Lungu Removed From Parliament; ECZ To Call By-Election\n\nBy A Correspondent | LUSAKA  In a dramatic and emotionally charged development, Speaker of the National Assembly Nelly Mutti has declared the Chawama parliamentary seat vacant, effectively removing Tasila Lungu  daughter of the late former President Edgar Chagwa Lungu  from Parliament after months of absence.\n\nThe announcement follows months of parliamentary debate and heightened public attention, with the Speaker overruling earlier committee recommendations that Tasila be allowed to continue attending sessions via remote video conferencing while her leave was extended due to bereavement.\n\nMutti has now officially referred the resolution to the Electoral Commission of Zambia (ECZ), mandating the preparation of a Chawama by-election.\n\nThe Legal Trigger: Article 72 of the Constitution\n\nThe ruling pivots on Article 72 of the Zambian Constitution (2016 amendment), which outlines conditions under which an MPs seat may become vacant  including prolonged absenteeism from parliamentary duties.\n\nIn July 2025, Speaker Mutti ruled that Tasila was required to appear in Parliament within 14 days of her fathers burial or 14 days from the start of the next session, whichever was later. This instruction was issued after a point of order by MP Brian Kambita.\n\nTasila did not return to legislative duties within the stipulated timeframe.\n\nPublic Reaction: Divided, Emotional, Polarized\n\nThe ruling ignited a storm of reactions across Zambia: Sympathy & grief argument: Supporters of the Lungu family call the decision inhuman and unAfrican, insisting cultural and emotional respect for a daughter mourning her father should override parliamentary protocols. Rule-of-law & accountability argument: Others argue that an MP cannot indefinitely withdraw from duties while still drawing public salary  stressing that the people of Chawama need active representation on the ground. Neutral legalists: A number of voices emphasize: Is it constitutional? If so  then let the law take its course.\n\nPolitical Stakes: Opposition Unity Tested\n\nSome citizens now see the by-election as a litmus test for the maturity of Zambias opposition: Whether PF and allied parties can rally behind a single candidate. Whether internal rivalries will fracture the vote. Whether the Chawama electorate will treat the result as a referendum on grief versus governance, tradition versus law.\n\nWhat Comes Next\n\nThe ECZ is now obligated to issue:1. Formal election timeline2. Nomination process3. Campaign schedule4. Polling date\n\nTasila Lungu still retains the right to: Contest the by-election herself Support a surrogate candidate Challenge the ruling in court\n\nA Moment That Defines Governance\n\nWhile emotions are running high, a foundational principle of statehood is being tested:Is Parliament governed by sentiment  or by the constitution?\n\nTodays decision in Lusaka will likely echo through Zambian politics for years  shaping how the nation balances culture, compassion, and constitutional order.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Speaker Declares Chawama Seat Vacant — Tasila Lungu Removed From Parliament; ECZ To Call By-Election By A Correspondent | LUSAKA … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/tasila-lungu-removed-from-parliament-ecz-to-call-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Tasila Lungu Removed From Parliament; ECZ To Call By-Election\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Why’s Chamisa the Only One Who Never Gets Duped by Josey Mahachi, Govt Blows 10 years Engaging the Magaya-Activist for Endless Dangote Trips?",
            "url": "https://www.zimeye.net/2025/11/28/whys-chamisa-the-only-one-who-never-gets-duped-by-josey-mahachi-govt-blows-10-years-engaging-the-magaya-activist-for-endless-dangote-trips/",
            "content": "loading below\n\nWhys Chamisa the only one who never gets duped by Josey Mahachi, Govt spends 10 years engaging the Magaya-activist for endless Dangote trips?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "loading below…",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Strict Rules At Mwazha’s Sunday Burial",
            "url": "https://www.zimeye.net/2025/11/28/strict-rules-at-mwazhas-sunday-burial/",
            "content": "By A Correspondent The family of the late African Apostolic Church founder, Archbishop Paul Mwazha, has confirmed that his burial will be conducted under strict religious protocols, in accordance with church doctrine and long-standing family traditions.\n\nArchbishop Mwazha, who died on 20 November 2025 at the age of 107, will be laid to rest in Chirasauta, Chikomba District, Mashonaland East Province.\n\nIn a statement, the Ministry of Home Affairs and Cultural Heritage said the burial will be strictly overseen by close family members and the church, following a formal request by the Mwazha family.\n\nAccording to the programme, Mwazhas remains will be collected from Nyaradzo Funeral Parlour and taken to the family home in Hatfield, where they will lie in state on Friday, 28 November 2025. A church service will be held from 7 pm to 10 pm.\n\nOn Saturday, 29 November, the body will be airlifted to Guvambwa for an all-night body viewing from 4 pm until 6 am. On Sunday, 30 November, it will be flown to Chirasauta Business Centre for final burial rites, scheduled between 9 am and midday.\n\nThe Ministry urged congregants and the general public to respect the strict religious guidelines governing the proceedings.\n\nThousands of followers are expected to gather in Chirasauta on Sunday for the burial, which comes after the family firmly rejected government plans to inter the revered cleric at the National Heroes Acre.\n\nThe decision has stirred national debate, particularly because the ZANU PF-led government had moved swiftly to take charge of the funeral after President Emmerson Mnangagwa conferred national hero status on Mwazha. For decades, the ruling party has used state-assisted burials at the national shrine to assert political authority and symbolically claim influential national figures.\n\nMwazhas family instead insisted on a private, church-centred burial  a rare but decisive departure that interrupts ZANU PFs long-standing practice of leveraging high-profile funerals for political gain. State funerals have often been used to consolidate loyalty, rehabilitate political narratives, or commandeer the legacy of prominent public figures.\n\nIn the months leading up to his death, the political courting of Mwazha had intensified. Senior ZANU PF officials frequently visited him ahead of key political events, and he recently received a luxury vehicle and cash gifts from businessman and convicted fraudster Wicknell Chivayo  one of the ruling partys most visible benefactors. The gestures fuelled public speculation that Mwazhas vast spiritual following was being targeted for political mobilisation.\n\nFamily spokesperson Dr Masimba Mwazha reiterated that the burial would proceed strictly in line with church and family protocols.\n\nThe body of the national hero will leave Harare on Saturday for Chikomba District, where everyone will be gathered. The body will depart for Chirasauta on Sunday for burial at a private function, he said.\n\nArchbishop Mwazha was immediately declared a national hero following his death, with Mnangagwa praising his spiritual leadership and contribution to the growth of African Independent Churches. ZANU PF National Chairperson Oppah Muchinguri-Kashiri, accompanied by CIO Minister Lovemore Matuke, visited the family home in Hatfield to deliver the Presidents condolence message.\n\nBorn on 25 October 1918 at Holy Cross Mission in Chirumanzu, Mwazha became one of the most influential leaders in African Independent Churches, grounded in accounts of divine encounters and a lifelong commitment to spiritual renewal.\n\nHis burial outside Heroes Acre stands as a firm assertion of family and church autonomy  a quiet but unmistakable rebuke of efforts to turn his passing into a political spectacle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The family of the late African Apostolic Church founder, Archbishop Paul Mwazha, has confirmed that his burial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/strict-rules-at-mwazhas-sunday-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Strict Rules At Mwazha’s Sunday Burial\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Chinhoyi Young Graduate Dies Of Cancer",
            "url": "https://www.zimeye.net/2025/11/28/chinhoyi-young-graduate-dies-of-cancer/",
            "content": "CHINHOYI YOUNG GRADUATE DIES OF CANCER\n\nBy Dorrothy Moyo | A cloud of grief has descended over Chinhoyi following the tragic passing of young graduate Sylvia Guchu, who lost her battle with stomach cancer. Her death has sparked an outpouring of emotion across social media, where friends, family, and community members mourn a bright life cut heartbreakingly short.\n\nTributes began circulating from loved ones, with many expressing disbelief and sadness. One of the closest to her, Bridgette Nyimboo Guchu, confirmed the cause of death in a comment, revealing that Sylvia had suffered from stomach cancer  a revelation that stunned many who had not known she was ill.\n\nPhotos shared online show Sylvia in full graduation attire, smiling proudly, holding her certificate  now symbolizing both her achievement and the devastating brevity of her journey.\n\nSympathy messages have flooded community pages and timeline posts: May her soul rest in perfect peace. Nematambudziko mhuri. Ko akanga achirwara here nhai? We are all so concerned, please tell us what happened.\n\nHer passing has triggered both mourning and reflection among peers, many of whom describe Sylvia as joyful, ambitious, and deeply loved.\n\nAs the community awaits funeral details, the Guchu family continues to receive messages of support and condolences from across Zimbabwe and the diaspora.\n\nMay her soul rest in eternal peace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "CHINHOYI YOUNG GRADUATE DIES OF CANCER By Dorrothy Moyo | A cloud of grief has descended over Chinhoyi following the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/chinhoyi-young-graduate-dies-of-cancer/\">Continue reading<span class=\"screen-reader-text\"> \"Chinhoyi Young Graduate Dies Of Cancer\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Mthuli’s 2026 Budget Ignores 22 Years Of Economic Fundamentals",
            "url": "https://www.zimeye.net/2025/11/28/mthulis-2026-budget-ignores-22-years-of-economic-fundamentals/",
            "content": "By Business Reporter-Finance Minister Mthuli Ncube on Thursday presented the 2026 National Budget, which reads like an elaborate attempt to project stability while avoiding the core structural collapse that has haunted the economy since 2003.\n\nBeneath the polished rhetoric of macroeconomic stability, fiscal consolidation, and Vision 2030, the Budget exposes a government still unwilling to confront the fundamental truth: Zimbabwe cannot rebuild its economy without first restoring confidence in the currency, re-establishing credible institutions, and abandoning the failed fantasy of a stable local currency in a dualised economy. For 22 years, successive governments have recycled the same promisesstability is coming, inflation is under control, reforms are underway. Yet real incomes continue collapsing, industry remains marginal, the informal sector dominates economic activity, and public confidence in the financial system is virtually non-existent. The 2026 Budget continues this tradition of denial, showcasing numbers that look impressive on paper but collapse under scrutiny.\n\nMinister Ncube celebrates alleged economic recovery: a projected 6.6% growth in 2025, declining inflation, a current account surplus, and strong diaspora inflows. But these headline indicators conceal deeper structural failures that have persisted since 2003. The introduction of the ZiG in April 2024 is hailed by the Minister as a milestone that restored stability, yet its performance only mimics temporary administrative control rather than market confidence. Inflation figures given in the BudgetZiG annual inflation at 32.7% in October 2025reflect a currency that is failing to store value, even under tight monetary suppression. The claim that inflation will fall to single digits in 2026 is purely aspirational. It ignores the underlying drivers of recurring hyperinflation cycles: lack of fiscal transparency, quasi-fiscal activities in the shadows of the state, uncontrolled money creation, weak central bank independence, persistent exchange rate distortions and public mistrust following repeated currency demolitions. Without addressing these, the ZiG is not a reformit is merely another temporary currency experiment.\n\nThe Budgets growth claims also misread the economy. The government celebrates 8.1% first-half growth and a 6.6% projection for 2025, mainly driven by agriculture, but Zimbabwe has repeatedly mistaken rainfall-driven agricultural upticks for structural growth. Manufacturing capacity utilisation remains low, industry relies heavily on imports, power shortages persist despite token allocations to the energy sector, mining growth is tied to global commodity cycles rather than domestic reform, and job creation remains stagnant with youth underemployment still cripplingly high. The Budgets numbers paint a recovery that the real economy does not feel.\n\nAt the heart of the crisis is a simple, politically uncomfortable fact: Zimbabwes economy functions de facto as a dollar economy. Eighty percent of meaningful transactions are priced, saved, or settled in dollars. Salaries, taxes and key government expenditures increasingly require hard currency. Businesses refuse to price long-term contracts in ZiG because the currency cannot reliably store value. Yet the Minister persists in positioning the ZiG as the anchor of macroeconomic stability. This refusal to accept full dollarisation as the foundation for credible reform is the single most damaging policy stance the government continues to take. Dollarisation is not a political choice but an economic reality forced by market behaviour; denying it ensures policy dissonance and recurring crises.\n\nPublic debt, listed at US$23.4 billion or 44.7% of GDP, is a major red flag. That number likely understates the true fiscal obligations when quasi-fiscal central bank liabilities, state enterprise guarantees and other off-budget commitments are considered. The Budget offers no convincing roadmap for comprehensive debt transparency, restructuring or sustainable arrears clearance. Government projects a near-balanced budget but Zimbabwe has balanced budgets before only to later reveal arrears, off-budget borrowing and quasi-fiscal spending. A balanced budget is meaningless without credible transparency, independent audits and binding commitments to stop the fiscal slippage that has repeatedly stolen gains from ordinary citizens.\n\nSocial services get headline numbers that crumble under inspection. Health receives ZiG30.4 billion, but hospitals lack drugs, equipment and staff retention measures. Education is allocated ZiG47.4 billion, yet teacher vacancies, dilapidated infrastructure and the cost of supplies continue to squeeze quality. The energy allocation of ZiG330.3 million is negligible compared to the scale of the sectors shortfall and will not resolve the chronic power constraints throttling the industry. Meanwhile, security spending receives ZiG46.8 billionalmost equal to the health allocationhighlighting the persistent distortion in public spending that favours coercive apparatus over human development.\n\nThe Budgets revenue measurestax tweaks, IMTT reductions, VAT adjustments, incentives for BPOs and liberalisation of gold tradingare important but insufficient. They treat symptoms without curing the disease. Enhanced VAT, revised royalties and digitisation of tax collection can only do so much in an environment where investors and citizens lack confidence in the rule of law, property rights, and policy predictability. The governments ease-of-doing-business reforms may help administrative costs, but they cannot substitute for credible, long-term macroeconomic anchors.\n\nHistory offers a clear lesson: the last period of relative stability occurred under widespread use of foreign currency. Between 2009 and 2013, when the Zimbabwe dollar was effectively abandoned and the economy transacted in foreign currency, inflation collapsed, industry reopened, savings returned, and investor confidence improved. Subsequent attempts to reintroduce a local currency without the necessary institutional reforms destroyed those gains. The 2026 Budget alludes to macroeconomic stability but does not confront the political and institutional costs of sustaining a currency that markets reject. The only realistic, immediate policy that would restore price stability, unlock saving, and make fiscal planning credible is a legal, durable, and transparent multi-currency regime anchored in the US dollar (or a basket of hard currencies) that is protected from politicised interventions for a long, specified period.\n\nImplementing full dollarisation would require hard choices: restore central bank independence, stop quasi-fiscal operations, create transparent debt restructuring plans, legislate protections for foreign-currency accounts, and restore confidence in property rights and contracts. It would also require complementary measures to promote export competitiveness, stimulate job-creating investment in manufacturing and agribusiness, and rebuild a functioning banking sector capable of intermediary services rather than serving as a fiscal backstop to the state.\n\nThe 2026 Budget is a polished document grounded in optimism but divorced from Zimbabwes economic reality. It recycles the same promises made since 2003 while ignoring the structural cracks beneath the surface. Without full dollarisation and deep institutional reforms, the stability Ncube celebrates is temporaryand Zimbabwe will once again slide back into crisis. This Budget is not a roadmap to Vision 2030; it is a sophisticated exercise in economic denial.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-Finance Minister Mthuli Ncube on Thursday presented the 2026 National Budget, which reads like an elaborate attempt to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/mthulis-2026-budget-ignores-22-years-of-economic-fundamentals/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli’s 2026 Budget Ignores 22 Years Of Economic Fundamentals\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "President Chamisa Mourns Chimhamha",
            "url": "https://www.zimeye.net/2025/11/28/president-chamisa-mourns-chimhamha/",
            "content": "By A Correspondent The Peoples President Nelson Chamisa has mourned the passing of popular socialite Tabeth Mukai Makombe, widely known as Chimhamha.\n\nChimhamha died peacefully at home on 22 November 2025, surrounded by her loved ones. Her family issued a public statement earlier this week confirming her passing and bringing closure to uncertainty over the last 48 hours.\n\nIn their message, they said their beloved mother has been called home to be with our Heavenly Father, describing her as a deeply cherished presence in their lives.\n\nIn a heartfelt statement, Chamisa paid tribute to Chimhamha, recalling a meaningful conversation they once shared:\n\nI am saddened by the passing of Chimhamha. Though I never met her in person, I followed her work on social media and had the opportunity to speak with her once through our Citizens Engagement programme, coordinated by our Citizens Desk. I always cherish a convivial and respectful conversation, no matter how different we think. I celebrate diversity of opinions.\n\nChamisa said Chimhamha had expressed how her views on the countrys direction had evolved, and he admired her courage in reassessing her stance as a citizen:\n\nShe shared how her perspective had changed, and I came to respect her disposition and choice as a citizen. She reminded us that true transformation is not the work of officeholders alone, but of engaged citizens who challenge the status quo and help build the much-needed  and soon-coming  Citizen Government.\n\nChamisa ended his message with a hopeful reflection on Zimbabwes future:\n\nZimbabwe shall be a land of freedom and prosperity. Rest in power, Citizen Champion.\n\nChimhamhas death has sparked an outpouring of condolences across social media, where she was known for her outspoken views, vibrant personality, and evolving political positions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —The People’s President Nelson Chamisa has mourned the passing of popular socialite Tabeth Mukai Makombe, widely known … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/president-chamisa-mourns-chimhamha/\">Continue reading<span class=\"screen-reader-text\"> \"President Chamisa Mourns Chimhamha\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        },
        {
            "title": "Shocking Twists in Mwazha Burial Saga",
            "url": "https://www.zimeye.net/2025/11/28/shocking-twists-in-mwazha-burial-saga/",
            "content": "By A Correspondent The burial of African Apostolic Church founder Archbishop Paul Mwazha has taken an unexpected turn, with the family enforcing strict religious protocols and firmly rejecting government attempts to turn the funeral into a political spectacle.\n\nArchbishop Mwazha, the revered leader of the African Apostolic Church (VaApostora veAfrica), died on 20 November 2025 at the age of 107. Though President Emmerson Mnangagwa immediately declared him a national hero, the family has instead chosen a private, church-led burial  a dramatic move that has unsettled ZANU PFs long-standing tradition of hijacking high-profile funerals for political gain.\n\nIn a statement, the Ministry of Home Affairs and Cultural Heritage confirmed that the burial will proceed strictly under the familys control and in accordance with the churchs spiritual protocols. His remains will be collected from Nyaradzo Funeral Parlour before being taken to the family home in Hatfield, where they will lie in state on Friday, 28 November. A church service will run from 7 pm to 10 pm.\n\nOn Saturday, 29 November, Mwazhas body will be airlifted to Guvambwa for an all-night body viewing, before being flown on Sunday to Chirasauta Business Centre in Chikomba District, Mashonaland East  his final resting place. Burial proceedings will take place from 9 am to midday.\n\nThousands of congregants are expected to gather in Chirasauta this Sunday, following the familys emphatic refusal to have Mwazha buried at the National Heroes Acre. This move interrupted a coordinated push by ZANU PF to claim ownership of the clerics legacy. The party has long used state-assisted funerals to reinforce loyalty, control political narratives, and embed itself into national memory through symbolic gestures of hero status.\n\nMwazhas funeral became even more politically charged after senior ZANU PF members intensified their courtship of the Archbishop in recent months. Speculation grew when Mwazha received a luxury vehicle and cash from businessman and convicted fraudster Wicknell Chivayo  widely viewed as a key financier of the ruling party. The gifts fuelled widespread belief that Mwazhas spiritual influence was being weaponised ahead of political milestones.\n\nBut in a stunning twist, the family drew a hard line. Family spokesperson Dr. Masimba Mwazha reinforced their stance:\n\nThe body of the national hero will leave Harare on Saturday for Chikomba District, where everyone will be gathered. The body will depart for Chirasauta on Sunday for burial at a private function.\n\nTheir decision has been interpreted as a quiet but powerful act of resistance  a refusal to let Mwazhas passing be repurposed for political optics.\n\nDespite the pushback, ZANU PF maintained its narrative. National Chairperson Oppah Muchinguri-Kashiri, accompanied by CIO Minister Lovemore Matuke, visited the family home to deliver Mnangagwas condolence message, praising Mwazha for his role in promoting peace during and after the liberation struggle.\n\nBorn on 25 October 1918 at Holy Cross Mission in Chirumanzu, Mwazha rose to become one of the most influential figures in African Independent Churches, his ministry defined by claims of divine encounters and a loyal following that grew into the millions.\n\nYet the final chapter of his life has revealed deep tensions between church autonomy, family wishes, and political opportunism.\n\nMwazhas burial outside the National Heroes Acre is more than a logistical decision  it is a symbolic break from ZANU PFs attempts to appropriate his legacy, marking a profound and unexpected twist in a saga where faith, power and politics collide.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —The burial of African Apostolic Church founder Archbishop Paul Mwazha has taken an unexpected turn, with the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/28/shocking-twists-in-mwazha-burial-saga/\">Continue reading<span class=\"screen-reader-text\"> \"Shocking Twists in Mwazha Burial Saga\"</span></a></p>",
            "time": "21:28",
            "date": "28 Nov 2025"
        }
    ]
}