{
    "news": [
        {
            "title": "Top Yester-year Musician Dies",
            "url": "https://www.zimeye.net/2025/06/29/yester-year-musician-dies/",
            "content": "ByShowbiz Reporter-Veteran bassist Clancy Mbirimi has  died.\n\nThe news of Mbirimis death was first announced on socil media by famous music producer Clive Mono Mukundu.\n\nHis death is a painful loss to the countrys cultural landscape and a stark reminder of how quickly our musical giants are disappearing.\n\nMbirimi was one of Zimbabwes longest-serving and most respected musicians, known for his calm demeanour, deep musical knowledge, and unmatched command of the bass guitar.\n\nA stalwart of the golden era of Zimbabwean music, Mbirimis career spanned decades, during which he played in and collaborated with several iconic bands, including the legendaryHarare Mambos.\n\nFormed in the early 1970s, the Harare Mambos were one of the most influential bands of post-independence Zimbabwe, renowned for their jazz-infused Afro-pop sound and crisp arrangements.\n\nLed by the charismatic vocalist and guitarist Green Jangano, the groups music became a fixture on local radio and in live venues across the country.\n\nClancy Mbirimis melodic and rhythmic basslines were central to the groups sound, giving groove and depth to timeless songs that blended township jazz, rhumba, and traditional Zimbabwean sounds.\n\nMbirimi also had a long-standing musical relationship with Steve Dhongi Makoni, one of Zimbabwes most loved musical humorists and acoustic storytellers.\n\nTheir collaboration went beyond stage performances, Mbirimi provided musical direction and bass accompaniment for many of Makonis performances and studio recordings.\n\nTheir synergy was a joy to behold, with Clancys musical sensitivity perfectly complementing Steves sharp wit and lyrical prowess.\n\nAside from performing, Mbirimi was also a music producer who worked with various record labels, contributing to the growth and development of emerging Zimbabwean talent. He played a behind-the-scenes but pivotal role in the careers of many musicians.\n\nMono Mukundu posted: In my book,Following the Melody, I recount on page 145 how Clancy was the first to notice my production potential.\n\nHe encouraged veteran producer Elias Msakwa to consider me for a role as a music produceran opportunity that proved to be a turning point in my life. I owe him a great deal.\n\nWe also collaborated on several music projects over the years, and in 1999, Clancy and I were part of theRevival Ministries Praise and Worship Team, where his basslines once again anchored soulful worship sessions that moved congregations deeply.\n\nClancy Mbirimis death is more than the passing of a musicianit is the burning down of a wealthy library of Zimbabwean musical memory and knowledge. He was a gentle giant whose quiet contributions helped shape the sound of generations.\n\nMay his soul rest in eternal peace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Veteran bassist Clancy Mbirimi has died. The news of Mbirimi’s death was first announced on socil media by famous … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/yester-year-musician-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Yester-year Musician Dies\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "JUST IN: Mutsvangwa Camp Suffers Crushing Defeat in Manicaland",
            "url": "https://www.zimeye.net/2025/06/29/just-in-mutsvangwa-camp-suffers-crushing-defeat-in-manicaland/",
            "content": "ByA CorrespondentZanu PF spokesperson Christopher Mutsvangwa and his wife, Womens Affairs Minister Monica Mutsvangwa, have suffered a significant political setback after their preferred candidate, Mercy Sacco, lost for the second time in the race for the Manicaland Womens League chair.\n\nDorothy Mabika, backed by Womens League boss Mabel Chinomona, secured a decisive victory in the rerun held in Mutare on Sunday, garnering 23 votes against Saccos 16. The result has been hailed as a win for Chinomonas faction and a major blow to the Mutsvangwasparticularly Monica, who had personally lobbied for Saccos candidacy.\n\nZanu PF National Political Commissar Munyaradzi Machacha, who presided over the election, declared it peaceful and successful, with the outcome now awaiting Politburo endorsement. Mabika pledged to work for unity and womens empowerment, while observers noted her triumph was also symbolic of deeper shifts in party power dynamics.\n\nThe election was a repeat of the April 6 vote, which had already seen Mabika trounce Sacco in a reported 291 landslide. That outcome was later nullified under pressure from the Mutsvangwa-aligned camp, triggering Sundays rerun. Despite these efforts, Mabika prevailed againthis time under stricter party oversight.\n\nA confirmation memo from Chinomonacopied to top officials including Secretary-General Obert Mpofu and the defeated Saccohas since formalised Mabikas appointment as the substantive chairwoman for the province.\n\nThis double loss underscores the waning influence of the Mutsvangwas in Manicaland, a province once considered one of their key strongholds. Also hit hard by the defeat is Zanu PFs legal affairs secretary and Mutsvangwa ally,Patrick Chinamasa, who had reportedly backed Sacco behind the scenes.\n\nReacting to the initial outcome, Christopher Mutsvangwa launched an attack on Information Minister Jenfan Muswere, accusing him of announcing Mabikas initial win prematurely and violating party protocol. In a furious letter, then, Mutsvangwa complained that only his office had the authority to speak for the partyexposing his desperation to control the narrative.\n\nBut insiders say the outrage masked a more personal defeat: a collapse of the Mutsvangwa factions grip in a critical province ahead of Zanu PFs next elective congress. This is less about procedure and more about the politics of survival, a senior party official said. The Mutsvangwas have been outmaneuvered.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent –Zanu PF spokesperson Christopher Mutsvangwa and his wife, Women’s Affairs Minister Monica Mutsvangwa, have suffered a significant political setback … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/just-in-mutsvangwa-camp-suffers-crushing-defeat-in-manicaland/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Mutsvangwa Camp Suffers Crushing Defeat in Manicaland\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "Sad: FC Platinum Star Midfielder Dies In Tragic Accident",
            "url": "https://www.zimeye.net/2025/06/29/sad-fc-platinum-star-midfielder-dies-in-tragic-accident/",
            "content": "Sports Correspondent\n\nThe Zimbabwean football community is in mourning following the heartbreaking news that FC Platinums star midfielder, Brian Banda, has died in a tragic road accident.\n\nAccording to a statement released by the club on Sunday, Banda passed away on the morning of June 29, 2025, after sustaining fatal injuries in a car crash along the Zvishavane-Bulawayo road.\n\nWe are deeply saddened to share the news of Brian Bandas passing, which occurred today, June 29, 2025, in a car accident on the Zvishavane-Bulawayo road,read part of the statement.\n\nThe club confirmed that Banda tragically lost his life at the scene of the accident.\n\nGo well Brian Banda. FC Platinum has lost not only a talented athlete but also a beloved teammate and friend,the statement continued.\n\nKnown for his exceptional skill and unwavering commitment to the game, Bandas death leaves a massive void both in the dressing room and on the field.\n\nBrians dedication to the sport and his infectious enthusiasm both on and off the field left an indelible mark on all who knew him. His contributions to the team were invaluable, and his spirit will continue to inspire us,FC Platinum added.\n\nThe club has requested that the public and media respect the privacy of Bandas family during this painful period.\n\nWe kindly request that everyone respects his familys privacy during this difficult time as they grieve.\n\nIn their message of condolence, the club urged fans and the football fraternity to honour Bandas memory by reflecting on the joy he brought to many through his love for the game.\n\nIn these challenging moments, let us remember the joy and passion Brian brought into our lives. We extend our heartfelt condolences to his family, friends, and all who held him dear. May his legacy live on in the hearts of those he touched, and may his memory be a source of comfort and strength.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwean football community is in mourning following the heartbreaking news that FC Platinum’s star midfielder, Brian Banda, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/sad-fc-platinum-star-midfielder-dies-in-tragic-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Sad: FC Platinum Star Midfielder Dies In Tragic Accident\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "PSL: Ngezi Platinum FC Thrash Kwekwe United",
            "url": "https://www.zimeye.net/2025/06/29/psl-ngezi-platinum-fc-thrash-kwekwe-united/",
            "content": "Sports Correspondent\n\nSimba Bhora extended their lead at the top of the Castle Lager Premier Soccer League standings to two points following a 1-1 draw with FC Platinum on Matchday 18 at Mandava Stadium on Saturday.\n\nThe hosts, FC Platinum, opened the scoring in the 72nd minute through Thando Ngwenya, but Simba Bhora equalized just eight minutes later via Isheanesu Mauchi. The result took Simba Bhora to 36 points, while FC Platinum, though still unbeaten this season, remained in sixth position.\n\nMeanwhile, at Baobab Stadium, Ngezi Platinum registered a dominant 5-2 victory over Kwekwe United in a high-scoring encounter.\n\nQadr Amini opened the scoring with a penalty in the 40th minute, sparking a lengthy stoppage as Kwekwe United protested the decision. Amini struck again two minutes later to complete his brace, and Obriel Chirinda added a third in the 45th minute, giving Ngezi a commanding 3-0 halftime lead.\n\nAshwin Karengesha made it 4-0 early in the second half, but Kwekwe United responded with a quick brace from Genesis Munashe around the hour mark, narrowing the gap. However, Chirinda sealed the victory and completed his own brace with a goal in the 80th minute.\n\nIn other matches, ZPC Kariba and Dynamos played to a goalless draw, as did TelOne and Herentals. Yadah edged Manica Diamonds 1-0, while Bikita Minerals defeated Chicken Inn by the same margin.\n\nResults:ZPC Kariba 0-0 DynamosFC Platinum 1-1 Simba BhoraNgezi Platinum 5-2 Kwekwe UnitedTelOne 0-0 HerentalsYadah 1-0 Manica DiamondsBikita Minerals 1-0 Chicken Inn\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Simba Bhora extended their lead at the top of the Castle Lager Premier Soccer League standings to two … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/psl-ngezi-platinum-fc-thrash-kwekwe-united/\">Continue reading<span class=\"screen-reader-text\"> \"PSL: Ngezi Platinum FC Thrash Kwekwe United\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "Cash For Loyalty ?Mnangagwa’s US$200K Vendor Payout Sparks Outrage",
            "url": "https://www.zimeye.net/2025/06/29/cash-for-loyalty-mnangagwas-us200k-vendor-payout-sparks-outrage/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas government is under fire after doling out US$200,000 to informal traders across Zimbabwe in what critics describe as a shameless attempt to buy political support under the guise of economic empowerment.\n\nThe funds, distributed through the so-called Presidential Vendors Empowerment Scheme, were announced by the pro-ZANU PF social media outlet Varakashi4ED. According to the group, the initiative spans all 10 provinces and is meant to support small traders.\n\nThis milestone will boost informal businesses, drive economic growth, and empower vendors to build a brighter future for their families and communities, read a post from Varakashi4ED.\n\nBut observers and analysts are not buying it.\n\nThis is clearly a political stunt, said a political analyst based in Bulawayo. You dont address years of neglect with a sudden cash splash unless your true motive is votes, not empowerment.\n\nMany citizens see the timing of the payoutmonths before anticipated electionsas suspect. With the informal sector long ignored in budget allocations, the abrupt handout has left many questioning whether the funds serve the people or the ruling partys survival.\n\nTheyve ignored us all along, said a vendor in Chitungwiza. Now that elections are near, they show up with money? Its not about us, its about their power.\n\nCritics argue that real support would involve legal recognition, access to credit, market infrastructure, and protection from police harassmentnot sporadic, pre-election windfalls.\n\nWhile the US$200,000 may bring short-term relief to some traders, it has reignited accusations that Mnangagwas administration is using state resources to secure political loyalty, rather than developing lasting solutions for Zimbabwes economic woes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s government is under fire after doling out US$200,000 to informal traders across Zimbabwe in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/cash-for-loyalty-mnangagwas-us200k-vendor-payout-sparks-outrage/\">Continue reading<span class=\"screen-reader-text\"> \"Cash For Loyalty ?Mnangagwa’s US$200K Vendor Payout Sparks Outrage\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "FC Platinum Star In Terrible Road Accident",
            "url": "https://www.zimeye.net/2025/06/29/fc-platinum-star-in-terrible-road-accident/",
            "content": "Sports Correspondent\n\nFC Platinum midfielder Brian Banda was involved in a tragic road accident on Sunday along the Filabusi route.\n\nAccording to a source within the club, the accident claimed two lives, and Banda sustained serious injuries.\n\nThe club is yet to release an official statement, citing the sensitivity of the matter.\n\nMore details are expected to emerge as the situation develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent FC Platinum midfielder Brian Banda was involved in a tragic road accident on Sunday along the Filabusi route. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/fc-platinum-star-in-terrible-road-accident/\">Continue reading<span class=\"screen-reader-text\"> \"FC Platinum Star In Terrible Road Accident\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "High Court Dismisses Mnangagwa Bid To Punish Anyone Calling For Sanctions",
            "url": "https://www.zimeye.net/2025/06/29/high-court-dismisses-mnangagwa-bid-to-punish-anyone-calling-for-sanctions/",
            "content": "By A Correspondent\n\nHigh Court Judge Justice Rodgers Manyangadze has ruled against section 22A(3) of the Criminal Law Code, which aimed to criminalize individuals who call for sanctions or trade boycotts against Zimbabwe.\n\nThe judge declared the provision unconstitutional, describing it as too wide, vague, and broad to be enforceable under the law.\n\nThe legal challenge was brought forward by journalists Valentine Maponga, Paidamoyo Muzulu, and legal watchdog Veritas, represented by lawyer Tendai Biti.\n\nThe court did not issue any order regarding legal costs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent High Court Judge Justice Rodgers Manyangadze has ruled against section 22A(3) of the Criminal Law Code, which … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/high-court-dismisses-mnangagwa-bid-to-punish-anyone-calling-for-sanctions/\">Continue reading<span class=\"screen-reader-text\"> \"High Court Dismisses Mnangagwa Bid To Punish Anyone Calling For Sanctions\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "Zanu PF Mwenezi Stalwart Dies Under Mysterious Circumstances",
            "url": "https://www.zimeye.net/2025/06/29/zanu-pf-mwenezi-stalwart-dies-under-mysterious-circumstances/",
            "content": "By A Correspondent\n\nMWENEZI  The Mwenezi community has been left in shock following the mysterious death of former Zanu PF Ward 5 councillor, Tinashe Yingi, who was recently found hanging from a tree in the mountains two days after he was reported missing.\n\nYingi, a controversial figure in Dhuvai Village under Chief Neshuro, reportedly vanished shortly after the revelation of an alleged extramarital affair with a married woman from the same village.\n\nSources claim that tensions had been running high in the days leading up to his disappearance, but the exact circumstances surrounding his death remain unclear.\n\nHis body was discovered by villagers who had mounted a search operation after he failed to return home. The discovery has raised more questions than answers, with some community members expressing doubt over whether Yingi took his own life or if foul play may have been involved.\n\nIts hard to believe he would just take his life over an affair, said one local resident who requested anonymity. Theres more to this story than were being told.\n\nPolice have not yet released an official statement regarding the cause of death, and investigations are reportedly ongoing.\n\nYingis death has cast a dark cloud over the local Zanu PF structures, where he was known as a loyal party cadre and community mobilizer. Local leaders have called for calm and urged residents to allow the police to conduct a full investigation.\n\nThe community now awaits clarity as speculation continues to swirl over what really happened in the final hours of the former councillors life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MWENEZI – The Mwenezi community has been left in shock following the mysterious death of former Zanu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/zanu-pf-mwenezi-stalwart-dies-under-mysterious-circumstances/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Mwenezi Stalwart Dies Under Mysterious Circumstances\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "Controversy Over Walter Magaya’s ‘Anointed’ Apples",
            "url": "https://www.zimeye.net/2025/06/29/controversy-over-walter-magayas-anointed-apples/",
            "content": "By A Correspondent\n\nProphet Walter Magaya of Prophetic Healing and Deliverance (PHD) Ministries has once again found himself at the center of controversythis time for promoting so-called anointed apples ahead of a Sunday service.\n\nThe stunt has been widely condemned as exploitative and deceptive, targeting desperate followers with baseless spiritual promises.\n\nA source within PHD Ministries revealed:Prophet Magaya P havasi kuraravari busy kugomo kunamatira ma anointed apples in time for the Sunday service.The comment suggests the cleric is devoting extensive time on a prayer mountain to bless the apples before distributing them to congregants.\n\nReligious commentators and members of the public have not held back their criticism.This kind of manipulation undermines the core of religious faith. People are being made to believe that fruit can solve their problems,said one Harare-based theology scholar.Its spiritual theatrecalculated and commercial.\n\nAnother critic noted,What we are witnessing is a disturbing trend where religion is reduced to performances and objects. First it was anointed oil, now its apples. What next?\n\nMany are calling for tighter oversight of self-proclaimed prophets and their questionable practices. The anointed apples episode has reignited debate about the commercialization of religion in Zimbabwe and the urgent need to protect vulnerable communities from spiritual exploitation masquerading as faith.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Prophet Walter Magaya of Prophetic Healing and Deliverance (PHD) Ministries has once again found himself at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/controversy-over-walter-magayas-anointed-apples/\">Continue reading<span class=\"screen-reader-text\"> \"Controversy Over Walter Magaya’s ‘Anointed’ Apples\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        },
        {
            "title": "Mnangagwa Bribes Vendors With USD 200k",
            "url": "https://www.zimeye.net/2025/06/29/mnangagwa-bribes-vendors-with-usd-200k/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas administration has disbursed US$200,000 to informal traders across all 10 provinces under the so-called Presidential Vendors Empowerment Schemea move critics have slammed as a thinly veiled political gimmick ahead of future elections.\n\nThe announcement, made by the pro-Zanu PF platform VARAKASHI4ED, claims the funds will empower vendors and strengthen the informal economy. This milestone will boost informal businesses, drive economic growth, and empower vendors to build a brighter future for their families and communities, Varakashi4ED posted.\n\nHowever, many Zimbabweans have questioned the timing and sincerity of the gesture. Civic groups and political analysts argue the initiative is less about economic empowerment and more about buying loyalty from struggling citizens.\n\nThis is not empowermentits electioneering in disguise, said one Harare-based economist. The ruling party is dangling cash in front of desperate vendors to gain political mileage.\n\nA vendor in Mbare expressed skepticism over the initiatives intent. Why now? Weve been struggling for years and they suddenly remember us with dollars just before political campaigns heat up. Were not fools, she said.\n\nWhile the funds may bring temporary relief to some, critics argue it is yet another example of the governments failure to implement sustainable policies for the informal sectorresorting instead to once-off handouts designed to win hearts and headlines.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s administration has disbursed US$200,000 to informal traders across all 10 provinces under the so-called … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/29/mnangagwa-bribes-vendors-with-usd-200k/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Bribes Vendors With USD 200k\"</span></a></p>",
            "time": "06:47",
            "date": "30 Jun 2025"
        }
    ]
}