{
    "news": [
        {
            "title": "Top Byo Pastor Embarrassed As Lover Crashes Wedding",
            "url": "https://www.zimeye.net/2025/05/03/top-byo-pastor-embarrassed-as-lover-crashes-wedding/",
            "content": "By Showbiz Reporter- A dramatic scene unfolded at Entumbanes Presbyterian Church over the weekend after a two-year secret lover halted the wedding of popular Tabernacle Church pastor, Webby Mukoka.\n\nThe wedding, which was moments away from beingsolemnised, was brought to a sudden stop when an elderly man, Mr. Claudius Munenge, coincidentally sharing a surname with the bride but not related, stood up and objected just before the officiating pastor could proceed with the rites.\n\nMukoka was set totie the knot withMillet Munenge, a Harare-based detective with the Zimbabwe Republic Police, in what was expected to be a high-profile union.\n\nHowever, the ceremony was thrown into chaos when the pastors loverwho has allegedly been cohabiting with him and raising his childtook steps to expose the relationship.\n\nSources close to the matter say the woman, who works for a brewery company in Bulawayo, had been in a relationship withMukokafor two years and was devastated to learn about the wedding.\n\nShe has since filed a report at Entumbane Police Station after receiving alleged death threats.\n\nWe are at the police camp after I heard that these people want to attack me tonight, she said. Im making a formal police report but wont be sleeping at home for the next couple of days.\n\nFearing for her safety, the woman has temporarily moved in with her twin sister.\n\nThe incident has sent shockwaves through the local religious community, with many calling for an internal investigation into the pastors conduct.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter- A dramatic scene unfolded at Entumbane’s Presbyterian Church over the weekend after a two-year secret lover halted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/top-byo-pastor-embarrassed-as-lover-crashes-wedding/\">Continue reading<span class=\"screen-reader-text\"> \"Top Byo Pastor Embarrassed As Lover Crashes Wedding\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Sengezo Tshabangu Politically Dies",
            "url": "https://www.zimeye.net/2025/05/03/sengezo-tshabangu-politically-dies/",
            "content": "By Munacho Gwamanda- The Welshman Ncube-led Citizens Coalition for Change (CCC) has announced that its own creature and secretary general, Sengezo Tshabangu, is a political ghost.\n\nThis announcement comes after Tshabangu, who is recognised by Zanu PF, called for a parliamentary caucus meeting, sparking outrage and firm rejection from the partys official leadership.\n\nIn a strongly worded statement issued by the CCC Communications Department on May 3, the party dismissed Tshabangus authority, saying his position is based on a contested High Court default judgment and lacks any democratic or constitutional foundation.\n\nWe note with great concern the circulating document issued by Mr. Sengezo Tshabangu, who falsely purports to be the Interim Secretary General of the Citizens Coalition for Change (CCC) and Leader of Opposition in Parliament, the statement read.\n\nTshabangus attempt to convene a caucus, according to the CCC, is rooted in a default court ruling that the party says is currently being challenged through formal legal processes.A default judgment does not amount to a final determination on the substantive merits of the matter, the CCC emphasized. The CCC has filed a formal application for rescission of the judgment, along with applications for condonation and extension of time. Until these processes are resolved, no authority can be drawn from that judgment.\n\nParty spokesperson Willias Madzimure accused Tshabangu of exploiting legal technicalities to usurp power. The laws of Zimbabwe are clear: the term of office for a legitimately elected structure of any political party does not expire arbitrarily or through unilateral declarations, he said.\n\nThe party questioned the legitimacy of Tshabangus claims, highlighting that no official CCC organ had ever appointed him. When, where, and which party organs resolved to appoint Tshabangu as Interim Secretary General? the statement asked. He is fully aware that he is not.\n\nThe CCC also pointed out that Tshabangu had previously lost a High Court case against the party and has since appealed to the Supreme Court, with a hearing set for mid-May.We take issue with the political opportunism displayed in his call for a meeting, Madzimure said. His actions are not only divisive but undermine the collective struggles of the Zimbabwean people.Reiterating its position, the CCC said any claims to leadership or decision-making powers outside of its constitutional framework are null and void.Let it be known to all party members, citizens, stakeholders, and the international community that the CCC remains firmly guided by its Constitution, its values, and its democratic processes, the statement concluded.Despite ongoing turmoil, the party affirmed its commitment to democratic principles. The CCC remains unshaken in the commitment to return power to the citizens and to resist all attemptsexternal or internalto divert its democratic path.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- The Welshman Ncube-led Citizens Coalition for Change (CCC) has announced that its own creature and secretary general, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/sengezo-tshabangu-politically-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Sengezo Tshabangu Politically Dies\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Mliswa Spotted At Zanu PF Event",
            "url": "https://www.zimeye.net/2025/05/03/mliswa-spotted-at-zanu-pf-event/",
            "content": "By Munacho Gwamanda-Former Norton Member of Parliament, Temba Mliswa, was spotted this week at a Zanu PF farewell event held in Harare, reigniting public interest in the outspoken politicians ambiguous political positioning.\n\nNow a traditional leader, Mliswa attended a ceremony held tohonourthe retirement of Dr. Davison Gomo, the long-serving Zanu PF Director forCommissariat. Gomo, who served under four different political commissars, stepped down this week after years at the helm of Zanu PFs votermobilisationmachinery.\n\nWhile Mliswas presence at a ruling party function might raise eyebrows, it is not out of character.\n\nA former Zanu PF Mashonaland West provincial chairperson, he was expelled during the turbulent Mugabe-era factional battles between theGamatoxandZvipfukutocamps.\n\nSince then, he has carved out a distinctive political identityindependent, non-aligned, and vocal.\n\nThough he has no formal ties to any political party, Mliswa has consistently expressed personal loyalty to President Emmerson Mnangagwa, a position he has neverapologisedfor.\n\nHe has, however, distanced himself from Zanu PF as a political institution,criticisingits internal culture while maintaining his support for the Presidents leadership.\n\nHe may not wear party colours, but he doesnt hide where his loyalties lieMnangagwa the man, not Zanu PF the machine, said one observer.\n\nMliswas independence has also seen him attend opposition events and openlysympathisewith victims of state repression.\n\nHis pro-human rights stance has often put him at odds with hardliners within the ruling establishment.\n\nMliswa confirmed attending Dr Gomos farewell event, saying,  Yes, I was there. You know me and Dr Gomo, we have come a long way even during my time in the UK ( early 2000s). He is a respected man and a great mentor.\n\nAt the Gomo farewell ceremony, however, the Zanu PF family was united in praise.\n\nPolitical Commissar Munyaradzi Machacha credited Gomo with building an elaborate web of affiliateorganisationsthat significantly boosted the partysmobilisationahead of the disputed August 2023 elections.\n\nWhen I took over, I found that Dr. Gomo had already laid a solid foundation with the affiliate network, Machacha said. He gave the commissariat strategic depth.\n\nAmong these affiliates isForever Associates Zimbabwe (FAZ), a shadowy group allegedly linked to the Central Intelligence Organisation (CIO), which was accused of running parallel electoral structures, voter intimidation, and influencing outcomes in Zanu PFsfavour.\n\nAnother was theVarakashisocial media brigade, known for online propaganda and the harassment of government critics.\n\nOthers, likeTeachers for ED,Pastors for ED,Young Women for ED, andDiaspora 4ED, operated under the guise of civil society but promoted partisan interests. By 2023, Zanu PF claimed to have over 60 such groups under its wing, blurring the lines between grassroots engagement and political control.\n\nAffiliate leaders at the event celebrated Gomos legacy, vowing to carry on his work.\n\nWe willmobilisethe diaspora to return and help rebuild Zimbabwe under Zanu PF, declared Gwatidzo, political commissar for the partys UK branch.\n\nThough Gomo is stepping down, analysts warn that his influence will persist through the structures he helped entrench.\n\nCivil societyorganisationsand opposition parties continue to accuse Zanu PF of using affiliates to tighten its grip on rural communities and suppress dissent, all under the rhetoric of national unity and development.\n\nFor Mliswa, however, his presence at the farewell appears to reflect personal respect for Gomo and enduring ties to individuals within the ruling elite, rather than any formal political re-engagement.\n\nI go where I am invited, and I stand by what I believe, Mliswa has often said.\n\nThat belief, it seems, remains rooted in loyalty to Mnangagwaif not the party that surrounds him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Former Norton Member of Parliament, Temba Mliswa, was spotted this week at a Zanu PF farewell event held … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/mliswa-spotted-at-zanu-pf-event/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Spotted At Zanu PF Event\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Rinomhota Named Players’ Player of the Season at Cardiff City Awards",
            "url": "https://www.zimeye.net/2025/05/03/rinomhota-named-players-player-of-the-season-at-cardiff-city-awards/",
            "content": "Sports Correspondent\n\nCardiff City midfielder Andy Rinomhota has been honoured with the Players Player of the Season award after a standout campaign marked by resilience and versatility.\n\nThe accolade was presented during the clubs end-of-season awards ceremony earlier this week, recognizing Rinomhotas significant impact following his return from a loan spell. The 27-year-old overcame a slow start to the seasonhaving been an unused substitute in the opening six fixturesto establish himself as a key figure in the Bluebirds starting lineup.\n\nRinomhota made 31 appearances across all competitions, impressing not only in his familiar midfield position but also stepping in as a reliable right-back when required. His consistent performances and adaptability earned him the respect and votes of his teammates.\n\nBeing recognised by my fellow players means a lot, Rinomhota said after receiving the award. Its been a challenging season, but Im proud of how I responded and contributed to the team.\n\nAlthough nominated for the overall Player of the Season award, that honour went to forward Callum Robinson.\n\nCardiff City will now prepare for life in League One next season following their relegation from the Championship.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Cardiff City midfielder Andy Rinomhota has been honoured with the Players’ Player of the Season award after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/rinomhota-named-players-player-of-the-season-at-cardiff-city-awards/\">Continue reading<span class=\"screen-reader-text\"> \"Rinomhota Named Players’ Player of the Season at Cardiff City Awards\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Sad: Two Feared Dead In Terrible Head-on Collision In Masvingo City",
            "url": "https://www.zimeye.net/2025/05/03/sad-two-feared-dead-in-terrible-head-on-collision-in-masvingo-city/",
            "content": "By A Correspondent\n\nTwo people are feared dead following a horrific head-on collision that occurred on Friday at the Mucheke River Bridge in Masvingo City, sending shockwaves through the local community.\n\nThe accident involved a Mazda B2200 truck and a speeding Toyota GD6, which, according to police sources, was travelling from the city centre at an excessive speed.\n\nAfter colliding head-on with the Mazda, the GD6 reportedly lost control and ploughed into a commuter omnibus that was ahead of it.\n\nWhile authorities have not officially confirmed the number of fatalities, police at the scene believe the worst.\n\nWe suspect that two occupants from the Mazda B2200 may have died on the spot due to the impact, said a Zimbabwe Republic Police (ZRP) officer.\n\nThe driver of the GD6 was clearly speeding, and after hitting the Mazda, the vehicle couldnt stop and slammed into the kombi as well.\n\nNo official statement has been released by the Zimbabwe Republic Police.\n\nEmergency responders quickly attended the scene, and investigations are ongoing. Authorities have urged motorists to observe speed limits and exercise caution, especially in high-traffic areas like Mucheke Bridge, which has seen several accidents in recent years.\n\nMore details are expected to emerge as the police complete their report.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two people are feared dead following a horrific head-on collision that occurred on Friday at the Mucheke … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/sad-two-feared-dead-in-terrible-head-on-collision-in-masvingo-city/\">Continue reading<span class=\"screen-reader-text\"> \"Sad: Two Feared Dead In Terrible Head-on Collision In Masvingo City\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "CCC Infighting Takes New Twist, Tshabangu Faces Fierce Resistance",
            "url": "https://www.zimeye.net/2025/05/03/ccc-infighting-takes-new-twist-tshabangu-faces-fierce-resistance/",
            "content": "By Tinashe Sambiri\n\nA fresh wave of internal conflict has erupted within Zimbabwes main opposition party, the Citizens Coalition for Change (CCC), after Sengezo Tshabangu, who claims to be the partys Interim Secretary General, called for a parliamentary caucus meetingsparking outrage and firm rejection from the partys official leadership. The CCC has denounced Tshabangus legitimacy, accusing him of political opportunism and using the courts to undermine democratic processes.\n\nIn a strongly worded statement issued by the CCC Communications Department on May 3, the party dismissed Tshabangus authority, saying his position is based on a contested High Court default judgment and lacks any democratic or constitutional foundation.\n\nWe note with great concern the circulating document issued by Mr. Sengezo Tshabangu, who falsely purports to be the Interim Secretary General of the Citizens Coalition for Change (CCC) and Leader of Opposition in Parliament, the statement read.\n\nTshabangus attempt to convene a caucus, according to the CCC, is rooted in a default court ruling that the party says is currently being challenged through formal legal processes.\n\nA default judgment does not amount to a final determination on the substantive merits of the matter, the CCC emphasized. The CCC has filed a formal application for rescission of the judgment, along with applications for condonation and extension of time. Until these processes are resolved, no authority can be drawn from that judgment.\n\nParty spokesperson Willias Madzimure accused Tshabangu of exploiting legal technicalities to usurp power. The laws of Zimbabwe are clear: the term of office for a legitimately elected structure of any political party does not expire arbitrarily or through unilateral declarations, he said.\n\nThe party questioned the legitimacy of Tshabangus claims, highlighting that no official CCC organ had ever appointed him. When, where, and which party organs resolved to appoint Tshabangu as Interim Secretary General? the statement asked. He is fully aware that he is not.\n\nThe CCC also pointed out that Tshabangu had previously lost a High Court case against the party and has since appealed to the Supreme Court, with a hearing set for mid-May.\n\nWe take issue with the political opportunism displayed in his call for a meeting, Madzimure said. His actions are not only divisive but undermine the collective struggles of the Zimbabwean people.\n\nReiterating its position, the CCC said any claims to leadership or decision-making powers outside of its constitutional framework are null and void.\n\nLet it be known to all party members, citizens, stakeholders, and the international community that the CCC remains firmly guided by its Constitution, its values, and its democratic processes, the statement concluded.\n\nDespite ongoing turmoil, the party affirmed its commitment to democratic principles. The CCC remains unshaken in the commitment to return power to the citizens and to resist all attemptsexternal or internalto divert its democratic path.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri A fresh wave of internal conflict has erupted within Zimbabwe’s main opposition party, the Citizens Coalition for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/ccc-infighting-takes-new-twist-tshabangu-faces-fierce-resistance/\">Continue reading<span class=\"screen-reader-text\"> \"CCC Infighting Takes New Twist, Tshabangu Faces Fierce Resistance\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Mnangagwa In Secret Meeting With Obasanjo",
            "url": "https://www.zimeye.net/2025/05/03/mnangagwa-in-secret-meeting-with-obasanjo/",
            "content": "By A Correspondent\n\nZanu PF leader and Zimbabwean President Emmerson Mnangagwa held a closed-door meeting with former Nigerian President Olusegun Obasanjo at State House in Harare on Friday, fueling speculation amid rising tensions within the ruling party.\n\nThe visit, which was not announced in advance, has stirred political chatter as internal disputes within Zanu PF continue to escalate. With increasing pressure from within the party, observers suggest that Mnangagwa may be seeking counsel from Obasanjo, a respected elder statesman on the African continent.\n\nPresident ED Mnangagwa met with former Nigerian President, His Excellency Olusegun Obasanjo, at State House in Harare, Zanu PF said in a brief statement on Friday. The party, however, did not provide any details on the agenda or outcome of the meeting.\n\nThe timing of Obasanjos visit comes amid growing unrest in Zanu PF ranks. Prominent war veteran Blessed Geza recently called on Mnangagwa to resign, citing the presidents alleged incapacity and the unchecked looting of public funds by his inner circle.\n\nMnangagwa must go. He has failed to lead and has allowed his cronies to plunder state resources with impunity, Geza said in a strongly worded statement earlier this week.\n\nWhile the meetings purpose remains undisclosed, its secrecy and the current political climate suggest that the Zanu PF leader may be maneuvering to address internal dissent and shore up his waning support.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF leader and Zimbabwean President Emmerson Mnangagwa held a closed-door meeting with former Nigerian President Olusegun … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/mnangagwa-in-secret-meeting-with-obasanjo/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa In Secret Meeting With Obasanjo\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Mnangagwa Praises Looting Zvigananda",
            "url": "https://www.zimeye.net/2025/05/03/mnangagwa-praises-looting-zvigananda/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has drawn sharp criticism for remarks seen as an implicit endorsement of controversial businessman Wicknell Chivayo, following a speech in which he declared that his government rewards honest and hardworking individuals. The comments, delivered at the burial of the late Air Vice Marshal (Rtd) Winnie Mandeya, have sparked public outrage amid growing concerns about corruption and political patronage within the ruling Zanu PF.\n\nWe are in control of our own future, said Mnangagwa. Honesty, hard work, patriotism, zeal, and dedication will always be rewarded in the Second Republic. My government will always recognise those values and virtues.\n\nAlthough Mnangagwa did not mention Chivayo by name, his refusal to condemn the businessmanwho has become a symbol of alleged state capture and corruptionwas widely interpreted as a tacit endorsement. Chivayo, linked to questionable multi-million-dollar government tenders, continues to flaunt his wealth on social media while enjoying proximity to high-ranking officials.\n\nBy failing to distance himself from Chivayo and instead praising so-called hardworking individuals, Mnangagwa effectively legitimises looting, said one political analyst. It sends a dangerous message: loyalty to the system, not integrity, is what gets rewarded.\n\nThe timing of the remarks has added fuel to the fire. Mnangagwa also used the occasion to reaffirm his commitment to Vision 2030his flagship development agendawhich he insists will transform Zimbabwe into an upper-middle-income economy. But critics argue the initiative has become a political slogan detached from economic reality, especially as public frustration grows over inflation, unemployment, and elite enrichment.\n\nThe presidents use of liberation war rhetoric to defend his administrations direction has done little to calm tensions, especially as internal Zanu PF divisions deepen and calls for leadership renewal intensify. His silence on high-profile corruption scandals, including Chivayos, is increasingly viewed as complicity.\n\nAs the gap widens between government rhetoric and public experience, Mnangagwas attempt to project strength and vision is being undercut by accusations of hypocrisy and misplaced loyalty. Whether Vision 2030 can regain credibilityor whether the president can maintain his grip on powerremains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has drawn sharp criticism for remarks seen as an implicit endorsement of controversial businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/mnangagwa-praises-looting-zvigananda/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Praises Looting Zvigananda\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Mnangagwa Sticks To 2030 Agenda",
            "url": "https://www.zimeye.net/2025/05/03/mnangagwa-sticks-to-2030-agenda/",
            "content": "By A Correspondent\n\nDespite mounting pressure from both within and outside his party, Zanu PF leader President Emmerson Mnangagwa has reaffirmed his commitment to the controversial Vision 2030 agendasignaling his intention to remain in power amid growing calls for his resignation.\n\nSpeaking at the burial of the late Air Vice Marshal (Rtd) Winnie Mandeya, also known as Cde Cabby Rujeko Rwehondo, Mnangagwa used the national platform to double down on his long-term development plan.\n\nHis remarks come at a time of rising political tension, economic instability, and deepening factionalism within Zanu PF.\n\nWe are in control of our own future, said Mnangagwa, asserting that the goals set under Vision 2030 remain central to his administrations priorities. Honesty, hard work, patriotism, zeal, and dedication will always be rewarded in the Second Republic. My government will always recognise those values and virtues.\n\nThe presidents comments were widely seen as a strategic reaffirmation of authority, amid speculation that his leadership is under threat. Critics argue that the Vision 2030 agendawhich aims to transform Zimbabwe into an upper-middle-income economy by the end of the decadelacks transparency, measurable progress, and grassroots support.\n\nPolitical analysts believe Mnangagwas insistence on the 2030 vision is not just about economic development, but also a calculated move to extend his political lifespan. Hes tying national aspirations to his own leadership, one Harare-based analyst said.\n\nIn essence, abandoning Vision 2030 would mean admitting failure or stepping asideneither of which hes prepared to do.\n\nMeanwhile, public dissatisfaction continues to grow, driven by high inflation, unemployment, and allegations of corruption at the highest levels. The presidents speech, rooted in liberation war rhetoric, sought to remind the nation of its revolutionary originsa frequent tactic used to invoke loyalty and distract from present crises.\n\nAs the battle over succession and leadership intensifies, Mnangagwas reiteration of his 2030 agenda sends a clear message to both allies and rivals: he is not ready to relinquish control. Whether the nation can be persuaded to share his long-term vision, however, remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Despite mounting pressure from both within and outside his party, Zanu PF leader President Emmerson Mnangagwa has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/mnangagwa-sticks-to-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Sticks To 2030 Agenda\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        },
        {
            "title": "Mavetera Bribes Villagers With Goats",
            "url": "https://www.zimeye.net/2025/05/03/mavetera-bribes-villagers-with-goats/",
            "content": "By A Correspondent\n\nInformation and Communication Technology Minister Tatenda Mavetera is under scrutiny after she distributed goats to villagers in Matabeleland South on May Day, a move critics have labeled as a political bribe aimed at boosting support for the ruling party and its leader, President Emmerson Mnangagwa.\n\nMavetera, a staunch Mnangagwa loyalist and leader of the pro-Zanu PF Young Women 4ED group, made the donation during a public event at Mhlabangubo School in Tsholotsho South, where she handed out 200 goats to community members under the guise of an empowerment initiative.\n\nYesterday was a special day for us at Young Women for Economic Development, Mavetera said in a statement. We were at Mhlabangubo School in Tsholotsho South, Mat North, where we distributed 200 goats, marking the final phase of our initial nationwide empowerment program.\n\nShe went on to praise the effort as part of a broader development initiative, noting: During the course of the initiative we have empowered young women through sustainable livelihoods in goat rearing, pig farming, and rabbitry.\n\nWhile Mavetera framed the event as part of a legitimate economic development program, political analysts and opposition figures argue the gesture was little more than vote-buying in a region long neglected by the central government. The timing and symbolismon Workers Dayonly intensified the criticism.\n\nThis Workers Day, we did more than just remember the workers and heroes like Benjamin Burombo and Ubaba Dr. Joshua Nkomo, she added. We honored hardworking young women Zimbabweans by investing in their future. Agriculture is wealth, and empowerment is freedom.\n\nObservers, however, say Maveteras gesture reflects a growing trend within Zanu PF of using state-aligned resources and politically branded groups to maintain loyalty in rural areas. You can call it empowerment, but its clear this is a political transaction, said one civil society leader in Bulawayo. These so-called donations come with expectations of allegiance, especially in an election-sensitive climate.\n\nMavetera ended her statement by expressing gratitude to those involved: I am grateful to all who made this possible. The journey continues.\n\nAs the economic crisis deepens and pressure mounts on Mnangagwas administration, critics warn that patronage-driven programs like these only entrench inequality and undermine genuine development efforts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Information and Communication Technology Minister Tatenda Mavetera is under scrutiny after she distributed goats to villagers in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/03/mavetera-bribes-villagers-with-goats/\">Continue reading<span class=\"screen-reader-text\"> \"Mavetera Bribes Villagers With Goats\"</span></a></p>",
            "time": "20:26",
            "date": "04 May 2025"
        }
    ]
}