{
    "news": [
        {
            "title": "Pastor Collapses In Court After Being Sentenced To Five Years In Jail For Molesting Girl (11)",
            "url": "https://www.zimeye.net/2025/11/19/pastor-collapses-in-court-after-being-sentenced-to-five-years-in-jail-for-molesting-girl-11/",
            "content": "By A Correspondent A convicted pastor collapsed in court moments after being sentenced to five years in prison, with no option of a fine. Pastor Bongi Phiri, who had been found guilty of indecently dealing with an 11-year-old schoolgirl, fell to the ground in the dock upon hearing his sentence. Court officials and onlookers rushed to attend to him as the courtroom erupted in murmurs over the shocking case.\n\nPhiri was convicted for kissing the young girl on the lips while transporting her home from school, an act that drew widespread condemnation. The case had already stirred outrage in the community, with many calling for harsh punishment for anyone exploiting the trust placed in religious leaders.\n\nDuring the trial, evidence presented revealed that the girl had been left distressed and traumatised by the incident. The judge, in delivering the sentence, emphasised the need to protect vulnerable children and send a strong message that such offences would not be tolerated. The courtroom remained tense as the pastor was led away to begin serving his sentence, leaving a sobering reminder of the consequences of abusing positions of authority.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A convicted pastor collapsed in court moments after being sentenced to five years in prison, with no … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/pastor-collapses-in-court-after-being-sentenced-to-five-years-in-jail-for-molesting-girl-11/\">Continue reading<span class=\"screen-reader-text\"> \"Pastor Collapses In Court After Being Sentenced To Five Years In Jail For Molesting Girl (11)\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "President Duma Boko: “I Can Travel Alone, No Need for Huge Entourage”",
            "url": "https://www.zimeye.net/2025/11/19/president-duma-boko-i-can-travel-alone-no-need-for-huge-entourage/",
            "content": "Tinashe Sambiri Botswana President Duma Gideon Boko has revealed that he deliberately limits the size of his entourage whenever he travels outside the country, citing efficiency and practicality as his reasons.\n\nSpeaking to BTV News recently, President Boko emphasized that he prefers to travel light, avoiding the usual large government delegations that often accompany state leaders abroad.\n\nI dont want to travel with a huge entourage, for what reason? I can travel alone. Its unnecessary, he said.\n\nThe Presidents comments come amid growing discussions across the region about the cost and purpose of large governmental delegations, with many citizens questioning the necessity of extensive chaperones during official trips.\n\nBokos approach reflects a focus on frugality and practicality, as he seeks to minimize unnecessary expenditures while maintaining the functions of the presidency.\n\nObservers note that his decision to travel with a reduced team could set an example for other leaders in the region, promoting leaner and more efficient government practices.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Botswana President Duma Gideon Boko has revealed that he deliberately limits the size of his entourage whenever he … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/president-duma-boko-i-can-travel-alone-no-need-for-huge-entourage/\">Continue reading<span class=\"screen-reader-text\"> \"President Duma Boko: “I Can Travel Alone, No Need for Huge Entourage”\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Prison Officer Dies in Police Custody",
            "url": "https://www.zimeye.net/2025/11/19/prison-officer-dies-in-police-custody/",
            "content": "By A Correspondent A Zimbabwe Prisons and Correctional Service (ZPCS) officer has died under unclear circumstances while in police custody in Chinhoyi, raising serious questions from his family about the events leading to his death.\n\nThe deceased, Tawanda Marumahoko (34), had been arrested in connection with an alleged armed robbery. His relatives insist the official police account does not reflect what actually happened.\n\nZimbabwe Republic Police (ZRP) spokesperson, Commissioner Paul Nyathi, said Marumahoko was suspected of being part of a gang that allegedly robbed a bread delivery truck of US$10,000 and a mobile phone along the HarareChirundu Road on Friday, 14 November 2025.\n\nAccording to police, the trucks driver, 32-year-old Kenneth Tsvarisai, reported that he was robbed near the Mashonaland West Provincial Heroes Acre while travelling from Banket to Chinhoyi. Investigations later suggested the robbery may have been staged, with police alleging that Tsvarisai provided inside information after receiving cash from his manager.\n\nTsvarisai reportedly implicated Marumahoko, which led to his arrest and the recovery of US$4,680. Police further claim that Marumahoko confessed to using US$300 of the money to hire a lawyer after learning of Tsvarisais arrest. Officers also allege that he led them to the crime scene, where they recovered anEko P29 ONT 007 blowgunloaded with eight rounds.\n\nIn a puzzling twist, police say Marumahoko attempted to flee and was confronted by a mob conducting a citizens arrest. Commissioner Nyathi, however, did not explain how Marumahoko escaped from custody in the first place, nor how the alleged mob became involved.\n\nMarumahoko was later taken to Chinhoyi Provincial Hospital, where he died upon admission.\n\nHis family strongly disputes the police version.\n\nHis wife, Mary Muzama, said Marumahoko was arrested on Saturday morning and later taken home by detectives to collect items they claimed were needed for the investigation. She alleges that her husband was severely assaulted at Chinhoyi Police Stationand that she was also detained, beaten for nearly four hours, and had her phone confiscated.\n\nWhen I first saw him at Chinhoyi Police Station, he could hardly walk, she said. His legs were swollen, the right one was bleeding, he kept falling, and his forehead was swollen.\n\nMuzama said police officers openly threatened her husband, alleging he was a problematic suspect who was often released after arrest. One officer allegedly warned her not to be surprised if she heard he had been shot, claiming she was giving the police problems.\n\nShe said that by the last time she saw him, Marumahoko was unable to move and clearly unfit to be taken to any crime scene. Officers told her to return the next day.\n\nMarumahokos uncle, Office Marumahoko, who travelled from Magunje to seek answers, said the family was in shock and confusion and had not yet been allowed to view the body.\n\nThe family has also raised doubts about the alleged mob attack. They argue that the mob explanation appears to have been added later, noting that the area in question is remote and bushy.\n\nHuman rights groups have previously documented cases in which suspected armed robbers die during crime indications, a process meant to help police reconstruct events. In many of these incidents, police have claimed that suspectsoften shackledattempted to flee or attack officers before being shot or fatally injured.\n\nMarumahokos death now joins a growing list of highly contested cases involving suspects who die while in police custody or during police-led crime scene visits.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — A Zimbabwe Prisons and Correctional Service (ZPCS) officer has died under unclear circumstances while in police … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/prison-officer-dies-in-police-custody/\">Continue reading<span class=\"screen-reader-text\"> \"Prison Officer Dies in Police Custody\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Cut Rag Processors Expansion Drives Zimbabwe’s Industrial Resurgence and Forex Surge",
            "url": "https://www.zimeye.net/2025/11/19/cut-rag-processors-expansion-drives-zimbabwes-industrial-resurgence-and-forex-surge/",
            "content": "By A Correspondent| President Emmerson Mnangagwa has commissioned a multi-million dollar expansion at Cut Rag Processors making it Africas biggest tobacco processing plant.\n\nThe plant has a capacity of processing 12 000 cigarettes per minute.\n\nThe plant is designed to increase the domestic production of cut rag tobacco and cigarettes.\n\nThe commissioning follows the announcement that Zimbabwes 2025 tobacco production reached an all-time high of 355 million kilograms, valued at $1.2 billion, cementing its position as the worlds sixth-largest producer.\n\nMnangagwa said the investment is a direct outcome of his governments economic agenda.\n\nThis occasion demonstrates Zimbabwes on-going industrial resurgence and testament that Zimbabwe is Open for Business, he said.\n\nHe added that the state-of-the-art plant would advance the countrys goal of moving from raw material exports to manufacturing finished goods.\n\nThis remarkable capacity of the plant is set to consolidate Zimbabwes self-sufficiency in tobacco manufacturing, and as an emerging exporter of high-value, finished tobacco products, he said.\n\nThe investment by Cut Rag Processors, Zimbabwes first independent cut rag manufacturer established in 2000, was cited as evidence of growing private sector confidence.\n\nMnangagwa directly linked this to his administrations reforms.\n\nWe are determined to ensure that no investment is hindered by bureaucratic red tape, he said.\n\nFor decades, Zimbabwe has been a top global exporter of raw, flue-cured tobacco, with the bulk of profits from final manufactured products accruing to international companies.\n\nCut Rag Processors general manager, Lesley Malunga the plant will have a positive impact on Zimbabwes economy.\n\nThis expansion is not just about volume; its about value capture. Instead of shipping container loads of unbaled tobacco leaf, we can now export refined, packaged cut rag and finished cigarettes, which keeps a significantly larger portion of the revenue within Zimbabwe, Malunga said.\n\nHe added that the facility would create hundreds of new direct jobs in processing and packaging, in addition to supporting roles in logistics and engineering.\n\nThe tobacco industry remains a vital source of foreign currency, contributing over 25% to the nations total forex earnings.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| President Emmerson Mnangagwa has commissioned a multi-million dollar expansion at Cut Rag Processors making it Africa’s biggest … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/cut-rag-processors-expansion-drives-zimbabwes-industrial-resurgence-and-forex-surge/\">Continue reading<span class=\"screen-reader-text\"> \"Cut Rag Processors Expansion Drives Zimbabwe’s Industrial Resurgence and Forex Surge\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Cash Talks? Tagwirei Unrolls Financial Offensive To Prolong Mnangagwa Rule",
            "url": "https://www.zimeye.net/2025/11/19/cash-talks-tagwirei-unrolls-financial-offensive-to-prolong-mnangagwa-rule/",
            "content": "Tinashe Sambiri  At the ZANU PF Harare Province DCC 3 Inter-District Meeting held in Dzivarasekwa, Harare on Tuesday, President Emmerson Mnangagwa  through his close ally and businessman Kuda Tagwirei  reinforced his political influence by unveiling a series of high-value pledges framed as grassroots empowerment initiatives.\n\nZanu PF online activist Cleopas Mukungunugwa took to Facebook on Tuesday, praising Mnangagwas approach, writing: President ED Mnangagwas mission reflects the national leaderships unwavering dedication to uplifting communities and accelerating the realization of Vision 2030.\n\nUsing his moniker Nhamoyapera  loosely translated to Poverty is over  Tagwirei announced a massive financial package worth US$200,000 for DCC 3. The funds will be divided equally among the Main Wing, Womens League, War Veterans League, and Youth League, each receiving US$50,000.\n\nIn addition, the Disabled Community in DCC 3 will get US$25,000 to support their welfare needs.\n\nInfrastructure and social services formed a central part of Tagwireis pledges. He committed to installing 80 solarized boreholes across the district to increase access to clean water. His Bridging Gap Foundation will also distribute 12,500 food hampers to vulnerable families  a move presented as reinforcing food security amid economic hardship. Health delivery is set for significant enhancement too, with Tagwirei promising the construction of five clinics equipped with maternity wards.\n\nAdding to the display of generosity, Joachim Chivhayo donated seven laptops and 20 wheelchairs for people living with disabilities in DCC 3. Tagwirei also urged party members to position themselves for economic opportunities: Make sure your paperwork is in order so you can bid for tenders, he reportedly told attendees. As part of this push, DCC 3 will establish a party-run company to conduct business on behalf of the district.\n\nIn a symbolic act rooted in liberation war history, a widow of a war veteran who was hanged during the struggle will receive US$50,000  half for home renovations and half as direct assistance. Furthermore, Harare War Veterans and their spouses will be covered by funeral policies valued at US$2,500 each, funded by Tagwireis family.\n\nThese sweeping donations, unveiled at a time when debates over a possible extension of Mnangagwas term are intensifying, are viewed by critics as an attempt to sanctify the push for his continued rule through strategic financial influence. Supporters, however, insist the initiatives embody a people-first philosophy and demonstrate a commitment to building a prosperous Zimbabwe for all.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – At the ZANU PF Harare Province DCC 3 Inter-District Meeting held in Dzivarasekwa, Harare on Tuesday, President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/cash-talks-tagwirei-unrolls-financial-offensive-to-prolong-mnangagwa-rule/\">Continue reading<span class=\"screen-reader-text\"> \"Cash Talks? Tagwirei Unrolls Financial Offensive To Prolong Mnangagwa Rule\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Picture: Mnangagwa’s Henchman Joachim Chivayo Displays 150 000 USD Watch As Citizens Grapple With Poverty…",
            "url": "https://www.zimeye.net/2025/11/19/picture-mnangagwas-henchman-joachim-chivayo-displays-150-000-usd-watch-as-citizens-grapple-with-poverty/",
            "content": "Tinashe Sambiri  Joachim Chivayo, the brother of controversial Zanu PF tenderpreneur Wicknell Chivayo, has once again sparked public outrage after being photographed wearing a watch valued at a staggering US$150,000 during a Zanu PF rally in Harare this week.\n\nThe picture, which is circulating widely on social media, shows Joachim flaunting the extravagant timepiece at a time when millions of Zimbabweans are battling deepening economic hardships marked by high inflation, rising unemployment, and unaffordable basic goods.\n\nZimbabwean economist and business strategist Bla Bhidza was among those who voiced concern on X (formerly Twitter) on Tuesday.\n\nIn his post, he highlighted the glaring contrast between the lavish lifestyles of politically connected individuals and the daily struggles of ordinary citizens.\n\nBhidza wrote: Mnangagwas henchman Joachim Chivayo is seen here again wearing a fully diamond-encrusted (iced-out) Patek Philippe Nautilus in stainless steel. This is priced around US$150,000. It comes from a Dubai-based jeweler specializing in iced-out luxury watches.\n\nThe post quickly attracted widespread criticism, with many Zimbabweans questioning the source of such wealth and accusing Zanu PF elites of flaunting opulence while neglecting the countrys worsening socio-economic crisis.\n\nJoachim Chivayo, known for his association with high-end luxury items and controversial business dealings, has not responded to the latest public uproar.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Joachim Chivayo, the brother of controversial Zanu PF tenderpreneur Wicknell Chivayo, has once again sparked public outrage … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/picture-mnangagwas-henchman-joachim-chivayo-displays-150-000-usd-watch-as-citizens-grapple-with-poverty/\">Continue reading<span class=\"screen-reader-text\"> \"Picture: Mnangagwa’s Henchman Joachim Chivayo Displays 150 000 USD Watch As Citizens Grapple With Poverty…\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Video: Mnangagwa Captures Pastors With Donation Of Brand New Motor Vehicles",
            "url": "https://www.zimeye.net/2025/11/19/video-mnangagwa-captures-pastors-with-donation-of-brand-new-motor-vehicles-2/",
            "content": "Tinashe Sambiri As President Emmerson Mnangagwas bid to extend his term beyond constitutional limits gathers momentum, his administration has intensified a strategy critics describe as the co-option of influential social groups  this time through the pulpit.\n\nOn Monday, Presidential Special Investment Advisor Paul Tungwarara donated a fleet of brand-new motor vehicles to a group of pastors, a move widely interpreted as open political bribery disguised as benevolence.\n\nThe vehicles, reportedly over ten brand-new Toyota single cabs, were handed over at a public event attended by ruling party affiliates. While the gesture was packaged as support for religious outreach work, analysts argue that it forms part of a broader pattern in which State resources and politically connected business figures are deployed to secure the loyalty of church leaders ahead of the anticipated push for Mnangagwas extended rule.\n\nZanu PF activist Christine Charumbira celebrated the event on X on Tuesday, writing: The Special Investment Advisor gifted over 10 brand-new Toyota single cab vehicles to pastors, supporting their outreach efforts. Nyika inonamatirwa nevene vayo. Her remarks framed the gesture as an act of national spiritual empowerment rather than political manoeuvring.\n\nHowever, political observers say the timing and target of the donations reveal a calculated strategy. Pastors  particularly within large Pentecostal and Apostolic movements  wield significant influence over their congregations, making them valuable political assets. By aligning church leaders with the ruling establishment through material incentives, the Mnangagwa administration is effectively consolidating a moral shield for its contested political ambitions.\n\nCritics argue that these donations reflect a longstanding pattern in Zimbabwean politics: the exploitation of religious authority to legitimise controversial political agendas. The practice, they say, undermines the independence of the church while blurring the line between faith and partisan loyalty.\n\nSome civil society voices have gone further, accusing Mnangagwas officials of weaponising poverty in the church by offering material rewards to leaders whose congregations often struggle with economic hardship.\n\nThey warn that such practices weaken democratic accountability and create a dangerous precedent in which political elites can purchase moral endorsement using public or opaque private funds.\n\nAs the debate over constitutional limits intensifies, the vehicle donations stand as a vivid symbol of Mnangagwas evolving political machinery  one that increasingly leans on religious networks to anchor legitimacy.\n\nWhether the pastors will publicly endorse his stay-on campaign remains to be seen, but for many Zimbabweans, the video of smiling church leaders receiving keys to brand-new vehicles has already raised unsettling questions about the integrity of both the pulpit and the presidency.\n\nThe Special Investment Advisor gifted over 10 brand-new Toyota single cab vehicles to pastors, supporting their outreach efforts. Nyika inonamatirwa nevene vayo. pic.twitter.com/knf3uH0y0B\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– As President Emmerson Mnangagwa’s bid to extend his term beyond constitutional limits gathers momentum, his administration has intensified … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/video-mnangagwa-captures-pastors-with-donation-of-brand-new-motor-vehicles-2/\">Continue reading<span class=\"screen-reader-text\"> \"Video: Mnangagwa Captures Pastors With Donation Of Brand New Motor Vehicles\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "“Tagwirei Unelectable”",
            "url": "https://www.zimeye.net/2025/11/19/tagwirei-unelectable/",
            "content": "Tinashe Sambiri Fiery Zimbabwean political commentator Obiza Madoda has declared that Kuda Tagwirei, often portrayed as President Emmerson Mnangagwas potential successor, is unelectable.\n\nMadoda wrote on Facebook on Tuesday, questioning Tagwireis ability to win public support without relying on his considerable wealth, much of which is alleged to come from illicit businesses.\n\nUnless Tagwirei uses his money from his multiple illegal businesses, who really will vote for this guy to be president? Madoda asked.\n\nHe also criticized Tagwireis moral character, describing him as the most corrupted religious guy Zimbabwe has ever seen and known.\n\nMadodas comments add to ongoing debates in Zimbabwe about political succession, corruption, and the influence of wealth in securing political power.\n\nWhile supporters of Tagwirei have remained largely silent on the claims, the remarks highlight the growing scrutiny over figures perceived as potential heirs to Mnangagwas presidency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Fiery Zimbabwean political commentator Obiza Madoda has declared that Kuda Tagwirei, often portrayed as President Emmerson Mnangagwa’s potential … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/tagwirei-unelectable/\">Continue reading<span class=\"screen-reader-text\"> \"“Tagwirei Unelectable”\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Two Veteran ZBC Broadcasters Die in Two Days",
            "url": "https://www.zimeye.net/2025/11/19/two-veteran-zbc-broadcasters-die-in-two-days/",
            "content": "By A Correspondent-Zimbabwes broadcasting fraternity is mourning the loss of two veteran former Zimbabwe Broadcasting Corporation (ZBC) broadcasters, who died within a space of two days.\n\nTheir deaths have plunged the media industry into reflection on an era that shaped the countrys radio and television identity.\n\nIsiah Mutemachani  one of the most distinctive voices of ZBC Radio 2 in the 1980s and 1990s  died on Monday afternoon at Chitungwiza General Hospital after a long battle with cancer, his family confirmed.\n\nHis passing came barely 24 hours after the death of another broadcasting giant, Dr Temba Basopo Moyo (formerly Nemapare), a respected former ZBC Television News head and academic.\n\nMutemachani was part of the pioneering generation of Radio 2 (now Radio Zimbabwe) presenters who helped define Zimbabwes post-independence radio culture. In an era when radio was the countrys primary source of entertainment and information, he earned a place among the stations most recognisable voices. His trademark warm delivery, consistency, and deep connection with listeners made him a household favourite during radios golden period.\n\nThe 1980s and 1990s were transformative years for local broadcasting. With only four stationsRadio 1, 2, 3, and 4radio dominated domestic entertainment, especially in rural communities where radiograms consumed too much power and televisions were scarce. Families routinely gathered around battery-operated radios or shortwave sets to follow dramas such asMhuri yaVaMukadotaandRazor Man. Listeners built mental pictures of characters long before televisions became widespread.\n\nRadio 2 was particularly influential, thanks to presenters like Lisbern Nasasara, Deans Patrick Mutume, Grey Gambiza Moyo, Sam Sibanda, Joe Panganai, Nyasha Maposa and Itai Godfrey Muchada. Across other stations, broadcasters such as Hilton Dr Bobo Mambo, John Matinde, Peter Jones and Tsitsi Mawarire set national standards for on-air professionalism and creativity.\n\nSignature programmes of that era still evoke nostalgia:Kuverengwa Kwemabhuku, brought to life through Simon Pashoma Ncubes expressive storytelling;Jarzin Man, presented by Admire Taderera and later Lazarus Tembo; and football commentary by greats such as Kingsley Sibanda, Lisbern Nasasara, and Evans Mambara. Greeting shows likeKwaziso/Ukubingelelanagave listeners a sense of belonging, with postcards and letters serving as the primary mode of communication.\n\nIn stark contrast, many listeners today feel radio has lost the discipline, originality and production values of earlier decades. Presenters often rely on newspapers and online content, explicit music airs without adequate censorship, and musicians frequently complain about biased playlists and poor documentation affecting royalties. Modern technologies  from smartphones to Bluetooth speakers  have further fragmented radio listenership.\n\nDr Temba Basopo Moyos death has compounded the nations grief. A respected figure at Pockets Hill, he headed ZBC Television News in the early 1980s under Director Grey Tichatonga (Ambassador Mark Marongwe). He worked alongside a distinguished generation of broadcasters and administrators including Joseph Masuku, Godfrey Majonga, Dorcas Chibanda, Darlington Munyoro, Evans Mambara and Rueben Barwe, among many others who defined the early identity of national television.\n\nColleague and veteran broadcaster John Masuku described Dr Moyo as a visionary who saw the digital media transformation decades before it occurred. Educated at Tegwane High School, he shared formative years with future ZBC heavyweights such as Munyaradzi Machacha (Cde George Kashiri) and Victor Mhizha-Murira.\n\nMutemachani and Dr Moyo belonged to a generation that transitioned the Rhodesia Broadcasting Corporation into a post-independence national broadcaster that reflected Zimbabwes culture, aspirations and diversity. Their passing marks the end of a significant chapter in Zimbabwes media history  a period defined by discipline, creativity, and a deep bond between broadcasters and their audiences.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Zimbabwe’s broadcasting fraternity is mourning the loss of two veteran former Zimbabwe Broadcasting Corporation (ZBC) broadcasters, who died … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/two-veteran-zbc-broadcasters-die-in-two-days/\">Continue reading<span class=\"screen-reader-text\"> \"Two Veteran ZBC Broadcasters Die in Two Days\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Fortune Or Misfortune? Mudiwa Hood Gets Donation Of Brand New Motor Vehicle From Chivayo",
            "url": "https://www.zimeye.net/2025/11/19/fortune-or-misfortune-mudiwa-hood-gets-donation-of-brand-new-motor-vehicle-from-chivayo/",
            "content": "Controversial Zanu PF tenderpreneur Wicknell Chivayo has donated a brand-new Toyota Fortuner to social media influencer and artist Mudiwa Hood  a gesture that has triggered more criticism than admiration across Zimbabwe.\n\nChivayo made the announcement on Wednesday morning via Facebook, launching into his usual dramatic praise of Hood, whom he described asa young man with a millionaire mindset.He went on to call himone of Zimbabwes most inspiring, disciplined and successful entrepreneurswhile listing a long and questionable catalogue of supposed business ventures ranging from construction to aviation.\n\nHe also romanticised Hoods rise from Chitungwiza, declaring,From HUMBLE beginnings ku GHETTO redu ku CHITUNGWIZA Mudiwa has built a MASSIVE BRAND that is hard to ignore.Chivayo praised Hoods Christian messaging too, saying his favourite song isNDAITA MARI NDINA MWARI,before adding thatwealth is by Gods grace, not merely human effort.\n\nBut the political undertones of the donation were hard to ignore. Chivayo openly applauded Hood for siding with the ruling party, stating,Most importantly, you have been a consistent supporter of our ruling party ZANU-PF, championing the message of youth empowerment and national development under the visionary leadership of His Excellency, President ED Mnangagwa.\n\nThis admission has only fuelled public criticism that the donation is less about merit and more about rewarding political loyalty. Chivayo has repeatedly gifted vehicles to pro-Zanu PF personalities, cementing concerns that he uses his wealth  much of it linked to opaque government tenders  to buy influence and polish the ruling partys image.\n\nChivayo ended his post by telling Hood to collect the vehicle, writing,Please go and see Victor at Exquisite Car Dealership on Monday to collect your brand spanking new Toyota Fortuner, fully paid for.\n\nBut many Zimbabweans see the gesture as yet another tone-deaf display of excess in a country grappling with poverty, unemployment and collapsing public services. Critics argue that such flashy giveaways insult the daily struggles of ordinary citizens and serve only to reinforce a system built on patronage rather than genuine empowerment.\n\nFor some, the question isnt whether Mudiwa Hood is lucky  but whether these spectacles of political generosity are a misfortune for the entire nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Controversial Zanu PF tenderpreneur Wicknell Chivayo has donated a brand-new Toyota Fortuner to social media influencer and artist Mudiwa Hood … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/19/fortune-or-misfortune-mudiwa-hood-gets-donation-of-brand-new-motor-vehicle-from-chivayo/\">Continue reading<span class=\"screen-reader-text\"> \"Fortune Or Misfortune? Mudiwa Hood Gets Donation Of Brand New Motor Vehicle From Chivayo\"</span></a></p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        }
    ]
}