{
    "news": [
        {
            "title": "Plot To Kill VP Chiwenga Exposed",
            "url": "https://www.zimeye.net/2025/10/18/plot-to-kill-vp-chiwenga-exposed/",
            "content": "By A Correspondent  A chilling assassination plot targeting Vice-President Constantino Chiwenga has been uncovered amid deepening factional wars in Zanu PF over President Emmerson Mnangagwas succession.\n\nAccording to a classified document marked Top Secret  believed to have originated from the United States government  a Belarusian-linked contract asset codenamedBEDROCKwas allegedly hired to eliminate Chiwenga, who is referred to in the document by his liberation war name,Dominic Chinenge.\n\nThe explosive report, stamped URGENT and bearing a consular receipt mark, describes Chinenge asan astute Zimbabwean national and general shadow head of the military and designated with Tier 5 credentials within the presidency.It further warns that Chiwengasgrowing influence has placed him at the centre of an aggressive ploy to assassinate him.\n\nThe intelligence brief claims that over the past three months,BEDROCKhas beenconducting surveillance on Chiwengas movements, includingmonitoring communications through platforms in the United Arab Emirates (UAE) and China. The operative, the report states,stands ready to activate active measures within plausible proximity.\n\nInsiders say the alleged plot is being orchestrated by Mnangagwa loyalists  often dismissed as bootlickers  who view Chiwenga as a threat to the Presidents continued grip on power.\n\nChiwenga, a key architect of the November 2017 military intervention that ousted the late Robert Mugabe, has in recent months clashed with Mnangagwas inner circle. On September 17, the Vice-President reportedly presented a dossier to the President calling for the arrest of Mnangagwas powerful allies  Kudakwashe Tagwirei, Pedzai Scott Sakupwanya, Dilesh Nguwaya, and Wicknell Chivayo  over the alleged looting of billions in public funds.\n\nMnangagwas response was swift and hostile. This week, Justice Minister Ziyambi Ziyambi, who also serves as Zanu PFs legal secretary, accused Chiwenga of treason, escalating tensions within the ruling party.\n\nAccording to the leaked intelligence report, US$100 000 was wired to a Jersey NatWest account via an offshore trust  AFTRADE DMCC, a company linked to Belarus  to finance the operational phase of the assassination plan. The report further alleges thatDNA and urine samples of Chinenge have been collected and analysed to dilute possible counter-measures.\n\nIt concludes that the Five Eyes intelligence alliance (FVEY)  comprising the United States, United Kingdom, Canada, Australia, and New Zealand  is fully aware of the operation, noting thatBEDROCKhad previous deployments in Iraq and Equatorial Guinea.\n\nA final line in the file reads:Call-off coding on BEDROCK are aligned to file ZANUPF372921/08224CGNC.\n\nAs of now, neither the US government, Zimbabwean authorities, nor Belarusian officials have commented on the leaked intelligence document, which remains classified under the US National Security Act of 2021.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — A chilling assassination plot targeting Vice-President Constantino Chiwenga has been uncovered amid deepening factional wars in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/18/plot-to-kill-vp-chiwenga-exposed/\">Continue reading<span class=\"screen-reader-text\"> \"Plot To Kill VP Chiwenga Exposed\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "VP Chiwenga Fires Another Shot",
            "url": "https://www.zimeye.net/2025/10/18/vp-chiwenga-fires-another-shot/",
            "content": "By A Correspondent Vice President Constantino Chiwenga on Friday fired yet another broadside at his critics and corrupt elements within the ruling Zanu PF, using the partys Annual Peoples Conference in Mutare to deliver a pointed lecture on integrity, unity, and moral leadership.\n\nBraving visible hostility from some quarters of the party, Chiwenga once again spoke out against corruption  a vice he said has crippled Zimbabwes progress and betrayed the sacrifices of the countrys liberation heroes.\n\nThe defiant vice president has in recent months been under sustained attack for repeatedly calling out corruption in government and within Zanu PF. He has publicly denounced what he callszvigananda parasitic elites feeding off the national trough while ordinary Zimbabweans suffer.\n\nLast month, Chiwenga reportedly tabled a dossier before the Zanu PF politburo, naming several top officials he accused of corruption and calling for their immediate arrest. His move sparked fierce backlash, with Justice Minister and Zanu PF Secretary for Legal Affairs Ziyambi Ziyambi responding through a scathing rebuttal presented to the politburo this week.\n\nAdding to the onslaught, party spokesperson and presidential aspirant Christopher Mutsvangwa intensified attacks on Chiwenga during a press conference at the party headquarters in Harare on Thursday.\n\nDespite the tension, Chiwenga used his speech in Mutare to restate his anti-corruption message  carefully framing it within the conferences theme,Attainment of Vision 2030 Through Economic Empowerment and Value Addition.\n\nHe said the theme captured the central task before the party: building a people-centred economy that benefits all Zimbabweans, not a privileged few.\n\nEconomic empowerment must be genuine  equipping all our people with the means to produce, innovate, and own their destiny. That is the essence of Vision 2030 and the spirit of revolutionary continuity, Chiwenga said.\n\nHe added:\n\nWe must always remember that we are not the Alpha and Omega of Zimbabwes journey. Our role is to carry forward the torch passed to us by those who gave everything without expectation of reward.Some of them, like the late General Josiah Magama Tongogara, knew they might not see a liberated Zimbabwe, yet they fought to the end. They fought for the future, not for themselves.\n\nChiwenga described Vision 2030 as anational covenantthat should reflect collective purpose rather than personal ambition.\n\nHe further emphasized the symbolic significance of holding the conference in Manicaland, saying Mutare held a sacred place in Zimbabwes liberation history.\n\nIt was a crucial gateway through which thousands of our brave sons and daughters crossed into Mozambique to wage the struggle for independence, he said. Through these mountains and valleys, they slipped across the border  young, determined, and full of conviction  to bases such as Chimoio, Nyadzonya, and Tembwe in Mozambique, and Freedom Camp in Zambia.Many perished not in battle but in hope, believing that their sacrifices would purchase a just, dignified, and prosperous Zimbabwe for all.\n\nChiwenga said the fallen heroes blood stillcries from the soildemanding honesty and service from the current generation.\n\nTheir blood demands integrity. Their voices cry out against corruption, laziness, and moral decay, he declared. The bond between the party and the people must remain unbroken. The same unity and singleness of purpose that drove our liberation struggle must now guide us into the future.\n\nChiwenga concluded by inviting President Emmerson Mnangagwa to address the conference, proclaiming,Pamberi neZanu PF! Pamberi naPresident Emmerson Mnangagwa! Pasi nemhandu!\n\nPolitical observers, however, said beneath the formalities of the address lay a thinly veiled rebuke of Mnangagwas leadership and the rampant corruption that has become synonymous with his administration  signalling that Zimbabwes ruling party remains deeply divided at the highest levels.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Vice President Constantino Chiwenga on Friday fired yet another broadside at his critics and corrupt elements within … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/18/vp-chiwenga-fires-another-shot/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Fires Another Shot\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Defiant VP Chiwenga Takes ED Head-On in Mutare",
            "url": "https://www.zimeye.net/2025/10/18/defiant-vp-chiwenga-takes-ed-head-on-in-mutare/",
            "content": "By A Correspondent Vice President Constantino Chiwenga has once again taken a veiled but unmistakable swipe at President Emmerson Mnangagwa and his allies, repeating his fiery anti-corruption rhetoric during the ruling Zanu PF Annual National Peoples Conference in Mutare.\n\nLast month, Chiwenga rattled Mnangagwas inner circle after delivering a blistering address during a politburo meeting  a dossier that exposed deep divisions in the party and sent shockwaves through Mnangagwas loyalists.\n\nIn Mutare, the former army commander, who played a pivotal role in the 2017 coup that brought Mnangagwa to power, reiterated his call for integrity, unity, and moral leadership within Zanu PF, cautioning against corruption and moral decay that, he said, betray the ideals of the liberation struggle.\n\nBelow are excerpts from Chiwengas full speech:\n\nIt is my profound honour and privilege to stand before you today to introduce the guest of honour  His Excellency, the President of the Republic of Zimbabwe and First Secretary of Zanu PF  on this occasion of our 22nd Annual National Peoples Conference.\n\nThis is not merely another conference. It is a moment of reflection, renewal, and recommitment to the timeless values that have carried our revolutionary party from the liberation struggle to the envisioned future.\n\nHolding this conference in Manicaland is profoundly symbolic, as this province occupies a sacred place in the liberation history of our country. It was a crucial gateway through which thousands of brave sons and daughters crossed into Mozambique to wage the war for our independence.\n\nThrough these mountains behind us, they slipped across the border  young, determined, and full of conviction  to bases such as Chimoio, Nyadzonya, and Tembwe in Mozambique, and Freedom Camp in Zambia. In those camps, the price of freedom was paid in full measure.\n\nMany perished not in battle but in hope, believing their sacrifice would secure a just and prosperous Zimbabwe for all. Those who died left us a moral duty  to live with integrity, unity, and service.\n\nTheir blood cries out against corruption, laziness, and moral decay. The liberation struggle was a peoples war; the bond between the party and the people must never be broken. The same unity and singleness of purpose that drove our struggle must guide us into the future.\n\nOur theme this year, Attainment of Vision 2030 Through Economic Empowerment and Value Addition, captures the central task before us: to build a people-centred economy that benefits all Zimbabweans, not just a privileged few.\n\nEconomic empowerment must be genuine  equipping our people with the means to produce, innovate, and own their destiny. That is the essence of Vision 2030 and the spirit of revolutionary continuity.\n\nWe must always remember that we are not the Alpha and Omega of Zimbabwes journey. Our role is to carry forward the torch passed to us by those who gave everything without expectation of reward  heroes like our late commander, General Josiah Magama Tongogara, who fought for the future, not for themselves.\n\nVision 2030 must therefore be understood as a national covenant  about the Zimbabwe we bequeath to future generations. Zanu PF stands where it does today because it has travelled a long, demanding road of vision, unity, sacrifice, love, and purpose.\n\nChiwenga concluded his speech by inviting Mnangagwa to address the conference, declaring, Pamberi neZanu PF! Pamberi naPresident Emmerson Mnangagwa! Pasi nemhandu!\n\nPolitical observers, however, were quick to note that beneath the formal tone of the speech lay a strong rebuke of corruption and factionalism  the very issues that have increasingly defined Mnangagwas administration and strained relations between the two leaders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Vice President Constantino Chiwenga has once again taken a veiled but unmistakable swipe at President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/18/defiant-vp-chiwenga-takes-ed-head-on-in-mutare/\">Continue reading<span class=\"screen-reader-text\"> \"Defiant VP Chiwenga Takes ED Head-On in Mutare\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Picture: Did General Chiwenga’s Wife “Refuse “to Wear Regalia Bearing President Emmerson Mnangagwa’s Face?",
            "url": "https://www.zimeye.net/2025/10/18/picture-did-general-chiwengas-wife-refuse-to-wear-regalia-bearing-president-emmerson-mnangagwas-face/",
            "content": "Picture: Did General Chiwengas Wife \"Refuse\" to Wear Regalia Bearing President Emmerson Mnangagwas Face?Dear friends,Did General Chiwengas wife really refuse to wear regalia bearing President Emmerson Mnangagwas face?Yours, Muvoni Muratidzwipic.twitter.com/JW9r3FZ2M9\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Watch: Mnangagwa Loyalists Explode Into Song ‘2030 Ndeya Emmerson’ At Zanu PF Annual Conference in Mutare …",
            "url": "https://www.zimeye.net/2025/10/18/watch-mnangagwa-loyalists-explode-into-song-2030-ndeya-emmerson-at-zanu-pf-annual-conference-in-mutare/",
            "content": "By A Correspondent\n\nZANU PF loyalists broke into a new campaign-style song titled 2030 Ndeya Emmerson during party activities in Mutare on Friday, in what observers say is a coordinated effort to drum up support for President Emmerson Mnangagwas continued rule beyond his current term.\n\nZANU PF online activist C.H. Mukungunugwa proudly announced the development on X (formerly Twitter) on Friday morning, writing:\n\n2030 Ndeya Emmerson is the new hit song! Vamhu vavharisa Mutare. Im telling you, Mnangagwa is loved, my brothers and sisters  Ive never seen anything like this since 1980!\n\nHe added that the atmosphere in Mutare was electric, with party members chanting, dancing, and singing in praise of the 81-year-old leader. Mazizi vachiti Tonho Zvinoo, he exclaimed, celebrating what he called an unprecedented show of unity.\n\nMukungunugwa further claimed that the chants reflected a peoples resolution for Mnangagwa to stay in power until 2030.\n\nBecause the people have spoken! From all 10 provinces, grassroots to national level, members have gathered in Mutare to support Resolution Number 1: President ED Mnangagwa should continue leading until 2030. This is the peoples call, not the Presidents  a true reflection of the nations will and unity, he wrote.\n\nHowever, the singing and public displays of loyalty come amid growing reports of a widening rift between Mnangagwa and his deputy, Constantino Chiwenga. Analysts say the 2030 chants are part of a factional campaign to sideline Chiwenga and legitimize Mnangagwas bid to extend his stay in office beyond the constitutional limit.\n\nThe spectacle in Mutare, critics argue, signals the beginning of an intensified internal power struggle within ZANU PF as the succession debate heats up.\n\nThunderous ArrivalBecause the people have spoken!  From all 10 provinces grassroots to national level  members have gathered in Mutare to support Resolution Number 1: President ED Mnangagwa should continue leading until 2030. This is the peoples call, not the Presidents apic.twitter.com/e5ZShe0ih4\n\n2030 Ndeya Emmerson Is the New Hit song Vamhu  Vavharisa Mutare. Ndati Mnangagwa Unodiwa Hama Dzangu Handisati Ndamboona Zvakadai KUBVA 1980Mazizi vachiti Tonho Zvinoo @CrimeWatchZW@ali_naka@LynneStactia@KMutisi@MacBeltspic.twitter.com/AZaQthRLrA\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF loyalists broke into a new campaign-style song titled “2030 Ndeya Emmerson” during party activities in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/18/watch-mnangagwa-loyalists-explode-into-song-2030-ndeya-emmerson-at-zanu-pf-annual-conference-in-mutare/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Mnangagwa Loyalists Explode Into Song ‘2030 Ndeya Emmerson’ At Zanu PF Annual Conference in Mutare …\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Masasi Kids Granted Bail",
            "url": "https://www.zimeye.net/2025/10/18/masasi-kids-granted-bail/",
            "content": "Mutare, Zimbabwe  October 18, 2025  Two Masasi High School learners, aged 16 and 17, accused of gang-raping a 17-year-old schoolmate, have been released on US$200 bail each by Mutare High Court Judge, Justice Isaac Muzenda. The minors, whose identities are protected due to their age, were granted bail last week and placed under the custody of the Department of Social Development. They are currently writing their ZIMSEC Ordinary Level examinations, which began on Monday.\n\nThe accused, represented by Ms. Pamellah Musimwa and Ms. Tsitsi Masengure from Justice for Children Trust, were deemed suitable candidates for bail. Their legal team emphasized the boys desire to sit for their registered examinations. The State, represented by Mr. Malvern Musarurwa, did not oppose the bail application. Justice Muzenda ordered the minors not to interfere with witnesses, with their next court appearance to be scheduled after the completion of their exams.\n\nThe alleged victim, also 17, has been placed under the care of the Department of Social Development and is similarly writing her ZIMSEC examinations.\n\nThe two learners face serious charges under the Criminal Law (Codification and Reform) Act (Chapter 9:23):\n\nAccording to court documents, the incident occurred on February 8, 2025, at approximately 4 PM. The accused allegedly offered the complainant a drink that intoxicated her while they were walking home from school. They reportedly dragged her to a secluded forest area, where they took turns sexually assaulting her. The 16-year-old allegedly recorded the act, with the video later going viral on social media platforms after being shared with a friend. In the footage, the minors are heard praising themselves as soldiers while committing the assault, sparking widespread public outrage.\n\nThe viral video has fueled significant public anger, with many calling for justice for the victim. The case has raised concerns about school safety and the protection of minors. The Department of Social Development is providing support to both the accused and the complainant as investigations continue.\n\nThe court will reconvene after the ZIMSEC examinations to determine the next steps in the case. Authorities have urged the public to refrain from sharing the video to protect the victims dignity and ensure a fair trial.\n\nThis is a developing story, and further updates will be provided as new information emerges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare, Zimbabwe – October 18, 2025 – Two Masasi High School learners, aged 16 and 17, accused of gang-raping a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/18/masasi-kids-granted-bail/\">Continue reading<span class=\"screen-reader-text\"> \"Masasi Kids Granted Bail\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "VP Constantino Chiwenga Full Speech, “Wealth Must Benefit All Not Just The Few”",
            "url": "https://www.zimeye.net/2025/10/18/vp-constantino-chiwenga-full-speech-wealth-must-benefit-all-not-just-the-few/",
            "content": "It is my profound honor and privilege to stand before you today to introduce the guest of honour. His Excellency the president of the Republic of Zimbabwe and first secretary of our First Secretary of ZANU PF on the occasion of our 22nd ZANU PF Annual National Peoples Conference.\n\nThis is not merely another conference. It is the moment of reflection, renewal and recommitment to the timeless values that have carried our revolutionary party ZANU P.F. From the liberation struggle to the envisaged future. Distinguished guests, comrades and friends, holding this conference in Manicaland, is profound disembodied as the entire occupies a sacred place in the liberation story of our country.\n\nIt was a crucial gateway through which thousands of brave sons and daughters crossed into Mozambique to wage the struggle for our independence. Through these mountains behind us and worries, they sleep across the border, young, determined and full of conviction to break to bases such as Chimoio, Nyadzonya, and Tembe in Mozambique, those who crossed through Botswana and the Zambezi  and Freedom Camp in Zambia, among others.\n\nAnd in all respective camps, the prize of freedom was paid in full measure. Before they even fired a single shot, men and Jeward the ashes to conditions, such as disease, attacks by world animals, hunger and starvation. Far too men died, tenemblest, nameless deaths in the bush and under aerial bombardment. They perished not in battle, but in hope, believing that their sacrifices would purchase a just, dignified and prosperous Zimbabwe for all.\n\nThose camps in Mozambique and Zambia were not just in military art posts. They were altas of sacrifice, places where pain, courage and faith fused into the spirit of liberation. The cries of those who fell still echo across these hills. Their blood speaks from the soil, reminding us that our freedom was not inherited. It was end with suffering.\n\nThe spiritual being blood and consecrated by unwavering conviction. Today as we gather on this sacred ground, we are summoned by that same spirit. The spirit of endurance, oneness, unit and service. The foreign are watching us. Their blood demands integrity. Their voices cry out against oils, corruption, laziness and moral decay. The liberation struggle was a collective mission in which the masses, that is, the people, the youth traditionally does not children or played a decisive role. The welfare was peoples warfare. Everyone was either a best, a place to eat or a way of clothes were sold. Every family was part of their revolution. It was not born between the party and the people must remain unbroken. The same unit and the singleness of purpose. But drove our liberation struggle must be, must now be the moral compass guiding us into the future. We have a history which tells us which informed us to be where we are today. And today must inform the future. We must continue to move forward as one party. One people, one destiny, bound by a shared vision. Comrades and friends. Our theme this year, Attainment of Vision 2030 Through Economic Empowerment and value addition. Catch, catch, catch the central task before us. That is to build a peoples centered economy that empowers every Zimbabwean and ensures that our national wealth benefits all, not just appreciates the few. Economic empowerment must be genuine. Equipping all our people with the means to produce, innovate our own and innovate and own our own destiny. That is the essence of vision 2030 and that is the essence of the revolutionary continuity. We must always remember that we are not the Alpha and Omega of Zimbabwes journey. Our role is to carry forward, the torch passed to us by those who gave everything without expectation of reward. Some of them like our late commander, General Josiah Magama Tongogara knew they would not see any barriers in Zimbabwe. You were told openly when the day comes, that this country is going to be free, you will die. But you still fought until the last day. They fought for the future, not for themselves. Vision 2030 therefore must be understood in the same light as a party and a national covenant. is about the Zimbabwe we will be quick to the generations to come. ZANU PF stands where it is today because it has traveled a long demanding journey of vision, unity, sacrifice love and singleness of purpose. Distinguished ladies and gentlemen, in this atmosphere of reflection and re-commitment, it is my distinct honour to invite to the podium the president of the Republic of Zimbabwe and first secretary of ZANU pf, His Excellency comrades Dr Emmerson Dambudzo Mnangagwa, to addresses us and the nation at large. Pamberi neZANU PF!. Pamberi neZANU PF!. Na president, comrades Emmerson Mnangagwa! Pasi nemhandu!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "It is my profound honor and privilege to stand before you today to introduce the guest of honour. His Excellency … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/18/vp-constantino-chiwenga-full-speech-wealth-must-benefit-all-not-just-the-few/\">Continue reading<span class=\"screen-reader-text\"> \"VP Constantino Chiwenga Full Speech, “Wealth Must Benefit All Not Just The Few”\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Senator Morgan Femai Who Sold Out, Dies",
            "url": "https://www.zimeye.net/2025/10/17/senator-morgan-femai-who-sold-out-dies/",
            "content": "Veteran MDC Senator Morgan Femai Dies Amidst Sharp Divisions and Accusations of Betrayal\n\nBy ZimEye News | 17 October 2025\n\nZimbabwe has been plunged into mourning following the death of Senator Morgan Femai, a veteran politician and founding member of the Movement for Democratic Change (MDC). His passing, announced early Thursday morning, has sparked a wave of tributes  and controversy  within opposition circles and the wider political landscape.\n\nMDC stalwart Charlton Hwende was among the first to express condolences, calling Femai a true giant in the spheres of Zimbabwean politics and sport, and praising his role in laying the foundations of democratic opposition under the late President Morgan Tsvangirai. Hwende described Femai as a voice for the voiceless, whose unwavering courage and leadership helped shape Zimbabwes democratic struggle.\n\nHowever, beneath the tributes lies a deep vein of bitterness and political betrayal.\n\nUnder Hwendes Facebook post, several citizens  and apparent opposition supporters  voiced fierce disapproval of Femais legacy. Accusations of selling out the struggle, betraying the movement, and turning his back on the people filled the comment section. One user, Farayi Zambara, wrote: Hatidi kuchemai ikoko, hatiuye, no mercy for sellouts. Another, Innocent Munyanyiwa, remarked: No sellout will live longer.\n\nThe backlash reflects the ongoing divisions within Zimbabwes fragmented opposition, with many activists questioning the loyalty of veteran figures who aligned with state interests or accepted controversial government appointments. Some alleged that Femai had sold out the ideals of democratic change for political convenience in his final years.\n\nIn a biting comment, one user questioned Hwendes own silence over the current MDC infighting: Ko iwe Charlton hausi kuCongress kune vamwe vako sei?  a clear reference to the fractured state of the party and alleged selective solidarity.\n\nDespite the hostile reactions, some former colleagues like Jaison Matewu paid respectful tribute, saying: May his soul rest in peace.\n\nSenator Femai, who also served as a prominent figure in the Dynamos Football Club supporters leadership, leaves behind a mixed legacy  one marked by historic contributions to Zimbabwes democratic resistance, but now clouded by allegations of betrayal and political compromise.\n\nHis funeral arrangements have not yet been announced.\n\nZimEye will continue to monitor developments.\n\nSenator\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Veteran MDC Senator Morgan Femai Dies Amidst Sharp Divisions and Accusations of Betrayal By A Correspondent | Zimbabwe has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/senator-morgan-femai-who-sold-out-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Senator Morgan Femai Who Sold Out, Dies\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Granny Randomly Handpicked And Assaulted By Police Accused Of Backing Geza",
            "url": "https://www.zimeye.net/2025/10/17/granny-randomly-handpicked-and-assaulted-by-police-accused-of-backing-geza/",
            "content": "A passerby, Gogo Chirenje,  was randomly handpicked and heavily assaulted by officers before being bundled and taken to Harare Central Police station.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Murder of Joseph Mutangadura: 2nd Suspect Arrested",
            "url": "https://www.zimeye.net/2025/10/17/murder-of-joseph-mutangadura-2nd-suspect-arrested/",
            "content": "Harare  17 October 2025\n\nBy Dorrothy Moyo | The Zimbabwe Republic Police (ZRP) has announced a major breakthrough in the investigation into the shocking robbery and murder of businessman Joseph Mutangadura (67), which occurred at Mutangadura Hideout along Dunstan Road, Ruwa, on 17 August 2025.\n\nAccording to a press statement released today, the ZRP has confirmed the arrest of another suspect, Given Mandizadza (34), following the earlier capture of Phillip Mutasa (38) on 4 October 2025. Both men are believed to be connected to the violent crime that has sent shockwaves through the Ruwa community and beyond.\n\nPolice say detectives from the CID Homicide Department received a crucial tip-off that led them to track Mandizadza to the intersection of Robert Mugabe Road and Julius Nyerere Way in Harare, where he was arrested on 13 October 2025.\n\nDuring the dramatic arrest, investigators reportedly recovered a cache of weapons and explosives, including:\n\nThe ZRP commended members of the public for providing information that led to the arrest, urging continued cooperation as investigations progress.\n\nAuthorities believe the recovered weapons may have been used in a series of armed robberies and could provide vital forensic evidence in establishing the full circumstances behind Mr. Mutangaduras murder.\n\nMr. Mutangadura, a well-known businessman and proprietor of the Mutangadura Hideout, was attacked and killed in August in what investigators described as a targeted and violent robbery.\n\nThe latest arrest marks a significant development in a case that has gripped national attention. Police investigations are ongoing as detectives continue to pursue additional leads.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 17 October 2025 By Dorrothy Moyo | The Zimbabwe Republic Police (ZRP) has announced a major breakthrough in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/murder-of-joseph-mutangadura-2nd-suspect-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"Murder of Joseph Mutangadura: 2nd Suspect Arrested\"</span></a></p>",
            "time": "18:29",
            "date": "18 Oct 2025"
        }
    ]
}