{
    "news": [
        {
            "title": "LEAKED- Minister Ziyambi’s Law Bill To Change Constitution",
            "url": "https://www.zimeye.net/2025/04/21/leaked-minister-ziyambis-law-bill-to-change-constitution/",
            "content": "Minister of Justice Ziyambi Ziyambi recommends constitutional changes for Cabinet approval-SummaryPurpose of the Bill:To amend the Constitution of Zimbabwe to:Extend the term of Parliament and the Presidency in the national interest.Reform electoral functions andpic.twitter.com/glAs8MZvay\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "Fresh Details Emerge In The Death Of Pope Francis",
            "url": "https://www.zimeye.net/2025/04/21/fresh-details-emerge-in-the-death-of-pope-francis/",
            "content": "Vatican City The Vatican has said Pope Francis Pope died of a stroke and subsequent irreversible heart failure.\n\nThePopedied early Monday, and his death marks not just the end of a papacy but also the closing chapter of one of the most transformative eras in the modern Catholic Church.\n\nRevered as the Peoples Pope, Francis, who passed thismorning, willbe rememberedfor reshaping the Churchs tone and posture inways both subtle and profound.\n\nBut as the world mourns this towering spiritual figure, a centuries-old process quietly moves into motion  the sacred, symbolicandhighly ceremonial rites that follow the death of a pope.\n\nPope Francis, born Jorge Mario Bergoglio in Buenos Aires, Argentina, was the first Jesuit pope, the first from the Americas, and the first non-European in more than 1,200 years. Throughout his 12-year papacy, he steered the Church toward humility, social justice, and environmental stewardship, often drawingbothadmiration and criticism for his candid remarks and reformist zeal.\n\nHe emphasized compassion over condemnation and inclusivity over rigidity  a style rooted in the simplicity of his Jesuit background.\n\nIn November 2024, just months before his death, the Vatican confirmed that Pope Francis had revised the rites for papal funerals.\n\nHis wish was clear: strip away excessive pomp to emphasize the pastoral nature of his mission  the funeral of a shepherd and disciple of Christ, not of a powerful man of this world, said Monsignor Diego Ravelli, the Vaticans master of liturgical ceremonies.\n\nSo, what happens when a pope dies?\n\nThe first step is certification of death, a solemn task carried out by theCamerlengo, the cardinal who temporarily oversees Church affairs between pontificates.\n\nIn this case,Cardinal Kevin Farrell, thecamerlengo, pronounced the papal name Franciscus three times.\n\nWhen no response followed, the death was declared official. Farrell then notifiedCardinal Vicar Baldassare Reinaof the Roman Diocese and issued a death certificate.\n\nOne of the most symbolic acts comes next: thedestruction of the papal ring.\n\nKnown as theRing of the Fisherman, it represents thepopesauthority and is ceremonially crushed with special shears to prevent forgery and mark the end of his reign.\n\nFollowing tradition, thepapal apartmentsare sealed, a practice that dates back centuries to prevent looting and interference with personal effects and private correspondence.\n\nPope Francis body, dressed in simple papal garments, will lie in state atSt. Peters Basilicafor public viewing.\n\nThisbegins theNovemdiales, a nine-day mourning period rooted in ancient Roman traditions.\n\nDuring this time, daily Masses and prayersare held, culminating in the funeral and burial.\n\nWhile most popes in recent history have opted for elaborate arrangements,Francisowninstructionsinsisted on amodest funeral.Instead of being encased in the traditional triple coffin  cypress, lead, and oak Francis will be laid to rest in a single, zinc-lined wooden casket, according toReuters.\n\nHe also reportedly declined embalming, favoring a more natural return to the earth, in contrast to many predecessors.\n\nNotably,Pope John Paul IImade a similar choice, whilePope John XXIII, embalmed and entombed in an airtight coffin, was famously found to be incorrupt when exhumed in 2001.\n\nUntil a new pope is elected, the Church enters a period known assede vacante the Seat is Vacant.\n\nDuring this time, thecamerlengoand a small group of senior cardinals manage the daily affairs of the Church but cannot introduce newpolicyordoctrine.\n\nWithin 15 to 20 days, theCollege of Cardinals all under age 80  will conveneinconclaveto elect the nextpope.\n\nThe processis steepedin secrecy, with ballots burned after each vote. Black smoke signals an inconclusive vote; white smoke tells the worldhabemus papam we have a pope.\n\nFrancis papacy may be over, but his imprint on the Catholic Church and the world will not fade. He was a pontiff who urged the Church to smell like the sheep, to walk with the poor, and to serve as a field hospital in a wounded world.\n\nEven in death, his choices  from funeral rites to burial style  reinforce his commitment to simplicity, service, and faith.\n\nAs millions of faithful gather, mourn, and reflect, the Church preparesnot justto bury apope,but tocarry forward a legacy of mercy, justice, and humility that defined one of its most beloved modern leaders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Vatican City — The Vatican has said Pope Francis Pope died of a stroke and subsequent irreversible heart failure. The Pope died early … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/21/fresh-details-emerge-in-the-death-of-pope-francis/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh Details Emerge In The Death Of Pope Francis\"</span></a></p>",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "Police Panic Over Geza’s Impending Shutdown",
            "url": "https://www.zimeye.net/2025/04/21/police-panic-over-gezas-impending-shutdown/",
            "content": "By Jamers Gwati-In what appears to be a clear sign of panic, the Zimbabwe Republic Police (ZRP) has issued a stern warning against participation in a planned two-day national shutdown led by ex-combatant Blessed Geza, also known as Cde Bombshell.\n\nThe shutdown, set for Tuesday and WednesdayApril 22 and 23is Gezas latest attempt to force President Emmerson Mnangagwa out of office.\n\nIt follows last months protests in Harare, which saw over 100 people arrested in whatwas widely viewedas the first wave of visible resistance against Mnangagwas authoritarian rule.\n\nDespite these arrests and a warrant out for hisownarrest, Geza remains defiant, calling on Zimbabweans to stay at home in a peaceful show of disobedience.\n\nThis is to send a strong message to Mnangagwa and hiszvigananda, Geza said in a viral online broadcast. Shops and industries must not open. Kombis should be parked. The police will not teargas youbut if they come, you have the right to defend yourselves.\n\nIn a statement Monday, the ZRP said it had deployed officers nationwide to maintain law and order, particularly in urbancentres, residential areas, and industrial zones.\n\nAlthough the police did not explicitly name Geza or the shutdown, their language left little doubt.\n\nIn this regard, the police will arrest anyone who interferes with the smooth flow of traffic and the movement of the public, the statement reads.\n\nThe police also warned citizens against abusing social media and urged them to ignore what they called social media postings meant to cause chaos and alarm in the country.\n\nThe timing of the ZRPs response appears designed to reassure both local and international visitors expected at this years Zimbabwe International Trade Fair (ZITF) in Bulawayo, which coincides with the planned protests.\n\nBut critics say the authorities hardline stance reflects a government increasingly afraid of itsowncitizens.\n\nWith the economy in freefall, widespread corruption, and a collapsing public service, discontent is risingand fast.\n\nGezas call to action has struck a chord, especially with unemployed youths, frustrated civil servants, and disillusioned war veterans.\n\nFrom hiding, he has continued to rally support through social media, describing the stay-away as one of the few remaining peaceful tools left for resisting Zimbabwes authoritarian drift.\n\nMnangagwa has captured the judiciary and suspended Parliament at will, Geza said. Zimbabwe is now one of the few countries in the world where the right to protest no longer exists. But weve discovered that staying at home is a powerful weapon.\n\nSince seizing power in a 2017 military coup, Mnangagwa has promised a Second Republic and a break from Robert Mugabes repressive legacy.\n\nBut nearly eight years later, those promises have faded into disillusionment.\n\nThe Zimbabwean dollar has collapsed. Inflation is rampant. Basic goods are unaffordable for the majority. Salariesespecially in the public sectorare eroded within days of being paid.\n\nCorruption scandals involving COVID-19 funds, gold smuggling, and shady procurement deals have gone unpunished, with manyof thealleged perpetrators linked to Mnangagwas inner circle. Meanwhile, journalists, human rights defenders, and opposition activists continue to face arrest, harassment, and persecution.\n\nThe Presidentis also accusedof dismantling key democratic institutions to cement his grip on power. Parliament hasbeen sidelined.\n\nThe judiciaryis stackedwith loyalists. Promised electoral reforms have not materialized.\n\nAndthe Zimbabwe Electoral Commission (ZEC) remains discredited after overseeing elections tainted by irregularities, voter suppression, and allegations of rigging.\n\nInternally, ZANU PFis increasingly divided. Behind Mnangagwas strongman persona lies a party riven by factionalism.\n\nVice President Constantino Chiwengawho led the 2017 coupis said to be quietly consolidating his influence withinboththe military and the party, sparking growing tensions ahead of the next ZANU PF congress.\n\nIn his Independence Day address on April 18 in Gokwe, Mnangagwa issued a thinly veiled threat to social media activists accused of inciting unresta clearjab at Geza and otherswho have beenusing digital platforms to mobilize resistance.\n\nBut Geza remains undeterred.\n\nIm pleading with you to stay home, he said in a final rallying cry. I know its hardwere living from hand to mouth. But this is our only hope to make Mnangagwa hear us. We are staying away to force him to step down.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Jamers Gwati-In what appears to be a clear sign of panic, the Zimbabwe Republic Police (ZRP) has issued a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/21/police-panic-over-gezas-impending-shutdown/\">Continue reading<span class=\"screen-reader-text\"> \"Police Panic Over Geza’s Impending Shutdown\"</span></a></p>",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "King Bulelani Lobengula Khumalo in Bulawayo",
            "url": "https://www.zimeye.net/2025/04/21/king-bulelani-lobengula-khumalo-in-bulawayo/",
            "content": "The City of Kings and Queens -Bulawayo today. hosted King Bulelani Lobebgula Khumalo at the City Hall Municipal Building.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The City of Kings and Queens -Bulawayo today. hosted King Bulelani Lobebgula Khumalo at the City Hall Municipal Building.",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "Matabeleland Region a Hub of rich culture",
            "url": "https://www.zimeye.net/2025/04/21/matabeleland-region-a-hub-of-rich-culture/",
            "content": "Chief Mbusi Bekithemba Dakamela Cultural event held in Nkayi the least developed district in Zimbabwe with the worst road network but rich in culture.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chief Mbusi Bekithemba Dakamela Cultural event held in Nkayi the least developed district in Zimbabwe with the worst road network … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/21/matabeleland-region-a-hub-of-rich-culture/\">Continue reading<span class=\"screen-reader-text\"> \"Matabeleland Region a Hub of rich culture\"</span></a></p>",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "D-Day For ED As Geza Flexes Muscle",
            "url": "https://www.zimeye.net/2025/04/21/d-day-for-ed-as-geza-flexes-muscle/",
            "content": "By Munacho GwamandaHarare could be on the verge of amajorpolitical tremor following war veteran Blessed Bombshell Runesu Gezas weekend call for another national shutdown aimed at forcing President Emmerson Mnangagwa out of office.\n\nThis latest push comes despite the continued detention of more than 100 citizens arrested during last months protests in Hararean uprising thatmarked the first wave of visible resistance against Mnangagwas rule.\n\nGeza, the architect behind the widely observed shutdown in March, isonceagain rallying Zimbabweans to stay home on April 22 and 23, 2025.\n\nHe describes the planned action as a powerful yet peaceful demonstration of defiance.\n\nOnTuesday and Wednesday, the 22nd and 23rd of April, everyone must stay home.We must shut down Zimbabwe completely, Geza declared in a viral online broadcast.\n\nThis is to send a strong message to Mnangagwa and hiszvigananda. Shops and industries must not open. Kombis should be parked. The police will not teargas youbut if they come, you have the right to defend yourselves.\n\nIn a country where public demonstrations are effectively bannedandcivil liberties continue tobe eroded, Geza argues that stay-aways have become one of the few non-violent tools left for resisting authoritarian rule.\n\nMnangagwa has captured the judiciary and suspended Parliament at will. Zimbabwe is now one of the few countriesin the worldwhere the right to protest no longer exists. But weve discovered that staying at home is a powerful weapon, he said.\n\nDespite a nationwide warrant for his arreston charges including theft, incitement to violence, and undermining the authority of the PresidentGeza remains defiant.\n\nOperating from hiding, he has turned to social media to mobilize support, gaining a significant following among unemployed youth, disillusioned war veterans, and ordinary citizens frustrated with thestate of the nation.\n\nGezas renewed call for action comes as public anger over Mnangagwas failed leadershipcontinues to grow.\n\nWhen Mnangagwa seized power in a 2017 military coup, he promised a Second Republic and a break from Robert Mugabes authoritarian past.\n\nBut nearly eight years later, those hopes have faded.\n\nZimbabwes economy is in freefall.\n\nInflation is out of control. The Zimbabwean dollar continues to lose value.\n\nBasic commodities are out of reach for many, and civil servants salariesarewiped outwithin days of payment.\n\nCorruption scandalsincluding the looting of COVID-19 funds, rampant gold smuggling, and shady procurement dealshave gone unpunished, often implicating those within Mnangagwas inner circle.\n\nMeanwhile, journalists, opposition leaders, and human rights defenders face relentless harassment and arrest.\n\nPeaceful dissentis criminalized, and the mediais tightly controlled.\n\nMnangagwa is also accused of dismantling democratic institutions to entrench his grip on power.\n\nParliament hasbeen sidelined.\n\nThe judiciaryis packedwith loyalists. Promised electoral reforms never came to pass.\n\nThe Zimbabwe Electoral Commission (ZEC) remains discredited after presiding over deeply flawed elections marred by irregularities, intimidation, andvote-rigging.\n\nInternally, ZANU PFis increasingly divided.\n\nBehind Mnangagwas strongman image lies a party gripped by factionalism.\n\nVice President Constantino Chiwengawho led the 2017 coupis said to be quietly consolidating power withinboththe party and the military.\n\nTensions between the Mnangagwa and Chiwenga camps are reportedly escalating ahead of the next party congress.\n\nDuring his Independence Day speech in Gokwe on 18 April, Mnangagwa issued a thinly veiled warning to social media activists accused of inciting unresta clearjab at Geza and others galvanizing citizens online.\n\nStill, Geza remains undeterred.\n\nIm pleading with you to stay home. I know its hardwere living from hand to mouth. But this is our only hope to make Mnangagwa hear us. We are staying away to force him to step down.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda–Harare could be on the verge of a major political tremor following war veteran Blessed “Bombshell” Runesu Geza’s weekend call … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/21/d-day-for-ed-as-geza-flexes-muscle/\">Continue reading<span class=\"screen-reader-text\"> \"D-Day For ED As Geza Flexes Muscle\"</span></a></p>",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "Valverde Goal Sinks Athletic Club",
            "url": "https://www.zimeye.net/2025/04/21/valverde-goal-sinks-athletic-club/",
            "content": "Sports Correspondent\n\nReal Madrid secured a crucial 1-0 win over Athletic Club at the Santiago Bernabu, thanks to a stunning 93rd-minute volley from Federico Valverde.\n\nThe victory keeps Los Blancos in the hunt for the La Liga title, although they trail league leaders Barcelona by seven points.\n\nWith their league lead in mind, Real Madrid knew they had to deliver against Athletic Club.\n\nThe pressure on Carlo Ancelottis managerial position has intensified following a poor run of form in April, which included a Champions League exit at the hands of Arsenal.\n\nIn Kylian Mbappes absence due to suspension, Ancelotti reverted to the diamond formation that yielded significant success last season.\n\nJude Bellingham returned to his role at the top of the diamond, while Federico Valverde and Eduardo Camavinga played as full-backs, utilizing their versatility to support the team.\n\nThe matchs only goal came courtesy of Valverdes spectacular late strike, which sealed the win for Real Madrid and kept their title aspirations alive.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Real Madrid secured a crucial 1-0 win over Athletic Club at the Santiago Bernabéu, thanks to a stunning … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/21/valverde-goal-sinks-athletic-club/\">Continue reading<span class=\"screen-reader-text\"> \"Valverde Goal Sinks Athletic Club\"</span></a></p>",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "Shock As Zanu PF Varakashi Mock The Late Marabha",
            "url": "https://www.zimeye.net/2025/04/21/shock-as-zanu-pf-varakashi-mock-the-late-marabha/",
            "content": "By A Correspondent\n\nThe death of much-loved comedian Charles Mapalume, affectionately known as Marabha, has been met with a wave of grief across Zimbabwe. However, the sorrow was overshadowed by outrage as some Zanu PF-aligned social media users, known as Varakashi, took to Facebook to mock the late comedian.\n\nMarabha, who passed away over the weekend after a long illness, was a beloved figure in Zimbabwes entertainment scene, known for his iconic skits and comedic timing. But instead of condolences, certain Zanu PF youth supporters used the opportunity to rekindle an old political grudge.\n\nIn a widely circulated Facebook post, one Varakashi wrote:Ndanzwa kuti kunhamo kwamarabha vanyimwa body vashaya mari $200. Ndozvinoitika izvi ukatuka vakuru. Do you remember video rake President vachiti 2030 ndenge ndichipo iye akati tokumamisa. Now ndiani amamiswa manje. Kunyadzisa nemuguva nemuguva. Respect your elders.\n\nThe post refers to a viral comedy clip from years back in which Marabha was accused of mocking President Emmerson Mnangagwas 2030 vision. The Varakashi insinuated that Marabhas misfortunes were a result of his past disrespect.\n\nAnother comment added fuel to the fire, stating:Zvekunzi afa anaka zviya haa hameno. Uyu akanditukira Baba Vangu murume akarara apo uyu.(Translation: That saying about the dead being good people, well I dont know. This man insulted my father, now he lies lifeless.)\n\nThe comments sparked widespread backlash from members of the public and social media users who condemned the lack of empathy and politicisation of Marabhas passing.\n\nEven in death, this is the cruelty we have to endure, said one Twitter user. Marabha made people laugh. He was not a politician. Show some humanity.\n\nCultural analysts and media commentators have also weighed in, warning against the growing trend of cyberbullying and the toxic politicisation of public discourse in Zimbabwe.\n\nMarabha brought joy to many. The attempt to reduce his legacy to a single comedy clip taken out of context is not only unfair but reflects the erosion of values in our political culture, said media scholar Dr. Tinashe Chikomo.\n\nAs preparations for his burial continue, fans and fellow artists have called for Marabha to be remembered for the smiles he brought to millions  not for the political divisions others now try to attach to his name.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The death of much-loved comedian Charles Mapalume, affectionately known as Marabha, has been met with a wave … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/21/shock-as-zanu-pf-varakashi-mock-the-late-marabha/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Zanu PF Varakashi Mock The Late Marabha\"</span></a></p>",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "Harare Shut Down, Barely Any Movement Of Cars | How Will ED Manage To Run Country Like This?",
            "url": "https://www.zimeye.net/2025/04/21/harare-shut-down-barely-any-movement-of-cars-how-will-ed-manage-to-run-country-like-this/",
            "content": "Harare CBD is very slow today, with unusually low traffic for an Easter  holiday as Geza calls for stay away!pic.twitter.com/jOmyZnuY1A\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:43",
            "date": "22 Apr 2025"
        },
        {
            "title": "What On Earth Was Emmerson Mnangagwa Thinking About His Boss ?",
            "url": "https://www.zimeye.net/2025/04/21/what-on-earth-was-emmerson-mnangagwa-thinking-about-his-boss/",
            "content": "What on earth was Emmerson Mnangagwa thinking while serving under Robert Mugabe?pic.twitter.com/neFF4HtN3T\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:43",
            "date": "22 Apr 2025"
        }
    ]
}