{
    "news": [
        {
            "title": "Horror Crash at Sunway City on Mutare Road – Multiple Injuries, No Ambulance on Scene | CHECK WITH YOUR RELATIVES",
            "url": "https://www.zimeye.net/2025/06/04/horror-crash-at-sunway-city-on-mutare-road-multiple-injuries-no-ambulance-on-scene/",
            "content": "Marondera, Zimbabwe  4 June 2025\n\nBy A Correspondent | ZimEye | A horrific road traffic accident occurred late Wednesday night on the HarareMutare Highway between Zimra Park and Sunway City, leaving a car mangled beyond recognition and its passengers trapped in the wreckage.\n\nEyewitnesses at the scene reported that no ambulance or emergency response team had arrived more than 30 minutes after the crash, as bystanders desperately tried to rescue the injured from the twisted remains of the vehicle.\n\nSeveral passengers were seen bleeding profusely, pulled from the wreckage by hand. Among them was a minor girl who was dragged out alive in what one eyewitness described as a miracle. However, her mother remained stuck inside the car, reportedly too injured to move, and was last seen struggling to sit up as good Samaritans tried to comfort her.\n\nOne of the casualties is believed to be a police officer, identifiable by a uniform jersey with three stars on the shouldertypically indicating the rank of Inspector.\n\nThe passengers were en route towards Mutare.\n\nThis is horrifying. We are just watching people bleed with no ambulance in sight. The car is beyond recognition, said a witness at the scene, visibly shaken.\n\nTraffic has come to a standstill in the area, as bystanders and motorists have gathered, some attempting to assist, while others record the unfolding tragedy.\n\nThe cause of the crash remains unknown at this stage. Authorities are yet to comment or confirm the number of casualties.\n\nThis developing story is under investigation. Stay tuned for updates.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Marondera, Zimbabwe – 4 June 2025 By A Correspondent | ZimEye | A horrific road traffic accident occurred late Wednesday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/horror-crash-at-sunway-city-on-mutare-road-multiple-injuries-no-ambulance-on-scene/\">Continue reading<span class=\"screen-reader-text\"> \"Horror Crash at Sunway City on Mutare Road – Multiple Injuries, No Ambulance on Scene | CHECK WITH YOUR RELATIVES\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "🚨 BREAKING: Gold Miner Destroys Railway Line in Mvuma, Arrested by NRZ",
            "url": "https://www.zimeye.net/2025/06/04/%f0%9f%9a%a8-breaking-gold-miner-destroys-railway-line-in-mvuma-arrested-by-nrz/",
            "content": "Mvuma, Zimbabwe  4 June 2025\n\nBy Business Reporter | ZimEye | A gold panner has been arrested after digging directly beneath an active railway line in Mvuma, causing significant structural damage to the track, the National Railways of Zimbabwe (NRZ) has confirmed.\n\nIn a statement issued via its official social media platform, the NRZ said the suspect was apprehended by its loss control personnel on Sunday. The damage was discovered during routine inspections, with images showing a large trench excavated underneath the railway line  a serious threat to rail operations and public safety.\n\nAn artisanal gold miner was arrested by NRZ loss control personnel on Sunday while digging for gold under the railway tracks in Mvuma. As can be seen from the picture, the miner caused extensive damage to the ground under the tracks, the NRZ\n\nThe NRZ has since warned the public not to carry out mining within the railway reserve  an area that extends 45 metres on either side of railway lines  noting that such activities are illegal.\n\nIt is an offence under the Railways Act to prospect for minerals within the railway reserve and is punishable by up to 10 years in jail, the statement added.\n\nReacting to the incident, Donald Nyarota, Communications and Advocacy Officer at the Centre for Natural Resource Governance (CNRG), said the damage is not merely an isolated act of illegality, but a symptom of a broader failure in mineral governance.\n\nThis incident reflects a deeper crisis  communities are destroying national infrastructure out of desperation, while mining companies extract billions without developing the areas they operate in, Nyarota said.\n\nThis incident should be a wake-up call  not just about the risks of illegal mining, but about the deeper failures of mineral governance that continue to drive an extractivist agenda that is capital driven. As we condemn illegal mining in protected areas such as railway reserves, this incident must also compel the government, mining authorities, and private companies to confront the root causes of such acts. Communities are increasingly resorting to desperate and unsafe mining practices due to exclusion from formal mining benefits, widespread poverty, and the lack of development in mineral-rich areas.\n\nAuthorities have not yet disclosed the identity of the arrested miner. The NRZ says an engineering team has been dispatched to assess and repair the damage before any trains resume service on the affected line.\n\nThe time has come for African govts to pass a law imposing mandatory rail construction development on every mining claim, and mandatory diploma training certificate in smelting from raw to finished products. In such a move every mining claim holder must construct at least 5km of railway from their mine to the nearest community centre.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mvuma, Zimbabwe – 4 June 2025 By Business Reporter | ZimEye | A gold panner has been arrested after digging … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/%f0%9f%9a%a8-breaking-gold-miner-destroys-railway-line-in-mvuma-arrested-by-nrz/\">Continue reading<span class=\"screen-reader-text\"> \"🚨 BREAKING: Gold Miner Destroys Railway Line in Mvuma, Arrested by NRZ\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Zanu PF’s Matutu Issued with Arrest Warrant",
            "url": "https://www.zimeye.net/2025/06/04/zanu-pfs-matutu-issued-with-arrest-warrant/",
            "content": "By A Correspondent | ZimEye | Harare magistrate Winfridah Tiyatara has issued a warrant for the arrest of former Zanu PF youth leader Lewis Matutu after he failed to appear in court for his fraud trial.\n\nMatutu stands accused of defrauding a mining company, Shisib Investments, of US$150,000 by allegedly stealing shares from the company.\n\nHe faces charges alongside four co-defendants: Blessing Kusangaya, Tafadzwa Kusangaya, Muzimba Muhamba, and Chisakwa Muhamba.\n\nThe State alleges that the group collaborated to prepare fraudulent annual returns dated April 30, 2018, which included forged signatures.\n\nThese falsified documents were intended to alter the shareholding structure of Shisib Investments, unlawfully designating the accused as majority shareholders.\n\nAs a result of these actions, the complainant, Sibanda, was deprived of US$150,000, and none of the funds have been recovered. The States claims indicate that in 2018, Matutu and his accomplices concocted a scheme to illegally acquire shares in the mining company.\n\nThey allegedly backdated annual returns for the years 2014, 2016, 2017, and 2018, forging the signatures of both the complainant and Lyton Shumba, falsely claiming these individuals had signed off on the returns, listing the complainant as director and Shumba as secretary.\n\nThe returns were filed at the Registrar of Companies, presenting false information regarding changes in shareholding and directorship of Shisib Investments. This act falsely indicated that the accused had allotted themselves shares in the company, thereby establishing themselves as the majority shareholders, the prosecution asserted.\n\nThe scheme reportedly came to light on September 30, 2024, when the complainant was informed by the Department of Parks and Wildlife that the accused had instructed the agency to suspend all mining operations.\n\nThey allegedly claimed to be shareholders who had agreed to sell the mining claim, prompting the department to request a meeting with representatives from Shisib Investments.\n\nFurthermore, utilising the illegally acquired shares, the accused attended an Annual General Meeting (AGM) on November 19, 2024, during which they removed the complainant from his directorship and resolved to change the companys registered address.\n\nAs a direct consequence of the accuseds actions, the complainant suffered significant financial prejudice amounting to US$150,000, with no recovery of the lost funds, according to the States allegations.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Harare magistrate Winfridah Tiyatara has issued a warrant for the arrest of former Zanu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/zanu-pfs-matutu-issued-with-arrest-warrant/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF’s Matutu Issued with Arrest Warrant\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "VP Chiwenga Addresses African Presidents As Soldiers Flood Harare Suburbs",
            "url": "https://www.zimeye.net/2025/06/04/vp-chiwenga-addresses-african-presidents-as-soldiers-flood-harare-suburbs/",
            "content": "By A Correspondent-Vice President Constantino Chiwenga on Tuesday addressed African Heads of State and Government on the continents ongoing battle against cholera, even as the streets of Harare saw an increased presence of army personnel in what authorities claim is a routine military training exercise.\n\nChiwenga, standing in for President Emmerson Mnangagwa, delivered his speech virtually during an Extraordinary High-Level Meeting focused on the regional response to cholera outbreaks.\n\nIn his address, Chiwenga urged African nations to move beyond reactive, crisis-driven responses and instead adopt long-term strategies aimed at eliminating cholera from vulnerable communities across the continent.\n\nThe President encourages the continent to shift from reactive to proactive approaches and act decisively to eradicate cholera once and for all, Chiwenga said.\n\nBut even as the Vice President spoke of regional health concerns, developments back home struck a different tone.\n\nTroops in the Streets\n\nOn Tuesday, the Zimbabwe National Army (ZNA) announced it would be conducting a three-day military field training exercise in several residential suburbs of Harare.\n\nThe operation, which runs from 3 to 6 June, is taking place in Glen View, Glen Norah, Kuwadzana, Dzivarasekwa, Mt Hampden, and Westgate, with notable military movements along Solomon Mujuru Road (formerly Kirkman Road).\n\nIn a public notice, Colonel Hlengiwe Dube, the ZNAs Director of Public Relations, assured citizens that the exercises were standard procedures aimed at maintaining operational readiness.\n\nThe exercise will be conducted during daytime and will not affect the general publics daily routine. The public is therefore requested not to panic, read the statement.\n\nUneasy Parallels with 2017\n\nDespite assurances from the army, the sudden deployment of troops in urban residential areas has triggered anxiety among citizens.\n\nMany still vividly recall the events of November 2017, when military vehicles rolled into Harare under the guise of a routine operation.\n\nWithin days, then-President Robert Mugabe was placed under house arrest and eventually resigned, ending his nearly four-decade-long rule.\n\nThat operation, led by then-General Constantino Chiwenga, was described by the military as a non-coup, but widely recognised as a de facto coup dtat. Today, Chiwenga occupies the second-highest office in government.\n\nThe current military mobilisation comes at a time of rising internal tensions within the ruling Zanu PF party, prompting speculation about the political undercurrents behind the drills. While the army maintains that the exercises are purely logistical and apolitical, the timing has led some observers to draw parallels with previous power plays.\n\nPublic Reaction and Official Advice\n\nResidents in the affected suburbs have reported unease, with some taking to social media to voice concerns over the symbolism and timing of the drills. Community leaders and civil society groups have called on authorities to provide clearer communication and greater transparency about the scope and nature of the exercises.\n\nIn the meantime, the ZNA has urged the public to remain calm, cooperate with military convoys, and channel any inquiries to the armys Public Relations office at Josiah Magama Tongogara Barracks.\n\nAs Chiwenga projects diplomatic calm abroad and soldiers roll through Harares western suburbs, Zimbabweans are once again reminded that in their country, political developments are rarely straightforwardand never without consequence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Vice President Constantino Chiwenga on Tuesday addressed African Heads of State and Government on the continent’s ongoing battle … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/vp-chiwenga-addresses-african-presidents-as-soldiers-flood-harare-suburbs/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Addresses African Presidents As Soldiers Flood Harare Suburbs\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Grim Conditions At Harare Remand Prison",
            "url": "https://www.zimeye.net/2025/06/04/grim-conditions-at-harare-remand-prison/",
            "content": "By Crime and Courts Reporter-The Zimbabwe Human Rights Commission (ZHRC) has condemned the appalling conditions at Harare Remand Prison following a recent monitoring visit, citing numerous human rights violations and systemic neglect.\n\nThe ZHRC delegation, led by Chairperson Jessie Fungayi Majome, toured the facility in response to mounting public outcry over the continued detention of individuals arrested in politically sensitive cases. The visit, conducted under the Commissions constitutional mandate, was aimed at assessing the treatment of detainees and identifying possible violations of their rights.\n\nA System in Crisis\n\nZimbabwes prisons have long been plagued by overcrowding, poor sanitation, inadequate healthcare, and food shortages. Harare Remand Prison, in particular, has become symbolic of the broader crisis within the countrys penal system. Originally built to accommodate fewer inmates, the facility now houses far more than its intended capacity, with many detainees languishing for monthsor even yearsawaiting trial.\n\nThe countrys collapsing economy and chronic underfunding of the Zimbabwe Prisons and Correctional Service (ZPCS) have worsened the situation. With dilapidated infrastructure, intermittent water supply, and insufficient medical staff, prisons have become sites of suffering rather than rehabilitation. Inmates are often forced to share overcrowded cells without access to adequate bedding, sanitation, or ventilation. Diseases such as tuberculosis and scabies are common, and mental health support is virtually nonexistent.\n\nFindings from the ZHRC Visit\n\nDuring the recent visit, the ZHRC identified numerous critical issues at Harare Remand Prison:\n\nCall for Immediate Reforms\n\nIn a strongly worded statement, the Commission called on authorities to urgently address the violations and uphold constitutional guarantees, including the right to bail.\n\nBail is a constitutional right unless compelling reasons justify continued detention, said the Commission. We urge the expeditious processing of all pending bail applications, particularly for pre-trial detainees facing non-violent charges.\n\nThe ZHRC also called for:\n\nImmediate Interventions and Promises\n\nDuring the visit, the ZHRC secured several on-the-spot commitments from the prison authorities. These included:\n\nAdditionally, the Commission wrote to TelOne requesting urgent repairs to the prisons phone lines and promised to liaise with the University of Zimbabwe to support detained students in writing missed and upcoming examinations.\n\nThe Commission also facilitated communication between 94 protest detainees and their legal representatives to ensure that grievances were heard and legal rights protected.\n\nContinuing Oversight\n\nThe Commission will continue monitoring progress on these human rights and administrative justice issues, said ZHRC in its concluding remarks. The dignity and rights of all individualsincluding those in detentionmust be upheld without exception.\n\nAs Zimbabwe grapples with deepening political and economic instability, the spotlight on its prison system underscores the urgent need for reform, transparency, and justice. For the hundreds trapped behind bars without due process, change cannot come soon enough.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-The Zimbabwe Human Rights Commission (ZHRC) has condemned the appalling conditions at Harare Remand Prison following … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/grim-conditions-at-harare-remand-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Grim Conditions At Harare Remand Prison\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Gamecocks Face PSL Disciplinary Action",
            "url": "https://www.zimeye.net/2025/06/04/gamecocks-face-psl-disciplinary-action/",
            "content": "Sports Correspondent\n\nChicken Inn FC has been summoned to appear before the Premier Soccer League (PSL) Disciplinary Committee following the abandonment of their Castle Lager Premier Soccer League match against Scottland FC at Rufaro Stadium on Friday, 23 May 2025.\n\nIn an official statement, the PSL said: Chicken Inn FC have been charged for acts of misconduct that include disorderly conduct, failure by players and officials to comply with lawful orders, disturbing the normal proceedings of a match, and causing the abandonment of the match.\n\nThe league also confirmed that Chicken Inn player George Majika is facing individual charges. George Majika has been charged with disorderly conduct and failure to comply with lawful orders, the statement read.\n\nThe disciplinary hearing is scheduled to take place at the PSL offices on Thursday, 26 June 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Chicken Inn FC has been summoned to appear before the Premier Soccer League (PSL) Disciplinary Committee following the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/gamecocks-face-psl-disciplinary-action/\">Continue reading<span class=\"screen-reader-text\"> \"Gamecocks Face PSL Disciplinary Action\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Inzaghi Quits Inter After Champions League Humiliation",
            "url": "https://www.zimeye.net/2025/06/04/inzaghi-quits-inter-after-champions-league-humiliation/",
            "content": "Sports Correspondent\n\nSimone Inzaghi has stepped down as head coach of Inter Milan after four years at the helm, bringing an end to a tenure marked by domestic success but European disappointment.\n\nThe decision comes in the wake of a crushing 0-5 defeat to Paris Saint-Germain in the UEFA Champions Leaguea result widely viewed as the final straw. The humiliating loss intensified scrutiny over Inzaghis leadership and ultimately prompted his exit.\n\nInzaghi is now poised to take on a new challenge in the Middle East, as he prepares to become the new head coach of Saudi Arabian giants Al Hilal. Sources close to the negotiations say he is expected to lead the team into the upcoming FIFA Club World Cup.\n\nThe Italian leaves Inter having won multiple domestic titles, including a Serie A title and two Coppa Italia trophies. Despite his success at home, his Champions League campaigns were often inconsistent, culminating in the embarrassing exit this season.\n\nInter are yet to announce a replacement, but club officials are reportedly already searching for a new manager to guide them into the next phase.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Simone Inzaghi has stepped down as head coach of Inter Milan after four years at the helm, bringing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/inzaghi-quits-inter-after-champions-league-humiliation/\">Continue reading<span class=\"screen-reader-text\"> \"Inzaghi Quits Inter After Champions League Humiliation\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Police Release Veteran Journalist Without Charge After Arresting Him For Clearing Grass At Roadside …",
            "url": "https://www.zimeye.net/2025/06/04/police-release-veteran-journalist-without-charge-after-arresting-him-for-clearing-grass-at-roadside/",
            "content": "By A Correspondent\n\nVeteran journalist and Masvingo Mirror consultant Matthew Takaona was released without charge on Tuesday after being detained by police in what many are calling a clear act of intimidation.\n\nHis alleged offense? Clearing tall grass and shrubs along a dangerous stretch of road near a local school.\n\nTakaonas arrest sparked immediate concern among press freedom and human rights advocates.\n\nRepresented by a team of top human rights lawyers  Advocate Martin Mureri, who is also the MP for Masvingo Urban, Advocate Collen Maboke, and Advocate Grace Bwanya  Takaona was held for several hours before authorities backed down.\n\nAccording to his legal team, the police initially sought to press charges for conducting the cleanup operation without notifying local councilor Benson Dandira.\n\nThere is absolutely no legal requirement for a citizen to seek permission from a councilor before engaging in a voluntary act of public service, said the legal team.\n\nThis was clearly an overreach and an attempt to intimidate Mr. Takaona.\n\nAs the situation unfolded, officials from the Environmental Management Agency (EMA) were brought in, potentially to find grounds for environmental violations.\n\nHowever, the EMA declined to pursue the matter, stating that no legal breach had occurred.\n\nDespite police pressure to submit a written statement before his release  a condition his lawyers strongly objected to  Takaona was eventually let go without charges being filed.\n\nSpeaking after his release, Takaona remained defiant and resolute. I was arrested for showing care for the bad state of the countrys roads and the safety of school kids, he said. I will be back on Thursday to continue cutting down grass and shrubs on that stretch of road.\n\nThe incident has drawn sharp criticism from civil society groups, who see the arrest as emblematic of a wider trend of harassment against activists and independent voices in Zimbabwe.\n\nThis is not just about cutting grass, one observer noted. Its about the state using its power to stifle community engagement and suppress dissent.\n\nTakaonas experience underscores the difficult environment in which journalists and ordinary citizens operate  where even acts of goodwill can be construed as subversive.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran journalist and Masvingo Mirror consultant Matthew Takaona was released without charge on Tuesday after being detained … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/police-release-veteran-journalist-without-charge-after-arresting-him-for-clearing-grass-at-roadside/\">Continue reading<span class=\"screen-reader-text\"> \"Police Release Veteran Journalist Without Charge After Arresting Him For Clearing Grass At Roadside …\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "ZANU-PF Suspends Top Chiwenga Ally Amid Rising Factional Tension",
            "url": "https://www.zimeye.net/2025/06/04/zanu-pf-suspends-top-chiwenga-ally-amid-rising-factional-tension/",
            "content": "By Tinashe Sambiri ZANU-PFs internal power struggles took a fresh turn this week after the partys Mashonaland Central provincial leadership issued a prohibition order against prominent businessman and political operative Tafadzwa Musarara, widely viewed as a close ally of Vice President Constantino Chiwenga.\n\nMusarara, who chairs the Grain Millers Association of Zimbabwe (GMAZ) and is a senior figure within the Affirmative Action Group, is accused of sympathizing with a faction of the ruling party opposed to the so-called 2030 agenda  a slogan increasingly associated with support for President Emmerson Mnangagwas extended leadership ambitions.\n\nA letter dated 31 May 2025, signed by the ZANU-PF Mashonaland Central leadership, stated:\n\n> Pending the outcome of the disciplinary hearing as per the attached Notice, you are hereby directed to stop acting for and/or on behalf of the Party ZANU PF until the matter is finalized.\n\nThe prohibition effectively bars Musarara from performing any official party duties until the conclusion of disciplinary proceedings. The notice, while brief, has triggered widespread speculation about growing friction between rival factions ahead of ZANU-PFs anticipated leadership realignments.\n\nWhile Musarara is yet to issue a formal response, insiders say the prohibition order stems not from specific conduct, but rather from Musararas perceived alignment with Chiwengas camp and his opposition to the extension of Mnangagwas rule beyond 2028.\n\nA senior party source, speaking on condition of anonymity, said:\n\n> Musarara has been vocal in internal circles against the 2030 project. That alone makes him a target. Its no longer about loyalty to the party  its about loyalty to a faction.\n\nMusarara, a well-known figure in both business and political circles, rose to prominence through his work in the private sector and as a digital mobilizer  leading an influential group of ZANU-PF-aligned social media activists known as varakashi.\n\nHowever, in recent months, his visibility within official party events has waned, and his social media footprint has shifted toward issues of economic empowerment, often skirting party propaganda themes  further fuelling suspicion of ideological divergence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri ZANU-PF’s internal power struggles took a fresh turn this week after the party’s Mashonaland Central provincial leadership … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/zanu-pf-suspends-top-chiwenga-ally-amid-rising-factional-tension/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU-PF Suspends Top Chiwenga Ally Amid Rising Factional Tension\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Suspected Government Spooks Raid Masvingo Media Center Offices",
            "url": "https://www.zimeye.net/2025/06/04/suspected-government-spooks-raid-masvingo-media-center-offices/",
            "content": "By A Correspondent\n\nMasvingo In a suspected politically motivated break-in, unidentified burglars raided the offices of the Masvingo Media Centerpublishers of the fast-growing regional paper Center Newsand made off with valuable electronic equipment, including two laptops essential to the newsrooms operations.\n\nThe incident took place on Monday and is being investigated by local police.\n\nAccording to Editor Godfrey Mtimba, the break-in has dealt a significant blow to the publications ability to function effectively. Our work has been greatly jeopardized by the break-in, Mtimba said in an interview. Our staff in all departments are now sharing one laptop, and its affecting the  operations of the newspaper.\n\nThe stolen equipment, which includes a Microsoft Surface 4 and an HP Nova, is estimated to be worth around US$3,000. A police report has been filed at Masvingo Central Police Station under RRB number 6192358, with investigations currently ongoing.\n\nMtimba voiced concern over what he described as a worrying pattern of intimidation againstCenter News, particularly in light of its bold reporting on politically sensitive issues in the province. The newspaper has recently published exposs on corruption, human rights abuses, and illegal gold mining activities reportedly linked to ruling party officials.\n\nWe suspect this was not just a random burglary, Mtimba said. Its hard to ignore the timingthis comes after a series of investigative reports that have unsettled some powerful people.\n\nHe also revealed that members of theCenter Newsteam have been subjected to surveillance and informal questioning by individuals believed to be affiliated with state security agencies.\n\nDespite the setback, Mtimba emphasized that the paper remains undeterred in its mission. We will not be silenced. Our duty is to the public, and we will continue to publish without fear or favour, he affirmed.\n\nThe break-in has sparked concern among media freedom advocates and raised fresh questions about the safety of journalists and independent media houses in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo— In a suspected politically motivated break-in, unidentified burglars raided the offices of the Masvingo Media Center—publishers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/04/suspected-government-spooks-raid-masvingo-media-center-offices/\">Continue reading<span class=\"screen-reader-text\"> \"Suspected Government Spooks Raid Masvingo Media Center Offices\"</span></a></p>",
            "time": "09:46",
            "date": "05 Jun 2025"
        }
    ]
}