{
    "news": [
        {
            "title": "Mighty Pharaohs Of Egypt Announce AFCON Squad",
            "url": "https://www.zimeye.net/2025/12/12/mighty-pharaohs-of-egypt-announce-afcon-squad/",
            "content": "Egypt coach Hossam Hassan has officially unveiled his final squad for the 2025 Africa Cup of Nations (AFCON), confirming the group of players entrusted with leading the Pharaohs campaign on the continental stage.\n\nDrawn in Group B, Egypt will battle Zimbabwe, South Africa and Angola in what promises to be a highly competitive pool. The team kicks off its tournament on 22 December at Stade Adrar against Zimbabwe, before taking on South Africa four days later. Their final group match is scheduled for 29 December against Angola.\n\nBelow is Egypts full squad for AFCON:\n\nGoalkeepers:Mohamed El-Shenawy (Al-Ahly), Ahmed El-Shenawy (Pyramids), Mostafa Shobeir (Al-Ahly), Mohamed Sobhi (Zamalek)\n\nDefenders:Mohamed Hany (Al-Ahly), Ahmed Eid (El-Masry), Rami Rabia (Al-Ain), Khaled Sobhi (El-Masry), Yasser Ibrahim (Al-Ahly), Mohamed Ismail (Zamalek), Hossam Abdelmaguid (Zamalek), Mohamed Hamdy (Pyramids), Ahmed Fatouh (Zamalek)\n\nMidfielders:Marwan Ateya (Al-Ahly), Hamdy Fathy (Al-Wakrah), Mohanad Lasheen (Pyramids), Mahmoud Saber (Zed), Mohamed Shehata (Zamalek), Emam Ashour (Al-Ahly), Ahmed Zizo (Al-Ahly), Mahmoud Trezeguet (Al-Ahly), Ibrahim Adel (Al-Jazira), Mostafa Fathi (Pyramids), Omar Marmoush (Manchester City), Mohamed Salah (Liverpool)\n\nForwards:Mostafa Mohamed (Nantes), Salah Mohsen (El-Masry), Osama Faisal (National Bank of Egypt)\n\nAFCON\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Egypt coach Hossam Hassan has officially unveiled his final squad for the 2025 Africa Cup of Nations (AFCON), confirming the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/mighty-pharaohs-of-egypt-announce-afcon-squad/\">Continue reading<span class=\"screen-reader-text\"> \"Mighty Pharaohs Of Egypt Announce AFCON Squad\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "Man Kills Colleague For Refusing To Share Beer",
            "url": "https://www.zimeye.net/2025/12/12/man-kills-colleague-for-refusing-to-share-beer/",
            "content": "By A Correspondent A shocking incident has left a Masvingo community in fear after a man allegedly murdered a drinking companion over a dispute about beer.\n\nMaxwell Marumbwa from Manyise Village, under Chief Nyajena, is reportedly on the run following the death of Sentie Hando of Mukarudzo Village, also under Chief Nyajena. The alleged killing occurred at Zengeza Business Centre, Nyajena, Masvingo, last Saturday.\n\nAccording to police reports, Marumbwa and Hando were drinking together around 2pm when the dispute began. Marumbwa allegedly brought an empty two-litre bottle and demanded that Hando fill it with beer.\n\nHando left the bar briefly to make a phone call, but tensions escalated upon his return. In an effort to avoid confrontation, Hando reportedly stepped outside, only for Marumbwa to follow him, leading to a violent altercation.\n\nEyewitnesses said Hando tried to flee while Marumbwa pursued him. After failing to catch him, Marumbwa returned to the bar and told other imbibers he had lost track of Hando.\n\nTragically, Handos body was discovered the following day in an open area near the bar. The deceased had visible bruises on his left cheek and a deep cut on his right shoulder.\n\nMasvingo Police have launched a manhunt for Marumbwa and are urging anyone with information about his whereabouts to come forward.\n\nZRP\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– A shocking incident has left a Masvingo community in fear after a man allegedly murdered a drinking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/man-kills-colleague-for-refusing-to-share-beer/\">Continue reading<span class=\"screen-reader-text\"> \"Man Kills Colleague For Refusing To Share Beer\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "After Controversial ZACC Clearance, Chivayo Splashes State Cash On Wife’s Expensive Lamborghini",
            "url": "https://www.zimeye.net/2025/12/12/after-controversial-zacc-clearance-chivayo-splashes-state-cash-on-wifes-expensive-lamborghini/",
            "content": "Tinashe Sambiri Controversial Zanu PF-linked businessman Wicknell Chivayo has once again sparked outrage as he celebrated what he described as vindication by the Zimbabwe Anti-Corruption Commission (ZACC), despite persistent claims of corruption and misuse of public funds.\n\nIn a statement on Thursday, Chivayo claimed: Yesterday, I watched the televised interview by the ZACC Chairman with a deep sense of RELIEF and VINDICATION. For almost TWO grueling YEARS, my name has been SCANDALISED and FALSELY accused over a non-existent fraud relating to the 2023 ZEC election materials procurement.\n\nHe insisted that all allegations against him were fabricated by opposition parties, framing his narrative as one of personal and professional victimhood. These damaging allegations were nothing more than FABRICATED LIES manufactured by spiteful and FAILED OPPOSITION elements who could not accept their DECISIVE DEFEAT by our Revolutionary Mass Party ZANU PF, he added.\n\nChivayo went on to claim that ZACC confirmed he had no involvement in the controversial procurement process, stating: It has also now been settled that I have NEVER had any contractual or business relationship with ZEC and that I have NEVER worked with or partnered with MIKE CHIMOMBE or MOSES MPOFU in ANY business whatsoever.\n\nHowever, critics argue that Chivayos close ties to President Mnangagwa and Zanu PF have insulated him from scrutiny, allowing him to evade accountability despite numerous reports of corrupt dealings and misuse of public funds.\n\nWhile presenting himself as a vindicated businessman, Chivayo has continued to flaunt his wealth publicly. Zanu PF online activist Cleopas Mukungunugwa posted on Thursday showing Chivayo gifting a brand-new 2025 Lamborghini Urus SE to his wife, complete with a custom Zimbabwean number plate, calling it a grand gesture of love, loyalty, and pure luxury.\n\nObservers say such displays of wealth amid the countrys ongoing economic hardships underscore the perception that Chivayo remains untouchable, raising questions about the independence of anti-corruption institutions when politically connected figures are involved.\n\nDespite Chivayos claims of innocence and vindication, many Zimbabweans remain unconvinced, viewing his continued prosperity as emblematic of the wider culture of impunity enjoyed by allies of the ruling party.\n\nGod is the greatest, he is FAITHFUL, and in all things, the TRUTH will always prevail and VINDICATE me, Chivayo declared, though public sentiment suggests that faith alone may not address the underlying issues of corruption and privilege that continue to plague the nation.\n\nWicknell Chivayo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Controversial Zanu PF-linked businessman Wicknell Chivayo has once again sparked outrage as he celebrated what he described as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/after-controversial-zacc-clearance-chivayo-splashes-state-cash-on-wifes-expensive-lamborghini/\">Continue reading<span class=\"screen-reader-text\"> \"After Controversial ZACC Clearance, Chivayo Splashes State Cash On Wife’s Expensive Lamborghini\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "Bishop Nyamakanga Enjoys A Laugh At Kandishaya’a Farm",
            "url": "https://www.zimeye.net/2025/12/12/bishop-nyamakanga-enjoys-a-laugh-at-kandishayaa-farm/",
            "content": "Picture Story: The Posture That Speaks\n\nIn the photograph taken at Taurai Kandishayas farm, Bishop Kevin Nyamakanga (right) is not in the posture of a watchful cleric or a detached spiritual adviser. His body leans inward, relaxed, smiling, hands open and unguarded  the unmistakable ease of political fellowship. There is no prophetic distance here, no symbolic separation between church and power. The stance is convivial, grounded, and unmistakably partisan. It is the body language of arrival, not visitation.\n\nThe farm setting itself matters. In Zimbabwes political grammar, farms are not neutral spaces. They are sites of patronage, loyalty, and alignment. Standing there, laughing, at ease, Nyamakangas posture performs what words often try to deny: comfort with power, acceptance of proximity, and a willingness to be seen. The image does not need captions; it is a declaration.\n\nFrom Prophecy To Proximity\n\nThis image lands at a moment of contradiction. Only months ago, Nyamakanga was among those publicly associated with prophetic claims of an impending leadership change in 2025  a message that resonated widely, amplified by church platforms, and received as divine forewarning. Howard Nyonis comment cuts to the core of that reversal: The greatest enemy of a false prophet is time.\n\nTime has indeed spoken. As the year closes, the prophecy has not unfolded  but the prophet has shifted. The move is not theological; it is directional. From predicting change, Nyamakanga is now pictured embracing continuity, standing comfortably within ZANU PFs social and political orbit. The pivot is visual, not theoretical.\n\nThe Cost Of Changing Direction\n\nIn Zimbabwe, prophetic authority rests not on sermons alone but on consistency under pressure. When prophecy bends toward power instead of confronting it, credibility fractures. The laughter at Kandishayas farm sits uncomfortably alongside earlier claims of imminent political upheaval. It invites the question Nyoni raises bluntly: was the prophecy revelation  or rhetoric?\n\nThis is why the image matters. It freezes the moment when prophecy meets reality and chooses accommodation. It shows how quickly spiritual language can be repurposed once access replaces anticipation. As one commenter put it in plain Shona: Kukurimwa chii uko kusina kana action kukutambiswa minda uko  what is being cultivated there, and for whom?\n\nEnd Of Year Reckoning\n\nAs Zimbabweans reflect on a year heavy with promises and light on transformation, this picture becomes a ledger entry. It records a shift  from forecasting leadership change to fraternising with those entrenched in power. Whether this is pragmatism, retreat, or exposure is for history to judge. But the posture, the setting, and the timing tell a coherent story.\n\nTime, as Nyoni notes, has a way of stripping prophecy bare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Picture Story: The Posture That Speaks In the photograph taken at Taurai Kandishaya’s farm, Bishop Kevin Nyamakanga (right) is not … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/bishop-nyamakanga-enjoys-a-laugh-at-kandishayaa-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Bishop Nyamakanga Enjoys A Laugh At Kandishaya’a Farm\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "Zanu PF Boasts Of Snatching 400 000 Opposition Members",
            "url": "https://www.zimeye.net/2025/12/12/zanu-pf-boasts-of-snatching-400-000-opposition-members/",
            "content": "Tinashe Sambiri Zanu PFs latest claims of a massive opposition exodus have been met with criticism and disbelief, with many Zimbabweans accusing the ruling party of fabricating numbers to project false dominance.\n\nSpeaking on Thursday, Zanu PF Secretary for the Commissariat Munyaradzi Machacha boasted that the party had allegedly absorbed 437,000 opposition members through its Huyai Kumusha uyanini Ekhaya/Come Home campaign  figures widely viewed as politically convenient rather than credible.\n\nMachacha insisted the party had created a special structure to manage these supposed returnees, claiming: Just this year alone, we have received not less than 187,000 people returning to the party, in addition to the 250,000 we had previously received.\n\nHe attempted to portray the alleged defections as a rejection of the opposition, saying: We can see that this is a massive mass movement away from bankrupt opposition politics to empowering, development-oriented Zanu PF politics.\n\nObservers argue the ruling party is relying on inflated statistics and political theatrics, as the country continues to experience economic decline, soaring prices and widespread public frustration.\n\nDespite the backlash, Machacha continued praising the leadership of President Emmerson Mnangagwa, claiming: It is something that we are really proud of  all because of President Mnangagwas wise leadership and his skilful handling of both governance and economic issues.\n\nIn a statement that raised even more eyebrows, Machacha openly suggested Zanu PF seeks total dominance, saying: Naturally, Zanu PF will continue to grow and eventually become an unlegislated one-party state again as we wait for the emergence of opposition politics.\n\nHis remarks have amplified fears of democratic backsliding, with critics saying the ruling party appears more focused on consolidating power than addressing Zimbabwes worsening socioeconomic crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF’s latest claims of a massive opposition exodus have been met with criticism and disbelief, with many … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/zanu-pf-boasts-of-snatching-400-000-opposition-members/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Boasts Of Snatching 400 000 Opposition Members\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "Chinamasa Throws Tungwarara Under The Bus As Zanu PF Infighting Intensifies",
            "url": "https://www.zimeye.net/2025/12/12/chinamasa-throws-tungwarara-under-the-bus-as-zanu-pf-infighting-intensifies/",
            "content": "Tinashe Sambiri Zanu PFs internal battles have taken another dramatic turn, with Treasurer-General Patrick Chinamasa openly distancing himself from Dr Paul Tungwarara and backing a decision that further exposes widening fractures inside the ruling party.\n\nChinamasa publicly endorsed the move to overturn Tungwararas controversial elevation to the Central Committee  a reversal communicated through a letter dated 11 December 2025 by National Political Commissar Munyaradzi Machacha to Manicaland Provincial Chair T. Mukodza. The co-option, rushed through during a PCC meeting on 7 December 2023, had been criticised for breaching procedure and fuelling factional tensions.\n\nChinamasa made it clear he fully supported Machachas decisive intervention, saying: I support the decision of Cde Machacha one hundred per cent, indeed wholeheartedly, for the reasons given and more.\n\nHe went further, using his trademark metaphorical language to suggest that the irregularities surrounding Tungwararas elevation were too glaring to be ignored. Those who have eyes, let them eye, and those who have ears, let them ear. Nokuti hatigoni kurega kutaura izvo takaona neizvo takanzwa, he said, implying that the truth of the matter was self-evident.\n\nThe dramatic nullification adds fuel to already intensifying infighting within Zanu PF, where provincial structures continue to clash with the central leadership. Senior party insiders say the move reflects Harares growing frustration with what they describe as increasing indiscipline and procedural manipulation at lower levels.\n\nPatrick Chinamasa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF’s internal battles have taken another dramatic turn, with Treasurer-General Patrick Chinamasa openly distancing himself from Dr … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/chinamasa-throws-tungwarara-under-the-bus-as-zanu-pf-infighting-intensifies/\">Continue reading<span class=\"screen-reader-text\"> \"Chinamasa Throws Tungwarara Under The Bus As Zanu PF Infighting Intensifies\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "Nelson Chamisa’s Strong Message Of Hope To Young Zimbabweans",
            "url": "https://www.zimeye.net/2025/12/12/nelson-chamisas-strong-message-of-hope-to-young-zimbabweans/",
            "content": "Tinashe Sambiri Citizens leader Advocate Nelson Chamisa on Thursday delivered an uplifting message directed at the nations young people, urging them to embrace their role as drivers of Zimbabwes future.\n\nChamisa praised the strength and resilience of the countrys youth, saying they remain the nations greatest asset. He declared, THE YOUNG WILL SAVE ZIMBABWE, emphasising that true national transformation will come from a generation that is bold enough to lead with purpose.\n\nHe added: Zimbabwes youth are a giant force  energetic, creative, resilient, and determined to build a New Great Zimbabwe. When young people lead with vision and unity, change becomes not just possible, but inevitable.\n\nChamisa encouraged young Zimbabweans to remain hopeful and committed to shaping a better nation, expressing confidence that a brighter era is within reach.\n\nHe concluded with an optimistic message: May the sun rise on a stronger, more prosperous New Great Zimbabwe.\n\nHis remarks, shared widely online, have been received as a rallying call for empowerment, unity, and national renewal among the countrys young citizens.\n\nAdvocate Nelson Chamisa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Citizens leader Advocate Nelson Chamisa on Thursday delivered an uplifting message directed at the nation’s young people, urging … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/nelson-chamisas-strong-message-of-hope-to-young-zimbabweans/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa’s Strong Message Of Hope To Young Zimbabweans\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "Do You Think ED’ll Manage To Change The Constitution?",
            "url": "https://www.zimeye.net/2025/12/12/do-you-think-edll-manage-to-change-the-constitution/",
            "content": "video loading below\n\nIf ED was all powerful he would have easily altered the constitution by now on his own, but he continues to dither around. Do you think hell make it?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "Chamisa Declares Political Comeback Despite Relentless Zanu PF Attacks",
            "url": "https://www.zimeye.net/2025/12/12/chamisa-declares-political-comeback-despite-relentless-zanu-pf-attacks/",
            "content": "Tinashe Sambiri Citizens leader Advocate Nelson Chamisa has sent a powerful message of resilience and renewal, declaring that no amount of mudslinging from Zanu PF will derail his political journey or silence his voice.\n\nIn a statement on Friday, Chamisa reflected on the challenges he has faced, emphasising that every trial has strengthened his resolve and shaped his mission going forward.\n\nRESETTING The battles Ive faced have been huge, but every one of them has purpose. Nothing is without reason. Im being remade from the inside out. Expect me renewed, refreshed, revived, and fired up. Great people, fellow citizensget ready, he said.\n\nChamisas remarks come amid intensified political hostility and smear campaigns from opponents who have repeatedly sought to undermine his leadership and influence.\n\nDespite the pressure, Chamisa made it clear that he remains unfazed and fully committed to leading citizens toward what he calls a new national direction anchored on hope, integrity, and transformation.\n\nHis message has reignited anticipation among his supporters, who interpret his declaration as a signal of a major political comeback.\n\nWith renewed confidence, Chamisa assured citizens that the journey continues, and that attempts to break his spirit have only reinforced his determination to fight for a better Zimbabwe.\n\nNelson Chamisa \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Citizens leader Advocate Nelson Chamisa has sent a powerful message of resilience and renewal, declaring that no amount … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/chamisa-declares-political-comeback-despite-relentless-zanu-pf-attacks/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Declares Political Comeback Despite Relentless Zanu PF Attacks\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        },
        {
            "title": "DETAILS: How Tungwarara Was Elbowed Out Of Zanu PF Central Committee",
            "url": "https://www.zimeye.net/2025/12/12/details-how-tungwarara-was-elbowed-out-of-zanu-pf-central-committee/",
            "content": "A fierce factional war has erupted inside Zanu PF following the dramatic nullification of Paul Temptor Tungwararas brief elevation to the partys central committee.\n\nParty insiders say this action was engineered by a powerful faction aligned to fuel tycoon and political financier Kudakwashe Tagwirei.\n\nWhat appeared, on paper, to be an administrative correction has been exposed as a calculated political strike executed by Zanu PF national political commissar Munyaradzi Machacha and openly endorsed by treasurer-general Patrick Chinamasa  both of whom insiders allege are firmly on Tagwireis payroll.\n\nAccording to several senior party insiders, the nullification was not about procedure but about blocking a rising political rival whose growing network threatens Tagwireis influence within Zanu PF.\n\nThe flashpoint of the controversy is a December 11 letter in which Machacha nullified Tungwararas co-option by the Manicaland Provincial Coordinating Committee (PCC).\n\nMachacha cited a legal affairs rule requiring that any Central Committee replacement must come from the same administrative district as the outgoing member, Dorothy Mabika, who hailed from Chipinge\n\nIn the letter, Machacha declared, The said co-option has been nullified with immediate effect, adding that any activities that involve issuance of money, goods or services by aspiring candidates will be deemed as vote buying and will lead to automatic disqualification.\n\nThese comments triggered anger among insiders who accuse Machacha of hypocrisy, claiming his own elevation was allegedly financed through the same vote-buying tactics by Tagwirei.\n\nOne senior provincial member remarked that Machacha cannot accuse Tungwarara of vote buying when his own rise was funded by Tagwirei. He is attacking a rival using the very sins that created him.\n\nThe plot against Tungwarara is said to have been driven by Tagwireis fury after his preferred candidate, Justin Matsatsira, lost the Manicaland vote despite a well-funded campaign.\n\nAccording to Zanu PF insiders, Tagwirei allegedly pumped at least US$500,000 into a vote-buying spree, deploying fleets of luxury vehicles, his Harare-based operatives and bundles of cash in nocturnal visits to PCC members.\n\nHis political runners reportedly assured him that Matsatsira would cruise to victory.\n\nInstead, Tungwarara won decisively, using what insiders described as Tagwireis own strategy better than him.\n\nThe defeat reportedly shook Tagwirei, with one insider saying the business magnate was deeply hurt by the rejection of his candidate.\n\nThe loss also exposed internal distrust within Tagwireis camp, amid allegations that some of the money never reached voters but remained in the pockets of his Harare lieutenants.\n\nPatrick Chinamasa, who is widely believed to be aligned to Tagwirei, then issued a public endorsement of Machachas nullification, reinforcing speculation that the decision was orchestrated from the top of the faction.\n\nIn a cryptic statement, Chinamasa declared, I support the decision of Cde Machacha one hundred per cent, indeed wholeheartedly, for the reasons given and more.\n\nThose who have eyes, let them eye, and those who have ears, let them ear.\n\nNokuti hatigoni kurega kutaura izvo takaona neizvo takanzwa (Because we cannot stop speaking about what we have seen and what we have heard), added Chinamasa.\n\nParty insiders, however, insist that while Chinamasa attempted to take a principled stance, he was merely defending the interests of his benefactor.\n\nOne high-ranking source was blunt: Chinamasa is going against Temptor Tungwarara because he is on Tagwireis payroll.\n\nThe battle for the Manicaland Central Committee seat has exposed three warring factions: Tagwireis camp, which backed Matsatsira; John Paradzas camp, which supported Evelyn Gata; and Tungwararas own camp, which unexpectedly emerged victorious.\n\nAll three blocs had one shared objective  blocking General Sanyatwe, believed to be aligned with Vice President Constantino Chiwenga, from gaining ground in Manicaland.\n\nBut once Tungwarara defeated Matsatsira, the temporary unity collapsed, triggering a vicious counter-offensive led by Tagwireis allies.\n\nThe nullification, therefore, is widely viewed not as procedural enforcement but as a tactical strike in Zanu PFs broader factional wars.\n\nTungwararas rapid rise has unsettled Tagwireis faction for another reason, he represents a new power centre with direct access to state-funded programmes.\n\nTungwarara oversees the Presidential Borehole Scheme, the Veterans Housing Programme, the War Veterans Fund and the Presidential Solar Programme.\n\nThese initiatives have expanded his national profile, influence and independent political capital.\n\nSome insiders now see him as a potential future presidential aspirant  a prospect that directly threatens Tagwireis succession ambitions.\n\nOne Politburo insider explained: Tagwirei cannot accept being overshadowed by another billionaire-type figure inside Zanu PF.\n\nTo him, Tungwararas rise is unacceptable.\n\nMachachas warnings against vote buying have been dismissed by some party members as disingenuous.\n\nA youth league official said, Tagwirei bought half the Harare structures.\n\nHe bought the Central Committee seat. He bought campaigns. So how does Machacha talk about vote buying?\n\nTungwarara only used the same template, added the youth.\n\nThe nullification has therefore not only embarrassed Tagwirei but also exposed the commissariats alleged susceptibility to elite capture and provoked resentment among provincial structures tired of Harare-based oligarchs imposing candidates through money.\n\nThis fight is also widely viewed as a preview of Zanu PFs looming succession crisis.\n\nThe TungwararaTagwirei showdown is a proxy battle over influence, resources and future presidential positioning.\n\nIn its aftermath, the Manicaland province has been ordered to restart the selection process, but insiders insist the fight is far from over.\n\nTagwireis camp is determined to overturn Tungwararas gains, while Tungwararas supporters are preparing for counter-mobilisation.\n\n-Newshour.co.zw\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A fierce factional war has erupted inside Zanu PF following the dramatic nullification of Paul “Temptor” Tungwarara’s brief elevation to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/12/details-how-tungwarara-was-elbowed-out-of-zanu-pf-central-committee/\">Continue reading<span class=\"screen-reader-text\"> \"DETAILS: How Tungwarara Was Elbowed Out Of Zanu PF Central Committee\"</span></a></p>",
            "time": "06:44",
            "date": "13 Dec 2025"
        }
    ]
}