{
    "news": [
        {
            "title": "Tocky’s Alex Sports Club Show Flops",
            "url": "https://www.zimeye.net/2025/10/05/tockys-alex-sports-club-show-flops/",
            "content": "By Showbiz Reporter Award-winning Zimdancehall artistTocky Vibes(real nameObey Makamure) suffered a humiliating setback on Friday night after only a handful of fans attended his much-hyped album launch atAlex Sports Clubin Harare.\n\nDespite boasting amassive online following of over 800,000 Facebook fansand a music career spanning more than a decade, Tockys latest event turned into an embarrassing spectacle as empty chairs and sparse crowds dominated the venue.\n\nThe show, meant to unveil his new album, had been billed as a star-studded affair featuring performances fromFeli Nandi, Killa T, Oriyano, and several other popular artists. Tickets were priced atUS$10, but the turnout fell drastically short of expectations.\n\nObservers attributed the poor attendance tolow publicity, poor timing, and fan fatigue, with some suggesting that Tockys musical relevance has waned compared to his peak years.\n\nTocky Vibes rose to fame in2014with hit songs such asAmai,Mhai,Usandicheme, andToti Toti, which established him as one of the most lyrically gifted and socially conscious artists in the Zimdancehall genre. His poetic storytelling and clean lyrical content set him apart from his contemporaries, earning him several local music awards and widespread respect from critics.\n\nHowever, in recent years, Tocky has struggled to maintain his earlier dominance in a competitive industry increasingly driven by new trends and youthful acts such asEnzo Ishall, Nutty O, and Freeman. His experimentation with Afro-fusion and gospel-infused sounds also divided his fanbase, with some long-time followers accusing him of abandoning his Zimdancehall roots.\n\nFriday nights poor turnout has reignited debates about thedisconnect between social media popularity and real-world support. While Tocky Vibes remains one of Zimbabwes most followed musicians online, the empty venue reflected a growing gap between virtual fame and tangible fan engagement.\n\nMusic analysts have urged the artist torethink his marketing strategy and reconnect with grassroots audienceswho once propelled him to stardom.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Award-winning Zimdancehall artist Tocky Vibes (real name Obey Makamure) suffered a humiliating setback on Friday night after only a handful … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/05/tockys-alex-sports-club-show-flops/\">Continue reading<span class=\"screen-reader-text\"> \"Tocky’s Alex Sports Club Show Flops\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "Mliswa Spills More Secrets",
            "url": "https://www.zimeye.net/2025/10/05/mliswa-spills-more-secrets/",
            "content": "By A Correspondent  Outspoken former legislator Temba Mliswa has launched yet another explosive claim, this time alleging that fuel mogul and ZANU PF Central Committee member Kudakwashe Tagwirei has captured Zimbabwes military and is being prepared to succeed President Emmerson Mnangagwa.\n\nThe claims surfaced in a leaked audio of a private conversation between Mliswa and businessman Agrippa Bopela Masiyakurima, released on Thursday.\n\nThe leak comes just days after Mliswas rural home in Shurugwi was torched by unknown assailants in what police confirmed as a suspected arson attack. Mliswa described it as an assassination attempt linked to his persistent calls for accountability in government.\n\nIn the recording, Mliswa alleges that Mnangagwa has secured the loyalty of the armed forces through Tagwireis financial muscle. He claims that the hundreds of vehicles delivered to the Zimbabwe Defence Forces (ZDF) last week were not government-funded, as Mnangagwa announced, but were supplied by Tagwirei.\n\nMnangagwa will leave someone he trusts to look after his interests, and thats Kuda, Mliswa is heard saying.\n\nThere is no coup that will ever happen in Zimbabwe. Just check, military bosses were given 100 cars. Those are Kudas cars.\n\nMliswa further alleges that ZDF Commander General Philip Valerio Sibanda salutes Tagwirei when he passes by. He claims at least 500 vehicles will be distributed not only to top brass but also to colonels, captains, and majors  a strategy he described as good politics since mid-ranking officers are the backbone of the military.\n\nMliswa also revealed that he has been touring the country distributing bicycles donated by Tagwirei to village heads.\n\nMasiyakurima said he recorded the conversation after rejecting what he described as Mliswas offer to join a campaign backing Tagwirei. He alleged that Mliswa dangled promises of cash, vehicles, and business support in exchange for loyalty.\n\nWhen I realised the money was coming with conditions, I refused. My morals and principles would not allow me to be a sell-out, Masiyakurima said.\n\nI just wanted to show Zimbabweans that Temba goes to the highest bidder. He has been recruited by Tagwirei to do smear campaigns against VP Chiwenga.\n\nIn response, Mliswa accused Masiyakurima of betrayal. Writing on X, he said Masiyakurima had violated the sanctity of a private discussion:\n\nAs for you Bopela, I considered you a brother and friend and tried to help. We ate and took children to school together. Unfortunately, you had other ideas to please who I dont know. Next time, leak the whole conversation, not what you think are favourable portions.\n\nThe fallout adds fuel to tensions already swirling around Vice President Constantino Chiwengas bitter standoff with controversial businessman Wicknell Chivayo.\n\nMliswa has accused Chiwenga of using anti-corruption rhetoric selectively, claiming it stems from Chivayos alleged failure to fully bankroll Chiwengas 2022 wedding to Colonel Miniyothabo Baloyi. According to Mliswa, Chivayo lavished millions in cash, cars, and properties on the wedding but fell short by US$150,000  sparking Chiwengas vendetta.\n\nHe has also criticised Chiwenga for openly challenging Mnangagwa in Politburo meetings, warning that such disputes risk destabilising the party.\n\nMliswas latest claims follow weeks of political turbulence. Earlier, his vehicle was vandalised in what he linked to his attacks on Chiwenga. The arson attack on his Shurugwi homestead marked a sharp escalation.\n\nPolice confirmed the incident on Friday, saying investigations were underway:\n\nThe ZRP confirms that investigations are currently underway in connection with the malicious damage to property incident at Temba Mliswas homestead in Shurugwi on 02/10/25. More details will be released in due course.\n\nMliswa, a former ZANU PF Mashonaland West chairman, has a long history of clashes with party elites. Expelled in 2014 for allegedly undermining leadership, he reinvented himself as an independent legislator but remained deeply involved in factional politics.\n\nDespite repeated setbacks, Mliswa has carved a reputation as a political maverick who exposes corruption and power struggles inside ZANU PF. Following the Shurugwi attack, he reportedly left for Johannesburg, South Africa, raising speculation over whether he is seeking refuge or preparing for another round of political confrontation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Outspoken former legislator Temba Mliswa has launched yet another explosive claim, this time alleging that fuel … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/05/mliswa-spills-more-secrets/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Spills More Secrets\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "8 Linked To Mutangadura Brutal Murder",
            "url": "https://www.zimeye.net/2025/10/05/8-linked-to-mutangadura-brutal-murder/",
            "content": "By Crime and Courts Reporter Police have made a major breakthrough in the brutal murder of prominent Ruwa businessmanJoseph Mutangadura, with one suspect arrested and seven others still on the run.\n\nThe arrested suspect,Phillip Mutasa (38), was nabbed in Mkoba 6, Gweru, after detectives from theCID Homicide, Harare, received credible information linking him to the killing.\n\nMutangadura (67), the owner ofThe Hideout leisure spotalong Dunstan Road in Ruwa, was savagely attacked and killed onAugust 17, 2025, in what police described as aviolent armed robbery.\n\nAccording to investigators, a gang of eight robbers stormed the premises at night, demanding cash and valuables before brutally assaulting the businessman. He died from severe injuries sustained during the attack.\n\nPolice said Mutasas arrest onOctober 3, 2025, followed weeks of meticulous investigations and cooperation from informants. During interrogation, Mutasa allegedlyimplicated seven accomplices, who are now being hunted across various parts of the country.\n\nEfforts are underway to apprehend the outstanding suspects, and we urge anyone with information on their whereabouts to contact the nearest police station, said national police spokespersonAssistant Commissioner Paul Nyathi.\n\nMutangaduras killing sent shockwaves through the Ruwa business community, where he was known as ahardworking entrepreneurwho employed dozens and supported several local initiatives.\n\nHis family, who had been demanding swift justice, expressed relief at the latest developments, saying they hoped all those involved would be caught and face the full wrath of the law.\n\nCommunity leaders in Ruwa also welcomed the arrest, urging police to intensify the manhunt to restore public confidence amid rising cases of violent crime.\n\nPolice have assured the public that the net is closing in on the remaining suspects as investigations continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Police have made a major breakthrough in the brutal murder of prominent Ruwa businessman Joseph Mutangadura, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/05/8-linked-to-mutangadura-brutal-murder/\">Continue reading<span class=\"screen-reader-text\"> \"8 Linked To Mutangadura Brutal Murder\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "Ngarivhume Rushes to Publish Hopewell’s Anti-Chamisa Jarg After Failing To Contact Own “Brother”",
            "url": "https://www.zimeye.net/2025/10/05/ngarivhume-rushes-to-publish-hopewells-anti-chamisa-jarg-after-failing-to-contact-own-brother/",
            "content": "By Dorrothy Moyo | Analysis | Zimbabweans on Saturday woke up to an announcement by the Hopewell Chinono supporter, Jacob Ngarivhume demanding that the nations opposition leader Nelson Chamisa must address the country, over a story suggesting he is in the US for the next 3 years.\n\nAll this came from a report suggesting he has enrolled for a long distance postgraduate course.\n\nNgarivhume did not bother to contact his said brother privately. He rushed to publicise it, commentators said.\n\nNgarivhume is an ally of the name change scammer Hopewell Chinono, who last year launched a political organisation called Govt In Exile, he hopes will be displace Chamisa. Hopewell Chinono (who has changed his own name three times in less than 2 years) is widely described as Zimbabwes biggest corruption-problem before ZANU PF. The latter (Chinono) has spent the last 14 years falsifying that the UK embassy in Harare conducted a police clearance on his multiple names and on property purchase money he moved from Britain to Zimbabwe from a non existent UK lender. He also encourages citizens intotransnational frauds that include two incidents at UK airports in 2024 alone(29 April 2024, and 26 Aug 2024  WATCH VIDEO)\n\nNgarivhume says Chamisa must address the nation to explain a US course hes said to have enrolled.\n\nChinono is the one big problem for Zimbabwe, said commentator J Mukundi. (Watch)\n\nChamisas predecessor, Morgan Tsvangirai attended a top US academic institution while leading the movement on the ground and defeating Zanu PF in multiple elections, since 2001. He did not seek consensus with anyone over it.\n\nStrive Masiyiwa runs the richest Zimbabwean company while outside, just as the South African Elon Musk has presence in all countries of the world from his living room.\n\nThe late ZANU leader, Robert Mugabe graduated from foreign universities while stuck in a local prison.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Analysis | Zimbabweans on Saturday woke up to an announcement by the Hopewell Chin’ono supporter, Jacob … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/05/ngarivhume-rushes-to-publish-hopewells-anti-chamisa-jarg-after-failing-to-contact-own-brother/\">Continue reading<span class=\"screen-reader-text\"> \"Ngarivhume Rushes to Publish Hopewell’s Anti-Chamisa Jarg After Failing To Contact Own “Brother”\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "EXCLUSIVE: Chinese Gold Mining Company Changes Own Name After 2022 Labour Abuse Scandal | VIDEO",
            "url": "https://www.zimeye.net/2025/10/05/exclusive-chinese-gold-mining-company-changes-name-after-2022-labour-abuse-scandal-video/",
            "content": "By ZimEye Investigations Desk\n\nExclusive ZimEye footage has revealed that the Chinese-owned gold mining company Ming Chang Sino Africa Zimbabwe, previously exposed in 2022 for severe labor abuses and human rights violations, has quietly changed its operating name and branding to conceal its identity.\n\nVIDEO LOADING BELOW\n\nEXCLUSIVE: Chinese Gold Mining Company Rebrands After 2022 Labour Abuse ScandalBy ZimEye Investigations DeskExclusive ZimEye footage has revealed that the Chinese-owned gold mining company Ming Chang Sino Africa Zimbabwe, previously exposed in 2022 for severe labor abuses andhttps://t.co/Hn8KhXSFAxpic.twitter.com/t6wou5iJt9\n\nThe secret footage, captured this week, shows the companys fleet of trucks previously branded Ming Chang Sino Africa, now trading under new names, including Shuntai Investments (Pvt) Ltd, based at Plot 8, Eastbourne Farm, Chegutu.\n\nThe discovery raises serious concerns that the firm, under scrutiny for mistreatment of Zimbabwean workers, may be attempting to evade accountability and public backlash by rebranding its vehicles and logistical operations while maintaining the same business operations and management structure.\n\nIn 2022, Ming Chang Sino Africa was accused of exploiting its workforce at multiple mining sites across Zimbabwe, including Peter Pan near Inyati and the Mutare district.\n\nSummary of 2022 Allegations Against Ming Chang Sino Africa1.Inhumane Living Conditions: Workers were forced to live in makeshift plastic shelters.2.Underpayment: Local employees received substandard wages far below the legal minimum.3.Hazardous Work Environment: Miners worked in high-dust conditions without protective equipment such as masks or gloves.4.Unfair Dismissals: Employees were fired without due process.5.Lack of PPE: Workers were required to wear their own clothes during operations.6.Delayed Payments: Some employees waited up to two months for their first wages.7.Intimidation and Retaliation: Workers were afraid to report abuses due to threats of dismissal or violence.\n\nFollowing international outrage, labour lawyers and human rights groups intervened, forcing temporary improvements in worker safety and pay. However, recent evidence suggests that instead of addressing the abuses, the company rebranded under new names to continue operating unnoticed.\n\nThe China Global South Project publication had also previously documented claims of violent assaults, poor wages, and attempts by management to silence injured workers with hush money as little as US$10.\n\nZimEye is in possession of visual evidence confirming that trucks previously registered under Ming Chang Sino Africa are now bearing the label Shuntai Investments (Pvt) Ltd.\n\nWhen contacted for comment, company representatives were unavailable at the time of publication.\n\nDeveloping story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By ZimEye Investigations Desk Exclusive ZimEye footage has revealed that the Chinese-owned gold mining company Ming Chang Sino Africa Zimbabwe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/05/exclusive-chinese-gold-mining-company-changes-name-after-2022-labour-abuse-scandal-video/\">Continue reading<span class=\"screen-reader-text\"> \"EXCLUSIVE: Chinese Gold Mining Company Changes Own Name After 2022 Labour Abuse Scandal | VIDEO\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "Mystery Surrounds Tshabangu’s Health …",
            "url": "https://www.zimeye.net/2025/10/05/mystery-surrounds-tshabangus-health/",
            "content": "By A Correspondent\n\nControversial Citizens Coalition for Change (CCC) secretary general, Senator Sengezo Tshabangu, is once again at the centre of health rumours, with claims suggesting he was recently flown out of the country for urgent treatment.\n\nReports allege that Tshabangu quietly left Zimbabwe two weeks ago and is currently receiving medical care in India. He was transferred abroad a fortnight back, and specialists in India are now attending to him, a source close to the matter claimed.\n\nSpeculation over his wellbeing has lingered since October 2024, when Tshabangu collapsed during the 149th Inter-Parliamentary Union (IPU) Assembly in Switzerland. He was placed under intensive care at the time, prompting concerns over his long-term health.\n\nDespite the latest reports, some within the CCC have dismissed the story outright. A senior official from Masvingo described the claims as misleading, saying, These are baseless rumours created to stir unnecessary drama. There is nothing wrong with him.\n\nTshabangu has remained silent, neither confirming nor denying the claims, leaving the mystery over his health unresolved.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Citizens Coalition for Change (CCC) secretary general, Senator Sengezo Tshabangu, is once again at the centre … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/05/mystery-surrounds-tshabangus-health/\">Continue reading<span class=\"screen-reader-text\"> \"Mystery Surrounds Tshabangu’s Health …\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "Is Minister Garwe Failing To Deal With Rampant Invasion Of Wetlands?",
            "url": "https://www.zimeye.net/2025/10/05/is-minister-garwe-failing-to-deal-with-rampant-invasion-of-wetlands/",
            "content": "By A Correspondent\n\nThe Ministry of Local Government and Public Works is facing mounting criticism over the continued invasion of wetlands in Harare, as unauthorized and irregular construction projects increase across the city.\n\nDuring a workshop on the Construction Contractors Bill 2025 held on Thursday, Mrs Maria Mutandwa, senior communications and information management officer for the International Labour Organisation (ILO), appealed directly to Minister Daniel Garwe to take urgent action. She delivered her remarks on behalf of the ILO director for Zimbabwe and Namibia, Mrs Philile Masuka.\n\nI am now speaking as a Zimbabwean to our Honourable Minister. Minister, we have received numerous reports of construction taking place on wetlands, Mrs Mutandwa said. Your office has been open to suggestions and accommodating citizens who have approached you about this troubling matter. As a citizen, I implore you to intervene in areas with irregular construction and multiple violations of city by-laws regarding wetlands and undesignated land. I sincerely appeal to you to take action, Minister.\n\nIn response, Minister Garwe acknowledged the concerns but appeared to downplay the urgency, stating, I hope we can sit down and discuss how to address the wetland issues. Construction on wetlands reflects unbecoming behaviour.\n\nMrs Mutandwa further stressed the importance of strong regulations and professional standards in the construction sector. The construction sector is more than just bricks and mortar. It is the foundation of our economies and a major source of jobs and livelihoods. It builds the roads that drive economic growth, the schools where our children learn, the hospitals where we seek medical care, and the homes where we build our lives. For this sector to thrive, it must rest on strong legal frameworks, professionalism, and decent working environments that produce mutually beneficial outcomes for all, she said.\n\nThe ILO warned that without decisive enforcement and regulatory oversight, the continued invasion of wetlands could damage fragile ecosystems, increase flooding risks, and undermine sustainable urban development in Harare, raising questions about whether Minister Garwe is effectively addressing the crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Ministry of Local Government and Public Works is facing mounting criticism over the continued invasion of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/05/is-minister-garwe-failing-to-deal-with-rampant-invasion-of-wetlands/\">Continue reading<span class=\"screen-reader-text\"> \"Is Minister Garwe Failing To Deal With Rampant Invasion Of Wetlands?\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "Shock As Ngezi Platinum FC Coach Slaps Player After Receiving Red Card",
            "url": "https://www.zimeye.net/2025/10/04/shock-as-ngezi-platinum-fc-coach-slaps-player-after-receiving-red-card/",
            "content": "By A Correspondent\n\nChaos erupted at Rufaro Stadium on Saturday when Ngezi Platinum Stars head coach, Takesure Chiragwi, slapped one of his own players moments after being shown a red card during a tense Premier Soccer League (PSL) clash against Dynamos FC. The highly charged encounter ended in a 11 draw.\n\nThe shocking incident, which was broadcast live on ZBC Jive TV, sent shockwaves through the local football community and immediately drew the attention of league authorities.\n\nIn a statement released on Saturday, PSL Communications and Media Liaison Officer, Kudzai Bare, confirmed that the league had taken note of Chiragwis actions.\n\nThe Premier Soccer League takes note of the conduct of Ngezi Platinum Stars FC coach Takesure Chiragwi, which was broadcast live during their match against Dynamos FC at Rufaro Stadium, where they were seen assaulting their own player on the technical area, Bare said.\n\nThe PSL spokesperson added that the league is now gathering full reports from match officials and has requested the club to explain the incident in detail.\n\nWhilst the league currently awaits all the official match reports, we have requested the club to also submit a detailed report on the incident to enable us to establish the facts surrounding this case, Bare stated.\n\nThe PSL condemned the coachs behaviour, reaffirming its zero-tolerance policy toward violence in football.\n\nThe safety, security, and safeguarding of players, officials, and all stakeholders remain our top priority, the statement continued. The league strongly condemns any form of violence and will not hesitate to take appropriate disciplinary action where necessary in line with the PSL Rules and Regulations.\n\nThe league said it would not comment further until all reports have been received.\n\nThe dramatic altercation has drawn widespread criticism from fans and analysts, many of whom are urging the PSL to act decisively to protect the image and integrity of local football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chaos erupted at Rufaro Stadium on Saturday when Ngezi Platinum Stars head coach, Takesure Chiragwi, slapped one … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/shock-as-ngezi-platinum-fc-coach-slaps-player-after-receiving-red-card/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Ngezi Platinum FC Coach Slaps Player After Receiving Red Card\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "Breakthrough In Mutangazi Murder Case",
            "url": "https://www.zimeye.net/2025/10/04/breakthrough-in-mutangazi-murder-case/",
            "content": "By Crime and Courts Reporter Police have made a breakthrough in the brutal murder of prominent businessmanJoseph Mutangadura, arresting one suspect in connection with the case.\n\nThe suspect,Phillip Mutasa (38), was apprehended in Mkoba 6, Gweru, following weeks of investigations.\n\nMutangadura (67), a well-known businessman who ranThe Hideoutleisure spot along Dunstan Road in Ruwa, wasattacked and killed on August 17, 2025, in what police described as a violent robbery.\n\nAccording to investigators, the businessman was assaulted by a gang of armed robbers who raided his establishment, demanding cash and valuables before fatally attacking him.\n\nHis murder shocked the Ruwa business community, which described him as a resilient entrepreneur who had employed dozens of people and supported several local initiatives.\n\nIn a statement, the Zimbabwe Republic Police (ZRP) confirmed that onOctober 3, 2025, detectives from theCID Homicide, Harare, received credible information linking Mutasa to the robbery and murder. Acting on the tip-off, detectives launched a manhunt, tracked him to Gweru, and arrested him.\n\nUpon interrogation, the suspect implicated seven accomplices who are still at large. Efforts are underway to apprehend them, the police said.\n\nThe arrest has brought relief to Mutangaduras family, who had been demanding justice for weeks. Community leaders in Ruwa also welcomed the development, urging police to swiftly bring the remaining suspects to book to restore public confidence in the fight against violent crime.\n\nPolice have since appealed to members of the public with information on the whereabouts of the outstanding suspects to come forward.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Police have made a breakthrough in the brutal murder of prominent businessman Joseph Mutangadura, arresting one … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/breakthrough-in-mutangazi-murder-case/\">Continue reading<span class=\"screen-reader-text\"> \"Breakthrough In Mutangazi Murder Case\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        },
        {
            "title": "Scottland Eye PSL Glory",
            "url": "https://www.zimeye.net/2025/10/04/scottland-eye-psl-glory/",
            "content": "Sports Correspondent\n\nScottland FC strengthened their position at the top of the Castle Lager Premier Soccer League after a hard-fought 1-0 victory over Chicken Inn on Saturday.\n\nThe decisive goal came early in the game, with Tymon Machope netting in the 7th minute following a precise assist from Khama Billiat, securing all three points for Scottland.\n\nThe win extended Scottlands lead to four points at the summit, bringing their total to 56 points, although they have played two more matches than Simba Bhora, their closest title challengers.\n\nThis marked Scottlands second consecutive league victory as they aim to sustain their push for the PSL crown. Meanwhile, Chicken Inn suffered a second straight defeat, remaining in 10th place with 33 points as their inconsistent form persists.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Scottland FC strengthened their position at the top of the Castle Lager Premier Soccer League after a hard-fought … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/scottland-eye-psl-glory/\">Continue reading<span class=\"screen-reader-text\"> \"Scottland Eye PSL Glory\"</span></a></p>",
            "time": "08:32",
            "date": "06 Oct 2025"
        }
    ]
}