{
    "news": [
        {
            "title": "Zimbabwe Loses 40% Gold Revenue To Smugglers",
            "url": "https://www.zimeye.net/2025/05/09/zimbabwe-loses-40-gold-revenue-to-smugglers/",
            "content": "By Business Reporter-Zimbabwe is losing up to 40% of its gold revenue to smuggling syndicates, Mines and Mining Development Minister Winston Chitando has revealedconfirming long-standing allegations of systemic looting raised in high-profile international investigations.\n\nSpeaking at the 2025 First Quarter Gold Mobilisation Workshop held in Harare on Wednesday, Chitando said illicit trade in gold continues to pose a serious threat to Zimbabwes economic recovery, despite improved deliveries to the states gold-buying agencies.\n\nIt is important to acknowledge, however, the significant challenges that continue to face our gold mining sector, Chitando said. Foremost among these are illicit activities and the ongoing issue of gold smuggling. Due to its inherent nature as a high-value and low-volume commodity, gold is particularly susceptible to leakages to various international markets.\n\nThis public acknowledgement by a senior government official lends credence to a 2023 investigative documentary series byAl Jazeera, titledGold Mafia, in which ZimEye largely contributed to, which exposed elaborate gold smuggling and money laundering networks operating with impunity in Zimbabwe. The investigation, based on undercover footage and leaked documents, linked several gold smugglers to individuals within President Emmerson Mnangagwas inner circle, including diplomats, senior clergy, and politically connected businessmen.\n\nTheGold Mafiaexpos revealed that Zimbabwean gold was being moved illicitly to international marketsparticularly the United Arab Emirates and South Africathrough sophisticated networks involving fake invoices, diplomatic cover, and shell companies. Among the central figures implicated were self-styled prophet Uebert Angel, Zimbabwean presidential envoy and ambassador-at-large, and business mogul Simon Rudland, whose role in these schemes stirred intense local and global criticism.\n\nThe extent of Zimbabwes gold losses is staggering. A 2020 report by the International Crisis Group estimated that the country loses about US$1.5 billion annually to gold smugglingequivalent to 22.4 tonnes a year or approximately 1.87 tonnes every month. If current gold pricesreported by BullionVault Ltd to be around US$3,338.19 per ounceare applied, this means Zimbabwe could have forfeited around US$660 million in just the first quarter of 2025 alone due to smuggling.\n\nDespite these losses, Zimbabwe recorded gold export earnings of US$755.24 million in the first quarter of 2025, a significant increase from US$385.13 million during the same period in 2024, according to the Zimbabwe National Statistics Agency (ZimStat). Yet experts suggest these figures still fall far short of what the country could earn if all gold was sold through formal channels.\n\nChitando noted that total gold deliveries for the first quarter reached 8.5 tonnes, surpassing the quarterly target of 7 tonnes. He attributed much of this progress to the small-scale mining sector, which consistently contributes around 60% to Zimbabwes gold output.\n\nIn January, February and March 2025, small-scale miners delivered 2.27 tonnes, 1.64 tonnes and 1.86 tonnes respectively, averaging 68% of the total monthly production, Chitando said. This consistent performance underscores the effectiveness of our efforts to formalise and empower this pivotal industry.\n\nThe minister reaffirmed the governments commitment to supporting artisanal miners through training, formalisation, and improved access to fair markets. However, observers say real progress will depend on political will to dismantle entrenched smuggling cartels and ensure accountability for those implicated in the looting.\n\nThe Ministry of Home Affairs has previously estimated that Zimbabwe loses at least US$100 million monthly to gold smugglingan issue that has persisted despite various attempts to increase transparency and regulatory oversight.\n\nAnalysts and civil society organisations continue to call for an independent inquiry into theGold Mafiarevelations and prosecution of those involved. Without this, critics argue, Zimbabwes gold sector risks becoming a permanent tool for elite enrichment and international money laundering.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-Zimbabwe is losing up to 40% of its gold revenue to smuggling syndicates, Mines and Mining Development Minister … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/zimbabwe-loses-40-gold-revenue-to-smugglers/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Loses 40% Gold Revenue To Smugglers\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Frustration Mounts Over Slow National Sports Stadium Refurbishment",
            "url": "https://www.zimeye.net/2025/05/09/frustration-mounts-over-slow-national-sports-stadium-refurbishment/",
            "content": "Sports Correspondent\n\nSoccer fans and analysts alike are voicing growing frustration over the sluggish pace of renovations at Harares National Sports Stadium, despite promises of a full revamp of the facilitys turf and infrastructure.\n\nThe stadium, once hailed as Zimbabwes sporting pride, has long suffered from poor maintenance, inadequate drainage, and outdated amenities. A contractor assigned to overhaul the playing surface has attempted to reassure the public, outlining steps aimed at improving the pitchs drainage system and general condition.\n\nWe are currently focused on reconstructing the substructure, which includes proper drainage channels to ensure water flows away quickly during rains. Once the base is stable, new turf will be installed to meet international standards, said the contractor during a site update.\n\nHowever, football analysts and fans remain skeptical, citing a lack of visible progress and clear timelines.\n\nIts taking too long. Weve heard similar promises before, yet nothing substantial has changed, said one local football expert. The pace is disappointing, and its unfair to clubs and fans who rely on the stadium for major fixtures.\n\nThe Zimbabwe Football Association (ZIFA) has previously faced sanctions and international scrutiny over the condition of the stadium, which has led to national teams being forced to host matches abroad. With the refurbishment now in the spotlight, there is renewed pressure on authorities to deliver tangible improvements.\n\nFor now, the once-mighty stadium continues to bear the weight of expectationsand skepticism.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Soccer fans and analysts alike are voicing growing frustration over the sluggish pace of renovations at Harare’s National … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/frustration-mounts-over-slow-national-sports-stadium-refurbishment/\">Continue reading<span class=\"screen-reader-text\"> \"Frustration Mounts Over Slow National Sports Stadium Refurbishment\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Brendan Galloway to Stay at Plymouth Argyle for 2025/26 Despite Relegation Setback",
            "url": "https://www.zimeye.net/2025/05/09/brendan-galloway-to-stay-at-plymouth-argyle-for-2025-26-despite-relegation-setback/",
            "content": "Sports Correspondent\n\nPlymouth Argyle have confirmed that Zimbabwe international Brendan Galloway will remain with the club for the upcoming 2025/26 season, entering the final year of his current contract, which runs until June 2026.\n\nDespite Argyles relegation from the English Championship to League One, the 28-year-old defender is staying put as the club looks to rebuild and mount a strong promotion campaign.\n\nGalloway, known for his versatility at both centre-back and left-back, has been a reliable presence in the squad when fully fit.\n\nHowever, his 2024/25 season was marred by injuries, restricting him to just 15 appearances in all competitions.\n\nA serious leg injury in January 2025 prematurely ended his season, following a spell on the sidelines earlier in the campaign due to an ankle problem that caused him to miss nine matches.\n\nDespite the fitness challenges, Argyle see Galloway as a crucial part of their defensive setup heading into the new season.\n\nBrendan brings experience, leadership, and quality at the back. Were confident hell play a key role as we aim to bounce back, said a club spokesperson.\n\nGalloway joined Argyle in 2021 and has made over 71 league appearances for the club, following earlier stints with Everton and West Bromwich Albion.\n\nAs he continues his recovery, Galloway will be hoping to return stronger and help guide the Pilgrims back to the Championship.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Plymouth Argyle have confirmed that Zimbabwe international Brendan Galloway will remain with the club for the upcoming 2025/26 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/brendan-galloway-to-stay-at-plymouth-argyle-for-2025-26-despite-relegation-setback/\">Continue reading<span class=\"screen-reader-text\"> \"Brendan Galloway to Stay at Plymouth Argyle for 2025/26 Despite Relegation Setback\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Mutsvangwa Urges South Africa to Act Against Geza, Nyokayemabhunu",
            "url": "https://www.zimeye.net/2025/05/09/mutsvangwa-urges-south-africa-to-act-against-geza-nyokayemabhunu/",
            "content": "By Tinashe Sambiri\n\nHarare  ZANU PF spokesperson Christopher Mutsvangwa has called for cooperation from South African authorities in curbing what he described as subversive activities by Zimbabwean nationals operating from across the Limpopo.\n\nSpeaking at a ZANU PF media briefing in Harare on Thursday, Mutsvangwa expressed concern over individuals he referred to as Nyokayemabhunu and Geza, alleging that they are attempting to destabilize Zimbabwe while residing in South Africa.\n\nZimbabwean citizens plotting subversive activities while in South Africa will not succeed, Mutsvangwa declared. South Africa is a sister republic, and such actions will be met with the full force of the law.\n\nHe emphasized that the ruling party, ZANU PF, remains focused on stabilizing the countrys economy and restoring confidence in key sectors such as agriculture and retail.\n\nWe are creating an economy which will reduce retention on our exports, he said. ZANU PF wants to maintain price stability for retailers and farmers. Farmers are happythe tobacco selling price is worth it for those in Hurungwe and other parts. This gives Zimbabwe a comparative advantage on global markets.\n\nTurning to internal party matters, Mutsvangwa confirmed that President Mnangagwa had overseen disciplinary proceedings during the latest Politburo meeting, though no members were expelled.\n\nThe President yesterday presided over a number of disciplinary matters. He wants the party to be unitedhe does not want rumour mongering, he said. In Masvingo, there were grievances from some party members and they were given a reprimand. No one was expelled from the party.\n\nMutsvangwas remarks come amid growing political tension and increased scrutiny of exiled Zimbabweans who have been critical of the government via online platforms. His call to South Africa for assistance suggests a hardening stance toward diaspora-based dissent.\n\nWATCH | Chris Mutsvangwa slams Nyokayemabhunu and Blessed GezaRory Studios News, Facebookpic.twitter.com/WC4zwkWjYB\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Harare – ZANU PF spokesperson Christopher Mutsvangwa has called for cooperation from South African authorities in curbing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/mutsvangwa-urges-south-africa-to-act-against-geza-nyokayemabhunu/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Urges South Africa to Act Against Geza, Nyokayemabhunu\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Two Killed in InterAfrica Bus and Toyota Probox Collision",
            "url": "https://www.zimeye.net/2025/05/09/two-killed-in-interafrica-bus-and-toyota-probox-collision/",
            "content": "INTERAFRICA INVOLVED IN ACCIDENT NEAR TUGWI RIVER\n\nAn InterAfrica bus plying the ChiredziBulawayo route via Zvishavane was involved in a fatal collision with a Toyota Probox early this morning near the Tugwi River along the NgunduTanganda highway.\n\nAccording to eyewitnesses, the bus failed to dim its headlights, temporarily blinding the Probox driver and leading to the crash. Both the driver of the Probox and his passenger died at the scene.\n\nMore details to follow.\n\nSource: Our Triangle\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "INTERAFRICA INVOLVED IN ACCIDENT NEAR TUGWI RIVER An InterAfrica bus plying the Chiredzi–Bulawayo route via Zvishavane was involved in a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/two-killed-in-interafrica-bus-and-toyota-probox-collision/\">Continue reading<span class=\"screen-reader-text\"> \"Two Killed in InterAfrica Bus and Toyota Probox Collision\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Malema Slams UK Over Visa Denial, Calls It a “Political Move to Silence Dissent”",
            "url": "https://www.zimeye.net/2025/05/09/malema-slams-uk-over-visa-denial-calls-it-a-political-move-to-silence-dissent/",
            "content": "By A Correspondent\n\nJohannesburg  Economic Freedom Fighters (EFF) leader Julius Malema has lashed out at British authorities, accusing them of deliberately denying him a visa to attend a major event in the United Kingdom, just hours before his scheduled departure.\n\nMalema was due to speak at the Cambridge Africa Together Conference on 10 May 2025, but his travel plans were abruptly derailed when the British High Commission in South Africa failed to issue his visa on timea move he described as politically motivated.\n\nThe British authorities have denied me a visa to London for the Cambridge Conference this weekend, providing no substantial justification, Malema said in a strongly worded statement on Wednesday. It is clear to me that this is an attempt to silence a dissenting political perspective.\n\nVisibly frustrated, Malema revealed that he had been waiting at OR Tambo International Airport, expecting resolution by mid-afternoon.We are currently at the OR airport, as we were promised that everything would be sorted by 15:30. Instead, we received a regret letter just four hours before our departure. This is unacceptable and spineless, he added.\n\nThe British High Commission has since issued an apology, acknowledging its failure to process the visa in time. However, the apology has done little to ease tensions, with the EFF calling it a transparent attempt to avoid accountability.\n\nThe visa denial has also sparked political reactions back home. While Malemas supporters have rallied behind him, AfriForuma civil rights group that has long clashed with the EFF leaderwelcomed the outcome, claiming it validates their international lobbying against Malema.\n\nPolitical analysts say the incident could strain diplomatic relations and fuel ongoing debates around freedom of speech, international gatekeeping, and the political treatment of African leaders on the global stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Johannesburg – Economic Freedom Fighters (EFF) leader Julius Malema has lashed out at British authorities, accusing them … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/malema-slams-uk-over-visa-denial-calls-it-a-political-move-to-silence-dissent/\">Continue reading<span class=\"screen-reader-text\"> \"Malema Slams UK Over Visa Denial, Calls It a “Political Move to Silence Dissent”\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Nyokayemabhunu Bail Hearing Postponed, Awaiting Interpol Documents",
            "url": "https://www.zimeye.net/2025/05/09/nyokayemabhunu-bail-hearing-postponed-awaiting-interpol-documents/",
            "content": "Randburg, South Africa  9 May 2025\n\nThe bail hearing of Zimbabwean national Wellington Masiwa, widely known as Nyokayemabhunu, has been postponed once again after a brief appearance at the Randburg Magistrates Court today.\n\nMasiwa, who is facing fraud charges and is reportedly under investigation in connection with an Interpol red notice, will remain in custody until Wednesday next week, when both matters are expected to be consolidated before the court.\n\nSpeaking to reporters outside the courthouse, Masiwas legal representative explained the delay:\n\nThe matter has been postponed for bail application. It is for the fraud matter and Interpol matter to be brought together on Wednesday next week. Were going to try and get bail for Mr. Masiwa.\n\nShe added that key documentation from Masiwas family is still outstanding:\n\nThe original documentswere still waiting for them to come from the family. Its just that we are still to get that, yes.\n\nMasiwa, known by his alias Nyokayemabhunu, is an activist known  on social media as such.\n\nMore updates are expected as the matter unfolds next week.\n\nENDS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Randburg, South Africa – 9 May 2025 The bail hearing of Zimbabwean national Wellington Masiwa, widely known as “Nyokayemabhunu,” has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/nyokayemabhunu-bail-hearing-postponed-awaiting-interpol-documents/\">Continue reading<span class=\"screen-reader-text\"> \"Nyokayemabhunu Bail Hearing Postponed, Awaiting Interpol Documents\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Zimbabwe Struggles To Contain Rising Inflation",
            "url": "https://www.zimeye.net/2025/05/09/zimbabwe-struggles-to-contain-rising-inflation/",
            "content": "By A Correspondent\n\nZimbabwes economic outlook continues to darken as inflationary pressures mount, prompting strong warnings from the countrys largest business lobby. The Confederation of Zimbabwe Industries (CZI) has raised red flags over surging consumer prices and questioned the effectiveness of recent monetary reforms.\n\nAccording to the Zimbabwe National Statistics Agency (ZimStat), annual inflation for April 2025 stood at 85.7%, the first such figure released since the rollout of the ZiG currency in April 2024. However, economists and independent analysts argue the real inflation rate could be far higher.\n\nWe are deeply concerned about the trajectory inflation is taking, CZI stated in its latest Inflation and Currency Developments Update. Although the official figure is 85.7%, businesses on the ground are grappling with much steeper cost increases. Its affecting borrowing, pricing, and long-term planning.\n\nThe ZiGintroduced as a replacement for the collapsing Zimbabwean dollar (ZWL)was initially hailed as a stabilizing force. But just a year after its launch, its credibility is under strain. The ZiG was meant to restore confidence, the CZI noted. Instead, what were seeing are lingering effects of cumulative shocks from 2024, which have fueled persistent month-on-month inflation.\n\nRising inflation has also pushed up interest rates, compounding the challenges facing both industry and households. The cost of borrowing is now unsustainable for many companies, a CZI spokesperson said. This undermines production and ultimately impacts jobs and prices.\n\nDoubts over official inflation data are also growing. Bretton Woods institutions have reportedly requested access to ZimStats raw figures, expressing concern over the transparency and accuracy of the methods used.\n\nAs consumer purchasing power continues to erode, the private sector is urging authorities to urgently address economic fundamentals. Stabilization must go beyond currency changes, CZI emphasized. It requires consistent policy, transparency, and confidence-building measures.\n\nWith no clear relief in sight, both businesses and citizens are bracing for more difficult months ahead.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s economic outlook continues to darken as inflationary pressures mount, prompting strong warnings from the country’s largest … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/zimbabwe-struggles-to-contain-rising-inflation/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Struggles To Contain Rising Inflation\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Blessed Geza Promises Explosive Revelations on Zimbabwean Military Tonight",
            "url": "https://www.zimeye.net/2025/05/09/blessed-geza-promises-explosive-revelations-on-zimbabwean-military-tonight/",
            "content": "By A Correspondent\n\nWar veteran and former Zanu PF stalwart Blessed Geza has announced his return with a bold message that has already stirred anticipation and speculation across social media.\n\nIn a teaser posted earlier today, Geza declared: Good morning, fellow Zimbabweans, this is truly yours, Blessed Geza, comrade bombshell. Lets meet tonight at 20:30 when I give you another updatean explosive oneon the goings-on in the military of Zimbabwe.\n\nKnown for his provocative broadcasts and insider claims, Geza has built a loyal following eager for his no-holds-barred commentary, though his critics question the authenticity and intent behind some of his claims.\n\nWith tensions already simmering over national security and political intrigue, Gezas promise of an explosive military update has fueled widespread curiosity. Many are now waiting to see whether the broadcast will reveal credible information or ignite further controversy.\n\nLets make a date tonight @ 20:30hrs.Good day.pic.twitter.com/TgZJdDoqjt\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran and former Zanu PF stalwart Blessed Geza has announced his return with a bold message … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/blessed-geza-promises-explosive-revelations-on-zimbabwean-military-tonight/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza Promises Explosive Revelations on Zimbabwean Military Tonight\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "We Are Rebuilding Economy: Mutsvangwa",
            "url": "https://www.zimeye.net/2025/05/09/we-are-rebuilding-economy-mutsvangwa/",
            "content": "By Tinashe Sambiri\n\nHarare  ZANU PF spokesperson Christopher Mutsvangwa has called for cooperation from South African authorities in curbing what he described as subversive activities by Zimbabwean nationals operating from across the Limpopo.\n\nSpeaking at a ZANU PF media briefing in Harare on Thursday, Mutsvangwa expressed concern over individuals he referred to as Nyokayemabhunu and Geza, alleging that they are attempting to destabilize Zimbabwe while residing in South Africa.\n\nZimbabwean citizens plotting subversive activities while in South Africa will not succeed, Mutsvangwa declared. South Africa is a sister republic, and such actions will be met with the full force of the law.\n\nHe emphasized that the ruling party, ZANU PF, remains focused on stabilizing the countrys economy and restoring confidence in key sectors such as agriculture and retail.\n\nWe are creating an economy which will reduce retention on our exports, he said. ZANU PF wants to maintain price stability for retailers and farmers. Farmers are happythe tobacco selling price is worth it for those in Hurungwe and other parts. This gives Zimbabwe a comparative advantage on global markets.\n\nTurning to internal party matters, Mutsvangwa confirmed that President Mnangagwa had overseen disciplinary proceedings during the latest Politburo meeting, though no members were expelled.\n\nThe President yesterday presided over a number of disciplinary matters. He wants the party to be unitedhe does not want rumour mongering, he said. In Masvingo, there were grievances from some party members and they were given a reprimand. No one was expelled from the party.\n\nMutsvangwas remarks come amid growing political tension and increased scrutiny of exiled Zimbabweans who have been critical of the government via online platforms. His call to South Africa for assistance suggests a hardening stance toward diaspora-based dissent.\n\nWATCH | Chris Mutsvangwa slams Nyokayemabhunu and Blessed GezaRory Studios News, Facebookpic.twitter.com/WC4zwkWjYB\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Harare – ZANU PF spokesperson Christopher Mutsvangwa has called for cooperation from South African authorities in curbing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/09/we-are-rebuilding-economy-mutsvangwa/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Rebuilding Economy: Mutsvangwa\"</span></a></p>",
            "time": "08:41",
            "date": "10 May 2025"
        }
    ]
}