{
    "news": [
        {
            "title": "Controversial Judge Predicts the End of the World",
            "url": "https://www.zimeye.net/2025/08/21/controversial-judge-predicts-the-end-of-the-world/",
            "content": "By Crime and Courts Reporter-High Court judgeJustice Munamato Mutevedzihas expressed alarm at the nature of crimes coming before the courts, warning that the shocking acts being committed in Zimbabwe suggest that the end of the world may be near.\n\nThe judge made the remarks while sentencingTapiwa Mereka (19)at the Gweru High Court. Mereka was found guilty of the gruesome murder of his aunt,Mary Mereka, on January 27, 2023, before raping her body.\n\nJustice Mutevedzi said the crime was so horrifying that, in other jurisdictions, it would have warranted the death penalty.\n\nIf it is true that one day God will destroy the world, then that time is nigh. Some of the crimes we preside over suggest Armageddon is imminent, the judge remarked.\n\nHe added that cases of such brutality leave deep psychological scars on court officials, warning that judges and prosecutors may require therapy to cope with the trauma of what they encounter in criminal trials.\n\nThis case lays bare the oft-repeated myth that judges are inanimate. Judicial officers who hear these horrific stories almost daily may suffer vicarious trauma. They may all end up requiring therapy in one form or another, he said.\n\nThe court heard that Tapiwa Mereka had long plotted to rape and kill his aunt. In his warned and cautioned statement, he admitted that he had been admiring her and was waiting for the right moment to strike.\n\nOn the morning of the murder, while working with her in a field, he picked up an axe and struck her three times on the head. After she collapsed, he raped her.\n\nThe deceased was my aunt but I had admired her for some time and wished to rape her. I also had the intention to kill her I struck her with an axe, and after she fell, I had sexual intercourse with her, he confessed.\n\nMereka admitted he had no reason for the killing, saying only that he felt compelled to do it.\n\nJustice Mutevedzi described the crime as unconscionable, comparing it to the stuff of horror films.\n\nTapiwa Mereka has a head, but it is doubtful that he has a brain inside it. If he does, then his mind is so perverted and depraved that he should not be living among human beings. The crime he committed is unconscionable and would possibly win an Oscar award for horror movies, he said.\n\nThe judge ruled that even if the victim had already died at the time of the rape, the act still amounted to the crime ofviolating a corpseunder Section 111 of the Criminal Law (Codification and Reform) Act.\n\nHe noted that in other jurisdictions, it would be classified asnecrophilia, which aggravates the seriousness of the case.\n\nJustice Mutevedzi concluded that the crime was so severe it left only two sentencing options available:life imprisonmentor a minimum of 20 years in prison.\n\nBefore the abolition of the death penalty, this was a case that would have undoubtedly attracted capital punishment, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-High Court judge Justice Munamato Mutevedzi has expressed alarm at the nature of crimes coming before the courts, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/controversial-judge-predicts-the-end-of-the-world/\">Continue reading<span class=\"screen-reader-text\"> \"Controversial Judge Predicts the End of the World\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "🔴 Mliswa Rushes to High Court Over Farm & River Seizure",
            "url": "https://www.zimeye.net/2025/08/21/830570/",
            "content": "By A Correspondent | Harare  August 20, 2025  Former Norton legislator and businessman Temba Mliswa, through his company Cubs Den Consolidated (Pvt) Ltd, has filed an urgent chamber application at the High Court in Harare, seeking to block what he describes as the illegal disruption of a presidentially-approved river rehabilitation project.\n\nAccording to court papers, Mliswa entered into a lease agreement with Hurungwe Rural District Council in September 2021 to operate in the Rengwe Conservancy. In November 2024, he formally requested the Presidents consent to carry out river rehabilitation works along the Sanyati River, a project later approved by the President on 1 December 2024 as a national pilot programme.\n\nThe Environmental Management Agency (EMA) was appointed to oversee the project and, in May 2025, issued a directive formally authorising Mliswas company to begin operations.\n\nI hold valid leases, permits and EMA approvals authorising my occupation and operations, including the ongoing rehabilitation project, Mliswa said in his affidavit.\n\nDespite these approvals, Mliswa alleges that on 10 August 2025, police officers acting under the Provincial Joint Operations Command stormed the project site, ordered workers to stop operations, and seized equipment under what he calls spurious allegations.\n\nThe actions taken against me are unlawful and constitute an infringement of my rights as the lawful lessee and operator on the land in question, he told the court.\n\nHe further argues that the continued police presence has left the site vulnerable to illegal gold panners, who are now accelerating river degradation  the very crisis the rehabilitation project was designed to solve.\n\nThe seizure has jeopardised critical environmental rehabilitation efforts and opened the door to illegal miners, whose activities are destroying the Sanyati River, Mliswa warned.\n\nThe affidavit also alleges that the real motive behind the disruption is that certain authorities have issued irregular permits to competing entities linked to the provincial leadership, in order to take over the same project already approved for his company.\n\nThe letters exchanged with government agencies earlier this year show beyond doubt that my operations were lawful and duly sanctioned, Mliswa argued.\n\nHe stressed that his company has invested heavily in machinery and equipment, which now lies idle, incurring heavy costs while hundreds of employees face job losses.\n\nUnless this Honourable Court intervenes immediately, I will suffer irreparable harm to my business, my employees, and the community at large, Mliswa stated.\n\nThe project, described as of national importance, was designed to serve as a model for replication across Zimbabwe.\n\nMliswa is seeking an urgent court order to restore his rights, interdict further police interference, and allow the rehabilitation project to resume without obstruction.\n\nThe High Court is expected to hear the matter urgently.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Harare – August 20, 2025 – Former Norton legislator and businessman Temba Mliswa, through his company … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/830570/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 Mliswa Rushes to High Court Over Farm & River Seizure\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "Mugabe Coup Mediator Priest Mourns Fellow Long-Serving Catholic Cleric",
            "url": "https://www.zimeye.net/2025/08/21/mugabe-coup-mediator-priest-mourns-fellow-long-serving-catholic-cleric/",
            "content": "By A Correspondent Father Fidelis Mukonori, the Roman Catholic priest best known for his long and complex relationship with the late former President Robert Mugabe, has mourned the death of fellow Jesuit priest Brother Jonathan Chazura, who was laid to rest on Monday at Chishawasha Mission after 49 years of missionary service.\n\nFather Mukonori, who stood by Mugabe at crucial points in Zimbabwes history, described Chazura as a man of unwavering dedication, particularly to youth development.I worked with him from 1976. He was passionate about working with the youth, and it is a passion that he successfully maintained over five decades of ministry, said Mukonori.\n\nFather Lawrence Daka echoed these sentiments:We have lost a great man. It will be difficult to replace such a man, who was hardworking and honest. He lived an exemplary life that should be emulated by everyone.\n\nMukonoris tribute to Chazura came against the backdrop of his own storied career, which has been inseparably linked to Robert Mugabe. Their relationship dates back to the liberation struggle of the 1970s, when a young Mukonori meticulously documented atrocities committed during the Rhodesian Bush War. His reports, which reached Mugabe in Mozambique, deepened their trust and cemented Mukonoris role as both priest and confidant.\n\nAfter independence, Mukonori remained within Mugabes inner circle, often providing spiritual counsel during moments of crisis. This relationship came into sharp focus during Zimbabwes dramatic political upheaval in November 2017, when Mugabe, then 93, was forced to step down after a military intervention.\n\nAs tanks rolled into Harare and Mugabe was placed under house arrest, the generals turned to Mukonori to mediate. His stature as a respected cleric and his decades-long relationship with the president made him the only figure trusted by both sides.\n\nIn daily meetings at State House and Mugabes private residence, Mukonori sought to gently persuade the aging leader that stepping down was the only path left that would preserve his dignity.\n\nHe is a debater, he is a thinker, he argues intelligently, he can philosophize, Mukonori recalled. It was a question of making President Mugabe see what was happening in the country economically and politically at that time and what was at stake with regard to the soldiers moving in.\n\nMugabe resisted until the very end, even mulling a transfer of power to his exiled vice-president Emmerson Mnangagwa on his own terms. But as tens of thousands of Zimbabweans poured into the streets demanding his resignation, the priest seized the moment.\n\nIt moved him, Mukonori later explained. It moved him in this sense that he realized that they are speaking to say this is enough.\n\nMugabe finally resigned on November 21, 2017, bringing to a close 37 years of rule.\n\nEven after Mugabes fall, Mukonori maintained regular contact with him, describing the ousted leader as still mentally sharp, though withdrawn from the public eye. He has not vanished from life, he is not dead. But he has vanished from the limelight. His brains are still very sharp and working, the priest said at the time.\n\nThat history of loyalty and mediation makes Mukonori one of the most significant clerical figures in Zimbabwes political story. His mourning of Brother Chazura was thus not only a tribute to a fellow servant of the church but also a reminder of how the Catholic clergy has, at key moments, shaped the countrys destiny.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Father Fidelis Mukonori, the Roman Catholic priest best known for his long and complex relationship with the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/mugabe-coup-mediator-priest-mourns-fellow-long-serving-catholic-cleric/\">Continue reading<span class=\"screen-reader-text\"> \"Mugabe Coup Mediator Priest Mourns Fellow Long-Serving Catholic Cleric\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "RBZ Insists ZIG Cash Is Available Despite Persistent Shortages",
            "url": "https://www.zimeye.net/2025/08/21/rbz-insists-zig-cash-is-available-despite-persistent-shortages/",
            "content": "By Business Correspondent\n\nZimbabwean business stakeholders have expressed serious concerns over the Reserve Bank of Zimbabwes (RBZ) plan to phase out the US dollar by 2030, arguing that the strategy lacks clear legal frameworks and practical implementation measures.\n\nThe concerns were highlighted in the RBZ Mid-Term Monetary Policy Statement Review (August 2025), which captured stakeholder feedback and the Banks responses to its recent monetary policy proposals.\n\nOn the de-dollarisation plan, stakeholders demanded clarity on how foreign currency deposits will be treated after the multi-currency era ends. In response, the RBZ acknowledged these concerns but stressed that USD-denominated contracts remain valid.\n\nInterest rates also drew criticism. Stakeholders said the 35% policy rate makes loans unaffordable and drives up business costs. The RBZ defended its position: The rate is set based on inflation trends and is in line with rates in other emerging markets. It will continue to be reviewed by the Monetary Policy Committee (MPC).\n\nThe Targeted Finance Facility (TFF) was viewed positively, but stakeholders called for its expansion to include companies along the supply chain and for improved conditions for long-term funding. The RBZ responded: Because the market is currently in surplus, companies can fund their requirements without this facility, while acknowledging the need for value-chain financing.\n\nOther concerns included currency discrimination by mobile money operators, high bank charges, and limited uptake of the Zimbabwe Gold (ZIG) currency. Addressing ZIG adoption, the RBZ insisted: ZIG cash is available at banks. We will encourage businesses to pick up their full ZIG cash allocations to ensure they always have enough to meet client demand. However, stakeholders continue to report persistent shortages and difficulties accessing ZIG for everyday transactions, casting doubt on the Banks assurances.\n\nOn the forex market, stakeholders recommended a cap on margins in the Wholesale Foreign Exchange Auction System to improve private sector access. The RBZ said ongoing measures will increase competition, which will naturally lead to narrower trading margins.\n\nFiscal concerns were also raised, with stakeholders warning that government spending threatens macroeconomic stability. The RBZ assured that it is working with the Treasury to align monetary and fiscal policies, explaining: Using moral suasion, we continue to advise the government on pricing policies and addressing risks to macroeconomic stability.\n\nDespite these reassurances, many business leaders remain skeptical of the 2030 de-dollarisation target, calling for stronger legal frameworks, practical measures, and real solutions to currency accessibility before the US dollar is phased out.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Correspondent Zimbabwean business stakeholders have expressed serious concerns over the Reserve Bank of Zimbabwe’s (RBZ) plan to phase … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/rbz-insists-zig-cash-is-available-despite-persistent-shortages/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Insists ZIG Cash Is Available Despite Persistent Shortages\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "VP Chiwenga Mourns Top Priest",
            "url": "https://www.zimeye.net/2025/08/21/vp-chiwenga-mourns-top-priest/",
            "content": "By A Correspondent Vice President Constantino Chiwenga has joined fellow Roman Catholics in mourning the death of one of Zimbabwes longest-serving Jesuit priests, Brother Jonathan Chazura, who was laid to rest on Monday at Chishawasha Mission after 49 years of dedicated missionary service.\n\nBrother Chazura was remembered as one of the most revered administrators in the history of the Roman Catholic Church in Zimbabwe  a man whose life embodied humility, service, and unwavering faith.\n\nThe solemn funeral was attended by hundreds of mourners, with Acting President Chiwenga leading tributes to the late priest. Himself a devout Catholic, Chiwenga described Brother Chazura as rich in human warmth and praised his lifelong commitment to uplifting young people.\n\nHe was dedicated to ensuring the development of the youth, and would go out of his way to secure scholarships. We have a child who was assisted by the late Brother Chazura to study in South Korea. She is now completing her degree, and even though our Brother has departed, we will ensure she completes her studies, Chiwenga said.\n\nHe further urged the Church to honour Brother Chazuras legacy by addressing modern social ills, particularly drug and substance abuse. As a Church, let us follow the lessons of our departed brother. We have a role to play in shunning drug and substance abuse. There is no life in mutoriro, the Vice President added.\n\nFamily members, fellow Jesuits, and clergy also paid moving tributes. Simbarashe Chazura, speaking on behalf of the family, said: We have indeed lost a pillar, a beacon that illuminated everyones life in our family.\n\nFather Lawrence Daka of the Roman Catholic Church added: We have lost a great man. It will be difficult to replace such a man, who was hardworking and honest. He lived an exemplary life that should be emulated by everyone.\n\nVeteran cleric Father Fidelis Mukonori, who worked alongside Brother Chazura for decades, reflected on his passion for youth development: I worked with him from 1976. He was passionate about working with the youth, and it is a passion that he successfully maintained over five decades of ministry.\n\nAfter 67 years of life and nearly five decades of service, Zimbabwe has bid farewell to Brother Jonathan Chazura. Though his candlelight has dimmed, his legacy of faith, mentorship, and devotion to humanity will continue to inspire generations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Vice President Constantino Chiwenga has joined fellow Roman Catholics in mourning the death of one of Zimbabwe’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/vp-chiwenga-mourns-top-priest/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Mourns Top Priest\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "Is Mnangagwa Recycling Dirty Tactics to Crush Political Opponents?",
            "url": "https://www.zimeye.net/2025/08/21/is-mnangagwa-recycling-dirty-tactics-to-crush-political-opponents/",
            "content": "By A CorrespondentZimbabwes political history is littered with calculated plots, manufactured threats, and ruthless strategies designed to destroy rivals.\n\nAt the center of these tactics for more than four decades stands Emmerson Mnangagwa  first as Robert Mugabes loyal lieutenant, and now as president. Far from being a new phenomenon, the dirty tricks of today mirror those used in the 1980s to neutralize powerful opponents.Recent events show this pattern in motion once again. Just days before the planned **Geza demonstration of 31 March**, a Daddy character suddenly appeared with sensational claims: soldiers had deserted the army, AK rifles had been stolen, and properties were being bombed.\n\nThe scare-mongering was eerily similar to 1982, when Joshua Nkomo was falsely accused of plotting armed rebellion, paving the way for his political neutralisation  a process Zimbabweans came to call being Nkomorised.The same methods appear designed to entrap even Mnangagwas close colleagues. Analysts note that if **Vice President Constantino Chiwenga** had taken the bait of the fake fires narrative in March, he could easily have been set up for political elimination.And then there is **Nelson Chamisa**, the opposition leader who has consistently mobilised hope and faith among Zimbabweans. His frequent use of biblical imagery has been a rallying point for millions yearning for change. Yet Mnangagwas propagandists twist this strength into a weakness, attempting to portray Chamisa as a dangerous populist.\n\nFar from being destabilising, Chamisas message of peace and renewal has been one of the few stabilising forces in a country suffocated by state-engineered crises.The pattern is hard to ignore. In **2018**, as Mnangagwa fought to secure his first full term, the election was tainted by sudden outbreaks of violence, disputed ballot counts, and military intervention in the streets  all reminiscent of earlier decades. These moments werent accidents; they were carefully choreographed to tilt the political field in Mnangagwas favour.The recurring question is: **who is Mnangagwa using today to implement these schemes?** Are these shadowy Daddy characters extensions of the same state machinery that has been in motion since 1980, or are new players being enlisted to do the same old job?What remains clear is that Zimbabwes politics is trapped in a cycle where hope, whether expressed by Nkomo, Chiwenga, or Chamisa, is systematically undermined. And at the center of the cycle, Mnangagwas survival depends on the very dirty tactics that have scarred the nation for over forty years.\n\nIf Gen Chiwenga had followed the fake fires in March, hed have been Nkomorised; if hed used the Bible verses, chaibva Chamiswa saChamisa. But whos ED using to achieve all this? 3 days before the Geza demo, on  28 March, a Daddy character announced that soldiers havehttps://t.co/Hn8KhXSFAxpic.twitter.com/t7JxqJg0x6\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s political history is littered with calculated plots, manufactured threats, and ruthless strategies designed to destroy rivals. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/is-mnangagwa-recycling-dirty-tactics-to-crush-political-opponents/\">Continue reading<span class=\"screen-reader-text\"> \"Is Mnangagwa Recycling Dirty Tactics to Crush Political Opponents?\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "Zvishavane Super Model Kudzaishe Chimedza Shines In Gweru",
            "url": "https://www.zimeye.net/2025/08/21/zvishavane-super-model-kudzaishe-chimedza-shines-in-gweru/",
            "content": "By A Correspondent\n\nGWERU  Twenty-year-old model Kudzaishe Daphne Chimedza, a former Mandava High School student, made history last night after being crownedMiss Midlands 2025at a glittering pageant held in Gweru.\n\nHer victory has been hailed as a breakthrough moment for Zvishavane, which had gone nearly a century without producing a Miss Midlands title holder. In previous editions, the crown had consistently been won by contestants from bigger cities such as Gweru, Kwekwe, and Kadoma.\n\nThis is a proud moment for Zvishavane, said one community member after the announcement. Kudzaishe has shown that talent from smaller towns can shine just as brightly on big stages.\n\nChimedza is no stranger to pageantry. Earlier this year, she competed atMiss Tourism Zimbabwe 2025, where she walked away as thePeoples Choice winnerand finished assecond runner-up. Her rising profile has fuelled hopes that she could one day bring home theMiss Zimbabwe crown, and perhaps even represent the country at theMiss Universe competition.\n\nFor now, Zvishavane residents are celebrating her triumph, describing it as a historic win that finally put their town on the modeling map.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent GWERU – Twenty-year-old model Kudzaishe Daphne Chimedza, a former Mandava High School student, made history last night … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/zvishavane-super-model-kudzaishe-chimedza-shines-in-gweru/\">Continue reading<span class=\"screen-reader-text\"> \"Zvishavane Super Model Kudzaishe Chimedza Shines In Gweru\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "Cash-Starved Zimbabweans Reject RBZ’s ZiG Success Story",
            "url": "https://www.zimeye.net/2025/08/21/cash-starved-zimbabweans-reject-rbzs-zig-success-story/",
            "content": "By A Correspondent\n\nHARARE  Despite claims by the Reserve Bank of Zimbabwe (RBZ) that the Zimbabwe Gold (ZiG) currency is flourishing, ordinary citizens continue to struggle with its scarcity and lack of trust.\n\nRBZ Governor John Mushayavanhu highlighted that ZiG now accounts for over 40 percent of electronic payment transactions in the National Payment System, up from 26 percent in April 2024.\n\nWe continue to ensure the wider availability of ZiG cash through the banking system, complementing digital efforts, Mushayavanhu said. Our approach is not to supplant cash but to balance digital innovation with cash availability, catering to all segments of society.\n\nHowever, many economists and business owners have dismissed these figures as misleading. People are being forced to transact in ZiG because alternatives are being squeezed out, not because they trust the currency, one analyst noted.\n\nAcross the country, reports indicate that cash shortages persist, with banks unable to meet basic withdrawal demands. ATMs often remain empty, and traders continue to prefer US dollars, sidelining ZiG in everyday commerce.\n\nThe RBZ has instructed banks to maintain at least 3 percent of ZiG deposits in cash reserves and to improve availability at ATMs and banking halls by September 2025. Critics, however, remain skeptical.\n\nConfidence cannot be legislated, said a Harare business owner.\n\nNo matter what numbers the RBZ quotes, people know ZiG is unstable. Until it holds value, no one will take it seriously.\n\nWhile Mushayavanhu remains optimistic, public sentiment shows that ZiGs proclaimed success is largely a reflection of official statistics rather than actual market confidence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Despite claims by the Reserve Bank of Zimbabwe (RBZ) that the Zimbabwe Gold (ZiG) currency … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/cash-starved-zimbabweans-reject-rbzs-zig-success-story/\">Continue reading<span class=\"screen-reader-text\"> \"Cash-Starved Zimbabweans Reject RBZ’s ZiG Success Story\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "Grandpa (70)  R*pes Granddaughter",
            "url": "https://www.zimeye.net/2025/08/20/grandpa-70-rpes-granddaughter/",
            "content": "By A CorrespondentA 70-year-old man from Hurungwe has been jailed for an effective 20 years after being convicted of serious offences involving his 16-year-old step-granddaughter.\n\nThe Karoi Regional Magistrates Court delivered the sentence following the mans conviction on three counts. According to the National Prosecuting Authority of Zimbabwe (NPAZ), the incidents took place in February 2025.\n\nFor the first two counts, he was sentenced to 15 years each, while the third carried another 15 years. However, the court suspended 10 years on condition of good behaviour, leaving him with an effective 20-year term behind bars.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A CorrespondentA 70-year-old man from Hurungwe has been jailed for an effective 20 years after being convicted of serious … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/grandpa-70-rpes-granddaughter/\">Continue reading<span class=\"screen-reader-text\"> \"Grandpa (70)  R*pes Granddaughter\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        },
        {
            "title": "Long-Serving Catholic Priest Dies",
            "url": "https://www.zimeye.net/2025/08/20/long-serving-catholic-priest-dies/",
            "content": "By A Correspondent  One of Zimbabwes longest-serving Jesuit priests, Brother Jonathan Chazura, has died.\n\nHe was laid to rest on Monday at Chishawasha Mission after 49 years of dedicated missionary service.\n\nBrother Chazura was remembered as one of the most revered administrators in the history of the Roman Catholic Church in Zimbabwe, a man whose life embodied humility, service, and unwavering faith.\n\nHis funeral was attended by hundreds of mourners, including Acting President Constantino Chiwenga, who joined the Church and family in paying tribute.\n\nActing President Chiwenga, himself a devout Catholic, described the late priest as rich in human warmth and praised his tireless commitment to empowering young people.\n\nHe was dedicated to ensuring the development of the youth, and would go out of his way to secure scholarships. We have a child who was assisted by the late Brother Chazura to study in South Korea. She is now completing her degree, and even though our Brother has departed, we will ensure she completes her studies, Chiwenga said.\n\nHe also called on the Church to honour Brother Chazuras legacy by addressing todays social challenges, particularly drug and substance abuse. As a church, let us follow the lessons of our departed brother. We have a role to play in shunning drug and substance abuse. There is no life in mutoriro, he added.\n\nFamily members, fellow Jesuits, and church leaders described Brother Chazura as a father figure, mentor, and pillar of strength.\n\nWe have indeed lost a pillar, a beacon that illuminated everyones life in our family, said Simbarashe Chazura, a family representative.\n\nFather Lawrence Daka of the Roman Catholic Church echoed the sentiment: We have lost a great man. It will be difficult to replace such a man, who was hardworking and honest. He lived an exemplary life that should be emulated by everyone.\n\nVeteran cleric Father Fidelis Mukonori, who worked with Brother Chazura for decades, recalled his passion for youth empowerment. I worked with him from 1976. He was passionate about working with the youth, and it is a passion that he successfully maintained over five decades of ministry.\n\nAfter 67 years of life and nearly five decades of selfless service, the Church and nation bade farewell to Brother Jonathan Chazura. Though his candlelight has faded, his legacy of faith, mentorship, and devotion to humanity will forever be cherished.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – One of Zimbabwe’s longest-serving Jesuit priests, Brother Jonathan Chazura, has died.  He was laid to rest … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/20/long-serving-catholic-priest-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Long-Serving Catholic Priest Dies\"</span></a></p>",
            "time": "20:29",
            "date": "21 Aug 2025"
        }
    ]
}