{
    "news": [
        {
            "title": "Chivhayo Labels Chiwenga “Ambitious Though Hopeless Individual”",
            "url": "https://www.zimeye.net/2025/10/03/chivhayo-labels-chiwenga-ambitious-though-hopeless-individual/",
            "content": "By A Correspondent| Businessman Wicknell Chivhayo has waded into ZANU-PFs simmering succession battle, appearing to take a veiled swipe at Vice President Constantino Chiwenga whom he described as ambitious though hopeless individual.\n\nIn a lengthy post on X (formerly Twitter), Chivhayo lauded Mnangagwa as a LISTENING PRESIDENT, a man of his WORD and a leader PAR EXCELLENCE. He went on to warn what he called ambitious though hopeless individuals that the presidency was not a position to be seized at will.\n\nPRESIDENCY is not a position which one simply just wakes up and takes over, Chivhayo declared.\n\nIt only comes with GODs ANOINTING and APPROVAL. Without the support of the CHURCH and without DIVINE GRACE, no one can lead a nation. To fight against a LEADER chosen by GOD is to fight GOD Himself !!!\n\nHis comments are widely seen as a thinly-veiled jab at Vice President Chiwenga, who is locked in a factional battle with Mnangagwa loyalists over who should occupy the presidency after 2028, when Mnangagwas constitutional two terms are set to end.\n\nPro-Mnangagwa loyalists, including Chivhayo, have been openly pushing for the President to extend his stay in office beyond the two-term limit, while Chiwengas faction is believed to be positioning the former army commander to take over.\n\nChivhayos intervention underscores growing tensions within the ruling party, where rival camps are increasingly trading indirect barbs through public statements and social media posts.\n\nThe flamboyant businessman, known for his close ties to the Mnangagwa family, has in recent years been an outspoken defender of the President, often blending political messaging with religious overtones.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Businessman Wicknell Chivhayo has waded into ZANU-PF’s simmering succession battle, appearing to take a veiled swipe at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/chivhayo-labels-chiwenga-ambitious-though-hopeless-individual/\">Continue reading<span class=\"screen-reader-text\"> \"Chivhayo Labels Chiwenga “Ambitious Though Hopeless Individual”\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "Parliament Urged to Investigate George Guvamatanga",
            "url": "https://www.zimeye.net/2025/10/03/parliament-urged-to-investigate-george-guvamatanga/",
            "content": "By A Correspondent| Pro-ruling party group Varakashi4ED has called on Parliament to take the lead in probing corruption allegations leveled against Finance Ministry Permanent Secretary George Guvamatanga, following claims made in Parliament by legislator Dr. Energy Mutodi.\n\nIn a statement released Thursday, Varakashi4ED said the allegations  which accuse Guvamatanga of running a multi-million-dollar kickback scheme at Treasury  were serious enough to warrant an institutional investigation, but cautioned against trial by public opinion.\n\nVarakashi4ED notes with concern the recent allegations of corruption raised in Parliament by Honourable Energy Mutodi, a Member of Parliament, against Finance Chief George Guvamatanga. As the matter was tabled within the august House, we firmly believe that Parliament itself must lead the investigation through its established oversight mechanisms, the group said.\n\nMutodi alleged earlier this week that Guvamatanga, widely known as GG, demands between 5 and 10 percent from every Treasury payment he authorizes. Contractors and ministries that refuse to comply reportedly face delays or outright denial of budgeted funds.\n\nOne contractor, Bitumen, was allegedly forced to pay US$200,000 in kickbacks for every US$2 million installment it received, Mutodi claimed. He also accused Guvamatanga of starving Parliament itself of operational funds for six months, crippling legislative functions.\n\nBeyond financial impropriety, Mutodi described Guvamatangas wealth as grossly disproportionate to his civil service salary of under US$1,000 per month. He alleged that the finance chief owns more than 5,000 dairy cattle, dairy equipment, and multiple luxury homes.\n\nVarakashi4ED, however, emphasized the need for fairness in handling the allegations.\n\nThe person isnt guilty until proven so. In the meantime, he is innocent. We acknowledge that the Honourable MP may be right or wrong, just as the Finance Chief may be innocent or culpable. If wrongdoing is established, the law must take its course swiftly and decisively, the statement read.\n\nThe group, which describes itself as aligned with the values of President Emmerson Mnangagwa, stressed that corruption must be confronted, but not at the expense of due process. We stand firmly against any form of graft. At the same time, we uphold the principles of fairness, due process, and institutional integrity, it said.\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has not yet commented on whether it will launch a probe. Guvamatanga himself and the Finance Ministry have also remained silent on the matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Pro-ruling party group Varakashi4ED has called on Parliament to take the lead in probing corruption allegations leveled … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/parliament-urged-to-investigate-george-guvamatanga/\">Continue reading<span class=\"screen-reader-text\"> \"Parliament Urged to Investigate George Guvamatanga\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "Zanu PF’s Resolution Number 1 Declared Invalid",
            "url": "https://www.zimeye.net/2025/10/03/zanu-pfs-resolution-number-1-declared-invalid/",
            "content": "By Advocate Thabani Mpofu| A year ago, at its annual Conference, ZANU PF passed the notorious Resolution No. 1. The resolution, a vulgar piece of unmitigated buffoonery, attempts to extend EDs tenure beyond the term fixed by Congress in 2022 and effectively calls for subverting the national constitution to achieve that end.\n\nThe measure is both egregious and unlawful, chiefly because it conflicts with ZANU PFs own constitutive instruments. Congress v Conference ZANU PFs Congress, which meets once every five years, is the partys supreme decisionmaking body.\n\nDepending on which of the three un-ratified 2022 constitutions one reads, this authority is set out in section 23 or 27 in materially similar terms.\n\nThe provision confers on Congress the following powers: Congress shall be the supreme policy making organ of the Party and shall have the following powers and functions:- (\n\n1) to elect the President and First Secretary of the Party, who shall automatically become the sole candidate of the State President in the ensuing elections; In accordance with this provision, Congress in 2022 elected ED as ZANU PFs candidate for the 2023 elections.\n\nThis election was for a 5 year period. By design, Congress is the body that meets to select the partys candidate for any general elections and EDs incumbency draws its lifeblood from the 2022 Congress resolution.\n\nNo ZANU PF member can seek or maintain state or party power as the President post 2028 without the authority of Congress.\n\nTwo points emerge and must detain me:  the party constitution is tailored so that Congress precedes a general election for the purpose of selecting a presidential candidate; and  as a contractual and constitutional instrument, the party constitution cannot validly contain provisions that conflict with the national Constitution and any such conflicting provision is void.\n\nThus, there is no valid basis within ZANU PFs constitution for declaring a candidate beyond the 2028 elections more so if this is coming from an organ inferior to Congress.\n\nAny attempt to do so would violate the partys own constitution and would subordinate Congress to the Mai Welly twerking transactional politics that we now see on display The National Conference meets annually and its powers include receiving Central Committee reports, reviewing implementation of CC progs, making resolutions for implementation by the CC, & declaring the President elected at Congress as the partys State Presidential candidate.\n\nOutside a determination made by Congress and that only for a period of 5 years, the National Conference cannot transact any business bearing on the question of a national leader as is the purport of Resolution 1 Crucially, the National Conference does not have the power to elect the partys presidential candidate; it can only declare an election already made by Congress.\n\nLast years Conference resolution purporting to elect or rather select ED for a period outside that fixed by Congress, and calling for subversion of Congresss decision to achieve the purpose, was therefore unlawful under any of the three constitutional texts that are fraudulently used by ZANU PF.\n\nEDs position is not a legitimate matter for internal debate at this years Conference. In fact concerned ZANU PF members can stop their partyeither by judicial decree or through legitimate political maneuveringfrom becoming engaged with this issue Put in very simple terms, the question of the possible extension of EDs position cannot be debated by the National Conference. It is an act ultra vires.\n\nZANU PF must abide by its own rules & by the national Constitution. It cannot lawfully transact business in breach of those instruments or call for their subversion. This festival of absurdities & illegality must be stopped.\n\nThe men within ZANU PF, if there be any (& not vanoda kuchengeta vana), should confront these breaches & insist on adherence to both the party constitution & the Constitution of the land\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Advocate Thabani Mpofu| A year ago, at its annual Conference, ZANU PF passed the notorious Resolution No. 1. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/zanu-pfs-resolution-number-1-declared-invalid/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF’s Resolution Number 1 Declared Invalid\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "Chiyangwa’s Son Arrested Over Cannabis Possession",
            "url": "https://www.zimeye.net/2025/10/03/chiyangwas-son-arrested-over-cannabis-possession/",
            "content": "Phillip Munetsi Chiyangwa, 26, the son of businessman Phillip Chiyangwa, appeared in court today charged with possession of dangerous drugs. He was arrested with Tanaka Phil Kashambe, 25, in Highlands on Wednesday and found with 1 gram of cannabis.\n\nChiyangwa claimed detectives planted the drugs in his car as he applied for bail. A magistrate will rule on his bail application on Friday\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Phillip Munetsi Chiyangwa, 26, the son of businessman Phillip Chiyangwa, appeared in court today charged with possession of dangerous drugs. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/chiyangwas-son-arrested-over-cannabis-possession/\">Continue reading<span class=\"screen-reader-text\"> \"Chiyangwa’s Son Arrested Over Cannabis Possession\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "NetOne Executives Flee as ZACC Probes $10m Looting Scandal",
            "url": "https://www.zimeye.net/2025/10/03/netone-executives-flee-as-zacc-probes-10m-looting-scandal/",
            "content": "By A Correspondent| NetOnes Chief Technical Officer (CTO), Christopher Muchechemera, and Chief Financial Officer (CFO), Nyasha Nyambuya, are reportedly on the run over allegations of significant looting and financial mismanagement at the countrys second-largest mobile network operator, NetOne Cellular.\n\nThe company has lost more than US$10 million. The two individuals are wanted by the Zimbabwe Anti-Corruption Commission (ZACC) to answer various charges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| NetOne’s Chief Technical Officer (CTO), Christopher Muchechemera, and Chief Financial Officer (CFO), Nyasha Nyambuya, are reportedly on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/netone-executives-flee-as-zacc-probes-10m-looting-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"NetOne Executives Flee as ZACC Probes $10m Looting Scandal\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "New Nurse Entry Qualifications Set",
            "url": "https://www.zimeye.net/2025/10/03/new-nurse-entry-qualifications-set/",
            "content": "By A Correspondent The Government has revised the entry qualifications for nurse training in a bid to widen access and promote fairer recruitment, especially for applicants from rural and disadvantaged backgrounds.\n\nHealth and Child Care Minister Dr Douglas Mombeshora told Parliament on Wednesday that all nurse training institutions will now be required to enrol at least 50 percent of their student intake from their local districts.\n\nIn every district that has a hospital training nurses, that same district must provide 50 percent of the students admitted, Dr Mombeshora said during a question-and-answer session in the National Assembly.\n\nHe explained that the old requirement, which only admitted candidates who had obtained five O-Level passes in one sitting, had been scrapped after it was found to be discriminatory.\n\nWe realised that some children were not failing academically but simply could not afford to register five or more subjects at once. We have therefore removed the one-sitting requirement and now allow students with the requisite passes from more than one sitting to qualify, Dr Mombeshora said.\n\nThe minister was responding to Mkoba Member of Parliament Mr John Kuka, who asked what the Government was doing to assist children from rural and remote areas who have been repeatedly failing to secure places at nursing schools.\n\nDr Mombeshora said the quota system introduced in 2024 was designed to ensure equal representation across all districts. However, the number of applicants far outweighs available spaces due to limited infrastructure and staff shortages.\n\nThe demand for nurse training places is overwhelming. To address this, e-learning has been introduced in 23 out of the 73 training schools to ease the pressure on teaching staff, though challenges remain with ICT equipment and Wi-Fi connectivity, he said.\n\nThe minister added that the Government was working to expand training opportunities by capacitating more institutions and partnering with private hospitals.\n\nWe are now opening the door for private hospitals to train nurses. For example, Hwange Hospital was not part of Government institutions training nurses, but we are looking at such facilities to expand recruitment and training, he said.\n\nDr Mombeshora also highlighted another challenge: the employment of trained nurses.\n\nIf we increase training numbers, we must also ensure jobs are available. We have discussed with Treasury and agreed that the nursing workforce should double by 2030, which means recruitment will have to match the output from our training institutions, he said.\n\nThe Government has pledged to continue expanding nurse training facilities to meet rising demand while balancing the need for employment opportunities within the health sector.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Government has revised the entry qualifications for nurse training in a bid to widen access and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/new-nurse-entry-qualifications-set/\">Continue reading<span class=\"screen-reader-text\"> \"New Nurse Entry Qualifications Set\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "Mliswa Survives Assassination Attempt",
            "url": "https://www.zimeye.net/2025/10/03/mliswa-survives-assassination-attempt/",
            "content": "By A Correspondent  Outspoken former ZANU PF Mashonaland West Provincial chairman Temba Mliswa says his rural home in Shurugwi was set ablaze by unknown attackers on Wednesday night, in what he believes was an attempt on his life.\n\nMliswa, who also serves as a village head in the area, revealed the incident in a post on X (formerly Twitter) Thursday morning, linking it to his relentless calls for accountability in government.\n\nI have always known that corruption fights back and am prepared for everything. Last night they sneaked and burnt my house in Shurugwi all because I asked for accountability and transparency. Thank God no one was hurt. Mapisa Nyadzonia! he wrote.\n\nThe invocation ofNyadzoniawas a symbolic reference to the 1976 Rhodesian army attack on a ZANLA base in Mozambique, where more than 1,000 unarmed refugees were massacred, underscoring Mliswas framing of the attack as a politically motivated act of terror.\n\nMliswa is no stranger to controversy within ZANU PF. As Mashonaland West provincial chairman, he often clashed with senior party figures, including then-First Lady Grace Mugabe during the bitter factional battles that culminated in Robert Mugabes ouster in 2017. He was expelled from ZANU PF in 2014, accused of undermining the party, but reinvented himself as an independent legislator while maintaining influence in ruling party politics through his outspoken interventions.\n\nEven outside formal ZANU PF structures, Mliswa has continued to act as a political broker, often inserting himself into factional fights. His blunt criticism of senior officials has repeatedly unsettled the establishment, while his reputation as a mobiliser with grassroots networks has made him both a threat and an asset, depending on shifting internal dynamics.\n\nThe latest attack on his home comes against the backdrop of a leaked audio in which Mliswa was recorded discussing political survival, bluntly advising allies to support whoever is in power because toda kudya, tine mhuri (we must eat, we have families).\n\nMore explosively, Mliswa has recently launched attacks on Vice President Constantino Chiwenga, accusing him of weaponising the anti-corruption narrative for personal vendettas, particularly in his alleged push for the arrest of controversial businessman Wicknell Chivayo.\n\nAccording to Mliswa, the dispute traces back to lavish financial demands Chiwenga allegedly made during his 2022 wedding to Colonel Miniyothabo Baloyi. Mliswa claims Chivayo was pressured to bankroll the event to the tune of several million dollars, including six Rolls-Royce vehicles, US$250,000 for wedding preparations, another US$250,000 for a Seychelles honeymoon, R1 million for shopping in South Africa, R1 million for gifts, and US$450,000 for apartments for Chiwengas children. Chivayo reportedly delivered most of the money, but the fallout allegedly began when he failed to provide the outstanding US$150,000.\n\nMliswa has framed Chiwengas anti-Chivayo crusade as payback rather than genuine anti-corruption reform. He has also criticised the vice president for publicly confronting President Emmerson Mnangagwa during Politburo meetings, warning that such disputes should be handled discreetly.\n\nEarlier this week, Mliswas vehicle was reportedly vandalised, an incident he suggested was linked to his outspoken remarks about Chiwenga. The torching of his Shurugwi home appears to have escalated those hostilities.\n\nDespite his long history of feuding with ZANU PF heavyweights, Mliswa has managed to survive politically, often positioning himself as a maverick voice exposing corruption and factionalism within the ruling elite.\n\nFollowing the suspected arson attack, Mliswa reportedly left Zimbabwe for Johannesburg, South Africa, on Thursday afternoon, raising questions about whether he is seeking temporary refuge or regrouping for another round of political confrontation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Outspoken former ZANU PF Mashonaland West Provincial chairman Temba Mliswa says his rural home in Shurugwi … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/mliswa-survives-assassination-attempt/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Survives Assassination Attempt\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "Police Release List Of Red Traffic Light Violators In Central Harare",
            "url": "https://www.zimeye.net/2025/10/03/police-release-list-of-red-traffic-light-violators-in-central-harare/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has released registration numbers of vehicles caught on camera flouting red traffic lights in Harares Central Business District.\n\nPolice Spokesperson Commissioner Paul Nyathi said the violations were captured through the Electronic Traffic Management System and warned that all implicated vehicle owners must cooperate with authorities.\n\nAll the vehicle owners with registration numbers on the attached list are advised to report at any nearest police station to assist in the ongoing investigations within the next seven days, Nyathi said.\n\nHe stressed the importance of compliance, adding: Vehicle owners and those in possession of the vehicles are urged to cooperate with the police to assist in the maintenance of law and order in the country.\n\nNyathi also urged drivers to respect traffic laws to improve road safety. The Zimbabwe Republic Police implores motorists to observe road rules and regulations to enhance the smooth flow of traffic and curb road traffic accidents, he said.\n\nAuthorities say the clampdown is part of a broader push to restore discipline among motorists and reduce accidents in the capital.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has released registration numbers of vehicles caught on camera flouting red traffic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/police-release-list-of-red-traffic-light-violators-in-central-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Police Release List Of Red Traffic Light Violators In Central Harare\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "Mliswa Under Attack",
            "url": "https://www.zimeye.net/2025/10/03/mliswa-under-attack/",
            "content": "By A Correspondent  Former ZANU PF Mashonaland West Provincial Chairman Temba Mliswa is once again in the eye of Zimbabwes stormy factional politics after his rural home in Shurugwi was set ablaze by unknown assailants on Wednesday night.\n\nMliswa, who also serves as a village head in the area, revealed the incident in a post on X (formerly Twitter) on Thursday morning, describing it as a direct response to his outspoken stance against corruption and abuse of power.\n\nI have always known that corruption fights back and am prepared for everything. Last night they sneaked and burnt my house in Shurugwi all because I asked for accountability and transparency. Thank God no one was hurt. Mapisa Nyadzonia! he wrote.\n\nTheNyadzoniareference evoked Zimbabwes liberation history, recalling the August 1976 massacre in Mozambique where over 1,000 unarmed civilians at a ZANLA camp were killed by Rhodesian forces. By invoking this tragedy, Mliswa underscored his belief that challenging entrenched power in Zimbabwe remains a dangerous pursuit.\n\nThe suspected arson comes amid heightened factional battles inside ZANU PF and shortly after the leak of an audio conversation between Mliswa and his ally Bopela. In the recording, Mliswa bluntly remarked:Support whoever is in power.Toda kudya, tine mhuri.\n\nBut his recent political interventions have been anything but cautious. Mliswa has zeroed in on Vice President Constantino Chiwenga, accusing him of abusing the anti-corruption agenda to pursue personal vendettas.\n\nAccording to Mliswa, Chiwengas escalating fight with businessman Wicknell Chivayo is not about rooting out corruption but about settling old financial scores. He alleged that Chivayo had been pressured into bankrolling Chiwengas extravagant 2022 wedding to Colonel Miniyothabo Baloyi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former ZANU PF Mashonaland West Provincial Chairman Temba Mliswa is once again in the eye of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/mliswa-under-attack/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Under Attack\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        },
        {
            "title": "Ndini Ndamubata In Trouble For Concealing Mbanje Seized From Suspect",
            "url": "https://www.zimeye.net/2025/10/03/ndini-ndamubata-in-trouble-for-concealing-mbanje-seized-from-suspect/",
            "content": "A 21-year-old member of the Zimbabwe Republic Police (ZRP) Constabulary, Nqobile Mutale, has been convicted by the Lupane Magistrates Court for obstructing the course of justice after admitting to tampering with evidence in a drug-related case.\n\nMutale was stationed at the Lupane Terminus Base on 18 September 2025 when he received information that Thulani Sibanda was in unlawful possession of dagga. He arrested Sibanda and escorted him to the police station. However, instead of properly processing the seized drugs, Mutale colluded with Sibanda to conceal part of the recovered dagga.\n\nPolice investigations later uncovered the hidden stash behind the police base, after Mutale voluntarily led detectives to the location.\n\nMutale pleaded guilty to the offence and was sentenced to 24 months in prison, with 9 months suspended. The remaining 15 months were suspended on the condition that he completes 525 hours of community service.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A 21-year-old member of the Zimbabwe Republic Police (ZRP) Constabulary, Nqobile Mutale, has been convicted by the Lupane Magistrates’ Court … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/03/ndini-ndamubata-in-trouble-for-concealing-mbanje-seized-from-suspect/\">Continue reading<span class=\"screen-reader-text\"> \"Ndini Ndamubata In Trouble For Concealing Mbanje Seized From Suspect\"</span></a></p>",
            "time": "06:32",
            "date": "04 Oct 2025"
        }
    ]
}