{
    "news": [
        {
            "title": "MWOS Winless Run Continues",
            "url": "https://www.zimeye.net/2025/08/17/mwos-winless-run-continues/",
            "content": "By Sports Correspondent\n\nMWOS FCs struggles in the Castle Lager Premier Soccer League continued on Saturday after they suffered a narrow 10 defeat to Simba Bhora at Ngoni Stadium.\n\nA late strike sealed victory for Simba Bhora, leaving Lloyd Mutasas men without a win in their last six league matches.\n\nSpeaking after the match, head coach Mutasa remained philosophical despite the setback. Just like in real life, football has its ups and downs, he said, urging his side to keep fighting as they look to turn around their fortunes.\n\nThe result piles pressure on MWOS, who will be desperate to end their winless streak in upcoming fixtures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent MWOS FC’s struggles in the Castle Lager Premier Soccer League continued on Saturday after they suffered a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/mwos-winless-run-continues/\">Continue reading<span class=\"screen-reader-text\"> \"MWOS Winless Run Continues\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Another ZRP Assistant Inspector Confronts Mnangagwa Over Misplaced Priorities",
            "url": "https://www.zimeye.net/2025/08/17/another-zrp-assistant-inspector-confronts-mnangagwa-over-misplaced-priorities/",
            "content": "By A Correspondent\n\nA recently retired Zimbabwe Republic Police (ZRP) Assistant Inspector has launched a scathing attack on President Emmerson Mnangagwas government, criticising its decision to donate welfare goods to Mozambique while Zimbabweans continue to struggle with shortages of food, medicine, and basic services.\n\nTongai Fambi, who served as Office-In-Charge at Rujeko Police Station before retiring last month, said the governments foreign donations are a ploy to impress the international community while neglecting domestic needs.\n\nHe described the gesture as fiction that ordinary Zimbabweans will not accept. In his full statement, Fambi said:\n\nSelf-sustenance by African societies to assist each other in times of disaster is a big achievement towards a truly independent continent. However, this should be done in good faith, not in bad faith. That ZANU PF can stand on the international stage to fool the world by donating to Mozambique is itself a mockery to the people of Zimbabwe.\n\nYou can fool Mozambique, you can fool Africa and the world as you posture as a concerned entity, but as Zimbabweans, we refuse to buy such fiction.\n\nHave they ever done anything for the families of parents killed in the 2008 state-sponsored violence? Claiming to be the savior of Africa while stealing from cotton and tobacco farmers  do they think we cannot see?\n\nRural households pay taxes, yet have no safe water. Our cities water systems are broken, and boreholes are installed only in locations visible to cameras to create a false impression. Down in Sovelele, Chionde, Chadereka, there are no boreholes. Fear and control are the only tools of ZANU PF.\n\nLook at the state of our roads, our health system, our education system, and the salaries of our people. It is our hospitals that need donations, not Mozambique. ZANU PF, spare us this drama. We are suffering.\n\nFambis outspoken criticism adds to mounting voices accusing the government of prioritising appearances and foreign goodwill over urgent domestic needs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A recently retired Zimbabwe Republic Police (ZRP) Assistant Inspector has launched a scathing attack on President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/another-zrp-assistant-inspector-confronts-mnangagwa-over-misplaced-priorities/\">Continue reading<span class=\"screen-reader-text\"> \"Another ZRP Assistant Inspector Confronts Mnangagwa Over Misplaced Priorities\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Tshabangu Sings for His Supper, Praises Mnangagwa Over Airport Renovations",
            "url": "https://www.zimeye.net/2025/08/17/tshabangu-sings-for-his-supper-praises-mnangagwa-over-airport-renovations/",
            "content": "By A Correspondent\n\nControversial Citizens Coalition for Change (CCC) Secretary General, Senator Sengezo Tshabangu, has once again drawn fire after showering praise on the ZANU PF government for renovations at the Robert Gabriel Mugabe International Airport in Harare.\n\nSeen by many as a ruling party proxy, Tshabangu hailed President Emmerson Mnangagwas administration for the facelift, remarks critics say amount to political bootlicking at a time when ordinary Zimbabweans are suffering under a collapsing economy.\n\nIf we dont tell the good Zimbabwean story, who will? This is the newly renovated RGM International Airport in Harare. It provides advanced features that are comparable to none when it comes to Southern Africa.\n\nWell done Ministry of Transport and Infrastructure Development, said Tshabangu on Saturday.\n\nHis comments, however, have been slammed as tone-deaf and out of touch. Analysts note that praising bricks and mortar projects while millions struggle to afford food, healthcare, and basic services only highlights how disconnected Tshabangu has become from the realities facing citizens.\n\nFor many, the airport renovations serve a privileged few, while the majority continue to endure poverty, unemployment, and skyrocketing prices. Critics argue that Tshabangus remarks are less about national progress and more about currying favour with Mnangagwas government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Citizens Coalition for Change (CCC) Secretary General, Senator Sengezo Tshabangu, has once again drawn fire after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/tshabangu-sings-for-his-supper-praises-mnangagwa-over-airport-renovations/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Sings for His Supper, Praises Mnangagwa Over Airport Renovations\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Top Notorious Cop Falls on Hard Times",
            "url": "https://www.zimeye.net/2025/08/17/top-notorious-cop-falls-on-hard-times/",
            "content": "By A Correspondent- Notorious former head of the Zimbabwe Republic Police (ZRP) Criminal Investigations Department (CID) Law and Order Division in Harare, Crispen Makendenge, is reported to be battling mental illness after years of notoriety under the late President Robert Mugabes regime.\n\nMakendenge earned infamy as one of the most ruthless enforcers of state repression, accused of torturing opposition activists and harassing independent journalists.\n\nUnder his watch, the Law and Order Section became synonymous with abductions, brutal interrogations, and intimidation, often working in close collaboration with the Central Intelligence Organisation (CIO).\n\nTogether, these security arms spearheaded campaigns against civil society groups, student leaders, and pro-democracy activists, using arbitrary arrests, prolonged detentions, and beatings to silence dissent.\n\nA recent photo of Makendenge, published byCrime Watch Zim, shows him in a state of decline, sparking heated debate on social media. Many Zimbabweans interpreted his condition as a form of karma orngozi(atonement for past wrongdoing).\n\nAmong the most harrowing cases linked to Makendenge is that of opposition politicianJob Sikhala, who has publicly accused him of subjecting him to electrocution and other forms of torture during interrogations. Sikhala, however, has stated he would still choose to show Makendenge love and kindness despite the suffering inflicted upon him.\n\nJournalists were not spared either. Reporters who now work for independent outlets recall Makendenges relentless harassment, including raids, arrests, and interrogations designed to crush investigative journalism.\n\nThese actions were part of a broader state campaign to muzzle the independent press, which was viewed as a threat to Mugabes grip on power.\n\nNow reportedly struggling with mental health problems, Makendenges plight has become a subject of public reflection.\n\nMany Zimbabweans see it as a cautionary tale of the consequences of abusing authority and wielding state power to oppress others.\n\nThe reactions underline an enduring national conversation about justice, accountability, and the long-term impact of cruelty on both victims and perpetrators.\n\nWhile some believe Makendenges suffering is poetic justice, others argue that Zimbabwe still lacks a formal mechanism of transitional justice to address decades of human rights abuses committed by state security forces.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- Notorious former head of the Zimbabwe Republic Police (ZRP) Criminal Investigations Department (CID) Law and Order Division … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/top-notorious-cop-falls-on-hard-times/\">Continue reading<span class=\"screen-reader-text\"> \"Top Notorious Cop Falls on Hard Times\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Varakashi Celebrate Suffering Of Citizens",
            "url": "https://www.zimeye.net/2025/08/17/varakashi-celebrate-suffering-of-citizens/",
            "content": "By A Correspondent\n\nZANU PF-aligned online activists, popularly known as Varakashi, have drawn outrage after appearing to celebrate the suffering of ordinary citizens while mocking critics of the ruling party.\n\nIn a statement posted over the weekend on the Friends of Emmerson Mnangagwa official Facebook platform, the group dismissed any hopes of regime change and insisted the party would remain in power indefinitely.\n\nThe greatest mistake anyone can make is thinking ZANU PF can be voted out. ZANU PF is a big machine that always works and remains with the people. Its leadership understands its mission, and that mission is to serve Zimbabweans, read part of the post.\n\nThe statement has triggered anger among government critics, who argue that celebrating the publics hardship shows insensitivity at a time when many Zimbabweans are grappling with economic difficulties.\n\nAnalysts say the remarks highlight the widening gap between the ruling elite and ordinary citizens who continue to struggle with the rising cost of living.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF-aligned online activists, popularly known as Varakashi, have drawn outrage after appearing to celebrate the suffering … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/varakashi-celebrate-suffering-of-citizens/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi Celebrate Suffering Of Citizens\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Josephina Mnangagwa Dies",
            "url": "https://www.zimeye.net/2025/08/17/josephina-mnangagwa-dies/",
            "content": "By A Correspondent\n\nJosephina Mnangagwa, the wife of the late Albert Mnangagwa, has died.\n\nIn a statement released by the ZANU PF Midlands Province Information Desk, officials confirmed the passing and offered condolences to the bereaved family.\n\nThis morning, Midlands Province Minister of State and Devolution Hon. Owen Ncube, Members of Parliament, and Government officials paid their condolences to the Mnangagwa family following the passing of Josephina Mnangagwa, wife of the late Albert Mnangagwa, the statement read.\n\nMourners are gathered at Sanders Farm, located 10km from Kwekwe along Mvuma Road, where relatives and friends are paying their respects.\n\nThe late Josephina Mnangagwa will be laid to rest on Sunday at her farm.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Josephina Mnangagwa, the wife of the late Albert Mnangagwa, has died. In a statement released by the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/josephina-mnangagwa-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Josephina Mnangagwa Dies\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Ex-Police Officer Criticises Mnangagwa Over Aid to Mozambique As Zimbabweans Struggle",
            "url": "https://www.zimeye.net/2025/08/17/ex-police-officer-criticises-mnangagwa-over-aid-to-mozambique-as-zimbabweans-struggle/",
            "content": "By A Correspondent\n\nA recently retired Zimbabwe Republic Police (ZRP) Assistant Inspector has launched a scathing attack on President Emmerson Mnangagwas government, criticising its decision to donate welfare goods to Mozambique while Zimbabweans continue to struggle with shortages of food, medicine, and basic services.\n\nTongai Fambi, who served as Office-In-Charge at Rujeko Police Station before retiring last month, said the governments foreign donations are a ploy to impress the international community while neglecting domestic needs.\n\nHe described the gesture as fiction that ordinary Zimbabweans will not accept.\n\nIn his full statement, Fambi said:\n\nSelf-sustenance by African societies to assist each other in times of disaster is a big achievement towards a truly independent continent. However, this should be done in good faith, not in bad faith. That ZANU PF can stand on the international stage to fool the world by donating to Mozambique is itself a mockery to the people of Zimbabwe.\n\nYou can fool Mozambique, you can fool Africa and the world as you posture as a concerned entity, but as Zimbabweans, we refuse to buy such fiction. Have they ever done anything for the families of parents killed in the 2008 state-sponsored violence? Claiming to be the savior of Africa while stealing from cotton and tobacco farmers  do they think we cannot see?\n\nRural households pay taxes, yet have no safe water. Our cities water systems are broken, and boreholes are installed only in locations visible to cameras to create a false impression. Down in Sovelele, Chionde, Chadereka, there are no boreholes. Fear and control are the only tools of ZANU PF.\n\nLook at the state of our roads, our health system, our education system, and the salaries of our people. It is our hospitals that need donations, not Mozambique. ZANU PF, spare us this drama. We are suffering.\n\nFambis outspoken criticism adds to mounting voices accusing the government of prioritising appearances and foreign goodwill over urgent domestic needs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A recently retired Zimbabwe Republic Police (ZRP) Assistant Inspector has launched a scathing attack on President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/ex-police-officer-criticises-mnangagwa-over-aid-to-mozambique-as-zimbabweans-struggle/\">Continue reading<span class=\"screen-reader-text\"> \"Ex-Police Officer Criticises Mnangagwa Over Aid to Mozambique As Zimbabweans Struggle\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "A Tribute To CIO Director Michael Muchenje Nyere",
            "url": "https://www.zimeye.net/2025/08/17/a-tribute-to-cio-director-michael-muchenje-nyere/",
            "content": "By Dr. Masimba Mavaza\n\nI was sitting at Gate 4, waiting to board the always-delayed Ugandan Airways flight. My heart was heavy as I prepared to leave the motherland once again for the so-called slave yard. Then a message flickered onto my phone from a colleague. It carried the heaviest, most painful news: Director Nyere is no more.\n\nI had just met him. I never knew that meeting was a farewell.\n\nToday, we mourn the loss of a remarkable individual who dedicated his life to serving our nation. As a distinguished intelligence officer, Director Michael Muchenje Nyere demonstrated exceptional skill, unwavering commitment, and unshakable integrity.\n\nIt is with profound grief and sorrow that the nation learnt of the untimely death of the late Cde. Michael Muchenje Nyere, who passed away suddenly on August 14, 2025. Known to those close to him as Cde. KIM, he was a practical officer who knew no bounds.\n\nMichael Muchenje Nyere was born on April 24, 1961, in Chigasiye Village, Goromonzi District, Mashonaland East Province, to Fidelis Samie Nyere and Regina Raganai. From 1968 to 1974, he pursued his primary education at Ushewokunze Primary School in Seke District, before proceeding to Harare High School in Mbare, where he studied from 1975 to 1978. He successfully completed his A Levels at the same school in 1979.\n\nHis journey in service began with civilian employment. After completing A Levels, he worked at Barclays Bank from March 1981 to March 1982, then as a teacher at Mukaro Secondary School in Gutu (April to August 1982). From September 1982 to September 1983, he served as a Personnel Clerk at Old Mutual.\n\nIn his pursuit of higher learning, Cde. Nyere enrolled at the University of Zimbabwe, where he obtained a Bachelor of Arts (Honours) degree in History (19841986). Motivated by the desire to defend the independence dividend, he was attested into the Presidents Department on May 1, 1988, as an Assistant Intelligence Officer under the External Branch.\n\nHe completed his Basic Intelligence Training Course at Hatfield Training Academy and began his career as an Evaluation Officer. His precision and devotion to duty saw him promoted to Assistant Senior Intelligence Officer (ASIO) in 1991.\n\nIn the same year, he was posted to Ethiopia as a Liaison Officer, where he served with distinction until 1995. On his return, he was appointed to the Evaluation Division and promoted to Senior Intelligence Officer (SIO) in January 1996. Four years later, in 2000, he rose to Divisional Intelligence Officer (DIO) and Deputy Head of the Evaluation Division.\n\nIn 2004, he was deployed to Rome, Italy, as Liaison Officer. During this tour of duty (20042011), he tenaciously defended Zimbabwes national interests against Western diplomatic onslaughts. Later, under Director General Isaac Moyo, he was tasked to engage private media journalists, encouraging them to defend their country with honesty and without bias.\n\nIn 2011, he was promoted to Principal Intelligence Officer (PIO) and appointed Head of Anti-Corruption Investigations under the Economics Branch. A year later, in August 2012, he became Principal Staff Officer (PSO) to the Director General.\n\nFrom 2015 onwards, Nyere continued to ascend through the ranks  redeployed as Head of Evaluation (PIO) in the External Branch, then promoted to Assistant Director, Planning and Co-ordination (2018), Deputy Director of the same (2020), and finally Director of Analysis and Co-ordination after the division was upgraded into a full branch. On February 6, 2025, he was redeployed to the Economics Branch, where he served until his sudden passing.\n\nCde. Nyere was more than just a senior officer; he was a fatherly figure whose wisdom and counsel guided many. In meetings, he often spoke of truth and responsibility. Loving a country does not mean lying through writing, he once told me. Let the truth be said responsibly.\n\nOn another occasion, he reflected: Some journalists will be punished in heaven for giving people an overdose of truth, and others for starving people of the truth. Strike a balancebe responsible and truthful.\n\nSuch was the depth of his wisdom.\n\nHe inspired not only his colleagues in the intelligence community but also writers and journalists. Unlike some officers consumed by pride, Nyere was humble, approachable, and deeply committed to nurturing others.\n\nJust days before his passing, I met him at the Monomotapa Hotel for one of our usual review meetings. He showed no signs of illness. We shared a warm, meaningful conversationhis dedication, expertise, and love for country still abundant and clear.\n\nHis contributions to Zimbabwes national security and defence will not be forgotten. His legacy is one of unwavering service, inspiring leadership, and unmatched integrity.\n\nAs we bid farewell to this remarkable patriot, we take comfort in knowing his work will continue to inspire and protect our nation.\n\nMay Director Michael Muchenje Nyere rest in eternal peace, knowing his service has made a lasting impact.\n\nFare thee well, comrade. Rest in peace, Simboti  the Leopard of Integrity.Your legacy lives on in the hearts of those you served and inspired.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Masimba Mavaza I was sitting at Gate 4, waiting to board the always-delayed Ugandan Airways flight. My heart … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/a-tribute-to-cio-director-michael-muchenje-nyere/\">Continue reading<span class=\"screen-reader-text\"> \"A Tribute To CIO Director Michael Muchenje Nyere\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Another Mnangagwa Ally Bags Lucrative Ambulance Tender",
            "url": "https://www.zimeye.net/2025/08/17/another-mnangagwa-ally-bags-lucrative-ambulance-tender/",
            "content": "By Political Reporter One of President Emmerson Mnangagwas staunch allies,David Munowenyu, has controversially secured a lucrative tender to supply ambulance services to Harare City Council, in a move that has triggered outrage among residents and split councillors.\n\nMunowenyu, the owner ofDiscovery Ambulance Services, has been closely linked with Mnangagwas health initiatives, frequently criss-crossing the country under thePresidential Emergency Medical Scheme, where his company provided services during state medical outreaches. His latest windfall follows a familiar pattern in which Zanu PF-aligned businesspeople and loyalists are awarded government and municipal tenders without going through transparent procurement processes.\n\nDuring the last full council meeting, councillors clashed bitterly over the deal, which will see Harare residents payingdouble feesfor ambulances  an upfront charge for services on top of the existingUS$1 monthly emergency services levyalready collected by council.\n\nCivil society groups argue that the contract is another example of the ruling partys patronage system at work.Precious Shumba, director of the Harare Residents Trust, blasted the arrangement:\n\nPrivatisation of public services is not the best way to improve health delivery. The Discovery Ambulance Services deal was not selected through a competitive bidding process but handpicked on an unsolicited submission. Such contracts, with financial implications for millions of residents, must be transparent and accountable.\n\nSimilarly,Combined Harare Residents Association (CHRA) coordinator, Reuben Akili, accused the city of being captured by political elites:\n\nThere was no proper tendering, no due processes. The City of Harare has been collecting emergency levy funds all year to buy ambulances, yet not a single vehicle has been procured. Instead, residents are being punished by deals that enrich Zanu PF-linked cronies.\n\nCurrently, Harares 2.4 million residents rely on onlyfour functioning public ambulances, compared to the international standard of at least 48, highlighting how dire the shortage is.\n\nCritics also point out that Munowenyu joins a long list of Mnangagwas allies who have benefitted from questionable state or council tenders. These include:\n\nThe latest ambulance deal fits into this entrenched system ofpolitical patronage and tenderpreneurship, where loyalty to Mnangagwa is often rewarded with contracts at the expense of transparency and service delivery.\n\nCouncil spokespersonStanley Gamareferred questions to mayorJacob Mafume, who was unavailable. CouncillorDenford Ngadziorecondemned the move:\n\nResidents are already paying an ambulance levy. Forcing them to pay cash again when picked up is exploitation. This deal benefits one businessman at the expense of the public.\n\nThe founder and CEO of Discovery Ambulance,David Munowenyu, did not respond to questions.\n\nIronically, in July, Health and Child Care MinisterDouglas Mombeshorahad hailed Discovery Ambulance Services as a partner in delivering free medical services under the Presidential Emergency Medical Scheme. The Harare deal, however, appears to contradict that promise  as instead of easing the health burden, it risks deepening the costs for residents already struggling under economic hardships.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter — One of President Emmerson Mnangagwa’s staunch allies, David Munowenyu, has controversially secured a lucrative tender to supply ambulance … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/another-mnangagwa-ally-bags-lucrative-ambulance-tender/\">Continue reading<span class=\"screen-reader-text\"> \"Another Mnangagwa Ally Bags Lucrative Ambulance Tender\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        },
        {
            "title": "Cancelling Elections To Mnangagwa-rise A UN Agenda",
            "url": "https://www.zimeye.net/2025/08/17/cancelling-elections-to-mnangagwa-rise-a-un-agenda/",
            "content": "A Call to Uphold Democracy and Constitutionalism\n\nBy Gifford Gomwe | The 2030 Agenda, a United Nations plan for sustainable development, has been politicised by some individuals who seek to extend the presidential term of office beyond 2030. This move is a blatant disregard for democracy and constitutionalism.\n\nThose advocating for the extension of the presidential term are undermining the democratic principles that Zimbabwe has worked tirelessly to establish. This move is a clear attempt to subvert the will of the people and perpetuate a self-serving agenda.\n\nIt is disheartening to see some individuals using the sacred institution of ZANU PF to advance their personal interests. This is a blatant abuse of the partys principles and values. The partys primary objective is to serve the people of Zimbabwe, not to further the ambitions of a select few.\n\nThe notion of canceling elections is an affront to democracy. It is a clear indication that those advocating for it are aware that their candidate is unelectable in the 2028 elections. This move would be a catastrophic blow to Zimbabwes democratic progress and would undermine the trust of the people.\n\nWe urge all patriotic Zimbabweans to reject this attempt to undermine democracy and constitutionalism. We must stand firm in our commitment to upholding the principles of democracy and ensuring that the will of the people is respected.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Call to Uphold Democracy and Constitutionalism By Gifford Gomwe | The 2030 Agenda, a United Nations plan for sustainable … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/17/cancelling-elections-to-mnangagwa-rise-a-un-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Cancelling Elections To Mnangagwa-rise A UN Agenda\"</span></a></p>",
            "time": "09:38",
            "date": "18 Aug 2025"
        }
    ]
}