{
    "news": [
        {
            "title": "Supersport Secures Rights To Broadcast 2025 AFCON",
            "url": "https://www.zimeye.net/2025/11/06/supersport-secures-rights-to-broadcast-2025-afcon/",
            "content": "Sports Correspondent\n\nSupersport TV has confirmed that it has reached an agreement with the Confederation of African Football (CAF) to broadcast the 2025 Africa Cup of Nations (AFCON).\n\nThe deal ensures that football fans across the continent will be able to watch all the matches live on Supersport platforms, marking a major win for African football lovers eager to follow their national teams in action.\n\nZimbabwe is among the qualified nations for the continental showpiece and will compete in Group B alongside Egypt, South Africa, and Angola. The Warriors return to AFCON has reignited excitement among local supporters, who are hopeful the team will make a strong impression against some of Africas traditional football powerhouses.\n\nThe 2025 AFCON, set to be hosted in Morocco, promises to deliver thrilling encounters and showcase Africas finest football talent. With Supersports coverage now confirmed, fans across the region can look forward to full access to live matches, highlights, and expert analysis throughout the tournament.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Supersport TV has confirmed that it has reached an agreement with the Confederation of African Football (CAF) to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/supersport-secures-rights-to-broadcast-2025-afcon/\">Continue reading<span class=\"screen-reader-text\"> \"Supersport Secures Rights To Broadcast 2025 AFCON\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "No Training Without US$1 500 Bribe, Scandal Hits Nursing Recruitment As Another Student Is Caught With Fake Certificate",
            "url": "https://www.zimeye.net/2025/11/06/no-training-without-us1-500-bribe-scandal-hits-nursing-recruitment-as-another-student-is-caught-with-fake-certificate/",
            "content": "By A Correspondent\n\nA major scandal has been unearthed in the nursing recruitment system after a student nurse at Gutu Mission Hospital allegedly used a fake certificate to gain admission into training.\n\nThe incident occurred two weeks ago when the third-year trainee reportedly sneaked out of the hostels and vanished after learning that officials were about to conduct a verification exercise on students O-Level results.\n\nInvestigations later revealed that the student only had four O-Level passes but had used a forged certificate showing six subjects to secure a place in the nursing programme.\n\nThe nursing training programmes are run by the Ministry of Health and Child Care. However, insiders allege that corruption has become deeply entrenched in the recruitment process.\n\nIt is now an open secret that getting into nursing school requires paying a US$1 500 bribe, said a source close to the recruitment process. No one gets in without paying. Academic merit is no longer the determining factor.\n\nThe source further claimed that political influence also plays a major role in admissions. Nursing schools reportedly reserve three out of every fifteen available places for ZANU PF officials, who then give them to their relatives, the source added.\n\nAn official at Gutu Mission Hospital confirmed that a student was under investigation. There is a student who is not coming to class and investigations are underway. Its too early for us to discuss this further as investigations are being carried out, said the official.\n\nThe Masvingo Provincial Medical Directors office also commented on the issue, saying, Unfortunately, we cant say anything on the matter as we have not been informed. If we get the information, we will call you.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A major scandal has been unearthed in the nursing recruitment system after a student nurse at Gutu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/no-training-without-us1-500-bribe-scandal-hits-nursing-recruitment-as-another-student-is-caught-with-fake-certificate/\">Continue reading<span class=\"screen-reader-text\"> \"No Training Without US$1 500 Bribe, Scandal Hits Nursing Recruitment As Another Student Is Caught With Fake Certificate\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "Mthuli Ncube Presents “Useless Percentages” To Suffering Citizens",
            "url": "https://www.zimeye.net/2025/11/06/mthuli-ncube-presents-useless-percentages-to-suffering-citizens/",
            "content": "By A Correspondent\n\nZimbabweans have angrily rejected Finance Minister Mthuli Ncubes glowing claims about the countrys economy, insisting that government figures are meaningless in the face of soaring prices, stagnant wages, and daily struggles.\n\nProf Ncube addressed the 2026 Parliament Pre-Budget Seminar in Bulawayo on Wednesday, claiming that a significant number of Zimbabweans have reached middle-income status, reportedly spending an average of US$9 per day. He said the country was on track to achieving upper-middle-income status by 2030 under the National Development Strategy 1 (NDS1).\n\nThe National Development Strategy 1is coming to an end at the end of the year, December 31. I am happy to report that the average rate of economic growth during 2021 to 2025 will be 5,6 percent of GDP because we are expecting 6,6 percent growth this year, Prof Ncube said.\n\nBut citizens were quick to dismiss the figures. We dont eat percentages and GDP growth rates. We eat food, pay school fees, and buy fuel, said a Harare resident. How is US$9 a day middle-income? That barely keeps us alive.\n\nProf Ncube highlighted infrastructure projects in roads, dams, and energy as proof of progress. During the NDS1 period, we have seen accelerated investments in infrastructure and energy, by both Government and independent power producers, he said.\n\nYet the public sees little benefit. Our hospitals are under-equipped, schools are struggling, and we have constant power cuts, said a Bulawayo teacher. We dont see these so-called investments in our daily lives.\n\nOn macroeconomic stability, Prof Ncube argued that Zimbabweans GNI per capita of US$3 300 meant they were already middle-income. If you can spend US$9 per day consistently, you are already middle income. To get to upper middle income, you need US$12 per day. Since you are already spending US$9, you are already there, he claimed.\n\nAngry citizens remained unconvinced. These are empty numbers. Most of us are barely surviving, said a Harare street vendor. Statistics wont put bread on our tables.\n\nProf Ncube also highlighted growing foreign currency reserves and government reforms aimed at attracting investment. But ordinary Zimbabweans remain sceptical. Prices keep rising, salaries are stagnant, and yet the government talks about billions in reserves. We dont eat empty figures, said a local businessman.\n\nAs the 2026 budget approaches, Zimbabweans are making it clear: economic statistics mean nothing if ordinary citizens continue to struggle for survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabweans have angrily rejected Finance Minister Mthuli Ncube’s glowing claims about the country’s economy, insisting that government … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/mthuli-ncube-presents-useless-percentages-to-suffering-citizens/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Ncube Presents “Useless Percentages” To Suffering Citizens\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "Top Judge Dragged into Chapfika Estate Dispute",
            "url": "https://www.zimeye.net/2025/11/06/top-judge-dragged-into-chapfika-estate-dispute/",
            "content": "By Crime and Courts Reporter- A group of 20 property buyers has petitioned the Judicial Service Commission (JSC) to investigate the handling of a long-running property dispute involving land in Glen Lorne, Harare.\n\nThe buyers accuse the seller, Editha Investments (Pvt) Ltd, of refusing to cede residential stands despite having received full payment more than a decade ago. They argue that the matter has been marked by inconsistencies in court handling, conflicting orders, and questions over procedural fairness.\n\nThe case has over the years been presided over by High Court judges Justices Tawanda Chitapi, Siyabona Musithu, and Jacob Manzunzu under various case numbers, including HC9336/17, HC7373/23, and HH545/24. The petitioners have also asked the JSC to examine how Justice Musithu last year set aside an earlier order by consent issued by Justice Chitapi in 2019.\n\nAccording to court documents, the complainants entered into agreements of sale with Editha Investments in 2013 and 2014 for land described as Lot 1 of Subdivision C of Subdivision D of Ntaba, registered under title number 4214/2013, situated along Emmerson Dambudzo Mnangagwa Road in northern Harare. They claim they paid the full purchase price in United States dollars, the official currency at the time, but the developer allegedly failed to service the land or transfer ownership as agreed.\n\nIn December 2019, Justice Chitapi issued an order by consent following a deed of settlement between the purchasers and Editha Investments. Transfer of title deeds had not been finalized when company owner Mr. McDonald Chapfika died of natural causes in 2020. After Chapfikas death, the purchasers sought to compel the estate to comply with the 2019 consent order.\n\nIn November 2024, Chapfikas sons, Evans and Panashe, approached the High Court under case number HC7373/23, claiming to be joint executors of the estate and seeking cancellation of the 2019 consent order. However, records from the Master of the High Court show that the pair had been removed as joint executors on October 25, 2023, under estate file DR239/2019, after Panashe reportedly resigned in protest over the alleged mishandling of estate assets. On the same day, the Master appointed Mr. Caleb Mucheche as the new executor.\n\nLawyers representing the land purchasers, Chatsama and Associates and J. Mambara and Associates, argued that the sons application was invalid because they no longer held authority over the estate. They further noted that the founding affidavit of Editha Investments, signed by Mr. Derek Vuyani Kona, lacked a company resolution authorizing him to represent the firm. The affidavit, they said, merely adopted the Chapfika brothers earlier affidavit and was therefore legally defective. Despite these objections, Evans Chapfika later sought reinstatement as executor, an application that was granted by Justice Musithu, who went on to set aside Justice Chitapis 2019 consent order.\n\nIn their petition, the land purchasers have asked the JSC to investigate the circumstances under which Justice Musithu reinstated only Evans Chapfika as executor and subsequently overturned Justice Chitapis 2019 order. They have also queried the authenticity of a purported new order allegedly issued by Justice Chitapi on January 22, 2025, under case number HCH4346/25, which appears to reverse his earlier 2019 ruling.\n\nAccording to the petitioners, they were never served with any notice of hearing or order relating to the supposed January 2025 proceedings. They also allege that the Registrar of the High Courts notification letter, dated January 23, 2025, listed non-existent email and physical addresses, raising further doubts about the orders legitimacy.\n\nIn correspondence dated October 1, 2025, the buyers lawyers wrote to the Registrar demanding clarification, saying: We inquire the circumstances in respect of which this matter was brought before Justice Chitapi given that he himself had granted a final order by consent in this matter. How and under what circumstances was this matter revived? The right to be heard is part of administrative justice codified in Section 68 of the Constitution and Section 3 of the Administrative Justice Act. Our clients were never notified of any case management meeting in January 2025, and to date they have not been served with the order of January 22, 2025.\n\nThe lawyers also questioned the absence of a barcode on the alleged order, which they said was unusual in official court documents, and called on the JSC to verify its authenticity. In a letter dated October 20, 2025, the Judicial Service Commission acknowledged receipt of the complaint and confirmed that it would review the allegations raised against Justice Musithu and the Registrar of the High Court.\n\nEfforts to obtain comment from Mr. Evans Chapfika and Mr. Caleb Mucheche were unsuccessful at the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- A group of 20 property buyers has petitioned the Judicial Service Commission (JSC) to investigate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/top-judge-dragged-into-chapfika-estate-dispute/\">Continue reading<span class=\"screen-reader-text\"> \"Top Judge Dragged into Chapfika Estate Dispute\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "ZANU PF “Hijacks” Nursing Recruitment Process",
            "url": "https://www.zimeye.net/2025/11/06/zanu-pf-hijacks-nursing-recruitment-process/",
            "content": "By A Correspondent\n\nA shocking scandal has emerged in Zimbabwes nursing recruitment system, with allegations that ZANU PF officials are manipulating admissions to benefit party loyalists, turning what should be a merit-based process into one dominated by politics and corruption.\n\nThe controversy erupted following an incident at Gutu Mission Hospital, where a student nurse allegedly used a fake certificate to gain entry into the training programme.\n\nThe third-year trainee reportedly fled the hostels two weeks ago after learning that officials were about to verify students O-Level results.\n\nSubsequent investigations revealed that the student only had four O-Level passes but had used a forged certificate showing six subjects to secure a place in the programme.\n\nAlthough the nursing training schools are officially run by the Ministry of Health and Child Care, insiders claim that corruption and political influence have become deeply embedded in the recruitment system.\n\nIt is now an open secret that getting into nursing school requires paying a US$1 500 bribe, said a source close to the recruitment process. No one gets in without paying. Academic merit is no longer the determining factor.\n\nThe source alleged that ZANU PF officials have effectively taken control of the selection process. Nursing schools reportedly reserve three out of every fifteen available places for ZANU PF officials, who then give them to their relatives or people connected to the party, the source added.\n\nHealth sector observers have warned that the politicisation of nursing recruitment could have dangerous consequences for public health. When political connections matter more than competence, its the patients who suffer, said one Masvingo-based health worker.\n\nOfficials at the Masvingo Provincial Medical Directors Office were reluctant to comment on the matter. We are in a meeting, we will come back to you, said an official at Benjamin Burombo Building in Masvingo.\n\nThe Ministry of Health and Child Care is yet to issue an official statement regarding the allegations of bribery and political interference in the nursing recruitment process.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking scandal has emerged in Zimbabwe’s nursing recruitment system, with allegations that ZANU PF officials are … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/zanu-pf-hijacks-nursing-recruitment-process/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF “Hijacks” Nursing Recruitment Process\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "We Don’t Eat Empty Figures, Angry Zimbabweans Tell Mthuli Ncube",
            "url": "https://www.zimeye.net/2025/11/06/we-dont-eat-empty-figures-angry-zimbabweans-tell-mthuli-ncube/",
            "content": "By A Correspondent\n\nZimbabweans have rejected Finance Minister Mthuli Ncubes glowing claims about the countrys economy, insisting that government figures are useless in the face of soaring prices, stagnant wages, and daily hardships.\n\nProf Ncube addressed the 2026 Parliament Pre-Budget Seminar in Bulawayo on Wednesday, claiming that a significant number of Zimbabweans have reached middle-income status, spending an average of US$9 per day. He said the country was on track to achieving upper-middle-income status by 2030 under the National Development Strategy 1 (NDS1).\n\nThe National Development Strategy 1is coming to an end at the end of the year, December 31. I am happy to report that the average rate of economic growth during 2021 to 2025 will be 5,6 percent of GDP because we are expecting 6,6 percent growth this year, Prof Ncube said.\n\nBut citizens were quick to dismiss the figures. We dont eat percentages and GDP growth rates. We eat food, pay school fees, and buy fuel, said a Harare resident. How is US$9 a day middle-income? That barely keeps us alive.\n\nProf Ncube also touted infrastructure projects in roads, dams, and energy as evidence of progress. During the NDS1 period, we have seen accelerated investments in infrastructure and energy, by both Government and independent power producers, he said.\n\nYet the public sees little benefit. Our hospitals are under-equipped, schools are struggling, and we have constant power cuts, said a Bulawayo teacher. We dont see these so-called investments in our daily lives.\n\nOn macroeconomic stability, Prof Ncube argued that Zimbabweans GNI per capita of US$3 300 meant they were already middle-income. If you can spend US$9 per day consistently, you are already middle income. To get to upper middle income, you need US$12 per day. Since you are already spending US$9, you are already there, he claimed.\n\nAngry citizens were unimpressed. These are empty numbers. Most of us are barely surviving, said a Harare street vendor. Statistics wont put bread on our tables.\n\nProf Ncube also highlighted growing foreign currency reserves and government reforms aimed at attracting investment. But ordinary Zimbabweans remain sceptical. Prices keep rising, salaries are stagnant, and yet the government talks about billions in reserves. We dont eat empty figures, said a local businessman.\n\nAs the 2026 budget approaches, Zimbabweans are making it clear: economic statistics mean nothing if ordinary citizens continue to struggle for survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabweans have rejected Finance Minister Mthuli Ncube’s glowing claims about the country’s economy, insisting that government figures … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/we-dont-eat-empty-figures-angry-zimbabweans-tell-mthuli-ncube/\">Continue reading<span class=\"screen-reader-text\"> \"We Don’t Eat Empty Figures, Angry Zimbabweans Tell Mthuli Ncube\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "Watch: Zanu PF Youths Call for Extension of Mnangagwa’s Term to 2040",
            "url": "https://www.zimeye.net/2025/11/06/watch-zanu-pf-youths-call-for-extension-of-mnangagwas-term-to-2040/",
            "content": "By A Correspondent- A video showing Zanu PF youths calling for an extension of President Emmerson Mnangagwas term of office to 2040 is circulating widely on social media.\n\nMnangagwas current term is set to end in 2028, but hardliners within Zanu PF are pushing for an extension to 2030.\n\nIn a surprising development, some party youths are now openly calling for the presidents term of office to be extended all the way to 2040.\n\nWatch: Zanu PF Youths Call For Extension Of Mnangagwa Term Of Office To 2040pic.twitter.com/zEsy7UdRvk\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- A video showing Zanu PF youths calling for an extension of President Emmerson Mnangagwa’s term of office … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/watch-zanu-pf-youths-call-for-extension-of-mnangagwas-term-to-2040/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Zanu PF Youths Call for Extension of Mnangagwa’s Term to 2040\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "Arrest Warrant Issued for Robert Mugabe Jr After Failing to Appear in Court",
            "url": "https://www.zimeye.net/2025/11/06/arrest-warrant-issued-for-robert-mugabe-jr-after-failing-to-appear-in-court/",
            "content": "By A Correspondent | ZimEye | Harare, November 6, 2025  Harare Magistrate Lisa Mutendereki has issued a warrant of arrest against Robert Mugabe Junior, also known as Tino, after he failed to appear for his trial on charges of possessing dangerous drugs.\n\nCourt proceedings were briefly delayed this morning as the court orderly called Mugabes name three times, but the 33-year-old son of the late former president Robert Mugabe was nowhere to be found.\n\nMugabe Jr was previously released on $300 bail following his arrest earlier this year. His failure to appear in court today prompted the magistrate to take swift action and issue a warrant for his immediate arrest.\n\nThe case has drawn public attention due to Mugabe Jrs family background and the serious nature of the charges. Details of the alleged drug possession have not been disclosed in court.\n\nProsecutors are expected to seek enforcement of the warrant, and Mugabe Jrs whereabouts remain unknown as of publication time.\n\nThis is a developing story. More updates to follow as information becomes available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Harare, November 6, 2025 — Harare Magistrate Lisa Mutendereki has issued a warrant of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/arrest-warrant-issued-for-robert-mugabe-jr-after-failing-to-appear-in-court/\">Continue reading<span class=\"screen-reader-text\"> \"Arrest Warrant Issued for Robert Mugabe Jr After Failing to Appear in Court\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "Top CIO Agent Caught With Cocaine",
            "url": "https://www.zimeye.net/2025/11/06/top-cio-agent-caught-with-cocaine/",
            "content": "By A Correspondent\n\nA senior assistant officer of the Central Intelligence Organisation (CIO) was arrested in Harare over the weekend for allegedly possessing cocaine, raising serious concerns about drug involvement within the intelligence services.\n\nFrancis Gerald Mugoni, 34, appeared in Harare Magistrates Court on Saturday, facing charges of illegal possession of 24.95 grams of cocaine, valued at approximately US$1,320 on the streets. Magistrate Tapiwa Kuhudzai remanded him in custody.\n\nAccording to prosecutors, on 29 October at around 3 PM, CID Drugs and Narcotics received information that Mugoni was allegedly dealing cocaine in and around Kensington Shopping Centre, Harare.\n\nThe following day, at around 10 PM, detectives conducted surveillance in areas Mugoni was known to frequent. He was reportedly seen exiting a black Nissan X-Trail at the intersection of Connaught and Argyle Roads in Avondale.\n\nWhen approached and asked to submit to a search, Mugoni allegedly fled west along Argyle Road, prompting a chase by detectives. He was eventually apprehended on Kent Avenue, Avondale, where a search reportedly uncovered a transparent plastic sachet containing a white powder suspected to be cocaine.\n\nMugoni was taken to ZRP Harare Central, where a field test confirmed that the substance was indeed cocaine.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A senior assistant officer of the Central Intelligence Organisation (CIO) was arrested in Harare over the weekend … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/top-cio-agent-caught-with-cocaine/\">Continue reading<span class=\"screen-reader-text\"> \"Top CIO Agent Caught With Cocaine\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        },
        {
            "title": "Clarification, No Innscor Plans to Acquire OK Zimbabwe",
            "url": "https://www.zimeye.net/2025/11/06/clarification-no-innscor-plans-to-acquire-ok-zimbabwe/",
            "content": "By Engineer Jacob Kudzayi Mutisi |  Following my recent article titled OK Zimbabwes Struggles Demand Urgent Intervention, I wish to issue a clarification to prevent any misunderstanding that could lead to speculative buying or inaccurate assumptions in the market.\n\nIn that article, I raised my concerns as a shareholder regarding the deteriorating financial position of OK Zimbabwe, a company once regarded as the pride of Zimbabwean retail. My analysis was grounded in both financial and operational realities: shrinking profit margins, declining market confidence, and the apparent absence of a robust recovery strategy.\n\nAs a former investment analyst, investment banker and engineer with experience in company evaluation and financial sustainability, I based my observations on professional analysis rather than market rumours or insider information. My objective was to highlight the urgent need for strategic intervention to preserve shareholder value and protect one of Zimbabwes most respected retail institutions.\n\nHowever, I have since noted that my mention of Innscor Africa Limited was misinterpreted by some readers as an indication that a takeover or acquisition of OK Zimbabwe was imminent.I would like to categorically clarify that Innscor Africa Limited has not announced, nor is there any verified indication, that it intends to acquire or invest in OK Zimbabwe. My reference to Innscor was purely hypothetical, an example of the type of strong, well capitalised strategic investor that could theoretically help revive OK Zimbabwe if such an opportunity ever arose.\n\nAny assumptions or speculative trading based on that reference are therefore unfounded and should be avoided.\n\nThe central message of my article remains valid, OK Zimbabwe urgently requires decisive leadership, financial restructuring and a credible turnaround plan. Its survival is essential not only for shareholders but also for employees, suppliers and the broader Zimbabwean retail landscape.\n\nZimbabwes financial markets are sensitive and it is vital that commentary and reporting remain factually clear to prevent unnecessary volatility. While collaboration or investment from a strong strategic partner could help OK Zimbabwe regain stability, there is currently no plan or confirmation that Innscor or any other entity, is pursuing such a move.\n\nFor any further clarification please do not hesitate to contact me on +263772278161 or email[emailprotected]\n\nEngineer Jacob Kudzayi Mutisi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi | Following my recent article titled “OK Zimbabwe’s Struggles Demand Urgent Intervention,” I wish to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/06/clarification-no-innscor-plans-to-acquire-ok-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Clarification, No Innscor Plans to Acquire OK Zimbabwe\"</span></a></p>",
            "time": "18:48",
            "date": "06 Nov 2025"
        }
    ]
}