{
    "news": [
        {
            "title": "City Parking MD Under Scrutiny For Financial Mismanagement",
            "url": "https://www.zimeye.net/2025/01/21/city-parking-md-under-scrutiny-for-financial-mismanagement/",
            "content": "By A Correspondent| Simon Muzviyo, the managing director of City Parking, is under scrutiny for alleged financial mismanagement, personal enrichment, and authorizing failed foreign investments that reportedly cost theHarare CityCouncil (HCC) over US$4 million.\n\nCity Parking is tasked with managing parking spaces inHarares central business district (CBD). However, Muzviyo has claimed the company operates as a private entity and is not subject to oversight under the Public Finance Management Act.\n\nDuring his testimony before the Justice Cheda-led Commission of Inquiry investigating the operations of HCC since 2017, Muzviyo admitted to entering a joint venture with a Ghanaian company in 2015. Under the agreement, City Parking held a 45% stake and anticipated returns of US$1 million after purchasing equipment. However, the deal fell apart, resulting in significant losses for the council.\n\nMuzviyo disclosed that he spent a month in Accra at City Parkings expense but failed to account for his daily allowances for accommodation, meals, and other expenses when questioned by evidence leader Thabani Mpofu.\n\nOther questionable foreign investments approved by Muzviyo, without proper due diligence, involved ventures in South Africa and Zambia, with cumulative losses amounting to approximately US$4 million.\n\nInsiders allege that Muzviyos actions went unchecked due to the influence of his second wife, Tsitsi Samapundo, who manages the councils Business Development Unit (BDU). The BDU oversees entities such as City Parking, Rufaro Marketing, and Harare Quarry.\n\nAn ex-employee of the department claimed Samapundo helped conceal irregularities, including the lack of proper accounting, undocumented contracts, and the manipulation of both ZWL and USD accounts.\n\nSamapundos position allowed her to shield Muzviyo from accountability, the source alleged. Her failure to question his actions made her complicit in the maladministration.\n\nAttempts to contact Samapundo for comment were unsuccessful, and she reportedly sent proxies to threaten media outlets with legal action. Similarly, Muzviyo could not be reached, with sources claiming he is vacationing in the United Kingdom.\n\nCity Parkings alleged financial mismanagement and internal corruption further fuel concerns about systemic issues at the Harare City Council. These challenges have hindered the citys efforts to achieve its ambitious goal of becoming a world-class city by 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Simon Muzviyo, the managing director of City Parking, is under scrutiny for alleged financial mismanagement, personal enrichment, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/city-parking-md-under-scrutiny-for-financial-mismanagement/\">Continue reading<span class=\"screen-reader-text\"> \"City Parking MD Under Scrutiny For Financial Mismanagement\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "Headmaster Arrested For Corruptily Awarding Tender To Quest Motors",
            "url": "https://www.zimeye.net/2025/01/21/headmaster-arrested-for-corruptily-awarding-tender-to-quest-motors/",
            "content": "By A Correspondent| Vuti High School headmaster, Brain Chigudu has been arrested by ZACC on allegations of corruptly awarding a tender for the procurement of a 56 seater bus to Quest Motors Corporation.\n\nHe appeared before Mr Vakayi Douglas Chikwekwe at the Chinhoyi Magistrate Court and was charged with criminal abuse of duty.\n\nChigudu allegedly flouted procurement regulations and directly awarded a US$155 000.00 tender to Quest Motors Corporation, a company that had not responded to the tender application advertisement.\n\nHe was granted US$300.00 bail and remanded to February 3, 2025.\n\nAs bail conditions, the accused was ordered not to interfer with state witnesses, and banned him from visiting Vuti High School until the matter is resolved.\n\nMr Brighton Machekera prosecuted for the state.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Vuti High School headmaster, Brain Chigudu has been arrested by ZACC on allegations of corruptly awarding a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/headmaster-arrested-for-corruptily-awarding-tender-to-quest-motors/\">Continue reading<span class=\"screen-reader-text\"> \"Headmaster Arrested For Corruptily Awarding Tender To Quest Motors\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "Bogus ZANU PF Central Committee Member Arrested for Fraud",
            "url": "https://www.zimeye.net/2025/01/21/bogus-zanu-pf-central-committee-member-arrested-for-fraud/",
            "content": "By A Correspondent|The Zimbabwe Anti Corruption Commission (ZACC) has arrested Wilbert Nyarugwe, on allegations of defrauding a local businessman of US$10 000.00.\n\nNyarugwe posed as a ZANU PF Central Committee member and promised to use his purported influence to resolve a ZIMRA seizure case but later disappeared with the funds.\n\nIt is alleged that in October 2024, the complainant, Douglas Murazas bus, Shassell Logistics was seized by the Zimbabwe Revenue Authority (ZIMRA) in Masvingo during an operation against smuggling of goods.\n\nMuraza engaged the accused, who posed as a ZANU PF Central Committee member with connections to ZIMRA Commissioner General, Mrs. Regina Chinamasa.\n\nThe accused promised to secure the release of the bus and goods for a payment of US$10 000.00 allegedly to be handed over to Mrs Chinamasa who will facilitate the release at favourable terms.\n\nThe complainant instructed his wife to hand over US$10 000.00 to Nyarugwe but after the payment, Muraza received an official demand from ZIMRA for payment of ZWG893 529.59 duty plus 100 percent fine equivalent to duty, interest from the date of seizure and payment for storage charges.\n\nShocked by the amount demanded by ZIMRA, the complainant made efforts to reach out to Nyarugwe but he became evasive and eventually blocked the complainant and his wife.\n\nMuraza reported the matter to ZACC leading to Nyarugwes arrest. He was found with fraudulent ZANU PF cards.\n\nHe is expected to appear at the Harare Magistrates Court on 22 January 2025 for initial remand.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent|The Zimbabwe Anti Corruption Commission (ZACC) has arrested Wilbert Nyarugwe, on allegations of defrauding a local businessman of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/bogus-zanu-pf-central-committee-member-arrested-for-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Bogus ZANU PF Central Committee Member Arrested for Fraud\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "CIO’s FAZ Group Furiously Denies Lewis Matutu’s Account Was Hacked Amid Viral Post Warning of Unrest",
            "url": "https://www.zimeye.net/2025/01/21/cios-faz-group-furiously-denies-lewis-matutus-account-was-hacked-amid-viral-post-warning-of-unrest/",
            "content": "The controversial Forever Associates Zimbabwe (FAZ), a shadowy organization condemned by SADC electoral monitors for its role in violent coercion during Zimbabwes 2023 elections, has come forward to deny that ZANU PF Youth League deputy chair Lewis Matutus X (formerly Twitter) account was hacked. This follows the circulation of a cryptic post attributed to Matutu that warned of impending violence and unrest across Zimbabwe.\n\nMatutus now-deleted post read:\n\nThree nights ago, I had a very scary dream about our motherland Zimbabwe, chaos and violence all over the country with people killing each other in a merciless manner like wild animals. Men of cloth, please pray for our country Zimbabwe. I rarely miss when it comes to dreams, and this particular dream makes me nervous and shaken, for it shall come to pass. As I received it, sharing makes me feel relieved and vindicated.\n\nThe post caused a firestorm on social media, with many interpreting it as a direct acknowledgment of the growing discontent within Zimbabwe under President Emmerson Mnangagwas leadership.\n\nIn response, FAZ tweeted:\n\nHis X account was hacked. Be factual.\n\nHowever, the explanation was met with widespread skepticism, as the cryptic post aligns with increasing reports of unrest and dissatisfaction among citizens over Mnangagwas perceived stranglehold on power. Critics of FAZ argue that the denial is part of an attempt to silence dissent within ZANU PF ranks or control the narrative surrounding Matutus alarming statement.\n\nZimEye questioned FAZs claim in a tweet:\n\nAre you not the hacker, @faz_trust, who has hacked the X account after Lewis Matutus announcement of this Mnangagwa-Armageddon message that indicates the end of the ZANU PF leader is nigh?\n\nFAZ, already under fire for its involvement in violence and electoral manipulation, faces growing scrutiny over its role in this latest controversy. The organization was previously condemned by SADC observers for undermining democratic processes in Zimbabwe, and its involvement in this incident has reignited debate over its shadowy tactics.\n\nThis development comes at a time of heightened tensions in Zimbabwe, with signs of internal factional battles within ZANU PF and widespread public dissatisfaction. As the fallout from this incident continues, many are left questioning the stability of Mnangagwas leadership and the increasing cracks within the ruling party. ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The controversial Forever Associates Zimbabwe (FAZ), a shadowy organization condemned by SADC electoral monitors for its role in violent coercion … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/cios-faz-group-furiously-denies-lewis-matutus-account-was-hacked-amid-viral-post-warning-of-unrest/\">Continue reading<span class=\"screen-reader-text\"> \"CIO’s FAZ Group Furiously Denies Lewis Matutu’s Account Was Hacked Amid Viral Post Warning of Unrest\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "Chiwenga Takes Charge Shedding Tears",
            "url": "https://www.zimeye.net/2025/01/21/chiwenga-in-tears/",
            "content": "By Munacho Gwamanda-Vice President Constantino Chiwenga returned Monday from his annual leave to resume duties as acting President, burdened by sorrow and political tension.\n\nUpon his return, Chiwenga began his acting presidency with a condolence statement mourning Major General (Retired) Solomon Siziba, one of his close allies, who passed away last week.\n\nMajor General Siziba, 67, died at KG6 Hospital in Harare while Chiwenga was on leave.\n\nState media attributed the death to cancer, but whispers of scepticism surrounding the cause have emerged, especially from Chiwengas camp.\n\nIn his heartfelt message, Chiwenga celebrated Sizibas liberation war contributions and military career, describing him as a loyal and dedicated leader.\n\nSizibas illustrious journey included training under General Phillip Valerio Sibanda, surviving the Freedom Camp attacks, serving in Mozambique and the DRC, and leading initiatives such as the Botswana Military Attach Association.\n\nHowever, Sizibas death marks yet another addition to the growing list of high-ranking military officials who have died under unclear circumstances since President Emmerson Mnangagwas controversial rise to power through the 2017 military coup led by Chiwenga.\n\nThe deaths of key Chiwenga alliesamong them Foreign Minister Sibusiso Moyo, Agriculture Minister Perence Shiri, and over ten other senior military figureshave fueled speculation of a calculated purge aimed at consolidating Mnangagwas grip on power.\n\nInsiders assert that Mnangagwas actions defy a post-coup power-sharing agreement that would have seen him serve two terms before ceding the presidency to Chiwenga.\n\nInstead, Mnangagwa has reportedly moved to extend his rule through constitutional amendments, alienating Chiwengas faction and escalating tensions within the ruling Zanu PF.\n\nMnangagwas refusal to honor the agreement has created a rift thats impossible to ignore, a senior Zanu PF official disclosed. The systematic sidelining of Chiwengas allies is a clear message that dissent will not be tolerated.\n\nThe growing divide within Zanu PF has raised concerns about the potential for further destabilization.\n\nAnalysts caution that the removal of Chiwengas military loyalists could embolden his faction to retaliate, with some suggesting the possibility of another coup.\n\nMnangagwas survival now hinges on parliamentary backing and a neutral military, political analyst Mutodi remarked. But if Chiwengas camp feels sufficiently marginalized, they may challenge his legitimacy outright.\n\nWith Zanu PFs history of violent power struggles, the deepening conflict between the President and his Vice President threatens to plunge Zimbabwe into another period of uncertainty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Vice President Constantino Chiwenga returned Monday from his annual leave to resume duties as acting President, burdened by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/chiwenga-in-tears/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Takes Charge Shedding Tears\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "Mnangagwa Promise To Step Down In 36 Months’ Time | VIDEO",
            "url": "https://www.zimeye.net/2025/01/21/mnangagwa-promise-to-step-down-in-36-months-time-video/",
            "content": "Emmerson Mnangagwas @CNN promise to step down in 2028, even if the people would love me to the heel, I will still go away | 2025 STATUS @ZANUPF_Official  @nickmangwana   @amanpourpic.twitter.com/BCXaeeXlQc\n\nMnangagwas Promise of Constitutional Adherence Cast in Doubt Amid Contradictory Actions.\n\nPresident Emmerson Mnangagwas recent pledge to step down in 2028, in accordance with Zimbabwes constitutional two-term limit, has come under scrutiny as recent actions and remarks suggest a lack of commitment to this promise. While speaking to CNNs Christiane Amanpour, Mnangagwa declared:\n\nWe have now limited the terms of presidencyjust two terms, five to five. If you are able to have two terms, then the maximum a person can remain in office is two terms. But beyond that, you know the Constitution forbids it Even if the people would love me to stay, I will still go away because I believe constitutionalism is important. In fact, you must give your people a chance to have other people come. Ten years is not a short period.\n\nHowever, this statement sharply contrasts with recent developments that suggest Mnangagwas commitment to constitutionalism may be performative rather than genuine. Critics point to the presidents political history, particularly the events of August 1, 2018, when the army was deployed to quash protests over disputed election results, leading to civilian deaths. This violent crackdown undermined Mnangagwas initial promises of democratic reform following Robert Mugabes ousting.\n\nMore recently, concerns have been amplified by a controversial gathering at Mnangagwas farm during his holiday, where he hosted opposition MPs. During this event, former ZANU-PF Information Minister Webster Shamu openly suggested disregarding constitutional term limits, saying:The children have wept, boss,a symbolic plea for Mnangagwa to remain in office beyond 2028. Mnangagwas failure to challenge or rebuke this statement has raised alarm bells among observers who fear he may not honor his pledge to step down.\n\nThese developments paint a contradictory picture. While Mnangagwa positions himself on the international stage as a champion of constitutionalism, his domestic political conduct tells a different story. Hosting opposition MPs and permitting unchecked statements advocating a breach of constitutional limits suggest a strategy aimed at consolidating power, potentially laying the groundwork for a term extension.\n\nZimbabweans, having endured decades of authoritarian rule under Robert Mugabe, are acutely aware of the gap between political rhetoric and reality. Mnangagwas repeated emphasis on constitutional adherence will mean little without concrete action, such as publicly disavowing any calls for a third term and strengthening the independence of democratic institutions.\n\nAs 2028 approaches, the stakes are high. Mnangagwas credibility, and the future of Zimbabwes fragile democracy, rest on his willingness to match words with deeds. Until then, his promise remains overshadowed by actions that suggest a potential disregard for the very constitutionalism he claims to uphold.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mnangagwa’s Promise of Constitutional Adherence Cast in Doubt Amid Contradictory Actions. President Emmerson Mnangagwa’s recent pledge to step down in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/mnangagwa-promise-to-step-down-in-36-months-time-video/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Promise To Step Down In 36 Months’ Time | VIDEO\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "How Babies Were Swapped At UBH",
            "url": "https://www.zimeye.net/2025/01/21/how-babies-were-swapped-at-united-bulawayo-hospitals/",
            "content": "The Government has described as very unfortunate the recent baby-swapping incident that took place at the United Bulawayo Hospitals (UBH). The case came to light after a mother who had given birth to a baby boy was handed a baby girl by hospital staff, sparking widespread concern and outrage.\n\nThe incident has prompted a formal investigation initiated by the Ministry of Health and Child Care, which is currently underway. Responding to the situation yesterday, the Ministrys Permanent Secretary, Dr. Aspect Maunganidze, expressed the Governments concern and assured the public that steps are being taken to address the matter.\n\nThe Ministry is aware of the unfortunate incident of baby swapping that occurred at United Bulawayo Hospitals and awaits the results of the investigation that we instructed the hospital to undertake, said Dr. Maunganidze.\n\nHe emphasized the need for a swift yet thorough investigation, while also recognizing the emotional sensitivities surrounding the matter. While we expect the investigation to be concluded expeditiously, we acknowledge the sensitivities around the matter. Parallel to the investigative process, we have instructed the institution to assist with counselling all affected parties (including the staff), reorient or refresh our staff on the standard operating procedures during and after delivery, and reinforce the importance of good moral and ethical practice, added Dr. Maunganidze.\n\nThe affected mother, who has chosen to remain anonymous for ethical reasons, initially raised concerns with the hospital after being informed by a nurse that she had delivered a baby girl via Cesarean Section. The nurse attributed the mix-up to potential confusion caused by the mother being under sedation during the procedure.\n\nHowever, the mother maintained that she had delivered a baby boy and resorted to DNA testing to confirm her claims. The tests were conducted at a private DNA laboratory in Bulawayo and the National University of Science and Technology (NUST), providing the evidence needed to support her case.\n\nThe Government has assured the public that measures will be implemented to prevent similar incidents in the future. These include reinforcing standard operating procedures for maternity care, providing ethical training for healthcare staff, and offering psychological support to those affected by the incident.\n\nThis case has raised serious questions about the hospitals protocols during and after childbirth and highlighted the need for improved safeguards to protect the integrity of maternal and neonatal care in public health institutions. The Ministry has called for patience from the public as the investigation proceeds and has reiterated its commitment to transparency and accountability in addressing the matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Government has described as “very unfortunate” the recent baby-swapping incident that took place at the United Bulawayo Hospitals (UBH). … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/how-babies-were-swapped-at-united-bulawayo-hospitals/\">Continue reading<span class=\"screen-reader-text\"> \"How Babies Were Swapped At UBH\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "Top Award For Zim Martial Artist",
            "url": "https://www.zimeye.net/2025/01/21/top-award-for-zim-martial-artist/",
            "content": "By A Correspondent\n\nRenowned Zimbabwean martial artist Wilfred Zim Ninja Mashaya has been honored with a special recognition at the International Budo Bushi Hall of Fame in Poland for his outstanding efforts in promoting martial arts both in Zimbabwe and around the world.\n\nMashaya was presented with the prestigious award this past Saturday in Lacko, Poland, during a ceremony organized by the International Martial Arts Association and the International Self Defense Association, with support from Grand Master Stanislaw Majchrzak, president of both organizations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Renowned Zimbabwean martial artist Wilfred ‘Zim Ninja’ Mashaya has been honored with a special recognition at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/top-award-for-zim-martial-artist/\">Continue reading<span class=\"screen-reader-text\"> \"Top Award For Zim Martial Artist\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "Government Pays Tribute To Zanu PF Heroes",
            "url": "https://www.zimeye.net/2025/01/21/government-pays-tribute-to-zanu-pf-heroes/",
            "content": "By A Correspondent\n\nThe Ministry of Home Affairs and Cultural Heritage has announced that national heroes, Major General (Rtd) Solomon Siziba and Cde Chen Chimutengwende, will be buried on Wednesday, January 22, at the National Heroes Acre. This twin burial honors the two patriots, who have been conferred National Hero status, in recognition of their unwavering dedication to Zimbabwe.\n\nIn preparation for the burial, the body of Major General (Rtd) Solomon Siziba was flown to Bulawayo, where friends, relatives, and local leaders paid their respects. Mourners gathered at 527 Bulawayo Drive, Kilarney, Bulawayo, to bid farewell to the national hero. Additionally, Sizibas body was airlifted to his village and farm in Gwanda on Sunday, and will be flown back to Bulawayo, where it will lie in state at his family home before the burial.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Ministry of Home Affairs and Cultural Heritage has announced that national heroes, Major General (Rtd) Solomon … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/government-pays-tribute-to-zanu-pf-heroes/\">Continue reading<span class=\"screen-reader-text\"> \"Government Pays Tribute To Zanu PF Heroes\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        },
        {
            "title": "Zivhu Calls For Postponement Of Polls",
            "url": "https://www.zimeye.net/2025/01/21/zivhu-calls-for-postponement-of-polls/",
            "content": "By A Correspondent\n\nControversial Zanu PF official Killer Zivhu has sparked heated debate after claiming that elections are no longer necessary in Zimbabwe, advocating for the transition of the country from a republic to a kingdom under President Emmerson Mnangagwa.\n\nZivhu, known for his outspoken support of Mnangagwa, made his bold declaration on X (formerly Twitter) over the weekend. He wrote:\n\nGet ready for the return of Mutapa, The day of his resurgence is now marked on the calendar. Let us reform our constitution, transitioning from a republic to a kingdom. No more elections  instead, let Mutapa reign supreme, forever. ED is the rightful heir to Mutapas throne.\n\nHis comments have ignited a fierce debate on social media, with many questioning whether such an idea is in the best interest of the country. Zivhus call for the total abolition of elections and the establishment of a monarchy under Mnangagwa has drawn widespread criticism, as critics argue that it undermines democratic principles.\n\nBy proposing a system where Mnangagwa would rule indefinitely, Zivhus comments seem to challenge Zimbabwes constitution, which establishes the country as a republic with regular elections. The proposal to ditch elections has raised concerns among those who value democratic processes and the right of citizens to choose their leaders.\n\nSupporters of Zivhus view, however, argue that a more centralized form of governance could bring stability and long-term leadership to Zimbabwe, avoiding the disruptions often associated with frequent elections. But critics are quick to point out the risks of absolute power, with some warning of the potential for corruption and abuse of authority if power remains unchecked.\n\nPolitical analysts have condemned the idea, emphasizing that any push to abolish elections would be detrimental to the nations progress. Zimbabwe has experienced significant political turmoil in the past, and many believe that the path to a prosperous future lies in strengthening democratic institutions, not dismantling them.\n\nIn light of Zivhus controversial statement, the question remains: Should Zimbabwe abandon elections and embrace an unchallenged, perpetual rule under Mnangagwa, or is it crucial to uphold the democratic values enshrined in the countrys constitution?\n\nAs the debate continues, one thing is clear  Zivhus remarks have reignited conversations about Zimbabwes political future and the importance of elections in ensuring a fair and accountable government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF official Killer Zivhu has sparked heated debate after claiming that elections are no longer … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/21/zivhu-calls-for-postponement-of-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Zivhu Calls For Postponement Of Polls\"</span></a></p>",
            "time": "06:28",
            "date": "22 Jan 2025"
        }
    ]
}