{
    "news": [
        {
            "title": "Blessed Mhlanga Trial Pushed To July 31",
            "url": "https://www.zimeye.net/2025/07/16/blessed-mhlanga-trial-pushed-to-july-31/",
            "content": "By A Correspondent\n\nThe trial of Alpha Media Holdings journalist Blessed Mhlanga and HSTV general manager Olga Muteiwa has been postponed to July 31 after the investigating officer failed to appear in court due to illness.\n\nMhlanga and Muteiwa are being charged with transmitting messages allegedly inciting violence or damage to property. The charges relate to their coverage of press conferences held by war veteran and former Zanu-PF Central Committee member Blessed Runesu Geza on January 27 and February 11 this year.\n\nTestifying in court on Tuesday, Detective Edmore Nyazamba claimed the broadcasts posed a threat to national security. He said the two facilitated the dissemination of Gezas statements, which, in his view, had the potential to incite public unrest and encourage opposition to the government.\n\nNyazamba further alleged that the statements were shared online and on social media using professional media equipment. He also told the court that Mhlanga was in direct communication with Geza through X (formerly Twitter) callscommunications he said could not be easily intercepted.\n\nAccording to the detective, Mhlanga admitted that Geza had arranged transport for him and his crew to attend the press events. However, Mhlanga said he could not disclose the location without Muteiwas consent.\n\nWhen the trial began, both Mhlanga and Muteiwa entered not guilty pleas.\n\nMhlangas lawyer, Chris Mhike, argued that the charges against his client were baseless, stating that Mhlanga neither owns nor directs HSTV, nor does he have access to its broadcasting systems or accounts. Mhike insisted his client did not use any computer systems to transmit the contested material.\n\nMuteiwa, represented by Beatrice Mtetwa, also denied the charges, saying the allegations were flawed and did not constitute a legal offence. She dismissed claims that the broadcasts incited violence, pointing out that while Geza had called for President Mnangagwas removal during the press briefings, this did not amount to incitement under the law.\n\nThe State maintains that by livestreaming the events on HSTV and YouTube, the accused breached legal provisions relating to the dissemination of inflammatory content.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The trial of Alpha Media Holdings journalist Blessed Mhlanga and HSTV general manager Olga Muteiwa has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/blessed-mhlanga-trial-pushed-to-july-31/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Mhlanga Trial Pushed To July 31\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Madluphuthu has died aged 50",
            "url": "https://www.zimeye.net/2025/07/16/madluphuthu-has-died-aged-50/",
            "content": "Actor and comedian Bongani Mgudlwa best known for his iconic role as Madluphuthu, has passed away at the age of 50\n\nAnother dark day for entertainment industry as Comic Genius Madluphuthu dies. Oscar Bongani Madluphuthu Mgudlwa, the actor and comedian who brought laughter to countless homes, has died. Best known for his iconic role in the cult favourite Madluphuthu film series of the early 2000s. Mgudlwa became a household name for his hilarious, unfiltered takes on township life.\n\nHis raw, relatable, humorous storytelling not only made audiences laugh but also captured the daily struggles and spirit of Mzansis kasi culture. Its understood he died on Wednesday morning after a short illness. His son Asanda took to social media to share the news, saying: Rest in peace dad. I love you and I will forever love you, Madiba Dlomo. He will be sadly missed,\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Actor and comedian Bongani Mgudlwa best known for his iconic role as Madluphuthu, has passed away at the age of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/madluphuthu-has-died-aged-50/\">Continue reading<span class=\"screen-reader-text\"> \"Madluphuthu has died aged 50\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Soko, ED Hold Deep Conversation | Cartoon",
            "url": "https://www.zimeye.net/2025/07/16/soko-ed-hold-deep-conversation-cartoon/",
            "content": "Soko: ED youve wasted 60 years on Pfungwa, Ive invested in Pfuti!https://t.co/Hn8KhXSFAxpic.twitter.com/C1kCu1lJCO\n\nPfungwa vs Pfuti: The State of the Nation\n\nBy Farai D Hove | ZimEye | In an alternate Zimbabwean reality where history folds onto itself, two competing philosophiesPfungwa (thought/intellect) and Pfuti (the gun)wage an ideological war for control over the states future.\n\nScene Breakdown:\n\nThe cartoon visually depicts President Emmerson Mnangagwa, seated on a throne-like chair made entirely of human brainsa satirical embodiment of Pfungwa, the Shona word for thought or mind. The label on the seat reads Pfungwa-chair, suggesting a deep-rooted dependence on cunning, manipulation, and psychological control in his leadership style. He is dressed in a suit and scarf bearing the Zimbabwean flag colours, reinforcing his role as head of state.\n\nOn his right stands Vice President Constantino Chiwenga, in militaristic garb, firmly clutching an AK-47. He represents Pfuti (the gun), the militarised force that props up political power and enforces it through violence. His face is drawn in an enraged or determined expression, and his speech bubble reveals brutal intentions:\n\nED, youve wasted 60 years on Pfungwa. Ive invested in Pfuti. Ill kill her kids watching.\n\nThis chilling threat is directed at an implied enemyMarry Mubaiwa, Chiwengas estranged ex-wife, of whom the VP has in real life been accused of attempting to kill her and separate her from their children. In this fictionalized narrative, Chiwenga views any pursuit of justice or thought-based strategy as weakness, opting instead for raw militarised violence.\n\nThe 1980 TV Set Reference:\n\nTo the left of the cartoon sits a vintage TV labelled 1980, displaying Robert Mugabe running into a jet labelled Maputo List. The caption on screen:\n\nED: Bob go to Moza, the whites want to kill you.  MARCH 1980\n\nThis is a historical callback to the transitional period just before Zimbabwes independence when Mugabe fled to Mozambique. Mnangagwa, portrayed here as always pulling strings behind the scenes, is shown urging Mugabe to flee under the pretext of security. It suggests Mnangagwa has always maneuvered others through manipulation, even before power was his.\n\nAbove Mnangagwas head, another speech bubble (from the past?) reads:\n\nSoko go to Marry, she wants to kill you, kikiki get busy decapitating her.\n\nThis is a grotesque parody of whispered advice, suggesting that Mnangagwa may have incited Chiwenga against his own wife, twisting personal conflicts into tools for political consolidation.\n\nUnderlying Themes:\n\nThe cartoon is not just a commentary on individuals. Its a damning allegory on the Zimbabwean state: where Pfungwa has failed to deliver justice, and Pfuti thrives on destroying itall while the nation watches, again, from a flickering black-and-white TV.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "“Pfungwa vs Pfuti: The State of the Nation By Farai D Hove | ZimEye | In an alternate Zimbabwean reality … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/soko-ed-hold-deep-conversation-cartoon/\">Continue reading<span class=\"screen-reader-text\"> \"Soko, ED Hold Deep Conversation | Cartoon\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Zambia Moves To Solve Power Crisis",
            "url": "https://www.zimeye.net/2025/07/16/zambia-solves-power-crisis/",
            "content": " Diversifying the energy mix with solar\n\nBy Faith Zanda | Analysis |On June 30, 2025, Zambia inaugurated the 100MW Chisamba Solar Plant, developed by PowerChina. This gridconnected facility will supply electricity to First Quantum Minerals, freeing up local power capacity for households and businesses. It marks a major stride toward reducing dependency on hydropower and imported electricity .\n\nIn addition, a 60MW Itimpi Solar Power Station in Kitwe, privately developed by Copperbelt Energy Corporation, has been operational since April 2024, contributing significantly to grid resilience .\n\n Strengthening hydropower and grid infrastructure\n\nZESCO has also been upgrading smaller hydro facilities like the Chishimba Hydroelectric Power Station (~15MW), rehabilitated in the 2020s to improve reliability and reduce ruptures in regional supply .\n\n Tackling the hydropower shortfall\n\nChronic drought has led to low water levels in the Kariba Dam, Zambias main hydropower source. Reservoir levels dropped to critical lowsaround 10% usable waterwhich has led to rolling blackouts lasting 1417 hours daily . ZESCO extended emergency tariffs and sought electricity imports from the Southern African Power Pool to ease the pressure .\n\n Responding to technical outages\n\nIn instances of unexpected system faults, ZESCO crews have acted swiftly. For example, a nationwide grid disturbance in November 2024 left miners trapped undergroundbut power was restored to mines within hours and to households by early morning . ZESCO is also urging improved reporting of lengthy outages to fasttrack repairs ().\n\n Economic implications and policy direction\n\nPersistent power disruptions have hurt households and businesses alike. Droughtinduced outages drove households to rely on candles or generators, while MSMEs and manufacturers faced reduced productivity and revenue . In response, Zambia has begun expanding its energy infrastructure and embracing grid-enhancing technologies and diversified generation sources such as solar, wind, biomass, and geothermal .\n\n Outlook & next steps\n\n Solar capacity is rising:Chisamba (100MW) and Itimpi (60MW) projects are already active, with the Choma Solar Plant (+60MW plus batteries) expected by late 2025 ().\n\n Hydropower reliability is improving:Rehabilitation of small hydro stations is underway, and grid-enhancing technologies are being deployed to increase resilience ().\n\n Imports remain a buffer:Electricity imports and emergency tariffs continue to fill shortfalls while domestic capacity scales up.\n\nZambias approach to resolving its electricity crisis is multi-pronged: ramping up solar energy, refurbishing hydropower infrastructure, deploying smarter grid technologies, and importing power when necessary. While drought conditions still constrain hydropower, the rapid development of renewable assets and grid improvements suggest a promising path toward greater energy security.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "⸻ ⚡ Diversifying the energy mix with solar By Faith Zanda | Analysis | On June 30, 2025, Zambia inaugurated … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/zambia-solves-power-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Zambia Moves To Solve Power Crisis\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Zvigananda Target Kombi Sector in Dodgy Deal With Mafume, Tshabangu",
            "url": "https://www.zimeye.net/2025/07/16/zvigananda-target-kombi-sector-in-dodgy-deal-with-mafume-tshabangu/",
            "content": "By A Correspondent-President Emmerson Mnangagwas notorious business cartelpopularly known asZviganandais allegedly eyeing a hostile takeover of Harares lucrative commuter transport sector, with plans to ban commuter omnibuses (kombis) and pirate taxis, paving the way for cartel-linked transport monopolies.\n\nHarare Mayor Jacob Mafume, who is aligned with opposition renegade Sengezo Tshabangu, is reportedly facilitating this agenda under the guise of urban renewal. The move is widely seen as a front for looting, backed by Mnangagwas administration.\n\nTheZviganandacartelso named for its shadowy blend of Zanu PF cronies and business elitesis already deeply embedded in corrupt state tenders, including the scandal-ridden Pomona waste deal. Their blueprint is simple: hijack public services, privatise them under state blessing, and extract maximum profit from desperate citizens.\n\nNow, they want the commuter omnibus sector.\n\nUnder Harares newly adopted 20252045 Master Plan, all kombis will be banned in the next three years, while pirate taxismishikashikaface immediate outlawing. Authorities argue this will reduce congestion and accidents. But behind the public relations spin lies a deeper plot: to replace small, independent transport operators with cartel-owned buses and services.\n\nInsiders say Mafumes council is acting on directives from Local Government ministry controlled by Mnangagwa. Tshabangu, who controversially seized control of the Citizens Coalition for Change (CCC) in Parliament with suspected state backing, is also reportedly part of the wider effort to neutralise opposition-led municipalities and facilitate looting.\n\nCritics say this is a repeat of the COVID-19 era, when kombis were banned and the Zimbabwe United Passenger Company (Zupco)a state-linked entity with ties to Mnangagwas associatesbriefly monopolised urban transport, raking in profits while offering poor service.\n\nZviganandas fingerprints are all over this, said a council source. They are positioning to dominate the transport system the same way they took over refuse collection and construction contracts.\n\nTransport experts have slammed the plan as unrealistic and anti-poor. You cant ban kombis without providing alternatives, said Zimbabwe Union for Drivers and Conductors president Frederick Maguramhinga. People will be left stranded. This is not about sanityits about money.\n\nPassenger Association of Zimbabwe president Tafadzwa Goliath added: Council should focus on basicslike fixing public toilets and terminibefore dreaming of banning kombis.\n\nThe master plan also proposes banning three-wheeled taxis, demanding GPS data from ride-hailing firms, and pushing for a return of vehicle licensing to council controlanother potential revenue stream for the corrupt elite.\n\nIn reality, kombis transport over 50% of Harares commuters. Banning them without affordable alternatives will only deepen public hardship.\n\nThis latest manoeuvre underscores how Mnangagwas regime continues to hide looting and elite enrichment behind policy rhetoric, aided by captured councils and political puppets like Mafume and Tshabangu. WithZviganandanow circling Harares transport arteries, the future looks bleak for independent operatorsand for ordinary Zimbabweans who rely on them.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa’s notorious business cartel—popularly known as Zvigananda—is allegedly eyeing a hostile takeover of Harare’s lucrative commuter transport … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/zvigananda-target-kombi-sector-in-dodgy-deal-with-mafume-tshabangu/\">Continue reading<span class=\"screen-reader-text\"> \"Zvigananda Target Kombi Sector in Dodgy Deal With Mafume, Tshabangu\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Real Madrid Reunites with Álvaro Carreras in Six-Year Deal from Benfica",
            "url": "https://www.zimeye.net/2025/07/16/real-madrid-reunites-with-alvaro-carreras-in-six-year-deal-from-benfica/",
            "content": "Sports Correspondent\n\nReal Madrid C.F. have officially announced the return of lvaro Carreras, signing the talented defender on a six-year contract that runs until 30 June 2031. The Spanish full-back joins the club from Portuguese giants Benfica, marking a significant homecoming after his earlier stint in Real Madrids youth academy between 2017 and 2020.\n\nCarreras arrives in Madrid following an impressive season in Portugal, where he lifted the 2024 Portuguese League Cup with Benfica. Prior to his move to Lisbon, the 21-year-old had been part of Manchester Uniteds ranks, earning the title of the clubs best Under-23 player for the 202122 season.\n\nReal Madrid will officially present Carreras tomorrow, Tuesday, at 1 PM at Real Madrid City. The event will follow a contract signing ceremony, during which club president Florentino Prez will formally welcome the player.\n\nFollowing the presentation, Carreras is expected to address the media for the first time as a new Real Madrid first-team player.\n\nThis signing reflects the clubs continued commitment to investing in young, homegrown talent with proven international experience.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Real Madrid C.F. have officially announced the return of Álvaro Carreras, signing the talented defender on a six-year … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/real-madrid-reunites-with-alvaro-carreras-in-six-year-deal-from-benfica/\">Continue reading<span class=\"screen-reader-text\"> \"Real Madrid Reunites with Álvaro Carreras in Six-Year Deal from Benfica\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "Zvigananda Team Snatches Former Bosso Player",
            "url": "https://www.zimeye.net/2025/07/16/zvigananda-team-snatches-former-bosso-player/",
            "content": "Former Highlanders defender Godfrey Makaruse has sealed a move from Scottland to Southern Region Division One outfit Bulawayo Chiefs.\n\nMakaruses stint with Scottland was cut short after the club failed to register him at the start of the season, making him ineligible to compete. Now, the seasoned defender will look to revive his career with Bulawayo Chiefs as they bolster their squad for the remainder of the campaign.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Former Highlanders defender Godfrey Makaruse has sealed a move from Scottland to Southern Region Division One outfit Bulawayo Chiefs. Makaruse’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/zvigananda-team-snatches-former-bosso-player/\">Continue reading<span class=\"screen-reader-text\"> \"Zvigananda Team Snatches Former Bosso Player\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "About Homemade Colostrum…",
            "url": "https://www.zimeye.net/2025/07/16/about-homemade-colostrum/",
            "content": "By Dr Trywell Muzerengi\n\nIn situations where a newborn calf or kid is not receiving enough milk from its motheror if there is no foster animal availablehomemade colostrum can be a lifesaver.\n\nThis simple mixture provides essential nutrients and antibodies crucial for the survival and early development of young livestock.\n\nHeres a quick and effective method to prepare a basic colostrum substitute using readily available ingredients:\n\nIngredients:\n\nFresh Milk  Use whole cows milk, preferably unpasteurised for maximum nutritional value.\n\nEgg Yolks  2 yolks per litre of milk (these provide extra protein, fat, and immune-boosting nutrients).\n\nInstructions:\n\nThis colostrum substitute is meant for emergency use when natural colostrum is unavailable. While it does not fully replicate the complex immunity profile of natural colostrum from the mother, it provides vital proteins, fats, and nutrients to help the newborn build strength in the critical first hours of life.\n\nNote: It is always best to use natural colostrum when available, as it contains species-specific antibodies necessary for early immunity.\n\nHowever, this homemade recipe is a practical and accessible option for small-scale farmers in resource-limited settings.\n\nInstagram: lasmuzagro1\n\nLinkedIn: Lasmuz Agro\n\nlasmuzagrosolutions@gmail.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi In situations where a newborn calf or kid is not receiving enough milk from its mother—or … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/about-homemade-colostrum/\">Continue reading<span class=\"screen-reader-text\"> \"About Homemade Colostrum…\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "UK Home Office Abandons Passport Visa Stickers for eVisas on Key Routes Starting 15 July 2025",
            "url": "https://www.zimeye.net/2025/07/16/uk-home-office-abandons-passport-visa-stickers-for-evisas-on-key-routes-starting-15-july-2025/",
            "content": "LONDON  15 July 2025\n\nBy Farai D Hove | ZimEye | In a major shift in immigration policy, the UK Home Office has announced that starting today, successful applicants on select work and study visa routes will no longer receive a visa vignette (sticker) in their passport. Instead, they will be issued with an eVisa only, a digital record of their immigration status that is accessible via a UKVI account.\n\nThe change applies to main applicants who submit and pay for their visa applications on or after 15 July 2025. According to the advisory issued by the Home Office to licensed sponsors, dependant applicants will still receive both a vignette and an eVisa for now.\n\nAffected Visa Routes:\n\nRequirements for Applicants:\n\nBefore travelling to the UK, successful applicants must:\n\nApplicants are urged to report any incorrect information as soon as possible using the Home Offices correction portal:https://lnkd.in/eFHhvBWG\n\nThey are also encouraged to understand how to generate an eVisa share code, which will be used to prove their immigration status to employers, landlords, and public service providers.\n\nAdditional Resources:\n\nThis development is part of the UK governments ongoing digitisation of immigration services, aimed at streamlining border processes and improving document security.\n\nFor more updates on UK immigration changes, stay tuned to our newsroom.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "LONDON – 15 July 2025 By Farai D Hove | ZimEye | In a major shift in immigration policy, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/uk-home-office-abandons-passport-visa-stickers-for-evisas-on-key-routes-starting-15-july-2025/\">Continue reading<span class=\"screen-reader-text\"> \"UK Home Office Abandons Passport Visa Stickers for eVisas on Key Routes Starting 15 July 2025\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        },
        {
            "title": "“I Covet Your Prayers”: Veteran Musician Nicholas Madzibaba Zakaria Unwell",
            "url": "https://www.zimeye.net/2025/07/16/i-covet-your-prayers-veteran-musician-nicholas-madzibaba-zakaria-unwell/",
            "content": "By A Correspondent\n\nLegendary sungura musician Nicholas Madzibaba Zakaria has revealed he is unwell and has asked the public to keep him in their prayers.\n\nThe 68-year-old music icon, who is widely credited for mentoring top artists such as Alick Macheso and Simon Mutambi, confirmed in an emotional message that he is currently not in good health and unable to perform with his band, the Khiama Boys.\n\nI covet your prayers, said the soft-spoken musician, who has entertained generations of Zimbabweans with hits such as Rudo Rwechokwadi, Mahumbwe, and Mabvi Nemagokora.\n\nZakaria disclosed that he has delegated responsibilities to his son Franco Slomo and the rest of the Khiama Boys while he recuperates.\n\nI just managed to send my band and PA system and my son Franco to our family show, Zakaria told his fans. I havent been well for some time now, but I am grateful to God for strength and to my fans for the continued support.\n\nFranco Slomo, a former Orchestra Mberikwazo dancer and now a full-time performer, has taken the reins in his fathers absence and is leading the group in live shows across the country.\n\nThe development has drawn concern and support from fans on social media, many of whom consider Madzibaba Zakaria a foundational figure in Zimbabwean sungura music. His dignified and spiritual approach to the genre, often blending social commentary with moral teachings, has earned him admiration across age groups.\n\nZakarias illness comes at a time when the music industry is still reeling from the loss of several senior artists in recent years, prompting a renewed call for greater support for veteran musicians, especially in times of health crises.\n\nAs he takes time off the stage, Madzibaba says he remains hopeful: With your prayers, I know Ill be back soon doing what I love  music that heals and teaches.\n\nFans and fellow artists have since taken to various platforms to send well wishes, with many describing Zakaria as a national treasure whose legacy must be honoured both in word and deed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Legendary sungura musician Nicholas “Madzibaba” Zakaria has revealed he is unwell and has asked the public to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/16/i-covet-your-prayers-veteran-musician-nicholas-madzibaba-zakaria-unwell/\">Continue reading<span class=\"screen-reader-text\"> \"“I Covet Your Prayers”: Veteran Musician Nicholas Madzibaba Zakaria Unwell\"</span></a></p>",
            "time": "08:34",
            "date": "17 Jul 2025"
        }
    ]
}