{
    "news": [
        {
            "title": "ZBC Driver and ‘Gringo’ Star Dies Without Pension",
            "url": "https://www.zimeye.net/2025/07/10/zbc-driver-and-gringo-star-dies-without-pension/",
            "content": "By Showbiz Reporter Fanuel Firimoni Tonganayi, a beloved comedian best known for his role in the iconicGringotelevision drama series and a long-serving driver at the Zimbabwe Broadcasting Corporation (ZBC), has died.\n\nHe was 63.\n\nTonganayi passed away earlier this week at his rural home in Hurungwe after suffering from stomach complications. He had been battling illness for several days without access to medical assistance, largely due to financial challenges.\n\nLike many former ZBC workers, he retired without receiving his pension after over 25 years of service.\n\nHis death has reignited public criticism of ZBCs long-standing failure to honour pension obligations and adequately compensate its workersboth past and present.\n\nThe national broadcaster has been repeatedly accused of exploiting creative talent and technical staff, while failing to provide proper welfare support.\n\nTonganayi rose to national prominence through his comedic performances inGringo, one of Zimbabwes most popular yesteryear television dramas.\n\nThe show, which starred the late Lazarus Gringo Boora in the titular role, offered satirical reflections on everyday Zimbabwean life, winning the hearts of millions.\n\nFirimoni, as he was affectionately known on screen, played the bumbling sidekicka role that showcased his natural comic timing and endeared him to audiences across the country.\n\nNews of his passing was met with shock and sadness by colleagues and fans alike.\n\nI stayed with him for a year, and we never argued. He was a genuinely good person, always laughing, always lifting our spirits. The entire community loved him, said a former ZBC colleague.\n\nTaurai Gringo Junior Boora, son of the late Gringo and fellow actor, also mourned the loss.\n\nI received the sad news from one of his relatives in Hurungwe. He had been ill for three days. It was always difficult to reach him because he didnt own a cellphone, Boora said.\n\nHe worked closely with my father and was a talented man who loved his craft. I had hoped to collaborate with him, but sadly, it never happened. His passing is a big loss to the arts industry.\n\nBoora added that Firimoni had an unmatched ability to deliver humour effortlessly.\n\nHe easily mastered the art of acting. Its painful that weve lost such a gifted character. His work inspired many of us in the younger generation.\n\nFirimonis quiet death, far from the limelight and without a pension, is a tragic reminder of the fate that has befallen many of Zimbabwes creative legendssidelined and forgotten by the very institutions they helped build.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Fanuel “Firimoni” Tonganayi, a beloved comedian best known for his role in the iconic Gringotelevision drama series and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/zbc-driver-and-gringo-star-dies-without-pension/\">Continue reading<span class=\"screen-reader-text\"> \"ZBC Driver and ‘Gringo’ Star Dies Without Pension\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "It Costs 10 US Dollars to Defile Zimbabwe’s Heroes Acre",
            "url": "https://www.zimeye.net/2025/07/10/it-costs-10-us-dollars-to-defile-zimbabwes-heroes-acre/",
            "content": "By Dr. Masimba Mavaza | It is deeply saddening that some ministers pay just ten dollars for a group of girls to come to the Heroes Acre, sing, and desecrate the graves of our national heroes. This is not about Vision 2030. This is about selfishness, ignorance, stupidity, and a satanic and disgusting attempt to gain recognition.\n\nAt one funeral, the girls sang profanities while the nation was laying heroes to rest. This trend has now spiraled out of control and must be stopped. This is not how one campaigns for 2030.\n\nSinging praises for someone else at a funeral can be perceived as insensitive or inappropriate, depending on the context and the relationships involved. Funerals are meant to honor and pay respects to the deceased; the focus should ideally be on celebrating their life, legacy, and impact.\n\nPotential Issues: Shifting Focus: Praising another person may shift the attention away from the deceased, potentially diminishing the tribute being paid. Perceived Insensitivity: It can come across as insensitive or self-serving to use the occasion to promote or praise someone else, especially if they are not directly related to the deceased. If Done Tastefully: If such praise is carefully integrated into the celebration of the deceaseds life in a meaningful and respectful way, then it may be acceptable.\n\nZimbabwe must reject such opportunists and refocus attention on the deceased. Respect the Deceased: The primary emphasis should remain on honoring the life and legacy of the person who has passed. Be Mindful of the Familys Wishes: It is essential to consider the feelings and preferences of the deceaseds family and loved ones when choosing what to say or perform.\n\nBy being thoughtful and considerate, one ensures that any words or songs are a fitting tribute to the departed.\n\nGenerally, campaigning at a funeral is considered inappropriate. Funerals are solemn events for mourning, reflection, and offering comfort to those grieving. Campaigning at such a time is often seen as insensitive, disruptive, and exploitative, potentially causing distress to bereaved families.\n\nMinister Mavetera, as a patron of these girls, must teach them respect for the deceased and their families. Funerals are for Mourning: They are a time to honor the departed and support their loved onesnot to promote personal or political agendas. Inappropriate Timing: Campaigning at a funeral is opportunistic and insensitive, and it can seriously damage ones reputation. Disruption of Grieving: Such acts may interfere with the mourning process and provoke unnecessary tension or conflict.\n\nUltimately, it is crucial to prioritize respect, empathy, and discretion. Funerals are not political platformsthey are sacred moments to honor the dead.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Masimba Mavaza | It is deeply saddening that some ministers pay just ten dollars for a group of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/it-costs-10-us-dollars-to-defile-zimbabwes-heroes-acre/\">Continue reading<span class=\"screen-reader-text\"> \"It Costs 10 US Dollars to Defile Zimbabwe’s Heroes Acre\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Ntuli supports General Mkhwanazi",
            "url": "https://www.zimeye.net/2025/07/10/ntuli-supports-general-mkhwanazi/",
            "content": "Ntuli supports Mkhwanazi, calls for probe into SAPS corruption allegations\n\nKwaZulu-Natal Premier Thami Ntuli has thrown his support behind provincial police commissioner Lieutenant-General Nhlanhla Mkhwanazi, following explosive claims about corruption and interference at the highest levels of the South African Police Service (SAPS).\n\nNtuli, who also heads the provinces Community Safety and Liaison Department, called Mkhwanazi a man of principle and integrity, and said the allegations implicating senior police officials and Police Minister Senzo Mchunu in protecting criminal syndicates are too serious to ignore.\n\nHe urged for a full investigation, stressing that the safety of citizens is at stake and that the claims must get the national attention they deserve.\n\nNtulis public backing comes as three parliamentary committees prepare to probe Mkhwanazis allegations, while President Cyril Ramaphosa has promised to address the matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Ntuli supports Mkhwanazi, calls for probe into SAPS corruption allegations KwaZulu-Natal Premier Thami Ntuli has thrown his support behind provincial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/ntuli-supports-general-mkhwanazi/\">Continue reading<span class=\"screen-reader-text\"> \"Ntuli supports General Mkhwanazi\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Malaba’s High Court Enriches Fadzayi Mahere With  More Money USD100,00 As Geza, Chamisa Lose Everything",
            "url": "https://www.zimeye.net/2025/07/10/malabas-high-court-enriches-fadzayi-mahere-with-more-money-usd10000-as-geza-chamisa-lose-everything/",
            "content": "Fadzayi Mahere Beats Record with $100,000 Defamation Win in Malabas Courts  Sparks Accusations of Judicial Favouritism\n\nHarare  10 July 2025\n\nBy A Correspondent | ZimEye | In a development raising fresh controversy in Zimbabwes legal and political circles, former opposition legislator and prominent lawyer Fadzayi Mahere has been awarded a staggering US$100,000 in damages by the High Court in a defamation case against journalist Edmund Kudzayi  marking the highest ever compensation awarded to an opposition figure under the judiciary led by Chief Justice Luke Malaba.\n\nThe judgment, delivered by Justice Joel Mambara, is a default ruling after Kudzayi failed to appear in court. The case stemmed from a July 2022 article published by Kudzayis platform, Kukurigo, alleging Mahere had an affair with businessman Tinashe Murapata that resulted in the collapse of his marriage. Mahere vigorously denied the claims, calling them defamatory, baseless, and a violation of her right to privacy and professional dignity.\n\nControversial Victory Amid Corrupt Court Allegations\n\nThis ruling comes less than a year after Mahere was awarded US$17,000 in another high-profile defamation case against presidential advisor Petina Gappah  a case that already raised eyebrows. That award shattered the previous opposition defamation compensation record, which stood at just US$5,000. Her latest win has ignited debate over whether the former CCC spokesperson enjoys judicial privileges that no other opposition figure has been able to access  especially as leaders like Nelson Chamisa and whistleblowers like Blessed Geza continue to suffer apparent judicial marginalisation.\n\nInvestigative journalist and Gold Mafia founding researcher, Simba Chikanza, who testified for Gappah in the previous case, reacted strongly. He accused Mahere of judicial corruption, claiming she used extra-legal influence to remove key evidence from court bundles, including his own affidavit. Today, following her fresh victory, Chikanza reiterated his claims, stating Mahere would never have won the case if it had been heard outside Zimbabwe.\n\nThe Case: Default Ruling and Massive Compensation\n\nAccording to the ruling, Mahere is to receive: US$100,000 in damages 5% annual interest from the date of summons service Full legal costs\n\nThe court noted that the story in Kukurigo was widely disseminated and potentially reputationally damaging, particularly given Maheres public standing as an international speaker, legal practitioner, and political figure. The judgment came despite Kudzayis initial legal filings, where he fiercely defended the article as grounded in truth and written in the public interest.\n\nKudzayi argued that: The story was supported by verifiable facts Mahere was invited to respond The public had a right to know\n\nHe insisted Mahere must meet the strictest burden of proof, denying any malice or journalistic misconduct.\n\nOpposition or Beneficiary? Questions Mount\n\nMaheres judicial victories have triggered sharp political criticism, particularly from figures in Zimbabwes anti-corruption and activist community. Critics say the rulings expose a troubling contradiction: how can an opposition figure win massive payouts from a judiciary perceived as captured by ZANU PF?\n\nMany are totally clueless, tweeted Simba Chikanza. Due to her corruption, Fadzayi Mahere will never represent Chamisa. Her record of loose morals is sealed.\n\nIn another viral post, Chikanza wrote: I have evidence Mahere is more corrupt than [ZANU PF minister] Machakaire could ever be.\n\nOn Facebook, he continued: The only iron ladies Zim has are the likes of Margaret Dongo and Karen Kazingizi, not anaFadzayi Mahure whore getting rich winning fake defamation cases in Malabas corrupt courts.\n\nWhat Next for Mahere?\n\nThe defamation win cements Maheres place in legal history  not for her political contributions, but for her court victories. With more than US$117,000 now awarded in less than 12 months, scrutiny over her relationship with Zimbabwes judicial institutions is intensifying.\n\nMahere has yet to publicly address the corruption accusations, but political observers say she must now explain how she manages to achieve judicial success in a system that routinely rules against her allies.\n\nAs the silence grows louder, many wonder: is Mahere still an opposition figure  or something else entirely?\n\nDeveloping story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Fadzayi Mahere Beats Record with $100,000 Defamation Win in Malaba’s Courts — Sparks Accusations of Judicial Favouritism Harare – 10 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/malabas-high-court-enriches-fadzayi-mahere-with-more-money-usd10000-as-geza-chamisa-lose-everything/\">Continue reading<span class=\"screen-reader-text\"> \"Malaba’s High Court Enriches Fadzayi Mahere With  More Money USD100,00 As Geza, Chamisa Lose Everything\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Legendary Zimbabwean Drummer Dies",
            "url": "https://www.zimeye.net/2025/07/10/legendary-zimbabwean-drummer-dies/",
            "content": "By A Correspondent\n\nBEDFORD, UK  Celebrated Zimbabwean drummer Sam Chagumachinyi has died. He passed away on Saturday, July 5, 2025, in Bedfordshire, United Kingdom, following a short battle with cancer. He was diagnosed just a month before his death.\n\nThe news was confirmed by renowned Zimbabwean producer and musician Clive Mono Mukundu, who posted an update on Thursday: Sam passed away from cancer on Saturday, July 5, 2025. The family is currently processing repatriation papers in order to bring his body home for burial in Mutare. The process is expected to take between two and three weeks,Mukundu wrote.\n\nMukundu also appealed for support to help the family meet the repatriation costs: The family is asking for donations to cover the financial shortfall. Those willing to help can contact his brother Lawrence Chagumachinyi at +263775423423.\n\nSam Chagumachinyi was widely respected for his drumming skills, having played with top Zimbabwean acts such as Too Open, **Chiwoniso Maraire, Willom Tight and Dino Mudondo, and Busi Ncube. He remained in the UK after a tour with Busi in 2000 and continued to pursue his music career abroad.\n\nIn the UK, Sam furthered his education, earning a Master of Arts from the Institute of Performing Arts UKand later a BA Honours in Music Technology from the University of Bedfordshire. He lived in Bedford, where he ran a home studio and collaborated with fellow Zimbabwean artists in the diaspora, including Nagug and Tsungai Tsikirai.\n\nHis death has been met with sorrow across Zimbabwes music community and beyond, as fellow artists and fans remember a drummer whose rhythms carried the soul of a nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent BEDFORD, UK – Celebrated Zimbabwean drummer Sam Chagumachinyi has died. He passed away on Saturday, July 5, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/legendary-zimbabwean-drummer-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Legendary Zimbabwean Drummer Dies\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Latest FIFA Rankings: Warriors Remain Static",
            "url": "https://www.zimeye.net/2025/07/10/latest-fifa-rankings-warriors-remain-static/",
            "content": "Sports Correspondent\n\nZimbabwes national football team, the Warriors, have maintained their position in the latest FIFA world rankings, remaining 116th with 1157.45 points.\n\nThe unchanged ranking comes after the Warriors played two international friendlies last monthsuffering a defeat to Burkina Faso and managing a 1-1 draw against Niger. Despite the mixed results, the teams overall points tally remained steady.\n\nOn the continental stage, Zimbabwe also retained their 30th spot in Africa.\n\nMeanwhile, Morocco continues to lead the African rankings, while Argentina remains the number one team in the world.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe’s national football team, the Warriors, have maintained their position in the latest FIFA world rankings, remaining 116th … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/latest-fifa-rankings-warriors-remain-static/\">Continue reading<span class=\"screen-reader-text\"> \"Latest FIFA Rankings: Warriors Remain Static\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Hwende Rushes To Say ED’s Not Forsaken Parliament Just After Saying Chamisa Forsook  A Single MP Sikhala",
            "url": "https://www.zimeye.net/2025/07/10/hwende-rushes-to-say-eds-not-forsaken-parliament-just-after-saying-chamisa-forsook-a-single-mp-sikhala/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Highlanders Aim to Break Scoring Drought Against GreenFuel",
            "url": "https://www.zimeye.net/2025/07/10/highlanders-aim-to-break-scoring-drought-against-greenfuel/",
            "content": "Sports Correspondent\n\nHighlanders interim head coach Try Ncube is confident that his team can turn their fortunes around when they host GreenFuel this weekend. The Bulawayo soccer giants have struggled to find the back of the net in their past three games, but Ncube believes that his side is working hard to rectify the situation.\n\nWe have failed to score in the past three games, but we are working flat out to rectify that, Ncube said. Were hoping that come Sunday, we will get on the scoresheet. We are really working hard with our forwards.\n\nNcubes comments come as Highlanders look to bounce back from a barren run that has seen them fail to score in three consecutive matches. The teams forwards have been under scrutiny, but Ncube is adamant that they are doing everything possible to improve their finishing.\n\nWith GreenFuel coming to town, Highlanders will be looking to make a statement and get back to winning ways. Ncubes side will need to show a clinical edge in front of goal if they are to emerge victorious.\n\nThe match promises to be an exciting encounter, with Highlanders looking to break their scoring drought and GreenFuel eager to cause an upset. Will Highlanders finally find their scoring boots against GreenFuel? Only time will tell.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Highlanders interim head coach Try Ncube is confident that his team can turn their fortunes around when they … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/highlanders-aim-to-break-scoring-drought-against-greenfuel/\">Continue reading<span class=\"screen-reader-text\"> \"Highlanders Aim to Break Scoring Drought Against GreenFuel\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "From Waste to Wealth: Utilizing Local Feed Resources",
            "url": "https://www.zimeye.net/2025/07/10/from-waste-to-wealth-utilizing-local-feed-resources/",
            "content": "By Doctor Trywell Muzerengi\n\nImproving Local Feed Resources for Better Livestock Nutrition\n\nFeeding remains one of the biggest expenses in livestock production, consuming up to 80% of total input costs. For both smallholder and commercial farmers, the reliance on expensive and sometimes unavailable commercial feeds is a major challenge. However, utilizing locally available feed resources can provide a sustainable, affordable, and effective solutionif managed strategically.\n\nHere are key areas that farmers can focus on to improve livestock nutrition while cutting costs:\n\nIn conclusion, livestock farming can become more profitable and sustainable by shifting focus toward improving local feed resources. With the right knowledge, group initiatives, and proper feed management, farmers can significantly lower costs while improving animal health and productivity.\n\nInstagram: lasmuzagro1\n\nLinkedIn: Lasmuz Agro\n\nlasmuzagrosolutions@gmail.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Doctor Trywell Muzerengi Improving Local Feed Resources for Better Livestock Nutrition Feeding remains one of the biggest expenses in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/from-waste-to-wealth-utilizing-local-feed-resources/\">Continue reading<span class=\"screen-reader-text\"> \"From Waste to Wealth: Utilizing Local Feed Resources\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "As Soft As Wool ? Mnangagwa Minister Violates Constitution With Political Threat to Chief",
            "url": "https://www.zimeye.net/2025/07/10/as-soft-as-wool-mnangagwa-minister-violates-constitution-with-political-threat-to-chief/",
            "content": "By A Correspondent\n\nGUTU  ZANU PF Senator and State Security Minister Lovemore Matuke has issued a direct threat to newly installed Chief Nyamandi of Gutuborn Togara Masundadeclaring that his chieftaincy hinges on absolute loyalty to the ruling party and President Emmerson Mnangagwa.\n\nSpeaking at the installation ceremony recently, Matuke abandoned all pretence of constitutional decorum, warning the chief in front of gathered guests that neutrality would not be tolerated.\n\nFrom today onwards, you are a government official and the government is ZANU PF. If you dont support the President, you dont deserve to occupy the seat, Matuke said.\n\nThe remarks have sparked outrage across the country, with many condemning them as a brazen violation of Zimbabwes Constitution. Section 281(2) of the supreme law clearly prohibits traditional leaders from engaging in partisan politics, stating they must not be members of any political party or take part in political activities.\n\nMatukes threats, delivered without shame or consequence, reflect a broader pattern of lawlessness in Zimbabwes political landscapewhere the ruling elite routinely flouts legal provisions to entrench power and suppress dissent.\n\nThis incident has reignited fears over the increasing politicisation of traditional leadership. For years, civil society organisations and legal experts have warned that ZANU PF is systematically converting traditional leaders into party foot soldiers, weaponising their influence to control rural communities and sway election outcomes.\n\nEven more alarming is that the threat came from a senior cabinet minister responsible for national securityan office that should be upholding constitutional values, not undermining them.\n\nDespite Zimbabwes constitutional framework, such incidents highlight a grim reality: the rule of law is often ignored when it stands in the way of political control. Institutions meant to serve the public are being bent to enforce party loyalty, while those who dare to remain neutral risk being sidelined or removed.\n\nChief Nyamandi has yet to publicly respond, but sources in Gutu say villagers were left stunned by the open politicisation of the chieftaincy, which many still regard as a sacred and non-partisan institution.\n\nAs Zimbabwe inches closer to another election cycle, the message is clear: in the eyes of ZANU PF, even traditional leaders must fall in lineor be replaced.\n\nThis brazen abuse of authority lays bare the ruling partys willingness to subvert the Constitution in order to preserve powerone chief, one community, one threat at a time.\n\nVideo credit: Masvingo Mirror\n\nZanu PF senator for Gutu, Lovemore Matuke emphasises to newly installed Chief Nyamandi of Gutu, born Togara Masunda that he henceforth becomes an active member of Zanu PF. He warns him that failing to toe the line will have disastrous consequences for the chieftaincy. Ironically,pic.twitter.com/Q4sx4NdMp0\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent GUTU – ZANU PF Senator and State Security Minister Lovemore Matuke has issued a direct threat to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/10/as-soft-as-wool-mnangagwa-minister-violates-constitution-with-political-threat-to-chief/\">Continue reading<span class=\"screen-reader-text\"> \"As Soft As Wool ? Mnangagwa Minister Violates Constitution With Political Threat to Chief\"</span></a></p>",
            "time": "21:46",
            "date": "11 Jul 2025"
        }
    ]
}