{
    "news": [
        {
            "title": "Zanu PF Buries Chiwenga",
            "url": "https://www.zimeye.net/2024/12/25/zanu-pf-buries-chiwenga/",
            "content": "Harare Zanu PF has insisted that President Emmerson Mnangagwa would not be replaced in 2028, sidelining Vice President Constantino Chiwenga from succeeding him.\n\nInformation Minister and Zanu PF Central Committee member Jenfan Muswere made the announcement, putting to rest speculations that Chiwenga would become the Zanu PF Presidential candidate in 2028.\n\nMuswere revealed that the decision was ratified at the Zanu PF Annual Peoples Conference held in October in Bulawayo. The delegates to the Zanu PF 21st National Peoples Conference resolve as follows: the President and First Secretary of Zanu PF Party, His Excellency, Cde. Dr. E. D. Mnangagwas term of office as President of the Republic of Zimbabwe and First Secretary of Zanu PF be extended beyond 2028 to 2030, reads the resolution.\n\nThe resolution also directed the party and government to amend the national constitution to give effect to this extension.\n\nThe move seemingly ends years of speculation over Chiwengas potential succession, a debate that has persisted since the 2017 coup that ousted Robert Mugabe and brought Mnangagwa to power.\n\nInitially seen as Mnangagwas key ally, Chiwengas influence has appeared to wane amid growing internal factionalism and Mnangagwas consolidation of power.\n\nMusweres remarks underscore the binding nature of the resolutions passed at the conference, which he described as unanimously adopted with no opposition from the delegates.\n\nHe dismissed dissenting voices outside party structures as noise makers with no relevance to Zanu PFs internal processes.\n\nMuswere explained that extending Mnangagwas leadership is critical to ensuring the successful implementation of Vision 2030the governments ambitious development agenda aimed at transforming Zimbabwe into an upper-middle-income economy by the end of the decade.\n\nStability and consistency in leadership, he argued, are essential for achieving these long-term goals.\n\nAddressing questions from party members, including newly elected war veterans association member Gilbert Zowa, Muswere reiterated that the ED2030 slogan and the push for Mnangagwas continued leadership were in line with Zanu PFs constitution.\n\nHe noted that the resolutions were legally binding, as the conference met all procedural and quorum requirements.\n\nZowa had sought clarification on the ED2030 slogan, pointing out that Mnangagwa himself had previously expressed disinterest in extending his term beyond 2028.\n\nHowever, Muswere emphasized that the partys collective decision takes precedence. The Presidents personal statements notwithstanding, our guiding principle is the Zanu PF constitution and the resolutions adopted at the Annual Peoples Conference, he said.\n\nThe endorsement of Mnangagwas extended leadership signals a tightening grip on power by the incumbent, further marginalizing Chiwenga and his allies.\n\nThe power struggle between the two has been a defining feature of Zanu PFs internal politics since 2017, with Chiwengas faction increasingly on the back foot. By securing unanimous support for the extension, Mnangagwa has not only fortified his position but also reaffirmed his dominance over the partys succession narrative.\n\nMusweres statements also highlight the partys efforts to present a unified front amid growing calls for clarity on the leadership issue.\n\nThe resolutions passed in Bulawayo, chaired by Zanu PF national chairperson Oppah Muchinguri-Kashiri, underscore the partys determination to maintain Mnangagwas leadership for the foreseeable future.\n\n-State media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – Zanu PF has insisted that President Emmerson Mnangagwa would not be replaced in 2028, sidelining Vice President Constantino Chiwenga … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/zanu-pf-buries-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Buries Chiwenga\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Mnangagwa Calls Mozambique Opposition To Order",
            "url": "https://www.zimeye.net/2024/12/25/mnangagwa-calls-mozambique-opposition-to-order/",
            "content": "Harare-Thechairman of SADC and Zimbabwean President Emmerson Mnangagwa has urged parties in Mozambique to respect the rule of law.\n\nChaos escalated Monday in Maputo after the Constitutional Court upheld the controversial October election results.\n\nThe ruling reaffirmed the ruling FRELIMO party presidential candidate DanielChaposvictory, albeit with a revised margin, acknowledging significant electoral irregularities.\n\nThe court reducedChaposvictory from 71% to 65%, increasing his rival VenncioMondlanesshare to 24% from the previous 20%.\n\nThe opposition has rejected the results and called all citizens to storm the streets.\n\nIn a statement Wednesday, Mnangagwa saidthedecision oftheconstitutional courtshould be respected.\n\nBelow isMnangagwasfullstatement:\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE\n\nThe Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election Results held in the Republic of Mozambique on 9th October this year.The ruling by thatcountrystop electoral court, which upheldFRELIMOPartysvictory, completes and thus exhausts all lawful processesondetermining electionresults,in line with thatcountrysnationallaws,and in keeping withSADCsElection Guidelines and expectations.\n\nSADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council whichshould provide a constitutional way forward for the country,and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nSADC stands ready to assist the incomingGovernment,and People ofMozambique,in consolidating their electoral democracyon the basis ofthe aforesaid Court decisionwhichshould be held sacrosanct by all.Indeed, this is what the rule of law is all about.\n\nFurther, SADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law, and orderwhichthe country and people sorely need and deserve.\n\nOur Region witnessed a record number of national elections in the last two years, itself a loud testimony that democracy continues to find deeper roots andtoflourish in our SADC Region.\n\nED MnangagwaPresident of Zimbabwe and Chairman of SADC\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE.The Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December, 2024, by the Constitutional\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare-The chairman of SADC and Zimbabwean President Emmerson Mnangagwa has urged parties in Mozambique to respect the rule of law. Chaos … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/mnangagwa-calls-mozambique-opposition-to-order/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Calls Mozambique Opposition To Order\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Mnangagwa Speaks On Mozambique Electoral Controversy",
            "url": "https://www.zimeye.net/2024/12/25/mnangagwa-speaks-on-mozambique-electoral-controversy/",
            "content": "Harare SADC Chairman and the President of Zimbabwe Emmerson Mnangagwa said the opposition in Mozambique should adhere to the rule of law.\n\nIn a statement Wednesday after the recent ruling byMozambiqueshighest court upholding theOctober 9election results, which declared the FRELIMO Party victorious, Mnangagwa said everyone in Mozambique should respect thecourtsdecision.\n\nMozambique has beenembroiled in controversysince the October elections, with opposition parties and some international observers raising concerns about alleged irregularities.\n\nThe announcement by the Constitutional Council affirmingFRELIMOsvictory comes amidst accusations of voter suppression and fraud, leading to widespread protests and unrest across the country.\n\nMnangagwascall for calm and adherence to constitutional processesis a reflection ofSADCsbroader commitment to regional stability.\n\nHowever, critics argue thatSADCsapproach often prioritizes the status quo over addressing legitimate grievances.\n\nThis stance has drawn both praise for promoting order and criticism for perceived bias towards ruling parties in theregion.\n\nMnangagwasfullstatement reads as follows:\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE\n\nThe Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday,23rd December2024, by the Constitutional Council of Election Results held in the Republic of Mozambique on9th Octoberthis year.The ruling by thatcountrystop electoral court, which upheldFRELIMOPartysvictory, completes and thus exhausts all lawful processesondetermining electionresults,in line with thatcountrysnationallaws,and in keeping withSADCsElection Guidelines and expectations.\n\nSADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nSADC stands ready to assist the incoming Government, and People of Mozambique, in consolidating their electoral democracy on the basis of the aforesaid Court decision which should be held sacrosanct by all. Indeed, this is what the rule of law is all about.\n\nFurther, SADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law, and orderwhichthe country and people sorely need and deserve.\n\nOurRegionwitnessed a record number of national elections in the last two years, itself a loud testimony that democracy continues to find deeper roots and to flourish in our SADC Region.\n\nED MnangagwaPresidentof Zimbabwe and Chairman of SADC\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE.The Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December, 2024, by the Constitutional\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – SADC Chairman and the President of Zimbabwe Emmerson Mnangagwa said the opposition in Mozambique should adhere to the rule … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/mnangagwa-speaks-on-mozambique-electoral-controversy/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Speaks On Mozambique Electoral Controversy\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Chiwenga Thrown-Out Of Succession Race",
            "url": "https://www.zimeye.net/2024/12/25/chiwenga-thrown-out-of-succession-race/",
            "content": "Harare Zanu PF has officially endorsed President Emmerson Mnangagwas leadership beyond 2028, effectively sidelining Vice President Constantino Chiwenga from succeeding him.\n\nInformation Minister and Zanu PF Central Committee member Jenfan Muswere, made the announcement putting to rest speculations that Chiwenga would become the Zanu PF Presidential candidate in 2028.\n\nMuswere revealed that the decision was ratified at the Zanu PF Annual Peoples Conference held in October in Bulawayo. The delegates to the Zanu PF 21st National Peoples Conference resolve as follows: the President and First Secretary of Zanu PF Party, His Excellency, Cde. Dr. E. D. Mnangagwas term of office as President of the Republic of Zimbabwe and First Secretary of Zanu PF be extended beyond 2028 to 2030, reads the resolution.\n\nThe resolution also directed the party and government to amend the national constitution to give effect to this extension.\n\nThe move seemingly ends years of speculation over Chiwengas potential succession, a debate that has persisted since the 2017 coup that ousted Robert Mugabe and brought Mnangagwa to power.\n\nInitially seen as Mnangagwas key ally, Chiwengas influence has appeared to wane amid growing internal factionalism and Mnangagwas consolidation of power.\n\nMusweres remarks underscore the binding nature of the resolutions passed at the conference, which he described as unanimously adopted with no opposition from the delegates.\n\nHe dismissed dissenting voices outside party structures as noise makers with no relevance to Zanu PFs internal processes.\n\nMuswere explained that extending Mnangagwas leadership is critical to ensuring the successful implementation of Vision 2030the governments ambitious development agenda aimed at transforming Zimbabwe into an upper-middle-income economy by the end of the decade.\n\nStability and consistency in leadership, he argued, are essential for achieving these long-term goals.\n\nAddressing questions from party members, including newly elected war veterans association member Gilbert Zowa, Muswere reiterated that the ED2030 slogan and the push for Mnangagwas continued leadership were in line with Zanu PFs constitution.\n\nHe noted that the resolutions were legally binding, as the conference met all procedural and quorum requirements.\n\nZowa had sought clarification on the ED2030 slogan, pointing out that Mnangagwa himself had previously expressed disinterest in extending his term beyond 2028.\n\nHowever, Muswere emphasized that the partys collective decision takes precedence. The Presidents personal statements notwithstanding, our guiding principle is the Zanu PF constitution and the resolutions adopted at the Annual Peoples Conference, he said.\n\nThe endorsement of Mnangagwas extended leadership signals a tightening grip on power by the incumbent, further marginalizing Chiwenga and his allies.\n\nThe power struggle between the two has been a defining feature of Zanu PFs internal politics since 2017, with Chiwengas faction increasingly on the back foot. By securing unanimous support for the extension, Mnangagwa has not only fortified his position but also reaffirmed his dominance over the partys succession narrative.\n\nMusweres statements also highlight the partys efforts to present a unified front amid growing calls for clarity on the leadership issue.\n\nThe resolutions passed in Bulawayo, chaired by Zanu PF national chairperson Oppah Muchinguri-Kashiri, underscore the partys determination to maintain Mnangagwas leadership for the foreseeable future.\n\n-State Media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – Zanu PF has officially endorsed President Emmerson Mnangagwa’s leadership beyond 2028, effectively sidelining Vice President Constantino Chiwenga from succeeding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/chiwenga-thrown-out-of-succession-race/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Thrown-Out Of Succession Race\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "ZANU PF Says It’s Entering Mozambique for Chapo Inauguration; Should We Alert Citizens?",
            "url": "https://www.zimeye.net/2024/12/25/zanu-pf-says-its-entering-mozambique-for-chapo-inauguration-should-we-alert-citizens/",
            "content": "ZANU PF has announced it is soon entering Mozambique for Daniel Chapos inauguration. Should we inform the citizens or keep quiet ?@wilkerDias13@podemos@Cidiachissungo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Talent Rusere- Fact Check",
            "url": "https://www.zimeye.net/2024/12/25/talent-rusere-fact-check/",
            "content": "A ZANU PF activist, who  claims he exposed election rigging in Mozambique, has recently gone on to accuse the Botswana Government for arresting him in Plumtree.\n\nMr Talent Rusere who calls self a professor, also alleges he is a lawyer and or an advocate such that he leads a group of lawyers called the SAHRF: Southern African Human Rights Forum\n\nSAHRF FACT CHECKS-\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A ZANU PF activist, who claims he exposed election rigging in Mozambique, has recently gone on to accuse the Botswana … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/talent-rusere-fact-check/\">Continue reading<span class=\"screen-reader-text\"> \"Talent Rusere- Fact Check\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Mapfumo to Mozambicans: You’re More Than Soldiers, Come Out",
            "url": "https://www.zimeye.net/2024/12/25/mapfumo-to-mozambicans-youre-more-than-soldiers-come-out/",
            "content": "Youre more than the soldiers, come out and protest against misrule, legendary singer Thomas Mapfumo tells Mozambicans as he connects to events being reported by@AllexandreMZ@wilkerDias13@Cidiachissungo.https://t.co/hSOzlbDTvx\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Mnangagwa Sticks to Vision 2030",
            "url": "https://www.zimeye.net/2024/12/25/mnangagwa-sticks-to-vision-2030/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has reaffirmed his commitment to achieving Zimbabwes Vision 2030, a plan aimed at transforming the country into an upper-middle-income society. While his leadership has often been scrutinized, particularly regarding his adherence to the constitution, Mnangagwas latest statements suggest a focused pursuit of this national agenda. He has been consistent in outlining a path for economic growth, social cohesion, and unity, emphasizing that all sectors of society must collaborate to realize the vision.\n\nSpeaking on the trajectory towards Vision 2030, President Mnangagwa assured that the country is progressing steadily on the path to economic development. Vision 2030 shall surely become a reality, he stated, Never, never, never again should anything ever divide us. United we must stand, strong and solid as the walls of great Zimbabwe, from which we derive our nations name. The Presidents words underline the importance of unity, not just for political stability, but as a cornerstone for economic prosperity.\n\nAt the core of the Vision 2030 agenda is a call for collaboration across all levels of society. Mnangagwas vision requires the active participation of citizens, businesses, and the government. He expressed this sentiment clearly, saying, Hand in hand, in unity, from village to the provincial level, sector by sector and industry by industry, Vision 2030 shall surely become a reality. His message is clear: the achievement of the nations aspirations is only possible through collective effort.\n\nCentral to the governments strategy for achieving Vision 2030 is fostering national unity and social cohesion. President Mnangagwa emphasized that the country is building a cohesive society through grassroots development and decentralization. These include accelerated development at grassroots level and broader decentralisation. Home-grown unity and peace-building processes, led by our chiefs, are a testimony of the effectiveness of our heritage-based strategies in addressing contemporary realities, he explained.\n\nThe Presidents focus on heritage-based strategies and decentralization underscores a commitment to local-level engagement, particularly through traditional leadership. Chiefs, who have been instrumental in peace-building efforts, are seen as vital players in uniting communities and fostering a sense of shared purpose.\n\nAs the country marks 37 years since the signing of the Unity Accord, which ended the civil strife between Zanu PF and the PF-Zapu, President Mnangagwa used this significant milestone to remind Zimbabweans of the values that have shaped the nations progress. Unity, patriotism, peace as well as love and respect for one another are indispensable values to accelerate the development of our country, he asserted. The Unity Accord, signed in 1987, remains a pivotal moment in Zimbabwes post-independence history, and Mnangagwas reference to it calls for a renewed commitment to peace and national reconciliation.\n\nWhile President Mnangagwa has faced scrutiny regarding his constitutional adherence, particularly his statement about stepping down in 2028 as required by the constitution, his consistent rhetoric about unity, peace, and development provides a clear narrative about his vision for the country. The challenge for Mnangagwa, however, remains in balancing his public pledges with the need for genuine democratic reforms. His statement about not staying in power beyond 2028, in accordance with the constitution, invites further scrutiny into whether his actions will align with this promise.\n\nIn conclusion, President Mnangagwas insistence on Vision 2030 being on course, along with his emphasis on national unity and grassroots development, presents a roadmap for Zimbabwes future. However, his adherence to the constitution and his commitment to democratic processes will remain key indicators of his sincerity in achieving the vision he has outlined. Let us therefore, look ahead to a brighter future as we continuously discover the strength that resides in our diversity, culture, and traditions, Mnangagwa concluded, encapsulating his vision for Zimbabwes unity and progress.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has reaffirmed his commitment to achieving Zimbabwe’s Vision 2030, a plan aimed at transforming … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/mnangagwa-sticks-to-vision-2030/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Sticks to Vision 2030\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Baba Jukwa Warns Mnangagwa the Day He Touches Mondlane He’s Out In 7 Days | FULL TEXT",
            "url": "https://www.zimeye.net/2024/12/25/baba-jukwa-warns-mnangagwa-the-day-he-touches-mondlane-hes-out-in-7-days-full-text/",
            "content": "ByBaba Jukwa | Emmerson Mnangagwa, hear this cry echoing from the depths of Mozambiques soul! The agony of the Mozambican people, the suffering etched intheir hearts, demands your unwavering attention. Do not test the patience of those who stand steadfast against tyranny. Do not lay a finger on Velancio Mondlane or his kin, for their cause burns brighter than any oppressive force you could muster.\n\nBeware, for the winds of change howl fiercely. If you falter, if you dare to oppress, your days of unlawfully occupying State House will come to an abrupt and undeniable end. Within seven days, you will be swept away, airlifted into irrelevance, retired by the very forces you sought to silence. By the close of this year31 December 2024your throne of illegitimacy will crumble to dust if you tread recklessly.\n\nBehave wisely, Emmerson, for the sands of time are slipping through your fingers. Wapera, Emmerson, wapera! Act otherwise, and you will witness the will of the people rise as an unrelenting storm, uprooting your reign, your power, and your legacy. The world is watching, the people are waiting, and the reckoning is near.\n\nBehave any other way and see what will happen to your illegal tenancy of State House by 31 Dec 2024.Behave mfana!\n\nAsijiki!NdatendaBaba Jukwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Baba Jukwa | Emmerson Mnangagwa, hear this cry echoing from the depths of Mozambique’s soul! The agony of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/baba-jukwa-warns-mnangagwa-the-day-he-touches-mondlane-hes-out-in-7-days-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"Baba Jukwa Warns Mnangagwa the Day He Touches Mondlane He’s Out In 7 Days | FULL TEXT\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        },
        {
            "title": "Church Invites Musician Clive Malunga For “Instant Deliverance”",
            "url": "https://www.zimeye.net/2024/12/25/church-invites-musician-clive-malunga-for-instant-deliverance/",
            "content": "By A Correspondent\n\nIn an unexpected turn of events, Masvingo-based clergyman Prophet Lovemore Chevure has condemned veteran musician Clive Malunga for criticizing President Emmerson Mnangagwas bid for a third term.\n\nThe controversy began after a video surfaced last week in which Malunga, who is also a war veteran, argued that Mnangagwa was not divinely appointed and therefore had no mandate to extend his rule.\n\nYes, I clearly said that Mnangagwa wont see 2030 or even 2026 because he isnt God and wasnt appointed by God to be President of Zimbabwe, Malunga stated.\n\nIn response, Chevure, leader of Prophetic Grace International Church, rebuked Malungas remarks in an interview with a local publication. Chevure invited Malunga to visit his church for instant deliverance.\n\nPresident Emmerson Mnangagwa has every right to rule. The power of life and death lies in your tongue, as the scriptures say. Therefore, the President has every right to say, I can be there and lead even up to 2040,' Chevure asserted.\n\nChevure continued by addressing Malunga directly: As for you, Clive Malunga, you dont have the power to say the president wont be around in 2026. Who are you? Who gave you that authority? Regardless of our political affiliations, we must accept that the current president of Zimbabwe is Emmerson Mnangagwa. Scriptures urge us to respect the authority of our leaders, and by showing disrespect to the President, Malunga has invited a curse on himself and his family.\n\nHe further invited Malunga to his church for deliverance, claiming that if Malunga could not see the progress made under the Second Republic, he was in need of spiritual intervention. The problem with some of our countrymen is that they focus only on the negative side, Chevure said.\n\nChevure also reminded listeners that no one is perfect. You must know that if you are praying for your enemies to die, remember that you, too, are someones enemy, and they might be wishing the same for you. No human has a clean record; we all have offended someone at some point.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In an unexpected turn of events, Masvingo-based clergyman Prophet Lovemore Chevure has condemned veteran musician Clive Malunga … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/church-invites-musician-clive-malunga-for-instant-deliverance/\">Continue reading<span class=\"screen-reader-text\"> \"Church Invites Musician Clive Malunga For “Instant Deliverance”\"</span></a></p>",
            "time": "20:38",
            "date": "25 Dec 2024"
        }
    ]
}