{
    "news": [
        {
            "title": "Mnangagwa Readmits G40 Kingpin",
            "url": "https://www.zimeye.net/2025/05/12/mnangagwa-readmits-g40-kingpin/",
            "content": "By A Correspondent-President EmmersonMnangagwa reversedthe suspension of prominent G40-linked figure Shadreck Mashayamombe andordereda probe into what he described as illegal and factional expulsions within the ruling party.\n\nSources who attended the politburo meeting held last week saidthat Mnangagwa was incensed by what he called clandestine suspensions of party members without due process, accusing unnamed individuals of acting likeenemies of the party.\n\nThe development comes amid growing tensions within the partys provincial structures, particularly in Harare and Masvingo, ahead of internal elections set for next year.\n\nShadreck Mashayamombe, once a prominent figure in the Generation 40 (G40) faction that backed former First Lady Grace Mugabe and opposed Mnangagwas ascendancy in 2017, had been suspended by the Harare provincial leadership led by Godwills Masimirembwa.\n\nG40 was a powerful Zanu PF faction that emerged in the latter years of the Mugabe era. It was composed of younger, urban-based politicians loyal to Mugabe and his wife, Grace,whothey saw as his successor. The faction clashed with Mnangagwas Lacoste faction,made up largelyof liberation war veterans and military-aligned figures. The rivalry culminated in the 2017 military-assisted coup that ousted Robert Mugabe and catapulted Mnangagwa to power, leading to the purging and exile of many G40 leaders, including Saviour Kasukuwere, Jonathan Moyo, and Patrick Zhuwao.\n\nMashayamombe, a former Harare South MP, wasamong thosesidelined but remained politically active. His re-emergence and Mnangagwas intervention signal a possible softening of stance toward some G40 elements, at least those willing to toe the current leaderships line.\n\nAccording to Zanu PFs constitution, Mashayamombes status as a cell member means any disciplinary process against him should have been initiated at the branch level. However, the provincial leadership allegedly bypassed these internal procedures.\n\nThe President demanded an investigation into who orchestrated these suspensions, said a senior politburo member. He emphasized that Mashayamombe brings value to the party and should not be a victim of factional rumours.\n\nSources suggest Masimirembwa viewed Mashayamombe as a threat in the upcoming provincial elections, and the suspension was part of a broader strategy to neutralize political rivals.\n\nMasimirembwa could not be reached for comment.\n\nMnangagwa also reversed the expulsion of two members from Masvingo province, underscoring his disapproval of internal purges.\n\nAt a press conference following the politburo meeting, Zanu PF national spokesperson Christopher Mutsvangwa confirmed the Presidents strong stance on unity and due process.\n\nPresident Mnangagwa was very stern on the issue of expulsions. He believes this could destroy the party, Mutsvangwa said.\n\nHe does not tolerate clandestine suspensions and expulsions. Zanu PF is a revolutionary party rooted in the people, guided by the principle of leaving no one and no place behind.\n\nMutsvangwa added that the party will now favour reprimands over expulsionsin a bidto foster internal healing and avoid further divisions.\n\nRather than removing members, the party opted for reprimands where necessary. This reflects the Presidents leadership style  focused on strengthening the party from within, Mutsvangwa said.\n\nWith next years provincial elections drawing closer, Mnangagwas move appears to be a calculated effort to consolidate unity within Zanu PF and rein in rogue elements within the provincial structures. However, observers note that the re-admission of G40-linked figures could spark renewed tensions within the deeply factionalised party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa reversed the suspension of prominent G40-linked figure Shadreck Mashayamombe and ordered a probe into what he described as illegal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/mnangagwa-readmits-g40-kingpin/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Readmits G40 Kingpin\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "Top Cabinet Minister’s Daughter Raped",
            "url": "https://www.zimeye.net/2025/05/12/top-cabinet-ministers-daughter-raped/",
            "content": "Harare man up for raping ministers daughter and friend\n\nBy A Correspondent | ZimEye | A Harare man has been dragged to court on allegations of raping an intoxicated cabinet ministers daughter and her friend.\n\nThe incident allegedly tool place on May 7 this year.\n\nThe suspect Prince Dzingai appeared before Harare magistrate Marewanazvo Gofa who advised him to seek bail at the High Court.\n\nIt is alleged that on the day, the ministers daughter her friend and Dzingai went to Robert Mugabe International Airport to drop her aunt around midday.\n\nOn their way the trio were drinking vodka.\n\nAfter dropping the relative the three then decided to go to Dzingais house.\n\nThey wanted to return to the airport around 7pm to pick the ministers wife.\n\nWhen they were going to the accuseds house the complainant was seated in the back seat as Dzingai allegedly encouraged her to drink more beer so that she would not be sad, reads court papers.\n\nWhen they reached Dzingais house, she was already drunk.\n\nDzingai allegedly kept on en couraging her to drink more until she became excessively drunk.\n\nThe court heard Dzingai then told the complainant that he liked her.\n\nThe three went out to buy some brandy and an energy drink which Dzingai allegedly spiked.\n\nShe noticed it had a funny taste.\n\nThe complainant then went blank but she remembers going to the toilet to change her pad.\n\nThe complainant remembers that she saw the accused on top of her her, further reads court papers.\n\nProsecutor Shambudzeni Fungura further alleged that Dzingai took off the complainants skirt and underwear.\n\nThe complainant allegedly told Dzingai that she was on her periods but he didnt care.\n\nIt is alleged that she raped the ministers daughter twice and also her friend twice.\n\nThe matter was reported the following day.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare man up for raping minister’s daughter and friend By A Correspondent | ZimEye | A Harare man has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/top-cabinet-ministers-daughter-raped/\">Continue reading<span class=\"screen-reader-text\"> \"Top Cabinet Minister’s Daughter Raped\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "Achraf Hakimi Wins 2025 Marc-Vivien Foé Award as Ligue 1’s Top African Player",
            "url": "https://www.zimeye.net/2025/05/12/achraf-hakimi-wins-2025-marc-vivien-foe-award-as-ligue-1s-top-african-player/",
            "content": "Sports Correspondent\n\nParis Saint-Germain and Morocco defender Achraf Hakimi has been named the winner of the 2025 Marc-Vivien Fo Award.\n\nThe accolade, presented annually by RFI and France 24, honors the best African player competing in Frances Ligue 1.\n\nHakimis consistent performances and key contributions for PSG throughout the season earned him this prestigious recognition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Paris Saint-Germain and Morocco defender Achraf Hakimi has been named the winner of the 2025 Marc-Vivien Foé Award. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/achraf-hakimi-wins-2025-marc-vivien-foe-award-as-ligue-1s-top-african-player/\">Continue reading<span class=\"screen-reader-text\"> \"Achraf Hakimi Wins 2025 Marc-Vivien Foé Award as Ligue 1’s Top African Player\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "Mnangagwa On Camera With People He Sold The Whole Of Mutare Land Size",
            "url": "https://www.zimeye.net/2025/05/12/mnangagwa-on-camera-with-people-he-sold-the-whole-of-mutare-land-size/",
            "content": "ANALYSIS: How Much More of Zimbabwes Land Was Bartered in Mnangagwas Latest Belarus Visit?\n\nBy Correspondent | ZimEye | 12 May 2025\n\nPresident Emmerson Mnangagwas latest state visit to Belarus, as proudly announced on his official page, rekindles memories of controversial land-for-deals diplomacy that has defined much of his foreign policy in recent years. While the post paints a picture of deepened collaboration between Zimbabwe and Belarus, many Zimbabweans are asking a sharper question: what did Mnangagwa give away this time?\n\nThe 2019 Precedent: Buses for a Province\n\nIn 2019, Mnangagwas government struck a deal with Belarus in which an estimated 700 ZUPCO buses were delivered  in return for land allocations reportedly equivalent to the size of Mutare. While officials claimed it was a development partnership, insiders and land rights experts widely condemned the deal as a monumental betrayal of national assets for short-term optics.\n\nIt didnt stop there. In the same period, Mnangagwa infamously offered U.S. President Donald Trump a chunk of Victoria Falls ancestral land  a gesture that had no economic logic and reeked of desperation for foreign approval.\n\nCarbon Credits or Carbon Crimes?\n\nIn the years since, thousands more hectares have been leased or granted to Gulf-based firms under the label of carbon credit projects  schemes that critics argue are nothing more than disguised land grabs. These arrangements often operate without parliamentary approval or transparency, placing critical ecological and cultural zones under foreign control for decades.\n\nThe Al Jazeera Sting\n\nIn 2021, Mnangagwa was exposed in the Al Jazeera Gold Mafia investigation where he and his associates nearly traded more of Victoria Falls for vague promises from undercover journalists posing as investors. That attempt, halted only by media exposure, highlighted a worrying pattern: land for loyalty, land for illusions of investment, land for nothing.\n\nWhat Did Minsk Get This Time?\n\nWhile no official figures have yet been released from the current Belarus visit, the pattern is too familiar to ignore. Based on previous transactions  such as the 700 buses exchanged for land  one might reasonably estimate that another 10,000 to 20,000 hectares could have quietly changed hands behind closed doors in Minsk.\n\nThats nearly twice the size of Harare. At an estimated commercial land value of US$3,000 per hectare (a conservative figure in Victoria Falls or eastern Zimbabwe), this means a potential transfer of assets worth US$3060 million could have occurred  in return for yet another token infrastructure promise, like tractors or fire engines.\n\nA Country for Sale?\n\nThe optics of Mnangagwas photo-op in Minsk are clear: smiling faces, waving flags, and words like collaboration. But behind the curtains, Zimbabweans must ask: what price is their land paying for these trips? In a nation where poverty is deepening and services are collapsing, the giveaway of ancestral and national lands to foreign interests  often for peanuts  is not collaboration. Its surrender.\n\nThe true cost of this visit may only be known years from now  when generations find they have no land left to call their own.\n\nA History of Controversial Land Deals\n\n1. 2019 Belarus Deal:\n\nIn 2019, Mnangagwas administration reportedly transferred land equivalent to the size of Mutareapproximately 16,700 hectaresto Belarus in exchange for 700 ZUPCO buses. However, reports indicate that many of these buses have since broken down, raising questions about the value and sustainability of the deal.\n\n2. Victoria Falls Offer to Trump:\n\nMnangagwa publicly offered land near Victoria Falls to then-U.S. President Donald Trump for the construction of a golf course, aiming to attract foreign investment. This move was met with criticism, as it involved offering a national park area rich in wildlife to a foreign leader.\n\n3. Carbon Credit Agreements:\n\nIn 2023, Zimbabwe entered into a deal with UAE-based company Blue Carbon, granting them conservation rights over 7.5 million hectares of forest landabout 20% of the countrys landmassfor carbon credit projects. While the deal was touted to bring in $1.5 billion, concerns have been raised about the lack of transparency and the actual benefits to local communities.\n\n4. Al Jazeeras 2021 Investigation:\n\nAn undercover investigation by ZimEye and Al Jazeera in 2021 revealed that Mnangagwas ambassador-at-large, Uebert Angel, offered to facilitate the laundering of millions of dollars through gold smuggling schemes. The investigation highlighted the potential for high-level corruption and misuse of national resources.\n\nEstimating the Impact of the Latest Belarus Visit\n\nWhile specific details of the recent Belarus visit remain undisclosed, historical patterns suggest the possibility of further land concessions. If we consider the 2019 deal as a benchmarkwhere approximately 16,700 hectares were exchanged for busesit is plausible that similar or larger tracts of land could have been involved in the latest agreements.\n\nAssuming a conservative estimate of 20,000 hectares at an average land value of $3,000 per hectare, the potential value of land exchanged could be around $60 million. However, without transparency and official disclosures, the exact figures remain speculative.\n\nVisualizing the Land Allocations\n\nTo better understand the scale and distribution of these land deals, the following map provides a visual representation:\n\nNote: The map illustrates Zimbabwes geographical layout, including major cities and regions. Specific land deal locations are not marked due to the lack of publicly available detailed information.\n\nThe recurring theme of trading significant portions of Zimbabwes land for foreign investments with questionable returns raises concerns about the long-term implications for national sovereignty and economic stability. As these deals often lack transparency and public consultation, there is a growing need for accountability and scrutiny to ensure that the nations resources are managed in the best interest of its citizens.\n\nFor further reading and detailed reports on these issues, consider the following sources:\n\nWould you like a more detailed breakdown or analysis of any specific aspect of these deals?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ANALYSIS: How Much More of Zimbabwe’s Land Was Bartered in Mnangagwa’s Latest Belarus Visit? By Correspondent | ZimEye | 12 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/mnangagwa-on-camera-with-people-he-sold-the-whole-of-mutare-land-size/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa On Camera With People He Sold The Whole Of Mutare Land Size\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "Xabi Alonso Set to Become Real Madrid Head Coach",
            "url": "https://www.zimeye.net/2025/05/12/xabi-alonso-set-to-become-real-madrid-head-coach/",
            "content": "Sports Correspondent\n\nAhead of Bayer Leverkusens 42 loss to Borussia Dortmund over the weekend, Xabi Alonso confirmed he will step down as head coach at the end of the current season. The former Spanish international has long been linked with a return to Real Madrid, where he enjoyed a successful stint as a player.\n\nAccording to renowned transfer expert Fabrizio Romano, Alonso has now reached a full agreement to become Real Madrids next head coach. He is expected to sign a contract that runs through 2028 and will take over from current manager Carlo Ancelotti ahead of this summers FIFA Club World Cup.\n\nAlonso took the reins at Leverkusen in October 2022 and led the club to a historic domestic double in his first full season. Despite their upcoming fixture against Mainz, Leverkusen are guaranteed a second-place finish in the Bundesliga, trailing only champions Bayern Munich.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Ahead of Bayer Leverkusen’s 4–2 loss to Borussia Dortmund over the weekend, Xabi Alonso confirmed he will step … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/xabi-alonso-set-to-become-real-madrid-head-coach/\">Continue reading<span class=\"screen-reader-text\"> \"Xabi Alonso Set to Become Real Madrid Head Coach\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "Economic Turmoil Hits Parliament: MPs Unpaid For Months",
            "url": "https://www.zimeye.net/2025/05/12/economic-turmoil-hits-parliament-mps-unpaid-for-months/",
            "content": "Tinashe Sambiri\n\nZimbabwes Parliament is facing mounting criticism after it emerged that legislators are owed over US$600,000 in unpaid sitting allowances, a backlog that stretches across eight months.\n\nA government source confirmed on Monday that economic turmoil and delays in funding processes have left Members of Parliament without their entitled payments. Legislators, who are supposed to receive US$75 per sitting, say the failure to disburse their allowances is affecting their ability to meet basic financial obligations.\n\nThe countrys legislators are owed over US$600,000 in unpaid sitting allowances spanning over the last eight months, the source revealed. Many MPs are now failing to meet their obligations such as paying their bills and utilities.\n\nThe delays have sparked discontent among lawmakers, some of whom argue that the financial strain is compromising their ability to serve effectively. Although Parliament has not issued an official statement, internal discussions suggest that the crisis is linked to broader economic challenges affecting public sector financing.\n\nAnalysts warn that unless the issue is resolved urgently, it could disrupt legislative work and morale within Parliament.\n\nThe matter is expected to feature prominently in upcoming parliamentary debates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Zimbabwe’s Parliament is facing mounting criticism after it emerged that legislators are owed over US$600,000 in unpaid sitting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/economic-turmoil-hits-parliament-mps-unpaid-for-months/\">Continue reading<span class=\"screen-reader-text\"> \"Economic Turmoil Hits Parliament: MPs Unpaid For Months\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "",
            "url": "https://www.zimeye.net/2025/05/12/820865/",
            "content": "Benny  Moyo Memorial Lecture on Jason Ziyaphapha Moyo entitled Jason Ziyaphapha Moyo a Politician and Military Strategist Par Excellence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Benny Moyo Memorial Lecture on Jason Ziyaphapha Moyo entitled “Jason Ziyaphapha Moyo a Politician and Military Strategist Par Excellence.",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "“Let’s Hope Mnangagwa Is Seeking Urgent Support To Revive Ailing Health System “",
            "url": "https://www.zimeye.net/2025/05/12/lets-hope-mnangagwa-is-seeking-urgent-support-to-revive-ailing-health-system/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas busy international travel schedule shows no sign of slowing down, as he clocked more hours in the air this past week with back-to-back visits to Russia and Belarus.\n\nFresh off a visit to Moscow, Mnangagwa landed in Minsk, Belarus, on Sunday for an official state visit aimed at deepening trade and political ties.\n\nAccording to a government statement, The President Emmerson Mnangagwa has arrived in Minsk, Belarus for an official visit.\n\nHe was welcomed by the Belarus Deputy Prime Minister Mr Karankevich Viktor Mikhailovich, Foreign Minister Ryzhenkov Maxim, and several Zimbabwean government ministers, as well as Zimbabwes consular Zingman Alexander and young Zimbabwean students studying in Belarus.\n\nThe statement added, The Presidents visit is packed as the two countries scale up trade relations, capitalising on excellent political relations between the two republics.\n\nWhile the government promotes the trip as a strategic diplomatic and economic engagement, critics have questioned the timing and value of Mnangagwas frequent international travels, especially given the countrys mounting domestic challenges.\n\nZimbabwe continues to struggle with a deteriorating healthcare system, inflation, and widespread poverty. Many see the Presidents travels as out of touch with the lived realities of ordinary citizens.\n\nLets hope Mnangagwa is seeking support to boost the ailing health system, said Stephen Sarkozy Chuma, former Citizens Coalition for Change (CCC) youth assembly spokesperson. Our hospitals are underfunded, doctors are leaving the country, and people cant even access basic treatment.\n\nWhile the outcomes of the Belarus visit remain to be seen, pressure is growing for Mnangagwa to prioritise pressing issues at home amid criticism that his globetrotting comes with little benefit to struggling Zimbabweans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s busy international travel schedule shows no sign of slowing down, as he clocked more … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/lets-hope-mnangagwa-is-seeking-urgent-support-to-revive-ailing-health-system/\">Continue reading<span class=\"screen-reader-text\"> \"“Let’s Hope Mnangagwa Is Seeking Urgent Support To Revive Ailing Health System “\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "Chivayo Publicly Mocks Suffering Zimbabweans, Boasts Of Being A Billionaire",
            "url": "https://www.zimeye.net/2025/05/12/chivayo-publicly-mocks-suffering-zimbabweans-boasts-of-being-a-billionaire/",
            "content": "By A Correspondent\n\nControversial businessman and ZANU PF-linked tenderpreneur Wicknell Chivayo has once again sparked public outrage after posting a picture of himself wearing a t-shirt emblazoned with the letter B, boasting of his wealth while millions of Zimbabweans continue to endure economic hardship.\n\nIn a statement shared on his social media platforms over the weekend, Chivayo wrote:OUTBOUND Take note the B is for the inevitable BILLIONAIRE status thats coming my way AGAINST ALL ODDS Maka tangirwa ne dare REGERAI VAKOMANA\n\nThe message, filled with bravado, suggested that Chivayo believes his rise to immense wealth is unstoppable and immune to public scrutiny or criticism.\n\nHis comments have struck a nerve with many Zimbabweans who are grappling with soaring inflation, unemployment, and a deteriorating healthcare system. With the cost of living rising daily and basic services in decline, Chivayos flamboyant display of wealth has been widely condemned as insensitive and out of touch.\n\nA political analyst said, Chivayos comments reflect the arrogance of elites who benefit from state-linked contracts while ordinary citizens cant even afford bread or access decent medical care.\n\nMany critics also accuse Chivayo of flaunting ill-gotten wealth, gained through opaque government deals, including controversial energy contracts that have yielded little in terms of results but reportedly paid out millions.\n\nPeople are suffering, and instead of showing humility or social responsibility, hes out here bragging about billions, one social media user wrote in response.\n\nIts not just tone-deafits provocative.\n\nDespite mounting criticism, Chivayo appears unfazed and defiant, implying that no force or authority can derail his path to wealth and status.\n\nHis post ended with a bold message to critics:Regerai vakomana\n\nAs Zimbabweans continue to question the source and purpose of such extravagant displays of wealth, calls are growing for greater transparency and accountability from those who profit while the rest of the nation struggles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial businessman and ZANU PF-linked tenderpreneur Wicknell Chivayo has once again sparked public outrage after posting a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/chivayo-publicly-mocks-suffering-zimbabweans-boasts-of-being-a-billionaire/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Publicly Mocks Suffering Zimbabweans, Boasts Of Being A Billionaire\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        },
        {
            "title": "Mnangagwa’s Penchant For Globetrotting Continues",
            "url": "https://www.zimeye.net/2025/05/12/mnangagwas-penchant-for-globetrotting-continues/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas busy international travel schedule shows no sign of slowing down, as he clocked more hours in the air this past week with back-to-back visits to Russia and Belarus.\n\nFresh off a visit to Moscow, Mnangagwa landed in Minsk, Belarus, on Sunday for an official state visit aimed at deepening trade and political ties.\n\nAccording to a government statement, The President Emmerson Mnangagwa has arrived in Minsk, Belarus for an official visit.\n\nHe was welcomed by the Belarus Deputy Prime Minister Mr Karankevich Viktor Mikhailovich, Foreign Minister Ryzhenkov Maxim, and several Zimbabwean government ministers, as well as Zimbabwes consular Zingman Alexander and young Zimbabwean students studying in Belarus.\n\nThe statement added, The Presidents visit is packed as the two countries scale up trade relations, capitalising on excellent political relations between the two republics.\n\nWhile the government promotes the trip as a strategic diplomatic and economic engagement, critics have questioned the timing and value of Mnangagwas frequent international travels, especially given the countrys mounting domestic challenges.\n\nZimbabwe continues to struggle with a deteriorating healthcare system, inflation, and widespread poverty. Many see the Presidents travels as out of touch with the lived realities of ordinary citizens.\n\nLets hope Mnangagwa is seeking support to boost the ailing health system, said Stephen Sarkozy Chuma, former Citizens Coalition for Change (CCC) youth assembly spokesperson. Our hospitals are underfunded, doctors are leaving the country, and people cant even access basic treatment.\n\nWhile the outcomes of the Belarus visit remain to be seen, pressure is growing for Mnangagwa to prioritise pressing issues at home amid criticism that his globetrotting comes with little benefit to struggling Zimbabweans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s busy international travel schedule shows no sign of slowing down, as he clocked more … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/12/mnangagwas-penchant-for-globetrotting-continues/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Penchant For Globetrotting Continues\"</span></a></p>",
            "time": "20:29",
            "date": "13 May 2025"
        }
    ]
}