{
    "news": [
        {
            "title": "Harare’s Toxic Deal? How City Officials Handpicked Watermark for US$16M Project",
            "url": "https://www.zimeye.net/2025/04/02/harares-toxic-deal-how-city-officials-handpicked-watermark-for-us16m-project/",
            "content": "Draft\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The tender awarded to Watermark Technologies by the Harare City Council (HCC) has come under intense scrutiny … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/harares-toxic-deal-how-city-officials-handpicked-watermark-for-us16m-project/\">Continue reading<span class=\"screen-reader-text\"> \"Harare’s Toxic Deal? How City Officials Handpicked Watermark for US$16M Project\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Chivayo-In-Law Armed Robber Sentenced to 60 Years Over US74,000 Theft",
            "url": "https://www.zimeye.net/2025/04/02/chivayo-in-law-armed-robber-sentenced-to-60-years-over-us74000-theft/",
            "content": "By A Correspondent | ZimEye | ONE of the armed robbers who robbed controversial businessman Wicknel Chivayos inlaws of US$74 000 has been slapped with a 60 year jail term.\n\nBigboy Nampungo pleaded guilty to the allegations as such did not go for trial.\n\nMagistrate Jesse Kufa howfar slashed half of his sentence on conditionally him to serve 30 years effective.\n\nThere were six complainants in the case building up six counts.\n\nThe breakdown of the counts was a s follows\n\nSentenceCount 1- 10yrs imprisonmentCount 2-10 yrs imprisonmentCount 3-10yrs imprisonmentCount 4-10yrs imprisonmentCount 5-10yrs imprisonmentCount 6-10yrs imprisonment.Count 1 and 2 to run concurrently 10yrs imprisonmentCount 3and 4 to run concurrently 10yrs imprisonmentCount 5and 6 to run concurrently 10yrs imprisonmentTotallying to 30 yrs imprisonment effective.\n\nNampungos collegues, Garikai Shangwa, Temptation Dinhidza, Arnold Tafirei, Tawanda Mushayatu and Mike Mhaka, Maramba Vhiya and Takudzwa Maisvoreva are denying the allegations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | ONE of the armed robbers who robbed controversial businessman Wicknel Chivayo’s inlaws of US$74 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/chivayo-in-law-armed-robber-sentenced-to-60-years-over-us74000-theft/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo-In-Law Armed Robber Sentenced to 60 Years Over US74,000 Theft\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Jordan Zemura Sidelined with Calf Injury",
            "url": "https://www.zimeye.net/2025/04/02/jordan-zemura-sidelined-with-calf-injury/",
            "content": "Sports Correspondent\n\nZimbabwean international Jordan Zemura has suffered a setback after picking up a calf injury during training. As a result, he missed Udineses recent match against Inter Milan, which ended in a 2-1 defeat.\n\nAccording to an official update from Udinese Calcio, Zemura sustained a distraction trauma to the medial calf of his right leg during a training session ahead of the Inter Milan match.\n\nThe clubs medical staff will continue to evaluate Zemuras condition over the coming weeks to determine the extent of the injury and a possible return date.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean international Jordan Zemura has suffered a setback after picking up a calf injury during training. As a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/jordan-zemura-sidelined-with-calf-injury/\">Continue reading<span class=\"screen-reader-text\"> \"Jordan Zemura Sidelined with Calf Injury\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zimbabwean Starlet Joins Portuguese Side",
            "url": "https://www.zimeye.net/2025/04/02/zimbabwean-starlet-joins-portuguese-side/",
            "content": "Sports Correspondent\n\nCobert Chimedza Junior, a talented 20-year-old Zimbabwean footballer, has secured a multi-year deal with Gil Vicente, a prominent Portuguese top-flight club. This milestone marks a significant achievement for Chimedza, who was born in Harare and relocated to the United Kingdom at the age of 14.\n\nChimedzas impressive skills were showcased during his tenure with MK Dons, where he scored an impressive 18 goals in just 15 appearances in the English League 2. His potential was recognized by the Warriors coaching staff in 2021, and he even trained with the team during the Zdravko Logarusic era.\n\nKnowledge Musona and Ovidy Karuru, then captain and vice-captain of the Warriors, acknowledged Chimedzas exceptional talent, labeling him as one for the future. Chimedzas accomplishment is historic, as he becomes the first Zimbabwean player to join a Portuguese top-flight club since the country gained independence. He follows in the footsteps of the late Freddy Mukwesha, who played for Sporting Braga in 1960.\n\nPreviously, Chimedza was on the verge of joining Turkish side Adana Demirspor in 2023, but the deal fell through due to the sudden departure of head coach Patrick Kluivert. Gil Vicente, led by coach Csar Peixoto, currently sits 14th in the league table with 26 points from 27 matches.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Cobert Chimedza Junior, a talented 20-year-old Zimbabwean footballer, has secured a multi-year deal with Gil Vicente, a prominent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/zimbabwean-starlet-joins-portuguese-side/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Starlet Joins Portuguese Side\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Every Second Matters Behind The Wheel",
            "url": "https://www.zimeye.net/2025/04/02/every-second-matters-behind-the-wheel/",
            "content": "Distracted driving has become one of the most significant threats to road safety in recent years. It only takes a mere five seconds to look away from the road  whether its to read a text, search for a phone number, adjust your cars music or GPS, or pick up something thats fallen  but those five seconds can be deadly. In fact, that short moment of distraction can make the difference between a safe journey and a devastating crash.\n\nWhile it might seem harmless to glance at your phone or fiddle with the radio for a moment, the consequences can be catastrophic. A vehicle moving at just 55 miles per hour travels the length of a football field in five seconds  a dangerous amount of time when youre not focused on the road. Those precious seconds can lead to fatal accidents, leaving you, your passengers, and others on the road in harms way.\n\nEvery moment you spend driving is critical to the safety of everyone around you. It may feel like a small, insignificant distraction, but it can easily result in tragic outcomes. Consider the devastating impact an accident can have on your life and the lives of your loved ones. A crash could leave you struggling in a hospital bed, confined to a wheelchair, or worse, it could end your life. More importantly, it could leave your family in grief and financial turmoil, forever haunted by the absence of your presence.\n\nThink about the effort you put into providing for your family. Imagine how your loved ones would cope without you. Your children may have to drop out of school, and your spouse may struggle to make ends meet. These are the harsh realities of distracted driving that we often fail to acknowledge. A momentary lapse in concentration could change everything for your family, and the consequences are often far-reaching.\n\nThe message is clear: every second behind the wheel is crucial. Never let a moment of distraction cost you everything. Stay focused, drive safely, and keep the ones you love safe. Your family needs you  dont let a few seconds of distraction jeopardize their future.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Distracted driving has become one of the most significant threats to road safety in recent years. It only takes a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/every-second-matters-behind-the-wheel/\">Continue reading<span class=\"screen-reader-text\"> \"Every Second Matters Behind The Wheel\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mnangagwa Spokesperson Mocks Suffering Zimbabweans",
            "url": "https://www.zimeye.net/2025/04/02/mnangagwa-spokesperson-mocks-suffering-zimbabweans/",
            "content": "By A Correspondent\n\nIn a controversial statement on Tuesday, Zimbabwes government spokesperson, Nick Mangwana, made headlines by mocking the suffering of ordinary Zimbabweans and praising President Emmerson Mnangagwas resilience.\n\nMangwana, who often defends the governments actions, posted a statement on social media that has sparked outrage among critics, especially those suffering under the current economic and political climate.\n\nIn his post on X (formerly Twitter), Mangwana claimed that President Mnangagwa was invincible and took aim at those who had attempted to challenge his leadership.\n\nED HAANA KUCHIPA (ED is unshaken), Mangwana wrote, highlighting several instances where opposition figures or groups had failed to bring about political change.\n\nHe continued, They threatened to upend the constitutional order  EDs still in charge They told you 31 March was the D-Day  they flopped Vakati tichamhanya  tichipo The pseudo-revolution flopped.\n\nMangwanas comments were seen by many as a direct dismissal of the serious challenges facing Zimbabweans today. His apparent celebration of the countrys political situation, which has seen widespread poverty, unemployment, and a deteriorating economy, has sparked outrage, particularly among critics of Mnangagwas administration.\n\nIn a country where inflation has skyrocketed, basic goods are scarce, and many citizens struggle to make ends meet, the tone of Mangwanas message has been deemed insensitive by many Zimbabweans. One social media user responded, While people are suffering every day, Mangwana is mocking them. This is the kind of leadership that has no empathy for its people.\n\nOpposition figures have also seized on Mangwanas comments, accusing the government of turning a blind eye to the suffering of its citizens. How can Mangwana celebrate while our people are living in abject poverty? This is a government that has no connection with the reality of its people, said one political analyst.\n\nWhile Mangwanas remarks were clearly intended to reinforce the governments position, they have instead drawn widespread condemnation for their lack of sensitivity to the harsh economic conditions many Zimbabweans are enduring.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a controversial statement on Tuesday, Zimbabwe’s government spokesperson, Nick Mangwana, made headlines by mocking the suffering … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/mnangagwa-spokesperson-mocks-suffering-zimbabweans/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Spokesperson Mocks Suffering Zimbabweans\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "I Am Not A Turncoat, Chamisa Dismisses Talk Of Betraying Struggle",
            "url": "https://www.zimeye.net/2025/04/02/i-am-not-a-turncoat-chamisa-dismisses-talk-of-betraying-struggle/",
            "content": "By A Correspondent\n\nDynamic opposition leader, Nelson Chamisa, has once again directed his criticism at President Emmerson Mnangagwas government, highlighting what he refers to as a leadership crisis in Zimbabwe. In the face of accusations that he has betrayed the peoples struggle, Chamisa has firmly rejected the claims, emphasizing his unwavering commitment to the cause of change and a brighter future for the nation.\n\nIn a powerful message posted on social media this Wednesday, Chamisa asserted that true leadership is driven by love and dedication to the people, not by emotions or hatred. He wrote, TRUE LEADERS cant be run by hate and emotions! True leaders are run by genuine love, equanimity and authentic loyalty. Have a blessed day!\n\nChamisas statement comes at a time when criticism of his leadership has been mounting. Detractors have accused him of not living up to the high expectations placed upon him by Zimbabweans, especially in terms of leading the opposition effectively. Despite these challenges, Chamisa has remained resolute, reaffirming that his primary focus remains the people and the vision for a transformed Zimbabwe.\n\nChamisa did not shy away from addressing the pressing issues facing the country, particularly the widespread suffering of its citizens under the Mnangagwa administration. He pointed out the worsening economic conditions and the increasing erosion of fundamental freedoms, stressing that these are signs of a government that has failed to serve its people. This government has tormented its citizens for far too long. Its time for change. People deserve better than what they are getting, Chamisa declared.\n\nThe opposition leaders remarks are seen as part of his broader strategy to rally support ahead of the upcoming elections. Chamisa has consistently emphasized the need for leadership change to address the countrys ongoing economic struggles and human rights violations.\n\nHis message has resonated with many Zimbabweans who continue to endure hardship under the current government. Chamisa is speaking the truth. We are suffering every day under this government. We need someone who genuinely cares for the people and not just for their own interests, one concerned citizen remarked.\n\nAs Zimbabwes political tensions continue to rise, Chamisas comments reflect the widening rift within the countrys leadership and the increasing calls for accountability and reform. With the political climate in flux, the next few months will be crucial in determining whether Chamisas calls for change can gain the momentum needed to challenge Mnangagwas rule effectively.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Dynamic opposition leader, Nelson Chamisa, has once again directed his criticism at President Emmerson Mnangagwa’s government, highlighting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/i-am-not-a-turncoat-chamisa-dismisses-talk-of-betraying-struggle/\">Continue reading<span class=\"screen-reader-text\"> \"I Am Not A Turncoat, Chamisa Dismisses Talk Of Betraying Struggle\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mnangagwa Is Invincible, Claims Nick Mangwana",
            "url": "https://www.zimeye.net/2025/04/02/mnangagwa-is-invincible-claims-nick-mangwana/",
            "content": "By A Correspondent\n\nIn a bold and highly controversial statement, government spokesperson, Nick Mangwana, asserted that President Emmerson Mnangagwa is invincible, dismissing the growing calls for leadership change as futile attempts.\n\nMangwanas remarks, made on social media, have provoked strong reactions, particularly from citizens facing economic hardship and political unrest.\n\nMangwana, known for his defence of the ruling partys actions, took to X (formerly Twitter) to mock those who had predicted the downfall of Mnangagwas administration.\n\nED HAANA KUCHIPA (ED is unshaken), Mangwana declared, emphasizing the presidents ability to withstand challenges.\n\nIn his post, Mangwana outlined several instances where opposition efforts to disrupt the political order had failed. They threatened to upend the constitutional order  EDs still in charge \n\nThese comments come at a time when Zimbabweans are grappling with inflation, food shortages, and a floundering economy. Mangwanas statement, which many interpreted as a celebration of the governments unchallenged grip on power, has been criticized for disregarding the struggles of ordinary citizens.\n\nThe governments rhetoric has sharply contrasted with the harsh realities on the ground, where unemployment remains high, poverty deepens, and basic goods are increasingly out of reach for many. One frustrated citizen wrote in response, Nick Mangwana can boast all he wants about EDs strength, but our people are suffering, and no one is paying attention to that.\n\nOpposition figures quickly seized on Mangwanas remarks, accusing the government of being out of touch with the needs of Zimbabweans. This is a government thats completely disconnected from the pain and struggles of its people, said a spokesperson for the opposition. Instead of offering solutions to the crisis, Mangwana mocks the citizens who are desperately fighting for their survival.\n\nThe criticism of Mangwanas statement is part of a wider backlash against a government that many believe is unable or unwilling to address the dire economic conditions facing Zimbabweans. As protests and calls for reform continue to grow, Mangwanas comments seem only to deepen the divide between the ruling government and the citizens it is meant to serve.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold and highly controversial statement, government spokesperson, Nick Mangwana, asserted that President Emmerson Mnangagwa is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/mnangagwa-is-invincible-claims-nick-mangwana/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Is Invincible, Claims Nick Mangwana\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Police, Army Keep Masvingo Under Surveillance Amid Political Unrest",
            "url": "https://www.zimeye.net/2025/04/02/police-army-keep-masvingo-under-surveillance-amid-political-unrest/",
            "content": "By A Correspondent\n\nIn response to escalating political tensions, police and military personnel have increased their presence in the ancient city of Masvingo, a key transit zone connecting several major urban centers in Zimbabwe. Sources within the security forces confirmed on Tuesday that they have been instructed to closely monitor the area due to concerns over potential unrest.\n\nMasvingo is a transit zone, therefore you shall see that police officers and military personnel will remain on the ground monitoring the situation, a police source revealed. We are not taking chances, the source added, highlighting the authorities heightened state of alert.\n\nThe stepped-up security comes after war veteran Blessed Geza called for nationwide demonstrations on Monday, urging President Emmerson Mnangagwa to resign. Geza cited economic mismanagement and the alleged betrayal of ZANU-PFs revolutionary ideals as the primary reasons for his call. Following these remarks, Masvingos central business district (CBD) and surrounding residential areas have seen heavy patrols from both the police and military.\n\nThe increased surveillance is seen as a precautionary measure to prevent any potential disruptions or violent confrontations in the wake of Gezas outspoken stance. With Masvingo being a strategic link between important urban centers, the authorities are taking no chances in ensuring stability during this period of heightened political tension.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In response to escalating political tensions, police and military personnel have increased their presence in the ancient … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/police-army-keep-masvingo-under-surveillance-amid-political-unrest/\">Continue reading<span class=\"screen-reader-text\"> \"Police, Army Keep Masvingo Under Surveillance Amid Political Unrest\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "You Are Heartless, Angry Motorists Slam Mnangagwa",
            "url": "https://www.zimeye.net/2025/04/02/you-are-heartless-angry-motorists-slam-mnangagwa/",
            "content": "By A Correspondent\n\nIn a move that further burdens Zimbabwes already struggling citizens, President Emmerson Mnangagwas government has pushed forward a controversial bill requiring mandatory radio license payments for motor vehicles.\n\nThe Broadcasting Services Amendment Bill, which passed through the Senate without amendments, has sparked intense public outcry.\n\nMotorists are particularly furious about the new requirement, which adds to the list of financial demands on a population already grappling with high costs of living. How can they impose yet another license on us when we can barely afford the basics? one angry motorist exclaimed. This government just keeps finding ways to drain our pockets dry.\n\nDr. Jenfan Muswere, the Minister of Information, Publicity, and Broadcasting Services, defended the bill, stating that it was necessary to improve the quality of broadcasting services and support content creators.\n\nThere has always been mandatory payment of licenses, but now we are amplifying this requirement to improve quality and adequately compensate content creators, he explained.\n\nHowever, the reaction from the public has been one of frustration and confusion. I have two cars, so now Im expected to pay a separate license for each? How is this fair? a driver fumed. Many motorists are questioning the fairness of the new fee structure, especially for those who own multiple vehicles.\n\nIn addition to the radio license issue, Dr. Muswere provided an update on the governments ongoing efforts to digitize the countrys broadcasting services. However, many citizens remain skeptical of the governments promises, questioning whether these initiatives will actually benefit the average Zimbabwean. They keep talking about digitization, but will it really make a difference to us? All we want is to live without being charged for every little thing, said another frustrated motorist.\n\nWith the Broadcasting Services Amendment Bill having already passed both the National Assembly and Senate, it is now poised to be reviewed by the Parliamentary Legal Committee before being sent to President Mnangagwa for final approval. As the bill nears the final stages of becoming law, the public remains deeply divided over its necessity and its potential to worsen their already strained financial situations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that further burdens Zimbabwe’s already struggling citizens, President Emmerson Mnangagwa’s government has pushed forward … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/02/you-are-heartless-angry-motorists-slam-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"You Are Heartless, Angry Motorists Slam Mnangagwa\"</span></a></p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        }
    ]
}