{
    "news": [
        {
            "title": "CAPS United Bury Sugar Boys",
            "url": "https://www.zimeye.net/2025/03/17/caps-united-bury-sugar-boys/",
            "content": "By A Correspondent\n\nCAPS United secured their first victory of the 2025 Castle Lager Premier Soccer League season, defeating Triangle United 2-0 on Sunday. After a sluggish start to the campaign, with a 1-1 draw against Green Fuel and a 2-0 loss to Scotland FC, the Green Machine finally found their rhythm.\n\nJuan Mutudza proved to be the hero, scoring a crucial brace in the first half. He netted the opener in the 15th minute and doubled the lead just 11 minutes later, sealing the win for the visitors.\n\nThe loss further compounded Triangle Uniteds woes, as the Sugar Boys remain winless and pointless after three games. In contrast, CAPS Uniteds triumph injects momentum into their season, and they will look to build upon this result in their upcoming matches.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent CAPS United secured their first victory of the 2025 Castle Lager Premier Soccer League season, defeating Triangle … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/caps-united-bury-sugar-boys/\">Continue reading<span class=\"screen-reader-text\"> \"CAPS United Bury Sugar Boys\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Atletico de Madrid Pay Price For Sitting Back Against Barcelona",
            "url": "https://www.zimeye.net/2025/03/17/atletico-de-madrid-pay-price-for-sitting-back-against-barcelona/",
            "content": "By A Correspondent\n\nIn a thrilling Spanish title race showdown, Barcelona staged a stunning comeback to defeat Atletico Madrid 4-2 on Sunday. The Catalans trailed 2-0 but fought back to claim victory, with Lamine Yamal and Ferran Torres scoring in stoppage time.\n\nBarcelonas win propelled them back to the top of the table, level on 60 points with Real Madrid, who had briefly taken the lead after beating Villarreal on Saturday. Atletico Madrid, meanwhile, trail the top two by four points after a devastating week that saw them eliminated from the Champions League.\n\nThe match saw Atletico take an early lead through Julian Alvarez and Alexander Sorloth, but Barcelona responded with goals from Robert Lewandowski and Torres. The visitors then seized control in stoppage time, with Yamal and Torres sealing the win.\n\nBarcelonas comeback victory extended their unbeaten streak to 18 matches across all competitions, demonstrating their resilience and determination in the pursuit of the Spanish title.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a thrilling Spanish title race showdown, Barcelona staged a stunning comeback to defeat Atletico Madrid 4-2 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/atletico-de-madrid-pay-price-for-sitting-back-against-barcelona/\">Continue reading<span class=\"screen-reader-text\"> \"Atletico de Madrid Pay Price For Sitting Back Against Barcelona\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Speed Kills: The Devastating Impact of Reckless Driving",
            "url": "https://www.zimeye.net/2025/03/17/speed-kills-the-devastating-impact-of-reckless-driving/",
            "content": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in an instant. Each time you choose to drive above the speed limit, you are not only endangering yourself but also putting others at risk. Speeding kills, disables, and causes heartache, leaving behind broken families and shattered lives. Its essential to understand the profound impact of your actions on the road and the ripple effect they can have on others.\n\nOne of the most tragic consequences of speeding is the loss of life. Car accidents are a leading cause of death worldwide, and speed is often a contributing factor. When drivers exceed the speed limit, they decrease their ability to react to sudden changes in road conditions, such as pedestrians crossing, animals running into the road, or other vehicles making unexpected movements. At higher speeds, the impact of a collision is much more severe, increasing the chances of fatalities or life-altering injuries.\n\nThe consequences extend far beyond the driver. A fatal or serious crash caused by speeding can leave children without parents, spouses without partners, and entire families grieving. Imagine the pain and suffering that your loved ones would endure if you were taken from them because of your reckless decision behind the wheel. Your family loves you and wants you to come home safely at the end of each day. They depend on you, and speeding compromises that promise.\n\nMoreover, speeding can lead to long-term disabilities for both drivers and other road users. Survivors of high-speed crashes often face permanent injuries, which can affect their ability to work, care for their families, or live independently. These injuries are not just physical; they can also have a psychological toll, leading to trauma, depression, and a diminished quality of life. The emotional and financial burden of recovery falls not only on the individual but also on their family and community.\n\nRespecting road laws and driving responsibly isnt just about following rules; its about ensuring the safety of everyone on the road. There are countless other drivers, pedestrians, cyclists, and motorcyclists sharing the same roads as you, and their lives are just as important. Your behavior behind the wheel affects them directly. Driving carefully and within speed limits is a basic way of showing respect for the lives and safety of others. By choosing to drive responsibly, youre helping to create a safer, more considerate driving environment for everyone.\n\nWe all have a responsibility to ensure that our actions on the road do not harm others. Every life is precious, and the impact of speeding is far-reaching. It can change your life forever and leave scars on those around you. So, before you accelerate, take a moment to think about the consequences. Your loved ones, the people around you, and even strangers on the road depend on you making the right choice. Drive safely, follow the speed limits, and remember that speeding kills. Its not just a statistic  its a reality we can all prevent.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/speed-kills-the-devastating-impact-of-reckless-driving/\">Continue reading<span class=\"screen-reader-text\"> \"Speed Kills: The Devastating Impact of Reckless Driving\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Alarm As Ziyambi Ziyambi Reveals Mnangagwa Is Keen To Punish Journalist Blessed Mhlanga",
            "url": "https://www.zimeye.net/2025/03/17/alarm-as-ziyambi-ziyambi-reveals-mnangagwa-is-keen-to-punish-journalist-blessed-mhlanga/",
            "content": "By A Correspondent\n\nZiyambi Ziyambi, a member of the ZANU PF Politburo and Minister of Justice, Legal, and Parliamentary Affairs, has sharply criticized journalist Blessed Mhlanga of Heart & Soul Television (HSTV) and Alpha Media Holdings (AMH) for allegedly using social media platforms to incite violence.\n\nAt a Special Provincial Coordinating Committee meeting in Chinhoyi, Ziyambi made it clear that the government would not tolerate such actions, warning that the law would take decisive action against those spreading violent or provocative messages. He stated:\n\nIt is irresponsible for any journalist to foster panic and uncertainty.\n\nHe further emphasized the seriousness of the issue, asserting that:\n\nThe law will act decisively against the broadcasting of incitement and violent messages. This kind of behaviour is not only dangerous but also poses a threat to our nations stability and economic progress.\n\nZiyambi also declared that no nation would accept calls for violent uprisings against its leadership, reinforcing the governments stance against such actions.\n\nMhlanga was arrested on February 24, 2025, after he voluntarily turned himself in to the police. His arrest came after allegations that he had incited public violence through his broadcasts on HSTV, which included interviews with political figures critical of the government. Among those interviewed was Blessed Geza, a war veteran known for his outspoken criticism of President Emmerson Mnangagwa.\n\nMhlanga is facing charges under Section 164 of the Criminal Law (Codification and Reform) Act for allegedly transmitting messages intended to provoke violence or harm property. Although his lawyer sought to challenge the evidence and secure bail, the High Court indefinitely postponed his bail hearing, leaving him in custody at Harare Remand Prison.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Ziyambi Ziyambi, a member of the ZANU PF Politburo and Minister of Justice, Legal, and Parliamentary Affairs, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/alarm-as-ziyambi-ziyambi-reveals-mnangagwa-is-keen-to-punish-journalist-blessed-mhlanga/\">Continue reading<span class=\"screen-reader-text\"> \"Alarm As Ziyambi Ziyambi Reveals Mnangagwa Is Keen To Punish Journalist Blessed Mhlanga\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mnangagwa Son Sidelines Chiwenga Allies, Donates Cement To Masvingo Clinic Construction Project",
            "url": "https://www.zimeye.net/2025/03/17/mnangagwa-son-sidelines-chiwenga-allies-donates-cement-to-masvingo-clinic-construction-project/",
            "content": "By A Correspondent\n\nIn a move that seems to reinforce his familys influence within the political landscape, Major Sean Mnangagwa, the son of President Emmerson Mnangagwa, made a significant contribution to the construction of Zishumbe clinic in Masvingo North Constituency. His donation of 100 bags of cement has raised eyebrows, with political insiders suggesting it may also be a strategic maneuver to assert his fathers authority amid rising political tensions within the ruling Zanu PF party.\n\nSpeaking at the weekend, Masvingo North Constituency Member of Parliament Brian Mudumi expressed gratitude for the donation, which is expected to significantly aid in the completion of the clinic, a vital project for the community.\n\nWe are truly grateful for Major Sean Mnangagwas generous contribution of 100 bags of cement towards the construction of Zishumbe clinic, Mudumi said.\n\nThis donation will undoubtedly play a significant role in the completion of the clinic, which will provide essential healthcare services to the people of Masvingo North.\n\nThe clinic construction, a crucial development for the area, is part of ongoing efforts to improve healthcare infrastructure in rural Zimbabwe.\n\nHowever, the timing of the donation raises questions about underlying political motivations, particularly in light of the increasing rift between factions within Zanu PF.\n\nA source within the ruling party hinted that Major Sean Mnangagwas charitable act could be part of a broader strategy to strengthen his fathers position amid growing political tensions. Its a calculated move meant to portray President Mnangagwa as a man of the people. The whole thing is meant to ease the heightening tension, the source explained, suggesting that the donation was not just an act of goodwill but also a response to internal party rivalries.\n\nWith Zanu PF facing ongoing factional infighting, particularly between allies of President Mnangagwa and Vice President Constantino Chiwenga, the donation could be seen as a subtle way for the Mnangagwa family to assert its dominance, sidelining Chiwengas supporters in the process.\n\nWhile the gesture has been positively received in Masvingo, the political ramifications are more complex, signaling the Mnangagwa familys keen interest in shaping the narrative and maintaining influence within the party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that seems to reinforce his family’s influence within the political landscape, Major Sean Mnangagwa, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/mnangagwa-son-sidelines-chiwenga-allies-donates-cement-to-masvingo-clinic-construction-project/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Son Sidelines Chiwenga Allies, Donates Cement To Masvingo Clinic Construction Project\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Nelson Chamisa Aides On the Run After Being Attacked by State Security Agents Over March 31 Protests",
            "url": "https://www.zimeye.net/2025/03/17/nelson-chamisa-aides-on-the-run-after-being-attacked-by-state-security-agents-over-march-31-protests/",
            "content": "By A Correspondent\n\nTwo opposition activists aligned with Advocate Nelson Chamisa were attacked by State Security agents in Bulawayo on Saturday.\n\nThe activists, Arnold Batirai Dube and Takunda Madzana, are now on the run as they are being pursued by State Security agents in connection with the March 31 protests.\n\nWar veteran Blessed Geza had previously announced that protests against President Emmerson Mnangagwas third-term agenda would take place at the end of the month.\n\nIn an interview with ZimEye.com on Monday, Batirai Dube shared his experience: We are currently on the run. On Saturday, eight State Security agents assaulted me, punching and slapping me while demanding to know the whereabouts of Gift Ostallos Siziba. I told them I had no knowledge of his location.\n\nHe continued, They grabbed my phone and searched it, also punching me in the ribs. I somehow managed to escape. I am afraid to go home because I know they are looking for me.\n\nMadzana also expressed his fear, saying, I am terrified for my life because government agents are searching for me. They are accusing me of organizing the March 31 protests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two opposition activists aligned with Advocate Nelson Chamisa were attacked by State Security agents in Bulawayo on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/nelson-chamisa-aides-on-the-run-after-being-attacked-by-state-security-agents-over-march-31-protests/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Aides On the Run After Being Attacked by State Security Agents Over March 31 Protests\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Blessed Mhlanga Spends 21 Days In Remand Prison",
            "url": "https://www.zimeye.net/2025/03/17/blessed-mhlanga-spends-21-days-in-remand-prison/",
            "content": "Blessed Mhlanga, a senior Zimbabwean journalist accused on transmitting data messages with the intention of inciting violence, has spent more than 20 days in detention, as determination of his freedom bid remains pending at the High Court.\n\nThe 44 year-old Mhlanga, who is represented byChris MhikeofZimbabwe Lawyers for Human Rights, has spent 21 days in both police and prison detention afterZimbabwe Republic Policeofficers arrested him on 24 February 2025 and accused the senior journalist of acting unlawfully when he allegedly recorded a video ofBlessed Runesu Gezaand reportedly made it available to members of the public by transmitting and broadcasting it on YouTube, a social media and online video sharing platform and onHeart and Soul Broadcasting Services (HSTV), adigital content service provider and distributor, with the intention of inciting people to commit undisclosed acts of violence.\n\nOn 7 March 2025, Mhike filed an appeal at the High Court against Harare MagistrateFarai Gwitimasdecision to deny bail to the senior journalist. In the appeal, Mhike argued that Magistrate Gwitima grossly erred and misdirected himselfby denying bail to Mhlanga on 28 February 2025 as there were no compelling reasons to justify his continued incarceration.\n\nOn 10 March 2025, High Court Judge JusticeGibson Mandazabegan hearing Mhlangas bail appeal, whereFungai Nyahunzvi, a law officer intheNational Prosecuting Authority(NPA) made a shocking move of filing an application seeking referral of Mhlangas appeal to the High Courts Anti-Corruption Court (ACC) from the regular Bail Court; andalso sought apostponement of the matter pending the referral of the matter to the ACC.\n\nIn his application, Nyahunzvi argued that Mhlangas matter was placed in an ACC at Harare Magistrates Court and practice therefore dictates that the bail appeal in the High Court should be placed in the ACC Division of the High Court.\n\nHowever, Mhikeobjected and opposed Nyahunzvis applications and argued that there is nothing corruption-related in the charge being faced by Mhlanga.\n\nIn his ruling, Justice Mandaza dismissed Nyahunzvis application and ruledthat the ordinary Bail Court wascompetent to hear Mhlangas bail appeal.\n\nJustice Mandaza then postponedhearing of the bail appeal to12 March 2025 to allow the NPA to file its response to Mhlangas bid for freedom.\n\nOn 12 March 2025, Justice Mandaza postponed hearing of Mhlangas bail appeal to allow himself to make a determinationon the senior journalists request to be furnished with additional information such as the electronic and video evidence, which prosecutors claim incriminate Mhlanga in the commission of the offence of allegedly transmitting data messages inciting violence as defined in section 164 of the Criminal Law (Codification and Reform) Act.\n\nOn 17 March 2025, Justice Mandaza resumed hearing of Mhlangas bail appeal and first ruled that the High Court will not view the relevant video, which constitutes the basis of the states case against Mhlanga, because it is not part of the record of proceedings in the Harare Magistrates Court and indicated that he would be guided only by the content of what transpired in the lower court.\n\nAfterwards, Mhike submitted arguments in support of Mhlangas bail appeal and asked the High Court to set free the senior journalist while Nyahunzvi opposed the appeal and insisted that the media practitioner should remain holed up in prison and stand trial from jail.\n\nJustice Mandaza then reserved his judgment on Mhlangas bail appeal and indicated that he will advise all concerned parties in the matter when his verdict would be ready.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Blessed Mhlanga, a senior Zimbabwean journalist accused on transmitting data messages with the intention of inciting violence, has spent more … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/blessed-mhlanga-spends-21-days-in-remand-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Mhlanga Spends 21 Days In Remand Prison\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Zimbabwe Shall Be A Nation Of Abundance: Nelson Chamisa",
            "url": "https://www.zimeye.net/2025/03/17/zimbabwe-shall-be-a-nation-of-abundance-nelson-chamisa/",
            "content": "By A Correspondent\n\nZimbabwes opposition leader, Advocate Nelson Chamisa, has shared a bold and optimistic vision for the future of the country, declaring that Zimbabwe shall be a nation of abundance. In a passionate statement on Monday, Chamisa outlined a future where Zimbabwe thrives in every sector, from governance to agriculture, education, and tourism.\n\nThe Great Things to Come Zimbabwe shall be a nation of plenty. Zimbabwe shall be taken to another level, the next level of leadership excellence and government integrity, Chamisa proclaimed. His words reflected a deep belief in Zimbabwes potential to achieve phenomenal growth and unprecedented success under the right leadershipleadership that he emphasized must respect and value people through a foundation rooted in the love and fear of God.\n\nChamisas statement painted a picture of Zimbabwe as a nation known for good governance, exemplary fantastic policies, values, rights, and the rule of law. He continued, We will set an example in everything, signaling his commitment to a future where Zimbabwe is a global leader in these areas.\n\nHe went further to outline specific sectors that he believes will flourish under his vision. Chamisa spoke passionately about Zimbabwes infrastructure development, asserting, Zimbabwe shall have first-class infrastructure. We will be in the world class of Europe, Japan, China, and the US in infrastructure standards.\n\nThe opposition leader also highlighted the importance of education, declaring, We shall be renowned for excellence in education. We shall be a global learning center and model world education hub. This vision extended to social welfare, with Chamisa emphasizing the need for a country that takes care of its pensioners, elderly, and war veterans with robust social safety nets, describing Zimbabwe as a nation of politeness and care.\n\nAgriculture was another key focus, with Chamisa forecasting a strong future for Zimbabwe in this sector. \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s opposition leader, Advocate Nelson Chamisa, has shared a bold and optimistic vision for the future of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/zimbabwe-shall-be-a-nation-of-abundance-nelson-chamisa/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Shall Be A Nation Of Abundance: Nelson Chamisa\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Zanu PF Launches Glen View South By-election Campaign Amid Intimidation, Vote Buying",
            "url": "https://www.zimeye.net/2025/03/17/zanu-pf-launches-glen-view-south-by-election-campaign-amid-intimidation-vote-buying/",
            "content": "By A Correspondent\n\nAs the April 12 National Assembly by-election for Glen View South approaches, ZANU PF candidate Tsitsi Tawomhera has come under scrutiny amid reports of vote buying and voter intimidation tactics being employed by the party.\n\nTawomhera, a 37-year-old national executive member of the ZANU PF Youth League, won the primary elections last Sunday to secure the partys nomination for the by-election, following the death of local legislator Grandmore Hakata of the opposition CCC in January.\n\nWhile ZANU PF has struggled to win the constituency in recent years, the party is now making aggressive moves to reclaim the seat, which has been largely controlled by the opposition for two decades.\n\nTawomhera, confident of her chances, declared that she would run a vigorous campaign, claiming that the opposition had failed to serve the people of Glen View South. She stated:\n\nFor a long time, the opposition has been dominant in Glen View South, but they have failed to deliver. The Members of Parliament we have had over the years did not report back to the people; they remained silent while we faced numerous challenges like cholera outbreaks, poor roads, and a lack of development.\n\nHowever, reports from local voters and opposition figures suggest a more troubling side to the ZANU PF campaign. Allegations of vote buying have surfaced, with claims that party supporters are being offered money, food, and promises of development in exchange for votes. Additionally, there are reports of ZANU PF officials intimidating voters, pressuring them to support Tawomhera or face repercussions.\n\nIn one instance, a local resident, speaking anonymously, revealed:\n\nWe are being pressured to attend ZANU PF rallies, and if you dont show up, people start talking about your loyalty to the party. Some are even offering cash to people who say they will vote for them. Its becoming very clear that the election isnt just about ideas, its about who can pay the most and intimidate the hardest.\n\nThe opposition has condemned these tactics, claiming that they undermine the democratic process. As the election date draws closer, the issue of vote buying and voter intimidation looms large over the by-election, raising questions about the integrity of the race and the fairness of the competition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As the April 12 National Assembly by-election for Glen View South approaches, ZANU PF candidate Tsitsi Tawomhera … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/zanu-pf-launches-glen-view-south-by-election-campaign-amid-intimidation-vote-buying/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Launches Glen View South By-election Campaign Amid Intimidation, Vote Buying\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Judge Dismisses Blessed Mhlanga’s Application for Particulars",
            "url": "https://www.zimeye.net/2025/03/17/judge-dismisses-blessed-mhlangas-application-for-particulars/",
            "content": "By A Correspondent | ZimEye | High Court judge Gibson Mandaza has dismissed an application AMH journalist Blessed Mhlanga who was seeking further particulars from the state to argue his bail appeal.\n\nMhlanga is accused on publishing videos containing inciting messages following a press conference with Blessed Geza, a war veteran and Zanu PF member who is demanding the resignation of president Emmerson Mnangagwa.\n\nThrough his lawyer Chris Mhike, Mhlanga asked the state to avail video graphics of the alleged press conference arguing that what was uttered in the videos was different from what was on the request for remand papers.\n\nIn coming up with his ruling Mandaza said his court can only interfere where there is a misdirection by the lower court.\n\nIn my view for the the requested video to played in thus court may be inappropriate and this can be done during trial.\n\nIn appeals of this nature, it is the findings of the court aquo which must be attached, Mandaza said.\n\nHe said the High Court should confine itself with the laws.\n\nAllowing this court to view the videos is tantamount to making this court make a decision which should come out at trial.\n\nI therefore conclude that the application by the defense fails,he said.\n\nBail hearing now on.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | High Court judge Gibson Mandaza has dismissed an application AMH journalist Blessed Mhlanga who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/17/judge-dismisses-blessed-mhlangas-application-for-particulars/\">Continue reading<span class=\"screen-reader-text\"> \"Judge Dismisses Blessed Mhlanga’s Application for Particulars\"</span></a></p>",
            "time": "08:42",
            "date": "18 Mar 2025"
        }
    ]
}