{
    "news": [
        {
            "title": "Top Liberation Stalwart Dies,",
            "url": "https://www.zimeye.net/2025/02/06/top-liberation-stalwart-dies/",
            "content": "By A Correspondent| The High court has set free Timothy Chiminya, a traditional leader, who had spent more than one month in prison after he was arrested and charged for allegedly undermining authority of or insulting President Emmerson Mnangagwa.\n\nChiminya, who was arrested by some Zimbabwe Republic Police officers on 16 December 2024 and charged with undermining authority of or insulting the president as defined in section 33(2)(a)(ii), had languished in prison after he was denied bail on Wednesday 8 January 2025 by Harare Magistrate Sheunesu Matova, who ruled that he is a security threat and did not deserve to be released from prison as he had dethroned some traditional leaders, who were installed by President Mnangagwa and that some subjects of the Chiefs, who were removed, were bound to fight the Chiefs, whom he had installed.\n\nThis compelled Chiminyas lawyer Gift Mtisi of Zimbabwe Lawyers for Human Rights, to file an appeal against Magistrate Matovas decision at Harare High Court on Tuesday 7 January 2025, seeking his release from detention on bail.\n\nOn Friday 31 January 2025, High Court Judge Justice Faith Mushure upheld Chiminyas appeal and set aside Magistrate Matovas decision denying the traditional leader bail.\n\nIn granting bail to Chiminya, Justice Mushure ordered him to pay US$200 or its ZiG equivalent as bail surety and restricted him to a 25 kilometre travel radius from Harare Central Police Station until his matter is finalised.\n\nThe Judge also ordered Chiminya to report twice every week on Mondays and Fridays at Harare Central Police Station until his matter is finalised including surrendering his passport with the Clerk of Court at Harare Magistrates Court.\n\nThe traditional leader was also ordered not to interfere with state witnesses or investigations and to continue residing at his given residential address until his matter gets finalised.\n\nChiminya returns to court on 5 March 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "FORMER Manicaland Provincial Governor and liberation war stalwart, Cde Tinaye Elisha Nzirasha Chigudu (83) has died. Cde Chigudu died at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/top-liberation-stalwart-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Liberation Stalwart Dies,\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "LIVE: Firing Geza, Ziyambi Says ED Never Said He Wants To Rule to 2030 Yet Here’s Video Evidence Including Poisoning VP Chiwenga",
            "url": "https://www.zimeye.net/2025/02/06/live-firing-geza-ziyambi-says-ed-never-said-he-wants-to-rule-to-2030-yet-heres-video-evidence-including-poisoning-vp-chiwenga/",
            "content": "video loading below\n\nFIRING GEZA, ZIYAMBI SAYS ED NEVER SAID HE WANTS TO RULE TO 2030, YET HERES ALL EVIDENCE INCLUDING POISONING VPhttps://t.co/CqxfhiEepZ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "Joy For Zvigananda As Chiwenga Hands Over Power Back To Mnangagwa",
            "url": "https://www.zimeye.net/2025/02/06/joy-for-zvigananda-as-chiwenga-hands-over-power-back-to-mnangagwa/",
            "content": "By Munacho Gwamanda-VicePresidentConstantino Chiwenga officially returned to his position as the countrys second-in-command on Wednesday following the return of President Emmerson Mnangagwa from his month-long leave.\n\nChiwenga had been serving as Acting President for the past 10 days, having taken over from his co-deputy, Kembo Mohadi, who held the role for 19 days.\n\nChiwengas brief tenure as Acting President reignited long-standing tensions within Zanu PF, particularly between himself and Mnangagwas loyalists.\n\nOver the years, the rivalry between the two has deepened, dating back to the 2017 coup that ousted Robert Mugabe.\n\nWhile the military played a pivotal role in installing Mnangagwa as President, Chiwenga, then the Zimbabwe Defence Forces (ZDF) commander, was widely perceived as the real architect of the power shift.\n\nSince then, factional battles within Zanu PF have intensified, with Chiwengas camp angling for succession in2028when Mnangagwais expectedto step down.\n\nDuring his recent stint at the helm, Chiwenga did notshy away from flexinghis political muscle, issuing thinly veiled threats to Mnangagwas inner circle.\n\nAddressing his supporters, he warned Mnangagwas loyalists, whom he derisively referred to asZvigananda(bootlickers), that their time was running out.\n\nHe further suggested that some of them could face jail time when he ascends to the presidency in 2028.\n\nThis bold declaration sent shockwaves through Mnangagwas camp, as itwas perceivedas a direct challenge to the sitting Presidents authority.\n\nDespite the evident friction, Presidential spokesperson George Charamba downplayed any tensions upon Mnangagwas return.\n\nIn his statement, Charamba avoided addressing the political undercurrents, focusinginsteadon economic matters.\n\nThe President is now officially back from his leave, and as you may know, there have been certain economic developments in the past few weeks. Remember, he had to break his leave last week to chair a meeting that focused on economic developments in the country. His major focus will now be on the economy, and some major decisions will be made in that regard, Charamba stated.\n\nMnangagwas return also coincides with his upcoming diplomatic engagements.\n\nHeis setto lead a Southern African Development Community (SADC) delegation to Tanzania later this week for an extraordinary joint meeting with the East African Community (EAC) to discuss the security situation in the Democratic Republic of Congo (DRC).\n\nWhile these international responsibilities take precedence, analysts argue that Mnangagwa will also have toturn his attention tothe growing rift with Chiwenga and the internal power struggles that could shape Zimbabwes political future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Vice President Constantino Chiwenga officially returned to his position as the country’s second-in-command on Wednesday following the return of President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/joy-for-zvigananda-as-chiwenga-hands-over-power-back-to-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Joy For Zvigananda As Chiwenga Hands Over Power Back To Mnangagwa\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "Another ZIMRA Officer Nabbed Over Fraud",
            "url": "https://www.zimeye.net/2025/02/06/another-zimra-officer-nabbed-over-fraud/",
            "content": "By A Correspondent\n\nA Zimbabwe Revenue Authority (ZIMRA) officer stationed at the Victoria Falls border post, Jean Felix Kudaro, has appeared in court on charges of criminal abuse of office. This follows the arrest of two other ZIMRA officers over the weekend, also facing similar allegations.\n\nKudaro, a customs officer at the border post, is accused of unlawfully facilitating the importation of 10 motor vehicles older than 10 years, in contravention of Statutory Instrument 54 of 2024. The alleged offenses took place between January and December 2024.\n\nAccording to the prosecution, Kudaro received both electronic and manual documents from clients and is said to have completed the vehicle valuation process, altering the chassis numbers to deceive his supervisor during the vehicle age verification process. The falsified documents were reportedly submitted for approval, and once approved, Kudaro entered the correct chassis numbers into the ASYCUDA World System.\n\nIt is further alleged that Kudaro manipulated physical valuation sheets and replaced the original documents with accurate details before final processing. Additionally, he allegedly released the vehicles without properly recording them in the release register or ensuring their registration, as required by station standing instructions.\n\nThe scheme was exposed when a vehicle that had not yet physically arrived in Zimbabwe was discovered to have already been registered.\n\nKudaro has been denied bail and is set to return to court on February 17th for the continuation of his trial.\n\nIn related developments, two other ZIMRA officers, Philip Kuvenga and Rangariraishe Zingwe, also facing similar charges, have been denied bail.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zimbabwe Revenue Authority (ZIMRA) officer stationed at the Victoria Falls border post, Jean Felix Kudaro, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/another-zimra-officer-nabbed-over-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Another ZIMRA Officer Nabbed Over Fraud\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "Go Buju Boys Kick Off New Season Preparations",
            "url": "https://www.zimeye.net/2025/02/06/go-buju-boys-kick-off-new-season-preparations/",
            "content": "Sports Correspondent\n\nReigning Premier Soccer League champions, Simba Bhora, have kicked off their 2025 season preparations with a two-week training camp in Polokwane, South Africa.\n\nThe Go Buju Boys are dedicating their time to intense training in a bid to successfully defend their title this season. Under the guidance of head coach Joel Lupahla, the team is also gearing up for their CAF Champions League campaign, which begins in August.\n\nWere not only focused on the Premier Soccer League title defense but are also aiming to make a strong impact in the CAF Champions League. Its going to be a challenging competition, but we believe in our teams strength and are putting in the necessary work to ensure were fully prepared, said Lupahla.\n\nSimba Bhora has been active in the transfer market, strengthening their squad with notable signings, including former Dynamos midfielder Donald Mudadi, dynamic central midfielder Blessed Ndereki from Yadah, and attacking midfielder Barnabas Mutuche, who joins from Manica Diamonds. Additionally, defensive midfielder Trevor Mavhunga, Chicken Inn striker Malvin Hwata, attacking midfielder Emmanuel Ziocha (formerly with Dynamos), and winger Tinotenda Meke have been added to the squad.\n\nDefenders Kelvin Gwao and Liberty Chakoroma, along with seasoned midfielder Never Tigere, will also be part of Simba Bhoras roster this season.\n\nThe teams preseason will culminate in the Castle Challenge Cup, where they will face Chibuku Super Cup winners Dynamos on the 22nd of February.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Reigning Premier Soccer League champions, Simba Bhora, have kicked off their 2025 season preparations with a two-week training … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/go-buju-boys-kick-off-new-season-preparations/\">Continue reading<span class=\"screen-reader-text\"> \"Go Buju Boys Kick Off New Season Preparations\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "Dangers Of Over-reliance On Bookish Economic Theories",
            "url": "https://www.zimeye.net/2025/02/06/dangers-of-over-reliance-on-bookish-economic-theories/",
            "content": "PRESS STATEMENT: THE DANGERS OF OVER-RELIANCE ON BOOKISH ECONOMIC THEORIES AND BRETTON WOODS INSTITUTIONS  A CALL FOR PAN-AFRIKAN ECONOMIC SOVEREIGNTYDate: 4 February 2025\n\nThe recent economic turmoil in Zimbabwe, marked by the closure of five OK Zimbabwe branches and the retrenchment of 347 CBZ Holdings employees, is a clear indication that our economy is bleeding. The continued job losses and business closures are a direct result of economic policies that prioritize the satisfaction of foreign institutions over the real needs of Zimbabweans.\n\nFinance Minister Mthuli Ncubes obsession with the International Monetary Fund (IMF) and World Bank is misguided and detrimental to our economic sovereignty. The Bretton Woods institutions have never been the saviors of Afrika; instead, they have systematically trapped us in a cycle of debt, structural adjustment programs (SAPs), and economic stagnation. Their so-called solutions have never worked for Afrika, and they never will because their interests are not aligned with ours.\n\nA Pan-Afrikan Call for Economic Independence\n\nAfrikas liberation struggle was never just about political independenceit was about total economic emancipation. The same revolutionary spirit that drove the land reform program in Zimbabwe must now be applied to economic governance. Just as we reclaimed our land from settler-colonialists, we must now reclaim our economy from foreign manipulation and neo-colonial control.\n\nFor decades, Afrika has been subjected to economic theories that do not take into account the realities of our societies. We have been told to liberalize markets, privatize state assets, and peg our currencies to foreign benchmarksall while our industries collapse, our youth remain unemployed, and our natural resources are looted by foreign corporations.\n\nIt is time to reject these bookish economic theories that serve the interests of global capital while destroying our local economies. We need to shift towards organic, homegrown economic solutions that empower the people, build strong industries, and create sustainable wealth.\n\nA New Economic Path for Zimbabwe and Afrika\n\nInstead of wasting time in endless IMF meetings, Mthuli Ncube should be meeting with local business leaders, industrialists, trade unions, and economic thinkers who understand Zimbabwes realities. Our solutions must be centered on:\n\nConclusion\n\nWe can no longer afford to be dictated to by institutions whose sole purpose is to maintain the economic subjugation of Afrika. Just as we fought for our land, we must now fight for our economic independence. It is time for Zimbabwe and Afrika to chart their own economic destiny, free from the shackles of neo-colonialism and predatory capitalism.\n\nWe call upon the government of Zimbabwe to prioritize the needs of its people over the demands of the IMF and World Bank. Our economic future lies in our own handsnot in boardrooms in Washington or Brussels. We must think Afrikan, act Afrikan, and build Afrikan solutions for Afrikan challenges.\n\nFor a truly independent Zimbabwe, for a sovereign Afrika!\n\nIssued by:Linda Tsungirirai MasariraPresident  Labour Economists and Afrikan Democrats (LEAD)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "PRESS STATEMENT: THE DANGERS OF OVER-RELIANCE ON BOOKISH ECONOMIC THEORIES AND BRETTON WOODS INSTITUTIONS – A CALL FOR PAN-AFRIKAN ECONOMIC … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/dangers-of-over-reliance-on-bookish-economic-theories/\">Continue reading<span class=\"screen-reader-text\"> \"Dangers Of Over-reliance On Bookish Economic Theories\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "Is Alonso Returning To Los Blancos?",
            "url": "https://www.zimeye.net/2025/02/06/is-alonso-returning-to-los-blancos/",
            "content": "By A Correspondent\n\nReal Madrid is set for significant changes in the summer transfer window. The club is currently competing with Premier League teams to sign Nottingham Forests defender Murillo, as they seek to bolster their defense following injuries.\n\nMeanwhile, Al-Ahli has shown interest in acquiring Vincius Jnior, but Real Madrid has no intention of parting with their star forward.\n\nIn another development, Xabi Alonso is reportedly poised to succeed Carlo Ancelotti as Real Madrids manager in the summer. Alonsos impressive performance at Bayer Leverkusen has caught the attention of Los Blancos.\n\nAs the club prepares for major moves in the summer, their focus remains on securing silverware this season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Real Madrid is set for significant changes in the summer transfer window. The club is currently competing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/is-alonso-returning-to-los-blancos/\">Continue reading<span class=\"screen-reader-text\"> \"Is Alonso Returning To Los Blancos?\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "Mnangagwa Minister Desperately Calls for Geza Arrest",
            "url": "https://www.zimeye.net/2025/02/06/mnangagwa-minister-desperately-calls-for-geza-arrest/",
            "content": "By A Correspondent\n\nZANU PF Politburo member and Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, has announced that the party intends to request Police Commissioner-General Stephen Mutamba to arrest war veteran and Central Committee member, Blessed Runesu Geza, on charges of murder.\n\nSpeaking at a ZANU PF meeting in North Court, Zvimba East Constituency, on February 3, Ziyambi emphasized the need for an investigation into an alleged incident from several years ago, where Geza was accused of being involved in the death of an unnamed individual at his homestead.\n\nZiyambi stated:In the past, he murdered someone at his homestead and the case was not thoroughly investigated.\n\nIf you murder someone, the case does not just disappear, were going to tell Mutamba to investigate.\n\nZiyambis comments come amid growing tensions within the party, with ZANU PFs Mashonaland West Province recommending the expulsion of Geza from the party.\n\nThe expulsion suggestion is based on allegations that Geza has been undermining and threatening President Emmerson Mnangagwa.\n\nGeza, known for his outspoken criticism, has accused President Mnangagwa of violating the constitution, worsening corruption, and betraying the principles of the liberation struggle.\n\nHe has also demanded Mnangagwas immediate resignation, making his position within the party increasingly precarious.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Politburo member and Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, has announced that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/mnangagwa-minister-desperately-calls-for-geza-arrest/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister Desperately Calls for Geza Arrest\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "Masvingo Teenager Arrested For Killing Colleague",
            "url": "https://www.zimeye.net/2025/02/06/police-arrest-form-four-learner-for-stabbing-colleague-to-death-2/",
            "content": "By A Correspondent\n\nA 19-year-old Form Four student has been arrested by Masvingo police in connection with the murder of an 18-year-old colleague.\n\nThe incident occurred at Mazambara High School in Masvingo on February 3, 2025.\n\nAccording to the Zimbabwe Republic Police, the suspect stabbed the victim in the stomach with an okapi knife following an argument.\n\nThe altercation stemmed from the suspects accusation that the victim had assaulted his younger brother.\n\nThe victim was rushed to a local clinic in Zimuto, where he succumbed to his injuries.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 19-year-old Form Four student has been arrested by Masvingo police in connection with the murder of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/police-arrest-form-four-learner-for-stabbing-colleague-to-death-2/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Teenager Arrested For Killing Colleague\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        },
        {
            "title": "ZIMRA Officer Arrested For Criminal Abuse Of Office",
            "url": "https://www.zimeye.net/2025/02/06/zimra-officer-arrested-for-criminal-abuse-of-office/",
            "content": "By A Correspondent\n\nA Zimbabwe Revenue Authority (ZIMRA) officer stationed at the Victoria Falls border post, Jean Felix Kudaro, has appeared in court on charges of criminal abuse of office. This follows the arrest of two other ZIMRA officers over the weekend, also facing similar allegations.\n\nKudaro, a customs officer at the border post, is accused of unlawfully facilitating the importation of 10 motor vehicles older than 10 years, in contravention of Statutory Instrument 54 of 2024. The alleged offenses took place between January and December 2024.\n\nAccording to the prosecution, Kudaro received both electronic and manual documents from clients and is said to have completed the vehicle valuation process, altering the chassis numbers to deceive his supervisor during the vehicle age verification process. The falsified documents were reportedly submitted for approval, and once approved, Kudaro entered the correct chassis numbers into the ASYCUDA World System.\n\nIt is further alleged that Kudaro manipulated physical valuation sheets and replaced the original documents with accurate details before final processing. Additionally, he allegedly released the vehicles without properly recording them in the release register or ensuring their registration, as required by station standing instructions.\n\nThe scheme was exposed when a vehicle that had not yet physically arrived in Zimbabwe was discovered to have already been registered.\n\nKudaro has been denied bail and is set to return to court on February 17th for the continuation of his trial.\n\nIn related developments, two other ZIMRA officers, Philip Kuvenga and Rangariraishe Zingwe, also facing similar charges, have been denied bail.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zimbabwe Revenue Authority (ZIMRA) officer stationed at the Victoria Falls border post, Jean Felix Kudaro, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/zimra-officer-arrested-for-criminal-abuse-of-office/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA Officer Arrested For Criminal Abuse Of Office\"</span></a></p>",
            "time": "20:34",
            "date": "06 Feb 2025"
        }
    ]
}