{
    "news": [
        {
            "title": "Details Emerge in Raila Odinga’s Sudden Death",
            "url": "https://www.zimeye.net/2025/10/15/details-emerge-in-raila-odingas-sudden-death/",
            "content": "By A Correspondent Africa is mourning the passing of one of its most enduring political figures, former Kenyan Prime MinisterRaila Amolo Odinga, who died suddenly during a morning walk in India,The Hindunewspaper has revealed.\n\nOdinga, aged 80, passed away on Wednesday morning at theSreedhareeyam Ayurvedic Eye Hospital and Research Centrein Kerala, India, after reportedly suffering cardiac failure. According toThe Hindu, the veteran politician had been receiving treatment at the facility in Koothattukulam, Ernakulam District, for the past five days. He was accompanied by his daughter,Rosemary Odinga, and his personal doctor.\n\nHospital officials confirmed that Odingas body would be embalmed, with arrangements being coordinated by theKenyan Embassy in New DelhiandIndias Ministry of External Affairsbefore repatriation to Nairobi.\n\nThe connection between the Odinga family and the hospital dates back to 2017, when Rosemary lost her eyesight due to optic nerve damage. She later regained partial vision in 2019 following Ayurvedic therapy at the same hospitalan achievement her father often spoke about with deep gratitude and admiration for the Indian doctors.\n\nA towering figure in Kenyan and African politics, Raila Odingas influence stretched beyond national borders. He served asKenyas Prime Minister from 2008 to 2013in a power-sharing government formed after the disputed 2007 elections. For over three decades, Odinga was at the heart of Kenyas democratic strugglesenduring imprisonment, political exile, and repeated election losses in his relentless pursuit of reform.\n\nWidely regarded asthe face of Kenyas oppositionand a symbol of resilience in African politics, Odingas legacy is rooted in his advocacy for good governance, constitutionalism, and social justice. His death marks the end of an era for a continent still grappling with the ideals he tirelessly championed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Africa is mourning the passing of one of its most enduring political figures, former Kenyan Prime Minister Raila … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/details-emerge-in-raila-odingas-sudden-death/\">Continue reading<span class=\"screen-reader-text\"> \"Details Emerge in Raila Odinga’s Sudden Death\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "2 Die On The Spot After Honda Fit Collision With Haulage Truck",
            "url": "https://www.zimeye.net/2025/10/15/2-die-on-the-spot-after-honda-fit-collision-with-haulage-truck/",
            "content": "Two people died on the spot after a Honda Fit collided head-on with a truck carrying building slats at the Susunje River blackspot along the HarareChirundu Highwayaround 11 PM yesterday.\n\nThe truck was travelling from Kariba to Harare, while the Honda Fit, carrying two occupants, was heading in the opposite direction.\n\nPolice confirmed the fatal crash, with Mashonaland West ZRP spokesperson Inspector Ian Kohwera directing further inquiries to national spokesperson Commissioner Paul Nyathi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Two people died on the spot after a Honda Fit collided head-on with a truck carrying building slats at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/2-die-on-the-spot-after-honda-fit-collision-with-haulage-truck/\">Continue reading<span class=\"screen-reader-text\"> \"2 Die On The Spot After Honda Fit Collision With Haulage Truck\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Court Confirms Mental Instability of “Rebel Cop” Mandizvidza",
            "url": "https://www.zimeye.net/2025/10/15/court-confirms-mental-instability-of-rebel-cop-mandizvidza/",
            "content": "By A Correspondent\n\nAssistant Inspector Simbarashe Mandizvidza, widely known as the Rebel Cop after making headlines in August for ordering all Chinese nationals to leave Zimbabwe and declaring himself the new police chief, has been declared mentally unfit to stand trial.\n\nHarare magistrate Tapiwa Kuhudzai made the ruling following evaluations by two state doctors and a private medical practitioner, all of whom confirmed Mandizvidzas mental instability. He has been committed indefinitely to Chikurubi Psychiatric Unit.\n\nMandizvidza had been facing charges of spreading false information, violating the Road Traffic Act, and attempting to sow division within the police and defence forces.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Assistant Inspector Simbarashe Mandizvidza, widely known as the “Rebel Cop” after making headlines in August for ordering … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/court-confirms-mental-instability-of-rebel-cop-mandizvidza/\">Continue reading<span class=\"screen-reader-text\"> \"Court Confirms Mental Instability of “Rebel Cop” Mandizvidza\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Chamisa Mourns Raila Odinga",
            "url": "https://www.zimeye.net/2025/10/15/chamisa-mourns-raila-odinga/",
            "content": "By A Correspondent  Opposition leader Nelson Chamisa has mourned the passing of former Kenyan Prime Minister Raila Odinga, describing him as an iconic figure in Africas struggle for democracy and freedom.\n\nOdinga, 80, passed away on Wednesday morning at the Sreedhareeyam Ayurvedic Eye Hospital and Research Centre in Kerala, India, after reportedly suffering cardiac failure during a morning walk.\n\nPosting on X (formerly Twitter), Chamisa wrote:\n\nSaddened to receive the tragic news of the passing of Mzee Raila Odinga this early morning. As many will remember, he was one of the iconic figures in the struggle for democracy and freedom in the fight for a better Africa. May his soul rest in peace.\n\nAccording toThe Hindunewspaper, Odinga had been receiving treatment at the hospital in Koothattukulam, Ernakulam District, for the past five days. He was accompanied by his daughter and personal doctor.\n\nHospital officials said Odingas body would be embalmed, with further procedures to be carried out under the guidance of the Kenyan Embassy in New Delhi and Indias Ministry of External Affairs.\n\nOdinga had a personal connection to the hospital, as his daughter, Rosemary Odinga, underwent treatment there after losing her sight in 2017 due to optic nerve damage. In 2019, she regained partial vision following Ayurvedic therapy  an outcome Odinga publicly praised the doctors for.\n\nRaila Odinga served as Kenyas Prime Minister from 2008 to 2013 and was the Member of Parliament for Langata from 1992 to 2013. A veteran of Kenyan politics, he was widely regarded as the face of the countrys opposition and a key advocate for democratic reform across Africa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Opposition leader Nelson Chamisa has mourned the passing of former Kenyan Prime Minister Raila Odinga, describing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/chamisa-mourns-raila-odinga/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Mourns Raila Odinga\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Just In: Raila Odinga Dies",
            "url": "https://www.zimeye.net/2025/10/15/just-in-raila-odinga-dies/",
            "content": "By A Correspondent\n\nRaila Odinga, former Prime Minister of Kenya and longtime opposition leader, has died at the age of 80.\n\nAccording to The Hindu Newspaper, Odinga passed away on Wednesday morning at an Ayurvedic eye hospital in Kerala, India, after suffering cardiac failure during a morning walk.\n\nThe publication reported that Odinga had been under treatment at Sreedhareeyam Ayurvedic Eye Hospital and Research Centre in Koothattukulam, Ernakulam district, for the past five days. He was accompanied by his daughter and personal doctor.\n\nHospital authorities said his body would be embalmed, with further steps to be taken according to instructions from the Ministry of External Affairs and the Kenyan Embassy in New Delhi.\n\nOdinga had a close connection with the hospital, as his daughter Rosemary Odinga had undergone treatment there after losing her sight completely in 2017 due to optic nerve damage. He had expressed gratitude to the physicians at the centre for helping her regain vision after the treatment began in 2019, the report added.\n\nRaila Odinga served as Prime Minister of Kenya from 2008 to 2013. He was the Member of Parliament for Langata constituency from 1992 to 2013 and had long been the Leader of the Opposition in Kenya.\n\nCitizens leader Advocate Nelson Chamisa paid tribute to the late statesman, saying, Saddened to receive the tragic news of the passing of Mzee Raila Odinga this early morning. As many will remember, he was one of the iconic figures in the struggle for democracy and freedom in the fight for a better Africa. May his soul rest in peace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Raila Odinga, former Prime Minister of Kenya and longtime opposition leader, has died at the age of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/just-in-raila-odinga-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Just In: Raila Odinga Dies\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Chiwenga Steals the Spotlight Ahead of Zanu PF Mutare Conference",
            "url": "https://www.zimeye.net/2025/10/15/chiwenga-steals-the-spotlight-ahead-of-zanu-pf-mutare-conference/",
            "content": "By A Correspondent Vice President Constantino Chiwenga has stolen the political spotlight ahead of this weeks Zanu PF Annual Conference in Mutare, after campaign-style flyers emblazoned with the messagePresident for 2028 & Beyond  General Constantino G.D.N. Chiwengaflooded the eastern border city.\n\nThe bold flyers  carrying slogans such asNo to corruption, no to patronage and cronyismenough is enough appear to project Chiwengas presidential ambitions beyond 2028, posing a direct challenge to President Emmerson Mnangagwas continued hold on power.\n\nThey also bear the lineI stand for Zimbabweans, not Zanu PF interests,sending a subtle yet unmistakable message of defiance within the ruling partys ranks.\n\nThe development comes amid reports that a dossier allegedly authored by Chiwenga  criticizing Mnangagwas leadership and accusing him of reneging on key promises  has leaked, sending shockwaves through the ruling elite.\n\nThe timing of the leak, just days before the high-stakes conference in Manicaland Province, has fueled speculation about a looming confrontation between the two former coup allies.\n\nIn an exclusive interview withZimEyeon Tuesday, outspoken former Norton legislator Temba Mliswa sensationally predicted Chiwengas political downfall, warning that the Vice President could emerge as the major casualty of this years gathering.\n\nIf theres anyone to be chased this week, it could be Chiwenga, Mliswa said. ED can fire anyone at the conference. The only safe person there is Mnangagwa. No one can move a motion to remove him because it has to be on the agenda  and this is not an elective congress.\n\nMliswa, a former Zanu PF Mashonaland West Provincial Chairperson known for his insider grasp of party politics, said Mnangagwa remains firmly in control of ZANU PF structures while Chiwengas political base has weakened considerably.\n\nWho controls the chairpersons? The only person safe is Mnangagwa because he can only be removed at congress. The Vice President, including Chiwenga, can be fired by ED even as the conference ends, Mliswa added.\n\nAlthough the conference is officially billed as a policy and strategy meeting, it has been overshadowed by factional tensions, loyalty tests, and fears of an imminent purge targeting those perceived as disloyal to the President.\n\nFor many observers, the circulation of Chiwengas flyers in Mutare signals deepening cracks within Zanu PF  and possibly a prelude to an internal showdown that could reshape Zimbabwes political landscape ahead of the 2030 elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Vice President Constantino Chiwenga has stolen the political spotlight ahead of this week’s Zanu PF Annual Conference … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/chiwenga-steals-the-spotlight-ahead-of-zanu-pf-mutare-conference/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Steals the Spotlight Ahead of Zanu PF Mutare Conference\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Anti-Mnangagwa Flyers Flood Mutare",
            "url": "https://www.zimeye.net/2025/10/15/anti-mnangagwa-flyers-flood-mutare/",
            "content": "By A CorrespondentCampaign-style flyers emblazoned with the messagePresident for 2028 & Beyond  General Constantino G.D.N. Chiwengahave flooded the eastern border city of Mutare ahead of this weeks high-stakes ZANU PF Annual Conference.\n\nThe fliers, boldly declaring No to corruption, no to patronage and cronyismenough is enough, appear to promote Vice President Chiwengas presidential ambitions beyond 2028, directly challenging President Emmerson Mnangagwas grip on power.\n\nThey also feature the sloganI stand for Zimbabweans, not ZANU PF interests,signaling a subtle but pointed message of defiance within the ruling partys ranks.\n\nThe development comes amid revelations that a dossier allegedly authored by Chiwenga, criticizing Mnangagwas leadership and broken promises, has leaked, sending shockwaves through the ruling elite.\n\nThe timing of the leak, just days before the conference in Manicaland Province, has intensified speculation of an imminent showdown between the two former coup allies.\n\nIn an exclusive interview withZimEyeon Tuesday, outspoken former Norton legislator Temba Mliswa sensationally predicted Chiwengas political downfall, warning that the Vice President could emerge as the major casualty of this years conference.\n\nIf theres anyone to be chased this week, it could be Chiwenga, Mliswa declared. ED can fire anyone at the conference. The only safe person there is Mnangagwa. No one can move a motion to remove him because it has to be on the agenda  and this is not an elective congress.\n\nMliswa, a former Zanu PF Mashonaland West Provincial Chairperson known for his inside knowledge of ZANU PF politics, said Mnangagwa remains firmly in control of party structures, while Chiwengas political base has weakened significantly.\n\nWho controls the chairpersons? The only person safe is Mnangagwa because he can only be removed at congress. The Vice President, including Chiwenga, can be fired by ED even as the conference ends, Mliswa added.\n\nThe conference, officially billed as a policy and strategy meeting, has been overshadowed by factional tensions, whispers of loyalty tests, and speculation about a looming purge targeting those perceived as disloyal to Mnangagwa.\n\nFor many observers, the circulation of the Chiwenga fliers in Mutare represents an unmistakable sign of factional agitation and deepening divisions within the ruling party.\n\nAs the conference unfolds, the political drama between Mnangagwa and his deputy could define the next phase of ZANU PFs internal power dynamicsand possibly shape Zimbabwes political landscape leading up to the 2030 elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent—Campaign-style flyers emblazoned with the message “President for 2028 & Beyond – General Constantino G.D.N. Chiwenga” have flooded the eastern … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/anti-mnangagwa-flyers-flood-mutare/\">Continue reading<span class=\"screen-reader-text\"> \"Anti-Mnangagwa Flyers Flood Mutare \"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Zimbabwean Man Found Dead in Johannesburg — Police Appeal for Relatives",
            "url": "https://www.zimeye.net/2025/10/15/zimbabwean-man-found-dead-in-johannesburg-police-appeal-for-relatives/",
            "content": "By Dorrothy Moyo | ZimEye | Cosmo City, Johannesburg  South African Police are appealing for public assistance after the body of a Zimbabwean man, identified as Percy Seke, was discovered deceased along a footpath in Cosmo City, north of Johannesburg, on Saturday, 11 October 2025.\n\nThe late Percy Seke, whose identity was confirmed through a Zimbabwean passport found at the scene, is believed to have died under unexplained circumstances. Graphic images shared on social media show his lifeless body lying face-down, wearing navy blue track pants branded Fabiani and a white T-shirt, with a backpack still strapped on. Visible bloodstains on his clothing suggest possible foul play, though police have not yet confirmed the cause of death.\n\nAuthorities recovered his Zimbabwean passport (PNZMSESEKE<<PERCY), which lists his place of birth as Chegutu, Zimbabwe, and his profession as Teacher. The passport number is GN225712 and was issued in Harare.\n\nPolice are urgently seeking to locate Mr. Sekes relatives or anyone who might have known him. Members of the public with information are encouraged to come forward to assist with identifying next of kin and supporting the investigation.\n\nThe incident has sparked emotional reactions on social media, with the hashtag #PutSouthAfricansFirst and #Zimbabwe trending, as users debated the broader context of Zimbabwean migration and the rising number of foreign nationals found dead in urban centres across South Africa.\n\n CALL FOR HELP:\n\nIf you have any information about Percy Seke or his family, please contact the South African Police Service (SAPS) in Cosmo City or report to the nearest police station immediately.\n\nThis is a developing story. Updates to follow.\n\nDate of Incident: Saturday, 11 October 2025\n\nLocation: Cosmo City, Johannesburg, South Africa\n\nVictim: Percy Seke\n\nNationality: Zimbabwean\n\n Tip-Offs: SAPS Crime Stop  08600 10111\n\n Please share to help locate his family.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | Cosmo City, Johannesburg — South African Police are appealing for public assistance after the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/zimbabwean-man-found-dead-in-johannesburg-police-appeal-for-relatives/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Man Found Dead in Johannesburg — Police Appeal for Relatives\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Mnangagwa Term Extension Resolution Heads for Key Vote on October 17 — Minister Defends Legality",
            "url": "https://www.zimeye.net/2025/10/15/mnangagwa-term-extension-resolution-heads-for-key-vote-on-october-17-minister-defends-legality/",
            "content": "By Farai D Hove | ZimEye | CHINHOYI  The controversial proposal to extend President Emmerson Mnangagwas rule beyond 2028  known as Resolution Number 1  is set to be formally voted on by ZANU PF structures on 17 October, the same day a public demonstration against the plan is being called by activist Blessed Geza.\n\nSpeaking at the Mashonaland West Provincial Co-ordinating Committee (PCC) meeting in Chinhoyi, ZANU PF Secretary for Legal Affairs Ziyambi Ziyambi said the resolution is firmly grounded in the ruling partys internal laws and procedures.\n\nResolution Number 1 conforms to Section 6 of the ZANU PF constitution, which mandates implementation of all conference resolutions, said Ziyambi, adding that the proposal had already passed through the partys grassroots structures, including inter-district meetings, PCCs, and was endorsed at the Annual National Peoples Conference.\n\n 17 October Showdown Looms\n\nZiyambis comments come as tension builds within the ruling party and across the country ahead of 17 October, when:\n\n Internal Divisions Surface\n\nA leaked intelligence memo seen by ZimEye has exposed deep cracks in the ZANU PF politburo, naming senior officials allegedly aligning themselves with Vice President Constantino Chiwenga in opposition to the resolution. The memo calls for a probe led by CIO Minister Lovemore Matuke to investigate those defying party orders.\n\n Ziyambi: Binding on All Members\n\nZiyambi was clear that once resolutions are passed, they are binding on all party members:\n\nThe disagreeable minority must align with the party position, he said.\n\n If Passed, Resolution 1 Will:\n\nAs the 17 October vote approaches, the battle over Zimbabwes leadership future has entered its most explosive phase yet  with both internal resistance and public protests threatening to derail Mnangagwas long-term ambitions.\n\nStay with ZimEye for live coverage of developments leading to the critical October 17 decision.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | CHINHOYI – The controversial proposal to extend President Emmerson Mnangagwa’s rule beyond 2028 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/mnangagwa-term-extension-resolution-heads-for-key-vote-on-october-17-minister-defends-legality/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Term Extension Resolution Heads for Key Vote on October 17 — Minister Defends Legality\"</span></a></p>",
            "time": "09:10",
            "date": "16 Oct 2025"
        },
        {
            "title": "Mliswa Says: It’s Impossible To Unseat Mnangagwa",
            "url": "https://www.zimeye.net/2025/10/15/mliswa-says-its-impossible-to-unseat-mnangagwa/",
            "content": "video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "09:10",
            "date": "16 Oct 2025"
        }
    ]
}