{
    "news": [
        {
            "title": "Fresh Details In Masvingo Chief Who Died At Auxillia Mnangagwa Event",
            "url": "https://www.zimeye.net/2025/04/13/fresh-details-in-masvingo-chief-who-died-at-auxillia-mnangagwa-event/",
            "content": "By Munacho Gwamanda  Fresh details have emerged in the death of Chief Nyajena, born Tungamirai Jerera, who tragically died on Saturday while attending an event hosted by First Lady Auxillia Mnangagwa.\n\nReports said that the chief collapsed while seated on the VIP podium, just behind the First Lady, during her meeting with widows from the local community.\n\nThe event was atRupikeIrrigation Scheme in Ward 23, Masvingo Central Constituency.\n\nRegent Chief Grace Zengeya confirmed the incident, saying the community was shocked by the unexpected death, which occurred in full view of many.\n\nI was seated a bit further from him, and we only realized something was wrong when we saw himbeing carriedto an ambulance, said Zengeya. I was shocked to learn it was him. Hewas rushedto Morgenster Hospital, but sadly,we were later informedthat he had passed away.\n\nWard 23 Councillor Tichaona Machingambi, who was also present, said the Permanent Secretary in the Office of the Minister of State for Provincial Affairs and Devolution, Dr Admore Pazvakavambwa, called for immediate medical assistance after noticing the chief collapse.\n\nI saw him fallandDr. Pazvakavambwa quickly called for help. Medics rushed in and took him to an ambulance, said Machingambi.\n\nEyewitnesses said Jerera was seated close to the First Lady and Member of Parliament Eddison Zvobgo at the time of the incident.\n\nOne source revealed that the chief had arrived at the venue on foot, walking approximately 10 km from his home in Guwa Village.\n\nHe looked healthy and energetic. Some people suspect that his sudden death mightbe connectedto disputes surrounding his chieftaincy appointment, which had faced challenges and delays, the source said.\n\nThe Chief Nyajena throne became vacant following the mysterious death of regent Chief Addmore Zengeya in 2022.\n\nZengeya had served as acting chief since 2018 afterthe death of his father.\n\nSince his passing, no formal regent hadbeen appointed, although his sister, Grace Zengeya, intermittently represented the chieftaincy.\n\nIn the absence ofa permanent chief, local headmen Maregere and Muchibwa handled most traditional affairs.\n\nAdding to the mystery, Madhuviko Manyisethe first headman of the recently established Muchibwa sub-chiefdomalso died under unclear circumstances in a car accident late last year, only a year into his tenure.\n\nMany locals now believe the string of deathsJerera, Addmore Zengeya, and Manyisemaybe linkedto witchcraft, often associated with disputes over the installation of traditional leaders.\n\nThe Muchibwa family, known as the Zigadzi (kingmakers) in the Nyajena and Bota areas of Zaka, recently engaged in a contentious struggle to establish theirownsub-chiefdom under Nyajena.\n\n-TellZim\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda – Fresh details have emerged in the death of Chief Nyajena, born Tungamirai Jerera, who tragically died … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/fresh-details-in-masvingo-chief-who-died-at-auxillia-mnangagwa-event/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh Details In Masvingo Chief Who Died At Auxillia Mnangagwa Event\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "Harare Elite Junior Football Development League U14 Tournament Produces Pulsating Final….",
            "url": "https://www.zimeye.net/2025/04/13/harare-elite-junior-football-development-league-u14-tournament-produces-pulsating-final/",
            "content": "Sports Correspondent\n\nThe Harare Elite Junior Football Development Leagues U14 tournament, which kicked off the 2025 season, came to an electrifying end with Lions Academy emerging victorious.\n\nThe tournament featured 14 top teams, showcasing the best young talent in the city.\n\nIn the highly anticipated finals, Lions Academy edged Power Academy 2-0, claiming the top spot. DZ Academy secured third place after a nail-biting penalty shootout against Boss T Bhora Academy, following a 0-0 draw in the third and fourth place playoff match.\n\nNotable guests, including MP Jimu, Edward Sadomba, Elvis Meleka, and Nesbert Saruchera, attended the event, which saw a significant reduction in age cheating, aligning with the leagues efforts to promote fair play.\n\nThe tournaments top performers were recognized with awards:\n\nThe Harare Elite Junior Football Development League is set to kick off its exciting season next Saturday, providing a platform for young athletes to develop their skills and enjoy the beautiful game.\n\nFor more information, please contact Reuben Dauti, Organizing Secretary, Harare Elite Junior Football Development League.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Harare Elite Junior Football Development League’s U14 tournament, which kicked off the 2025 season, came to an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/harare-elite-junior-football-development-league-u14-tournament-produces-pulsating-final/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Elite Junior Football Development League U14 Tournament Produces Pulsating Final….\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "Aeroplane Now Being Used By Zvigananda Wicknell-Hopewell To Harass Chamisa Was Invented By A Pastor Who Used A Single Bible Verse",
            "url": "https://www.zimeye.net/2025/04/13/aeroplane-now-being-used-by-zvigananda-wicknell-hopewell-to-harass-chamisa-was-invented-by-a-pastor-who-used-a-single-bible-verse/",
            "content": "The worlds first 2 youths who boosted the US economy with their bullet-train obsession were a pastors kids(Wright Brothers), who used the Elijah-Bullet-Chariot Bible verse to define science in 1903 and build earths first ever aircraft, at a time when books said its impossible to travel at 36miles per hour without choking the driver. The US economy has remained undefeated ever since.\n\nWilbur Wright (26) had enrolled for Bible school at the time. His young brother was a teenager.\n\nvideo loading below\n\nThe worlds first 2 youths who boosted the US economy with their bullet-train obsession were a pastors kids(Wright Brothers), who used the Elijah-Bullet-Chariot Bible verse to define science in 1903 and build earths first ever aircraft, at a time when books said its impossiblepic.twitter.com/2Xk2wK1EgZ\n\nThe worlds most powerful leaders, Putin, Trump and so forth, are either Bible or Koran maniacs. UKs first black billionaire and Zimbabwes richest man, Strive Masiyiwa is a Bible fanatic. His company is built around Bible verses.Al Jazeeras explosive GoldMafia documentary was launched by another Bible fanatic Simba Chikanza who used Bible verses to enter meetings and extract secrets that have exposed many wrongdoings to date.  Editorial Comment\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The world’s first 2 youths who boosted the US economy with their bullet-train obsession were a pastor’s kids(Wright Brothers), who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/aeroplane-now-being-used-by-zvigananda-wicknell-hopewell-to-harass-chamisa-was-invented-by-a-pastor-who-used-a-single-bible-verse/\">Continue reading<span class=\"screen-reader-text\"> \"Aeroplane Now Being Used By Zvigananda Wicknell-Hopewell To Harass Chamisa Was Invented By A Pastor Who Used A Single Bible Verse\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "About Distractions On The Road …",
            "url": "https://www.zimeye.net/2025/04/13/about-distractions-on-the-road/",
            "content": "Every time you get behind the wheel, youre making a commitmentnot just to reach your destination, but to protect your life and the lives of others on the road. Driving may feel routine, but it is a complex task that demands full attention. Even a momentary lapse in concentration can result in serious, sometimes fatal, consequences.\n\nToday, distracted driving is one of the leading causes of road accidents worldwide. And while most drivers are aware of the dangers, many still engage in risky behaviors without realizing how devastating the consequences can be.\n\nHere are some of the most common distractions that take your focus off the roadand why avoiding them could save lives:\n\n Never Text While Driving\n\nTexting while driving remains one of the most dangerous distractions. When you take your eyes off the road to send or read a message, even for just five seconds, you could travel the length of a football field without seeing whats in front of you. According to road safety experts, You are 23 times more likely to crash if youre texting while driving. No message is worth a lifekeep your phone out of sight and out of mind until youre safely parked.\n\n Dont Eat Behind the Wheel\n\nMany drivers think grabbing a quick bite during their commute is harmless. But eating while driving can be just as dangerous as texting. Holding food, unwrapping packaging, or dealing with spills forces you to take one or both hands off the wheel and diverts your attention. Taking your hand off the wheel to grab that burger can mean the difference between stopping in time and causing a crash, says a road safety spokesperson.\n\n Dont Let the Stereo Steal Your Focus\n\nMusic is a great way to enhance a drivebut fiddling with the stereo, adjusting volume, skipping tracks, or switching playlists can be distracting. If youre focused on your playlist instead of the traffic around you, youre not fully driving, warn experts. Pre-set your music before hitting the road or use voice-activated controls to keep your hands and eyes where they belong.\n\n Never Apply Makeup While Driving\n\nMultitasking while driving is a mythespecially when it involves something as delicate and time-consuming as applying makeup. Not only does it take your eyes off the road, but it also compromises your reaction time. Grooming behind the wheel is shockingly common, yet incredibly dangerous, say authorities. If youre running late, its better to arrive a few minutes behind schedule than not arrive at all.\n\n Dont Let Passengers Distract You\n\nFrom lively conversations to rowdy kids, passengers can be a major source of distraction. While its natural to talk during a drive, drivers must set boundaries. Its okay to ask passengers to keep it down if youre feeling overwhelmedyour main job is to drive safely, driving instructors advise. When dealing with children or upset passengers, its always safest to pull over before addressing the situation.\n\nThe Bottom Line\n\nDriving is not the time to divide your attention. Each of the above distractionsno matter how trivial they may seemcan be deadly when combined with the speed and unpredictability of the road.\n\nRemember: You cant drive safely unless the task has your full attention. Stay alert, stay focused, and arrive alive.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Every time you get behind the wheel, you’re making a commitment—not just to reach your destination, but to protect your … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/about-distractions-on-the-road/\">Continue reading<span class=\"screen-reader-text\"> \"About Distractions On The Road …\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "ZANU PF Wins Rushinga By-election Amid Intimidation, Harassment Of Voters",
            "url": "https://www.zimeye.net/2025/04/13/zanu-pf-wins-rushinga-by-election-amid-intimidation-harassment-of-voters/",
            "content": "By A Correspondent\n\nZANU PF candidate Trinity Madzinga secured victory in the Rushinga Ward 19 by-election held on Saturday, April 12, 2025, amid allegations of intimidation and harassment of voters.\n\nThe results were officially confirmed by the Ward Election Officer, Gilbert Runzonza, following the completion of the ballot count.\n\nAccording to Runzonza, Madzinga garnered 784 votes, defeating independent candidate Itai Kahwiti, who received just 19 votes. The voter turnout was recorded at 51.5%.\n\nIn an official statement, Runzonza declared:Rushingsa Rural District Council do hereby declare that I have, in accordance with the Electoral Act (Chapter 2:13) and the regulations made thereunder, ascertained the results of the poll for the said ward and that they have been given to:Name of Candidate: Madzinga TrinityVotes Received: 784Party: ZANU PFCandidate: Kahwiti ItaiVotes Received: 19Party: Independent.And that I therefore declare the said MADZINGA TRINITY of ZANU PF party this day, 12 April 2025, to be duly elected Councilor for Ward 19, Rushinga Rural District Council.\n\nHowever, the by-election did not take place without controversy.\n\nLocal watchdogs and residents raised concerns over reports of voter intimidation and harassment allegedly perpetrated by individuals linked to the ruling party.\n\nMultiple sources claimed that community members were threatened with violence or the withdrawal of government aid should they vote for the opposition or independent candidates.\n\nA local villager who spoke on condition of anonymity said, People were afraid. They told us if we voted for the wrong person, our names would be known, and we would be punished.\n\nHuman rights groups have expressed concern over the atmosphere surrounding the vote. One election observer noted that the environment was tense and heavily monitored, creating fear among voters rather than encouraging free democratic participation.\n\nDespite these claims, ZANU PF officials maintained that the election was conducted fairly and lawfully.\n\nA party representative said The people have spoken. Trinity Madzinga is their choice, and the victory reflects confidence in ZANU PFs leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF candidate Trinity Madzinga secured victory in the Rushinga Ward 19 by-election held on Saturday, April … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/zanu-pf-wins-rushinga-by-election-amid-intimidation-harassment-of-voters/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Wins Rushinga By-election Amid Intimidation, Harassment Of Voters\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "Burkina Faso Leader Slams Greedy Politicians, Vows to End Looting",
            "url": "https://www.zimeye.net/2025/04/13/burkina-faso-leader-slams-greedy-politicians-vows-to-end-looting/",
            "content": "By A Correspondent\n\nBurkina Fasos leader, Captain Ibrahim Traor, has delivered a scathing rebuke of corrupt political elites in his country, vowing to put an end to looting and the culture of greed that he says has left millions of citizens in poverty.\n\nSpeaking on Saturday, Traor did not hold back as he criticized the lavish lifestyles of politicians while ordinary citizens suffer.I am not a politician, so I will tell you the truth, he said. Every day we see politicians with multiple cars, they eat and dress well. They eat morning and evening while millions of people out there have no food.\n\nThe youthful leader has positioned himself as a champion of the poor and marginalized.\n\nIn his statement, he painted a stark picture of inequality and neglect across Burkina Fasos rural areas.\n\nGo to the villages and see how women are suffering. We have families that cant afford anything, Traor said. There is a problem if we have people enjoying while others are suffering.\n\nWhile acknowledging some progress under his leadership, Traor admitted that more needs to be done.Yes, we are fixing a lot of things, but it is not enough. We must make sure that in Burkina Faso, everyone is OKAY.\n\nHe also decried the rampant accumulation of wealth by some public figures:In my country, a politician can have 25 cars and 30 houses while we have homeless people in the streets.\n\nTraors fiery remarks have drawn praise from supporters who see him as a rare voice of honesty in African politics, but they are likely to increase tensions with entrenched elites and opposition figures.\n\nObservers say the leaders anti-corruption rhetoric, if backed by real action, could usher in a new era of accountability in Burkina Fasobut warn that translating words into lasting reforms will be the ultimate test of his leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Burkina Faso’s leader, Captain Ibrahim Traoré, has delivered a scathing rebuke of corrupt political elites in his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/burkina-faso-leader-slams-greedy-politicians-vows-to-end-looting/\">Continue reading<span class=\"screen-reader-text\"> \"Burkina Faso Leader Slams Greedy Politicians, Vows to End Looting\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "Shock As Chief Nyajena Dies At Auxillia Mnangagwa Event…",
            "url": "https://www.zimeye.net/2025/04/13/shock-as-chief-nyajena-dies-at-auxillia-mnangagwa-event/",
            "content": "By A Correspondent\n\nA sombre atmosphere gripped Rupike Irrigation Scheme in Masvingo Central last week after Chief Nyajena-elect collapsed and died while attending a programme hosted by First Lady Auxillia Mnangagwa.\n\nAccording to government sources present at the event, the traditional leader, whose installation was pending, suddenly slumped while seated directly behind the First Lady during the proceedings.\n\nThe incident unfolded in full view of attendees and officials, plunging the gathering into chaos and confusion.\n\nGovernment sources described the moment as deeply unsettling.It was weird and shocking, said one official who witnessed the tragedy. He was seated quietly behind the First Lady, and the next thing we saw, he had collapsed. People were stunned.\n\nThe unexpected death has sent shockwaves through the community and reignited memories of another tragic incidentwhen the acting Chief Nyajena mysteriously died in 2022 under unclear circumstances.\n\nAuthorities have not yet released an official cause of death. Meanwhile, community members are calling for clarity and transparency, with some expressing concern over the unexplained deaths within the Nyajena chieftaincy.\n\nAs investigations begin, the nation mourns a respected traditional leader whose life ended under mysterious and heartbreaking circumstances.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A sombre atmosphere gripped Rupike Irrigation Scheme in Masvingo Central last week after Chief Nyajena-elect collapsed and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/shock-as-chief-nyajena-dies-at-auxillia-mnangagwa-event/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Chief Nyajena Dies At Auxillia Mnangagwa Event…\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "Zanu PF Wins Glen View South By-election After Splashing Cash, Freebies",
            "url": "https://www.zimeye.net/2025/04/13/zanu-pf-wins-glen-view-south-by-election-after-splashing-cash-freebiesby-a-correspondent/",
            "content": "By A Correspondent\n\nZanu PFs Tsitsi Tranquility Tawomhera emerged victorious in the Glen View South Constituency by-election held on Saturday, following reports of widespread vote buying and the distribution of freebies in the lead-up to the poll.\n\nAccording to the official results announced by the Zimbabwe Electoral Commission (ZEC), Tawomhera secured 3,404 votes, defeating her closest rival, NCAs Perpetua Mukanda, who garnered 77 votes. Chakeredza Tonderai received 993 votes, George Makwangaidze polled 681, while Tungamirai Madzokere got 234.\n\nThe by-election, however, was marred by irregularities including low voter turnout, incidents of violence, and allegations of inducements aimed at swaying the electorate.\n\nObservers and residents reported that ruling party supporters were seen distributing food items, clothing, and cash in several neighborhoods ahead of voting day. One local resident claimed, They came with mealie meal, sugar, and cooking oil, telling people to vote Zanu PF. Some took the goods but still didnt vote.\n\nAnother voter, who asked not to be named, said, It wasnt an electionit was a market. They were buying votes in broad daylight.\n\nDespite these concerns, Zanu PF officials insisted the election was free and fair, celebrating Tawomheras win as a sign of growing support in urban constituencies.\n\nZEC has not publicly addressed the allegations of vote buying or violence, but civic groups have called for urgent reforms to ensure electoral integrity in future polls.\n\nZanu PF Wins Glen View South By-election After Splashing Cash, FreebiesBy A Correspondent\n\nBy A Correspondent\n\nZanu PFs Tsitsi Tranquility Tawomhera emerged victorious in the Glen View South Constituency by-election held on Saturday, following reports of widespread vote buying and the distribution of freebies in the lead-up to the poll.\n\nAccording to the official results announced by the Zimbabwe Electoral Commission (ZEC), Tawomhera secured 3,404 votes, defeating her closest rival, NCAs Perpetua Mukanda, who garnered 77 votes. Chakeredza Tonderai received 993 votes, George Makwangaidze polled 681, while Tungamirai Madzokere got 234.\n\nThe by-election, however, was marred by irregularities including low voter turnout, incidents of violence, and allegations of inducements aimed at swaying the electorate.\n\nObservers and residents reported that ruling party supporters were seen distributing food items, clothing, and cash in several neighborhoods ahead of voting day. One local resident claimed, They came with mealie meal, sugar, and cooking oil, telling people to vote Zanu PF. Some took the goods but still didnt vote.\n\nAnother voter, who asked not to be named, said, It wasnt an electionit was a market. They were buying votes in broad daylight.\n\nDespite these concerns, Zanu PF officials insisted the election was free and fair, celebrating Tawomheras win as a sign of growing support in urban constituencies.\n\nZEC has not publicly addressed the allegations of vote buying or violence, but civic groups have called for urgent reforms to ensure electoral integrity in future polls.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF’s Tsitsi Tranquility Tawomhera emerged victorious in the Glen View South Constituency by-election held on Saturday, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/zanu-pf-wins-glen-view-south-by-election-after-splashing-cash-freebiesby-a-correspondent/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Wins Glen View South By-election After Splashing Cash, Freebies\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "ED Unleashes Murambatsvina In Rural Areas",
            "url": "https://www.zimeye.net/2025/04/13/ed-unleashes-murambatsvina-in-rural-areas/",
            "content": "By AgricultureReporterThe governmenthas issued a chilling warning to thousands of rural dwellers occupying unsanctioned State land, ordering them toimmediately vacateor face prosecutiondrawing comparisons to the infamousOperation Murambatsvinaof 2005.\n\nIn a statement at theweekend,Lands and Agriculture Minister Dr Anxious Masuka said there had been a surge in illegal occupations of agricultural land across the country.\n\nHe reiterated that only theAgriculture,Minister hasthe legal authority to allocate gazetted land.\n\nOnce again, may I remind the public that, in terms of the Gazetted Lands (Consequential Provisions) Act [Chapter 20:28], it is a crime to occupy rural State land without authority,Masuka warned.All illegal occupiers should immediately vacate such land. Failure to comply may result in prosecution.\n\nThe government has urged the public to report suspected illegal occupiers to nearbyLandsoffices or police stations, even providing a mobile number for tip-offs.\n\nMasuka also called on holders of A2 offer letters or permits to approach Lands offices to expedite the processing of their title deeds, stating thatland is an economic assetcentral to therealisationof thegovernmentsVision 2030 agenda.\n\nThe latest crackdown has revived painful memories ofOperation Murambatsvina(Restore Order), the 2005 state-led campaign that displaced over 700,000 people acrossZimbabwesurbancentres.\n\nThe operation, sanctioned by then-President Robert Mugabe, was presented as a clean-up drive targeting illegal structures and informal businesses.\n\nHowever, human rightsorganisations, including the United Nations, condemned it as politically motivated and brutally executed.\n\nMurambatsvina disproportionately affectedthe urban poor, most of whom were perceived to be opposition supporters. Entire neighbourhoods were razed overnight, with families left homeless and livelihoods destroyed.\n\nThe UN Special Envoy, Anna Tibaijuka, described the operation as adisastrous venturethat violated international human rights standards.\n\nWhile the 2005 campaign primarily targeted urban areas, critics argue that the latest threats of eviction mark an extension of the same authoritarian logicthis time into the countryside.\n\nState-sanctioned evictions have long been a feature ofZimbabwesland governance.\n\nIn the 2000s, theFast-Track Land Reform Programmesaw thousands of white commercial farmers removed from their properties, often violently, to make way for land redistribution to black Zimbabweans.\n\nWhile the programme corrected colonial-era injustices, itwas marredby corruption, political patronage, and chaotic implementation.\n\nMore recently, informal settlers in areas likeCaledonia,Budiriro, andChitungwizahave been forcibly removed, often without proper notice or compensation.\n\nThe government has justified these evictions on grounds of planning violations, but human rights observers note that such actions often align with political agendas, particularly in pre- or post-election periods.\n\nIn rural areas, traditional leaderssome aligned with the ruling partyhave been accused of illegally parceling out State land in exchange for loyalty or financial kickbacks.\n\nThishas led to growing disputes, disorganised settlements, and a breakdown in land-use planning.\n\nWhile the government insists the clampdownis meantto restore order and protect agricultural productivity, critics warn it may be a veiled attempt to consolidate political control in rural areasespecially in the wake of internal Zanu PF power struggles and rising rural discontent over land tenure insecurity.\n\nThe language used is eerily familiar,said a land rights activist who spoke on condition of anonymity.Murambatsvina was about more than buildingsit was about controlling people and punishing dissent. These rural evictions could be about controlling the rural vote.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Agriculture Reporter–The government has issued a chilling warning to thousands of rural dwellers occupying unsanctioned State land, ordering them to “immediately vacate” or … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/ed-unleashes-murambatsvina-in-rural-areas/\">Continue reading<span class=\"screen-reader-text\"> \"ED Unleashes Murambatsvina In Rural Areas\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        },
        {
            "title": "Sanyatwe Finally Booted Out Of Barracks",
            "url": "https://www.zimeye.net/2025/04/13/sanyatwe-finally-booted-out-of-barracks/",
            "content": "By Charakupa Chimwanda-Former Zimbabwe National Army Commander, Lieutenant General (Retired) Anselem Sanyatwe, has officially handed over power to his successor, General Emmanuel Matatu, in a tightly controlled ceremony held midweek at Josiah Magama Tongogara Barracks (formerly KG6).\n\nThe event was presided over by Zimbabwe Defence Forces Commander, General Philip Valerio Sibanda, in a display carefully choreographed to project unity amid mounting internal fissures within the ruling elite.\n\nSanyatwe, a powerful figure in the military establishment and newly appointed Minister of Sports, was abruptly retired by President Emmerson Mnangagwa on the eve of the controversial 31st March protests organized by ex-ZANU PF Central Committee member and war veteran, Blessed Geza.\n\nThe official narrative framed the move as part of a cabinet reshuffle necessitated by the elevation of outgoing Sports Minister Kirsty Coventry to the presidency of the International Olympic Committee (IOC).\n\nHowever, insiders say the timing was far from coincidental.\n\nAccording to senior government sources, Mnangagwas sudden redeployment of Sanyatwe was a strategic effort to disarm potential military dissent linked to Vice President Constantino Chiwenga.\n\nAs tensions escalated ahead of the protests, Mnangagwa flooded the streets with riot police and army unitsnot just to deter public demonstrations but also to send a clear message to elements within the security forces whose loyalties were increasingly in question.\n\nSanyatwe, who once commanded the Presidential Guard and led the deadly post-election crackdown in August 2018 that killed at least six civilians, was viewed as a potential power broker.\n\nHis proximity to Chiwenga, the architect of the 2017 military coup that ushered Mnangagwa into power, made him a liability in a political environment increasingly shaped by fear, suspicion, and betrayal.\n\nThe rift between Mnangagwa and Chiwenga has been simmering ever since the coup that toppled Robert Mugabe.\n\nAlthough the two were once comrades-in-arms, their ambitions have increasingly diverged.\n\nChiwenga, a retired general and Vice President, has long harboured presidential ambitions and still commands significant loyalty within the armed forces.\n\nMnangagwa, on the other hand, has spent the past few years consolidating power by marginalizing military-aligned figures in both government and the party.\n\nSidelining Sanyatwe is part of this broader strategy to undercut Chiwengas influence and isolate him ahead of a possible ZANU PF succession battle.\n\nObservers believe the timing of Sanyatwes removaljust days before planned anti-government protestssuggests Mnangagwa feared more than just street unrest.\n\nHe feared an internal power shift.\n\nGeneral Emmanuel Matatu, the new army chief, is seen as loyal to Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Charakupa Chimwanda-Former Zimbabwe National Army Commander, Lieutenant General (Retired) Anselem Sanyatwe, has officially handed over power to his successor, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/13/sanyatwe-finally-booted-out-of-barracks/\">Continue reading<span class=\"screen-reader-text\"> \"Sanyatwe Finally Booted Out Of Barracks\"</span></a></p>",
            "time": "09:46",
            "date": "14 Apr 2025"
        }
    ]
}