{
    "news": [
        {
            "title": "Fresh Prophecy Predicts Mnangagwa Falling In A Violent Coup",
            "url": "https://www.zimeye.net/2025/02/19/fresh-prophecy-predicts-mnangagwa-falling-in-a-violent-coup/",
            "content": "By Munacho Gwamanda- A prophecies of an impending coup continue to surface,adding fuel tothe growing tensions within ZANU-PF.\n\nA viral video circulating on social media features an unnamed prophet predicting abloody military takeover, warning that the internal power struggles within the ruling party could soon erupt into full-scale violence.\n\nIn the video, the prophet declares:\n\nThe Lord has spoken, and I must pray for Zimbabwe. I saw another coupone that will bring chaos and bloodshed.Thiswill not be like before; this time, there will be much suffering, and many lives will be lost.\n\nI saw the current governmentbeing overthrown, and in its place, violence and turmoil will arise. The Bible commands us to pray for those in authority, andnowmore than ever, Zimbabwe needs our prayers.\n\nThe Lord revealedto methata deal was made, but it did not go well. One side agreed to step down and hand over power, but now, they refuse to let go. Because of this, a coup is brewinga dangerous storm is on the horizon.\n\nWe must stand together in prayer and call upon the hand of God to intervene. Let us lift our voices and declare: In the name of Jesus, we pray for Zimbabwe! May peace reign, and may Gods will be done. Amen!\n\nThis prophecy comes in the wake ofBlessing Geza, a war veteran and senior ZANU-PF Central Committee member, issuing a directthreat against President Emmerson Mnangagwa.\n\nGeza has publicly stated that he will soon revealthe steps war veterans will take to remove Mnangagwa, further escalating tensions within the ruling party.\n\nGeza, known for his close ties to powerful factions within the military, recently gaveMnangagwa an ultimatum to resign, warning that failure to do so would lead to drastic action.\n\nHis statements have added weight to the growing belief that Mnangagwa is losing control over the security forces that helped him seize power in 2017.\n\nAdding to the anxiety,another prominent prophet, Ian Ndlovu, has also issued a chilling prophecy of a coup, cautioning that Zimbabwes deepening power struggle could soon spiral out of control.\n\nWe must continue to pray for our nation Two trains are set to collide. I personally pray for peace for all ordinary Zimbabweans, but change must not be stopped, in whatever form it needs to come,Ndlovu warned in a now-viral video.\n\nReports indicate thata group of high-ranking military officials and war veterans recently held a secret meeting to discuss ways toblock Mnangagwas attempts to extend his rule beyond his current termunder the controversial#ED2030 agenda.\n\nA powerfulmilitary faction loyal to Vice President Constantino Chiwengais said to be behind the plot.\n\nSources close to the discussions reveal that many within the security forces and war veteran community believeMnangagwa has betrayed the 2017 coup pact, which allegedly included an agreementfor himtoserve only one term before handing over power to Chiwenga.\n\nAsecret meeting reportedlytook placein Mashonaland Central, a province historically known as a hub for political coups. The province has long been a stronghold for anti-Mnangagwa elements withinZANU-PF and the military, particularly those loyal to Chiwenga.\n\nA source close to the faction stated:\n\nYou hear what credible war veterans like Blessing Geza are saying. He is not hallucinating; he is communicating a message from the script, and you must listen to him carefully.\n\nThisis not the first time that power struggles within Zimbabwes ruling elite have led topolitical upheaval and bloodshed.\n\nThe lateAir Force Commander Perrence Shiriwho played a crucial role inthe 2017 coup against Robert Mugabewas known for holdingsecret meetingswith allies such asParadzai Zimondi and Bindura South MPRemigiousMatangiraat theBindura Arcadia Dam.\n\nBothShiri and Zimondi died under mysterious circumstancesduring theCOVID-19 pandemic, with speculation suggesting thatMnangagwa may have orchestrated their deathsto weaken potential challengers.\n\nDespite Mnangagwaspurge of senior military officers linked to Chiwenga, tensionscontinue to simmer within the security forces, with many stillloyal to Chiwengaand deeplyresentful of Mnangagwas growing authoritarianism.\n\nUnlike in 2017, Mnangagwa hasstrengthened his grip over Zimbabwes intelligence agenciesand placedloyalists in key military positions. However, history has shown that Zimbabwespolitical landscape is unpredictable, andeven a heavily fortified president can be overthrownif military discontent reaches a breaking point.\n\nThe rift betweenMnangagwa and Chiwenga has widenedover the years, with the Vice President increasinglysidelined from key government and party structures.\n\n.pic.twitter.com/Oh5tlc73sg\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- A prophecies of an impending coup continue to surface, adding fuel to the growing tensions within ZANU-PF.  A viral … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/fresh-prophecy-predicts-mnangagwa-falling-in-a-violent-coup/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh Prophecy Predicts Mnangagwa Falling In A Violent Coup\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "ZIMSEC Announces Exam Registration Deadline",
            "url": "https://www.zimeye.net/2025/02/19/zimsec-announces-exam-registration-deadline/",
            "content": "ByMinachoGwamanda-TheZimbabwe School Examinations Council (ZIMSEC) has announced that the deadline for registering for the June and November 2025 examinations will beMarch 10andMarch 24, respectively.\n\nTheexaminationbody has urged candidates to complete the process at their nearest school or examination centre before thedeadlines lapse.\n\nIn a statement, ZIMSEC confirmed that examination fees havebeen peggedin US dollars, with aGovernment subsidy availablefor candidates inpublic schools, local authority schools, and non-profit mission schools.\n\nHowever,private candidates, students attending private schools, and those retaking subjects will be required to pay the full amount.\n\nUnder the new fee structure,O Level candidateswill payUS$24 per subject, with theGovernment subsidising US$13, leaving eligible students to coverUS$11 per subject.\n\nA Level candidateswillbe requiredto payUS$48 per subject, with aGovernment subsidy of US$26, reducing the amount toUS$22 for qualifying students.\n\nPayments can be made inUS dollars, South African Rand, or Zimbabwe Gold (ZiG)at the prevailing interbank rate as ofMarch 10, 2024, for theJune sessionandMarch 24, 2024, for theNovember session.\n\nZIMSEC also clarified that theGovernment will subsidise up to seven subjectsfor O Level candidates andfour subjects, including Communication Skills, for A Level candidates.\n\nHowever, the subsidywill not apply to candidates retaking subjects, and students on theBasic Education Assistance Module (BEAM) will not receive financial aid for repeat exams.\n\nThe registration announcement comes against a backdrop ofmounting concerns over the effectiveness of the new education curriculumintroducedin recent years, which hasbeen linkedto a sharpdecline in national pass rates.\n\nTheCompetency-Based Curriculum (CBC), introduced in2017, sought to modernise the education system by integratingpractical learning, continuous assessment, and digital literacy.\n\nHowever, manyteachers, students, and parentshave raised concerns over itsimplementation challenges, lack of resources, and increased workload.\n\nZIMSECs most recent results revealed aworrying trend of declining performance, with the2023 O Level passratedroppingto27.57%, down from28.96% in 2022.\n\nSimilarly, A Level results showeda dip in performance, with many candidates struggling in science and mathematics subjects.\n\nEducation experts have attributed the poor performance toseveral factors, including:\n\nAs the exam registration deadline nears,students, parents, and education stakeholdersare urging the Government and ZIMSEC tore-evaluate the curriculums impactand address the factors contributing to declining pass rates.\n\nMeanwhile, parents and guardians have been advised to check with their respective schools or examination centres for specific registration details.\n\nStakeholders are encouraged to contact their respective centres for registration closing dates to avoid any inconvenience,ZIMSEC stated.\n\nWith the exam season approaching, students are encouraged toregister early and take advantage of the Government subsidies.\n\nFor further details,candidates have been urged to visit theirnearest school, examination centre, or the official ZIMSEC website.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Minacho Gwamanda-The Zimbabwe School Examinations Council (ZIMSEC) has announced that the deadline for registering for the June and November 2025 examinations will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/zimsec-announces-exam-registration-deadline/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMSEC Announces Exam Registration Deadline \"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "Mnangagwa Regime Uses Goats To Manipulate Villagers",
            "url": "https://www.zimeye.net/2025/02/19/mnangagwa-regime-uses-goats-to-manipulate-villagers/",
            "content": "By A Correspondent\n\nThe Zanu PF government has once again showcased its political maneuvering through the introduction of the Goats4ED initiative, a scheme presented under the guise of rural empowerment in the Midlands Province. This move is being heralded as a way to uplift livelihoods while conveniently aligning with the political agenda of President Mnangagwa and his party ahead of key political milestones.\n\nThe programme, formally launched this Monday at Vungwi Primary School in Shurugwi district, saw 100 goats distributed among 300 women from eight districts, who were handpicked to benefit from the Young Women 4ED goat pass-on scheme. The event was presented as an example of the governments commitment to empowering rural communities, but many observers see it as a strategic attempt to bolster Zanu PFs image and secure political loyalty.\n\nOne beneficiary praised the initiative, saying, These goats will play a crucial role in changing livelihoods, especially here in remote areas, and we want to thank the government for this initiative. Another added, As young women, we are excited and hopeful for a better future from this gesture. This will surely empower us economically. However, critics argue that such schemes are part of a broader political strategy to rally support for the ruling party under the banner of economic empowerment, while failing to address the structural issues that perpetuate poverty in rural areas.\n\nThe Young Women 4ED group, led by National Chairperson Honourable Tatenda Mavetera, was quick to endorse the programme, urging women to take full advantage of such government initiatives. Maveteras rhetoric, however, seemed to focus more on political alignment than genuine empowerment. She stated, I want to take this opportunity to urge and implore ladies to take advantage of these government programmes. I believe this programme will leave you empowered economically.\n\nGovernment officials were eager to tie the scheme to broader development goals, with Midlands Minister of State for Provincial Affairs and Devolution Honourable Owen Ncube touting it as a vital step toward achieving an upper-middle-income society by 2030. We are happy with programmes that are being spearheaded by Young Women 4ED because they complement the governments vision, he declared. Yet, such statements are widely seen as political posturing, aimed at securing both financial and electoral support from rural constituencies.\n\nIn reality, the goat pass-on scheme is designed to boost the economic participation of small-scale women farmersyet, its rollout coincides with a critical period in the lead-up to elections. While the stated objective is to empower women, many are left wondering if the true intent is to garner political advantage under the guise of rural development. The schemes ability to mitigate climate change and improve livelihoods, as suggested by government officials, remains to be seen, particularly in light of the ongoing economic challenges facing Zimbabwes rural communities.\n\nCritics remain skeptical about the programs long-term impact on rural development, questioning whether it is merely another political gimmick designed to maintain the ruling partys hold over the electorate in an election year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zanu PF government has once again showcased its political maneuvering through the introduction of the “Goats4ED” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/mnangagwa-regime-uses-goats-to-manipulate-villagers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Uses Goats To Manipulate Villagers\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "Man Nabbed Over Gruesome Murder",
            "url": "https://www.zimeye.net/2025/02/19/man-nabbed-over-gruesome-murder/",
            "content": "By A Correspondent\n\nA shocking turn of events led to the tragic death of a 22-year-old man at a local tavern in Philippolis, outside Bloemfontein in the Free State. The incident occurred on February 15, 2025, at approximately 01:30, during a heated game of pool.\n\nA dispute erupted between two men over a mere R5 coin, escalating into violence. The 22-year-old suspect allegedly broke a bottle and stabbed the victim in the neck. The wounded man stumbled out of the tavern, only to be found lying lifeless on the pavement.\n\nPolice were swiftly summoned to the scene, and with the help of the community, they managed to apprehend the suspect. The 22-year-old is now facing a murder charge and is expected to appear before the Philippolis Magistrates Court.\n\nThis senseless tragedy highlights the devastating consequences of unchecked anger and aggression .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking turn of events led to the tragic death of a 22-year-old man at a local … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/man-nabbed-over-gruesome-murder/\">Continue reading<span class=\"screen-reader-text\"> \"Man Nabbed Over Gruesome Murder\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "Pressure Group Exposes Mnangagwa’s  Insincerity About Stepping Down",
            "url": "https://www.zimeye.net/2025/02/19/pressure-group-exposes-mnangagwas-insincerity-about-stepping-down/",
            "content": "By A Correspondent\n\nPressure group ActZim has expressed its dissatisfaction with President Emmerson Mnangagwas media briefing held on Monday.\n\nThe President addressed editors at State House, where he claimed that he would respect the constitution.\n\nMnangagwa also claimed he would step down at the end of his term of office.\n\nBelow is ActZims official response to Mnangagwas briefing:\n\n ActZims Statement on Mnangagwas Press Briefing Regarding Term Extension\n\nOn February 6, ActZim issued a 40-day ultimatum for President Mnangagwa to address the nation, warning that failure to do so would result in a public revolt. Following the Presidents recent media briefing on this issue, ActZim wishes to voice its concerns:\n\nActZims response highlights growing frustrations with Mnangagwas handling of the 2030 issue.\n\nJoin ActZim WhatsApp via the link;https://chat.whatsapp.com/LwVs69pfNWg1DG0CiqD9Sh\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Pressure group ActZim has expressed its dissatisfaction with President Emmerson Mnangagwa’s media briefing held on Monday. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/pressure-group-exposes-mnangagwas-insincerity-about-stepping-down/\">Continue reading<span class=\"screen-reader-text\"> \"Pressure Group Exposes Mnangagwa’s  Insincerity About Stepping Down\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "Tricky Nedbank Cup Tie For Kaizer Chiefs",
            "url": "https://www.zimeye.net/2025/02/19/tricky-nedbank-cup-tie-for-kaizer-chiefs/",
            "content": "Sports Correspondent\n\nThe Nedbank Cup quarterfinal draw has been completed, setting the stage for exciting matchups in the South African Premier Soccer League. Several Zimbabwean players will be in action, including Washington Arubi, Daniel Msendami, and Junior Zindoga of Marumo Gallants.\n\nSuperSport Uniteds Zimbabwean duo, Terrence Dzvukamanja and Nokutenda Mangezi, will also be looking to make an impact. Meanwhile, Divine Lunga will represent Mamelodi Sundowns.\n\nThe Premier Soccer League will announce the dates and venues for the quarterfinal fixtures in due course.\n\nHere is the Nedbank Cup Quarter-Finals draw:\n\n Durban City FC v Marumo Gallants\n\n Mamelodi Sundowns v Royal AM/Milford FC/Sekhukhune United\n\n SuperSport United v Orlando Pirates\n\n Stellenbosch FC v Kaizer Chiefs\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Nedbank Cup quarterfinal draw has been completed, setting the stage for exciting matchups in the South African … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/tricky-nedbank-cup-tie-for-kaizer-chiefs/\">Continue reading<span class=\"screen-reader-text\"> \"Tricky Nedbank Cup Tie For Kaizer Chiefs\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "Mnangagwa Admits Chivayo Money Not Clean",
            "url": "https://www.zimeye.net/2025/02/19/mnangagwa-admits-chivayo-money-not-clean/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has publicly distanced himself from controversial businessman Wicknell Chivayo, denying any involvement in his financial dealings or lavish lifestyle.\n\nDuring a media briefing at State House in Harare on Monday, Mnangagwa addressed questions about his connection to Chivayo, whose business practices have sparked widespread scrutiny.\n\nIm not aware of any financial ties between myself and Mr. Chivayo, Mnangagwa stated. Its essential to investigate the source of his wealth, rather than speculating about our relationship.\n\nWhen asked about Chivayos high-profile donations, including vehicles given to individuals and celebrities, Mnangagwa reiterated his distance from the businessmans actions.\n\nLets focus on uncovering the truth behind his wealth, rather than making assumptions.\n\nMnangagwa also hinted at the possibility of illicit activities surrounding Chivayos wealth. Its possible that his wealth may have been acquired through questionable means, but thats for the authorities to investigate.\n\nThe Presidents comments come amid ongoing controversy surrounding Chivayo, who faces allegations of corruption and financial mismanagement.\n\nMnangagwas public disavowal marks a clear attempt to distance himself from the businessman, whose actions have become a source of political embarrassment for the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has publicly distanced himself from controversial businessman Wicknell Chivayo, denying any involvement in his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/mnangagwa-admits-chivayo-money-not-clean/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Admits Chivayo Money Not Clean\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "Pressure Group Dismisses Mnangagwa’s Media Briefing",
            "url": "https://www.zimeye.net/2025/02/19/pressure-group-dismisses-mnangagwas-media-briefing/",
            "content": "By A Correspondent\n\nPressure group ActZim has expressed its dissatisfaction with President Emmerson Mnangagwas media briefing held on Monday.\n\nThe President addressed editors at State House, where he claimed that he would respect the constitution.\n\nMnangagwa also claimed he would step down at the end of his term of office.\n\nBelow is ActZims official response to Mnangagwas briefing:\n\n ActZims Statement on Mnangagwas Press Briefing Regarding Term Extension\n\nOn February 6, ActZim issued a 40-day ultimatum for President Mnangagwa to address the nation, warning that failure to do so would result in a public revolt. Following the Presidents recent media briefing on this issue, ActZim wishes to voice its concerns:\n\nActZims response highlights growing frustrations with Mnangagwas handling of the 2030 issue.\n\nJoin ActZim WhatsApp via the link;https://chat.whatsapp.com/LwVs69pfNWg1DG0CiqD9Sh\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Pressure group ActZim has expressed its dissatisfaction with President Emmerson Mnangagwa’s media briefing held on Monday. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/pressure-group-dismisses-mnangagwas-media-briefing/\">Continue reading<span class=\"screen-reader-text\"> \"Pressure Group Dismisses Mnangagwa’s Media Briefing\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "WATCH LIVE: Blessed Geza Program",
            "url": "https://www.zimeye.net/2025/02/19/watch-live-blessed-geza-program/",
            "content": "Cde Blessed Geza special message now being delivered by Cde Mabhunu and@JenaguruVhttps://t.co/fVkoN7fZ3E\n\nWhat Clive Malunga did for Zimbabaw through his@JenaguruVconcerts is more than what@ZANUPF_Officialhas done for the country, says .https://t.co/fVkoN7fZ3E\n\nI told Simon Chimbetu and even his son,@suluchimbetu, and Andy Brownto avoid ZANU PF. Andy Brown killed his talent by aligning self with ZANU PF, says@JenaguruVhttps://t.co/fVkoN7fZ3E\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:39",
            "date": "19 Feb 2025"
        },
        {
            "title": "Mnangagwa Introduces Goats4ED",
            "url": "https://www.zimeye.net/2025/02/19/mnangagwa-introduces-goats4ed/",
            "content": "By A Correspondent\n\nThe Zanu PF government has once again showcased its political maneuvering through the introduction of the Goats4ED initiative, a scheme presented under the guise of rural empowerment in the Midlands Province. This move is being heralded as a way to uplift livelihoods while conveniently aligning with the political agenda of President Mnangagwa and his party ahead of key political milestones.\n\nThe programme, formally launched this Monday at Vungwi Primary School in Shurugwi district, saw 100 goats distributed among 300 women from eight districts, who were handpicked to benefit from the Young Women 4ED goat pass-on scheme. The event was presented as an example of the governments commitment to empowering rural communities, but many observers see it as a strategic attempt to bolster Zanu PFs image and secure political loyalty.\n\nOne beneficiary praised the initiative, saying, These goats will play a crucial role in changing livelihoods, especially here in remote areas, and we want to thank the government for this initiative. Another added, As young women, we are excited and hopeful for a better future from this gesture. This will surely empower us economically. However, critics argue that such schemes are part of a broader political strategy to rally support for the ruling party under the banner of economic empowerment, while failing to address the structural issues that perpetuate poverty in rural areas.\n\nThe Young Women 4ED group, led by National Chairperson Honourable Tatenda Mavetera, was quick to endorse the programme, urging women to take full advantage of such government initiatives. Maveteras rhetoric, however, seemed to focus more on political alignment than genuine empowerment. She stated, I want to take this opportunity to urge and implore ladies to take advantage of these government programmes. I believe this programme will leave you empowered economically.\n\nGovernment officials were eager to tie the scheme to broader development goals, with Midlands Minister of State for Provincial Affairs and Devolution Honourable Owen Ncube touting it as a vital step toward achieving an upper-middle-income society by 2030. We are happy with programmes that are being spearheaded by Young Women 4ED because they complement the governments vision, he declared. Yet, such statements are widely seen as political posturing, aimed at securing both financial and electoral support from rural constituencies.\n\nIn reality, the goat pass-on scheme is designed to boost the economic participation of small-scale women farmersyet, its rollout coincides with a critical period in the lead-up to elections. While the stated objective is to empower women, many are left wondering if the true intent is to garner political advantage under the guise of rural development. The schemes ability to mitigate climate change and improve livelihoods, as suggested by government officials, remains to be seen, particularly in light of the ongoing economic challenges facing Zimbabwes rural communities.\n\nCritics remain skeptical about the programs long-term impact on rural development, questioning whether it is merely another political gimmick designed to maintain the ruling partys hold over the electorate in an election year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zanu PF government has once again showcased its political maneuvering through the introduction of the “Goats4ED” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/19/mnangagwa-introduces-goats4ed/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Introduces Goats4ED\"</span></a></p>",
            "time": "20:39",
            "date": "19 Feb 2025"
        }
    ]
}