{
    "news": [
        {
            "title": "Cde Mabhunu On Sunday: Be Ready",
            "url": "https://www.zimeye.net/2025/02/23/cde-mabhunu-on-sunday/",
            "content": "video loading below\n\nCDE MABHUNU EARLY SUNDAY MORNINGhttps://t.co/i4iSRNPzWV\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "Mnangagwa Praises Self For Empowering Young People",
            "url": "https://www.zimeye.net/2025/02/23/mnangagwa-praises-self-for-empowering-young-people/",
            "content": "In a nation teetering on the brink of collapse, President Emmerson Mnangagwas latest public statements about his administrations supposed achievements ring hollow, masking the grim reality of a country grappling with widespread corruption, human rights violations, and the ongoing looting of national resources.\n\nAs the Zimbabwean government continues to project a false narrative of prosperity and empowerment, the lives of ordinary citizens are steeped in suffering, insecurity, and disillusionment.\n\nOn the occasion of the 2025 National Youth Day celebrations, Mnangagwa once again touted his administrations commitment to empowering Zimbabwes youth, positioning them in key decision-making roles. However, beneath this surface-level rhetoric lies a more troubling reality. Under Mnangagwas leadership, the political climate has become increasingly authoritarian, with dissent crushed through state-sanctioned violence and intimidation. The presidents claims of promoting young leaders in key government positions are overshadowed by a brutal crackdown on peaceful protesters, journalists, and opposition members who dare to speak out.\n\nWhile Mnangagwa continues to emphasize the importance of youth participation in national governance, he conveniently ignores the fact that many of these same young people are being subjected to violent repression at the hands of government forces. Reports of unlawful detentions, torture, and extrajudicial killings have become all too common, as the regime seeks to stifle any opposition to its increasingly tyrannical rule.\n\nMoreover, the so-called Second Republic is also infamous for its failure to address the rampant corruption that has infected every level of government. Far from empowering the youth, Mnangagwas administration has allowed a culture of impunity to flourish, with high-ranking officials and their cronies looting state resources with abandon. Whether its through the illegal exploitation of the countrys vast mineral wealth or siphoning off international aid meant to alleviate poverty, the looting continues unchecked, enriching the elites while the majority of Zimbabweans languish in poverty.\n\nThe presidents hollow promises to create a digital skills development programme in partnership with the United Arab Emirates do little to address the systemic issues of governance and corruption. While it is true that youth empowerment is essential, Mnangagwas words ring empty in a nation where the very institutions that should support development are being pillaged by those in power. The idea that this programme will somehow transform Zimbabwes young people into a new generation of skilled professionals seems more like a well-crafted distraction from the real issues at hand: human rights abuses, an economy in freefall, and a growing disillusionment among citizens.\n\nMnangagwas address also touched on the fight against drug and substance abuse, but once again, his focus on flushing out drug lords misses the larger picture of a government that has systematically destroyed its own institutions. While drug abuse is a significant issue, it is deeply connected to the countrys economic crisis, lack of opportunity, and the broader social malaise created by a corrupt and negligent government. The presidents failure to address the root causes of these issues  such as the erosion of trust in government and the systematic dismantling of public services  shows his detachment from the struggles faced by everyday Zimbabweans.\n\nUltimately, the National Youth Day celebrations, with their superficial focus on youth empowerment and development, serve only as a smokescreen for the deeper political crisis plaguing Zimbabwe. The youth may be used as pawns in Mnangagwas political game, but they are not truly being empowered. Instead, they are being betrayed by a government that continues to violate their human rights, endorse rampant corruption, and destroy the very future it claims to build. Zimbabwe needs more than empty promises and hollow rhetoric; it needs real change, accountability, and a restoration of its dignity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a nation teetering on the brink of collapse, President Emmerson Mnangagwa’s latest public statements about his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/mnangagwa-praises-self-for-empowering-young-people/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Praises Self For Empowering Young People\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "NYONI APPOINTED TO ZIFA YOUTH DEVELOPMENT COMMITTEE",
            "url": "https://www.zimeye.net/2025/02/23/nyoni-appointed-to-zifa-youth-development-committee/",
            "content": "Sports Correspondent\n\nBN Soccer Academy is celebrating a major milestone after its Director, Mr. Bekhimpilo Nyoni, was appointed to the Zimbabwe Football Association (ZIFA) Youth Development Committee.\n\nThe academy took to social media on Friday to congratulate Nyoni on his new role, expressing optimism that his vast knowledge and experience will greatly benefit the development of football in the country.\n\nWe are hopeful that his broad knowledge will help our football development, the academy said.\n\nNyonis appointment is a significant recognition of his contributions to the development of young football talent in Zimbabwe. As a member of the ZIFA Youth Development Committee, he will play a crucial role in shaping the future of Zimbabwean football.\n\nBN Soccer Academy and its stakeholders are eager to see the positive impact that Nyonis expertise will bring to the sport.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent BN Soccer Academy is celebrating a major milestone after its Director, Mr. Bekhimpilo Nyoni, was appointed to the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/nyoni-appointed-to-zifa-youth-development-committee/\">Continue reading<span class=\"screen-reader-text\"> \"NYONI APPOINTED TO ZIFA YOUTH DEVELOPMENT COMMITTEE\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "Mighty Warriors Eye Victory",
            "url": "https://www.zimeye.net/2025/02/23/mighty-warriors-eye-victory/",
            "content": "Sports Correspondent\n\nThe Zimbabwe national womens team, the Mighty Warriors, has arrived in South Africa ahead of their crucial second leg fixture against Angola. The team is seeking to overturn a 2-1 deficit from the first leg, which was played in Luanda on Thursday.\n\nDue to the unavailability of approved stadiums in Zimbabwe, the return leg will be hosted at the Lucas Moripe Stadium in Pretoria, South Africa, on February 26. The Mighty Warriors flew directly to South Africa from Luanda, eager to regroup and focus on the task at hand.\n\nThe upcoming match will decide the winner, who will progress to the next stage of the qualifiers.\n\nWith their sights set on victory, the Mighty Warriors are determined to make a comeback and keep their qualifying hopes alive.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe national women’s team, the Mighty Warriors, has arrived in South Africa ahead of their crucial second … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/mighty-warriors-eye-victory/\">Continue reading<span class=\"screen-reader-text\"> \"Mighty Warriors Eye Victory\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "Corpse Discovery: Manhunt for Felix Munyaradzi",
            "url": "https://www.zimeye.net/2025/02/23/corpse-discovery-manhunt-for-felix-munyaradzi/",
            "content": "By A Correspondent | The Zimbabwe Anti-Corruption Commission (ZACC) has launched a manhunt for Felix Munyaradzi, who is wanted in connection with a chilling discovery at his residence. According to a notice issued by ZACC, Munyaradzi is being sought for allegedly contravening section 136 of the Criminal Law (Codification and Reform) Act, [Chapter 9:23].\n\nIn a separate incident, a corpse was found at Munyaradzis home.\n\nLaw enforcement authorities are treating the case with the utmost seriousness, and ZACC has appealed to the public for any information that could lead to his apprehension.\n\nAnyone with information about his whereabouts should contact ZACC Investigators on 0772296635, 0776285981, 0715023975, or the Spokesperson on 0719565463, reads the notice from ZACC.\n\nThe nature of the crime and the circumstances surrounding the discovery of the body remain unclear. However, the authorities have emphasized the need for public cooperation to ensure Munyaradzi is located as swiftly as possible.\n\nThis is a developing story, and further updates will follow as more information becomes available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | The Zimbabwe Anti-Corruption Commission (ZACC) has launched a manhunt for Felix Munyaradzi, who is wanted in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/corpse-discovery-manhunt-for-felix-munyaradzi/\">Continue reading<span class=\"screen-reader-text\"> \"Corpse Discovery: Manhunt for Felix Munyaradzi\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "ED’s Fake Epworth Title Deeds",
            "url": "https://www.zimeye.net/2025/02/23/eds-fake-epworth-title-deeds/",
            "content": "Epworth Title Deeds Scandal UncoveredResidents Misled Over Presidential Title Deeds Programme\n\nHarare, Zimbabwe  Thousands of Epworth residents have been left in shock and confusion as revelations emerge that the much-publicized title deeds under the Presidential Title Deeds and Settlement Regularisation Programme may not be the qualifying legal documents they were promised.\n\nThe programme, launched in April 2023, was intended to provide legal ownership of properties to homeowners, thereby unlocking economic opportunities. However, it has come to light that the nearly 4,000 residents who applied for these title deeds might not receive fully qualifying legal documents, as initially suggested by government officials.\n\nAccording to new information, the Epworth Local Board secretary, Dr. Wilton Mhanda, previously praised the overwhelming response to the initiative. I am very happy that this programme has provided a long-awaited opportunity for our communities, he said. Yet, it appears this optimism may have been premature.\n\nInsiders close to the process have revealed that the current title deeds being issued might not meet the full legal criteria required for property ownership. Specifically, concerns are being raised over the stringent requirements for a property to qualify for a legitimate title deed, including the necessity of an approved building plan and a completed title survey. Many residents may not meet these conditions, leading to fears that they could be left with worthless papers instead of legally recognized ownership documents.\n\nOne of the critical issues highlighted is the status of properties built on wetlands. Dr. Mhanda mentioned a relocation strategy for these residents, but critics argue that this acknowledgment indicates that many properties already do not qualify for legitimate title deeds. We respect the rights of those living in wetlands and have applied to the Government for the acquisition of additional land to accommodate them, Mhanda said. However, this may be a tacit admission that these properties were improperly regularized in the first place.\n\nLocal governance and urban planning experts have started questioning the transparency of the programme. The government might be using this as a political tool, giving residents a false sense of security about their property ownership status, said a source familiar with land administration.\n\nMeanwhile, residents are expressing outrage and betrayal. We were told this would change our lives, give us real ownership of our homes. Now it feels like weve been duped, said one Epworth resident who asked to remain anonymous.\n\nThis unfolding scandal could have far-reaching implications, not only for Epworth but also for the broader Presidential Title Deeds and Settlement Regularisation Programme, which aims to regularize over 1.5 million properties across Zimbabwe.\n\nGovernment officials are yet to issue an official response to these allegations. As the situation develops, affected residents are being urged to seek legal advice and verify the legitimacy of any documents they receive under the programme.\n\nStay tuned for more updates on this developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Epworth Title Deeds Scandal Uncovered—Residents Misled Over Presidential Title Deeds Programme Harare, Zimbabwe – Thousands of Epworth residents have been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/eds-fake-epworth-title-deeds/\">Continue reading<span class=\"screen-reader-text\"> \"ED’s Fake Epworth Title Deeds\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "Mnangagwa’s “Mombe Yangu”Joke Fuels Zanu PF Infighting",
            "url": "https://www.zimeye.net/2025/02/23/mnangagwas-mombe-yangujoke-fuels-zanu-pf-infighting/",
            "content": "By A Correspondent\n\nZanu PF leader, Mr. Emmerson Mnangagwa, sparked controversy on Friday when he made a lighthearted comment directed at Vice President Constantino Chiwenga. During a public gathering, Mnangagwa jokingly told Youth Minister Tino Machakaire not to inform Chiwenga about the donation of one beast he had received.\n\nIn what seemed to be a casual remark, Mnangagwa quipped, Musaratidze VaChiwenga vanozondibira mombe yangu yakanakisa, which translates to Dont show Mr. Chiwenga my finest cattle, he might steal it.\n\nWhile the comment was made in jest, it immediately triggered a wave of reaction from both political commentators and Zanu PF members, with many criticizing the statement for being in poor taste. The timing of the joke, amidst the growing factionalism within the ruling party, raised eyebrows.\n\nInfighting within Zanu PF has been a longstanding issue, and the comment seemed to fuel speculations about the ongoing tensions between Mnangagwa and Chiwenga, two of the partys top figures.\n\nThe casual nature of the remark was seen by some as an attempt to downplay the serious infighting within the party, but for others, it appeared as a veiled jab at the Vice President. In a time when unity is critical for the party, such statements only exacerbate the divisions, said a senior political analyst, speaking on the condition of anonymity. Jokes like these, especially involving such high-profile individuals, can be misinterpreted and end up fanning the flames of discord.\n\nChiwenga, a key figure in the military and political landscape of Zimbabwe, has had a rocky relationship with Mnangagwa, and the two have been at odds at different points throughout their political careers. Although the comment was intended as lighthearted, it did little to reassure those within and outside the party about the state of Zanu PFs internal harmony.\n\nAs the debate over Mnangagwas comment continues, the focus now shifts to whether this mombe yangu joke will contribute to further deepening the fractures within the ruling party. With the 2023 elections on the horizon, many are wondering whether such remarks are a reflection of deeper issues in Zanu PFs leadership.\n\nWhether Mnangagwas words were truly intended as a harmless joke or a subtle dig at Chiwenga, one thing is clear: in the world of Zimbabwean politics, even the most seemingly innocuous comments can have far-reaching consequences.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF leader, Mr. Emmerson Mnangagwa, sparked controversy on Friday when he made a lighthearted comment directed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/mnangagwas-mombe-yangujoke-fuels-zanu-pf-infighting/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s “Mombe Yangu”Joke Fuels Zanu PF Infighting\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "City Council, Government Lock Horns Over Road Rehabilitation",
            "url": "https://www.zimeye.net/2025/02/23/city-council-government-lock-horns-over-road-rehabilitation/",
            "content": "By A Correspondent\n\nThe rehabilitation of Tangwena Street in Masvingo has sparked a dispute between the City Council and the Government, as both parties clash over responsibility for the ongoing project.\n\nA Ministry of Transport and Infrastructural Development official stated on Thursday that the City of Masvingo is responsible for the refurbishment of Tangwena Street.\n\nThis has raised questions and concerns among local residents who are eagerly awaiting improvements to the vital road.\n\nIn response, the City of Masvingo issued a statement to clarify its position regarding the ongoing construction of Tangwena Street and the associated roundabout project.\n\nThis statement seeks to provide clarity regarding the ongoing construction of Tangwena Street and roundabout in the city of Masvingo, the city council said.\n\nThe council acknowledged the frustration among residents about the perceived slow progress of the project but emphasized that the Ministry of Transport and Infrastructural Development is leading the initiative, not the city itself.\n\nWhile the city council acknowledges residents concerns regarding the perceived slow progress of the construction, its imperative to emphasize that the Ministry of Transport and Infrastructural Development is leading this initiative, not the city of Masvingo, the statement read.\n\nDespite this, Masvingo City Council expressed empathy towards the communitys desire for the timely completion of the road rehabilitation, recognizing its importance for local infrastructure development. Masvingo City Council fully empathizes with the communitys desire for the timely completion of this essential infrastructure project, the council affirmed.\n\nThe statement further called for an expedited resolution of delays, stressing the urgency of completing the project as soon as possible. In addressing the delays, its crucial to underscore the urgency of expediting the project to ensure it reaches completion as early as possible, meeting both the expectations of the residents and the strategic objectives of the citys infrastructure development plan, the city said.\n\nIn an effort to alleviate the situation, the council urged the Ministry of Transport and Infrastructural Development to allocate the necessary resources and streamline the construction process. We earnestly urge the Ministry to allocate necessary resources and streamline the construction process, the council added.\n\nThe city also expressed confidence in the Provincial Road Engineers ability to handle the project and address any concerns raised by residents. Additionally, we have full confidence in the expertise and dedication of the Provincial Road Engineer to promptly address any concerns raised by residents and stakeholders throughout the duration of the project, the statement concluded.\n\nThis ongoing clash between Masvingo City Council and the Government highlights the complexities of infrastructure development and the challenges local authorities face in balancing community expectations with bureaucratic processes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The rehabilitation of Tangwena Street in Masvingo has sparked a dispute between the City Council and the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/city-council-government-lock-horns-over-road-rehabilitation/\">Continue reading<span class=\"screen-reader-text\"> \"City Council, Government Lock Horns Over Road Rehabilitation\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "ED: The Conductor of the 2030 Choir",
            "url": "https://www.zimeye.net/2025/02/23/ed-the-conductor-of-the-2030-choir/",
            "content": "By Shelton Muchena and Desmond Nleya\n\nAs Zimbabwe grapples with a tumultuous political climate, the question lingers: Is President Emmerson Mnangagwa, affectionately known as ED, paving the way for a seamless transition of power, or are he and his affiliates conspiring to dismantle the very tenets of democratic governance? Increasingly, the narrative suggests a faction within the ruling Zimbabwe African National Union-Patriotic Front (ZANU-PF) is intent on extending his presidency beyond 2028, contradicting an implicit desire for change voiced by a significant portion of the electorate and party elders alike.\n\nOver the past week, some self-acclaimed members of the Varakashi for ED, a vocal social media group advocating the continued hanging on power of the President were permanently expelled from the group on charges that they were rogue elements planting disunity in the party. Their expulsion signals that ZANU PF is always bigger than individuals.\n\nThe apparent isolation of Harare and the Midlands as the only vocal proponents of EDs tenure beyond 2028 raises eyebrows. What does this suggest about the partys grassroots sentiment? With over 60 resolutions passed at the recent ZANU-PF conference, why is there such emphasis on a single resolution favouring EDs continued leadership? This oddity paves the way for speculation regarding whether the partys foundations are cracking, supporting the notion that the wider political apparatus may not share the fervent enthusiasm exhibited by EDs loyalist in Harare and Midlands.\n\nMoreover, the unnerving silence from key party figures, including Dr Obert Mpofu, Sydney Sekeramai, General Rugeje, Patric Chinamasa,George Charamba and Nick Mangwana, regarding the contentious 2030 slogan is telling. As the narrative circulates that ED may genuinely consider relinquishing power, why is he not denouncing a slogan that suggests he aims to remain in office well into the next decade? This hesitance only deepens the publics suspicion of his political intentions.\n\nIn recent days, the mantra supporting his extended presidency, Dancing to 2030, which previously filled the political atmosphere with fervour, has notably quieted. Coupled with the alarming sight of military tanks on the streets of Harare, the government seems to be sending a stark message: loyalty to ED will not be tolerated, and dissent will be met with force Is this an expression of confidence in his leadership or a desperate bid to project strength amid an atmosphere of uncertainty and doubt?\n\nThis mounting tension serves as a battle cry for Zimbabweans yearning for change, yet the decision-makers appear poised to stifle the peoples voice. As political affiliations become increasingly fractured, and as fear mounts over the consequences of dissent, the resolution rests in the hands of the electorate. Will they remain passive observers in the face of an unfolding political drama, or will they mobilise to demand accountability and change?If ED is honest about leaving office in 2028, why did he start the 2030 ndenge ndichipo slogan.Why have parallel structures with prefixes for ED? What happens to them when he leaves office? Why does he not stop the slogan that has seemingly caused division not only in the country but also in ZANU PF.Even without answers to these questions, one thing remains certain, that the winner will always be ZANU PF.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena and Desmond Nleya As Zimbabwe grapples with a tumultuous political climate, the question lingers: Is President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/ed-the-conductor-of-the-2030-choir/\">Continue reading<span class=\"screen-reader-text\"> \"ED: The Conductor of the 2030 Choir\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        },
        {
            "title": "Mention One Thing Mnangagwa’s Second Republic Has Achieved …",
            "url": "https://www.zimeye.net/2025/02/23/mention-one-thing-mnangagwas-second-republic-has-achieved/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa, the leader of Zimbabwes ruling Zanu PF party, took the opportunity on Friday to highlight what he described as his governments remarkable achievements in nation-building. Speaking at the National Youth Day Commemoration event in Bulawayo, Mnangagwa delivered a powerful address, urging Zimbabwes youth to contribute positively to the countrys growth and unity.\n\nWe are walking the talk, Mnangagwa declared, stressing that the government was not just making promises but delivering tangible progress. He emphasized that the governments vision was clear and centered on inclusion and development for all citizens. We are leaving no one behind, he added, signaling his administrations commitment to national unity and progress.\n\nDuring his speech, Mnangagwa urged the youth to safeguard the values that have shaped Zimbabwes society. I urge you to guard jealously the long-standing tradition of unity, solidarity, and co-existence, he said, calling on young people to cherish the bonds that hold the nation together. The president also pointed out the critical role that youth play in shaping the future of Zimbabwe, as well as the broader African continent. The prosperity and future of our region and continent is in your hands, he remarked, reinforcing the idea that the youth are the key to both Zimbabwes and Africas success.\n\nMnangagwa placed significant importance on the Day itself, which was dedicated to recognizing the potential of the youth. He appealed directly to them: I expect you to deliver, as he emphasized the need for young people to channel their energy and enthusiasm into national development. Continue to ensure that your zeal and energy are harnessed for national development, Mnangagwa urged.\n\nIn his speech, the president highlighted the importance of unity within Zimbabwes diverse society, declaring, In our diversity, we are one people, tiri vanhu vamwe, which translates to we are one people. This message resonated with the audience as he called for national cohesion amid the countrys ethnic and cultural differences.\n\nMnangagwa also commended the youth for their growing awareness of the nations rich history and the vision for the future. I commend you for the consciousness you have for our rich history and the future we are marching towards, he said, acknowledging the younger generations sense of purpose.\n\nHowever, Mnangagwa also warned against external and internal forces seeking to undermine the countrys unity and progress. Resist and reject the machinations of those who want to divide you and divide our nation, he cautioned, stressing that the unity of the nation must be preserved at all costs.\n\nWhile the presidents speech was met with applause from his supporters, critics have accused Mnangagwa of grandstanding, claiming that his statements are often more about rhetoric than substance. Detractors argue that, despite the lofty promises, many of the issues facing Zimbabweans, particularly the youth, remain unresolved. Nevertheless, Mnangagwas remarks at the National Youth Day Commemoration signal a continued focus on his administrations efforts to promote national unity and development, even as political challenges and divisions persist.\n\nAs the nation moves forward, Mnangagwas call for the youth to embrace their potential and work toward national progress remains a central theme in his governments narrative.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa, the leader of Zimbabwe’s ruling Zanu PF party, took the opportunity on Friday to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/23/mention-one-thing-mnangagwas-second-republic-has-achieved/\">Continue reading<span class=\"screen-reader-text\"> \"Mention One Thing Mnangagwa’s Second Republic Has Achieved …\"</span></a></p>",
            "time": "21:05",
            "date": "23 Feb 2025"
        }
    ]
}