{
    "news": [
        {
            "title": "Mnangagwa Regime Signals End Of USD Era By 2030",
            "url": "https://www.zimeye.net/2025/07/25/mnangagwa-regime-signals-end-of-usd-era-by-2030/",
            "content": "By A Correspondent\n\nThe government under President Emmerson Mnangagwa has reiterated plans to transition Zimbabwe to a single-currency system by 2030, phasing out the use of the United States dollar in the process.\n\nReserve Bank of Zimbabwe (RBZ) governor John Mushayavanhu revealed in an interview with theZimbabwe Independentthat the central bank is actively building foreign currency reserves to meet global benchmarks for import cover, a critical step towards achieving a mono-currency economy.\n\nOur target is to accumulate at least three months worth of import cover, Mushayavanhu said. We are currently sitting at US$731 million in reserves, which is still below the ideal threshold  not even one months worth  and significantly less than the Southern African Development Community (SADC)s recommended six-month cover.\n\nDespite the shortfall, the RBZ governor argued that Zimbabwes multi-currency setup offers additional protection. He noted that individuals and businesses are holding substantial foreign currency balances in Foreign Currency Accounts (FCAs), which help facilitate imports and act as alternative reserve buffers.\n\nOfficial figures show a steady increase in reserves: from US$270 million in April 2024 to US$731 million by the end of June. Thats an improvement from 0.4 months to nearly a full months worth of import cover, Mushayavanhu noted.\n\nHe explained, In multi-currency economies, theres no standard benchmark for import cover because economic players also maintain reserves. These free funds complement central bank holdings and are often used to manage strategic imports and savings.\n\nAs part of its long-term strategy, the RBZ is also working to build physical reserves in both gold and foreign currency, aiming to reach the recommended three to six months of import cover by 2029.\n\nOn the local currency front, Mushayavanhu said the total amount of Zimbabwe Gold (ZiG) notes in circulation currently stands at ZiG338,429,074, which is equivalent to about US$12.5 million. He highlighted that the central banks gold and forex reserves provide more than 20 times cover for both the ZiG in circulation and outstanding gold-backed digital tokens (GBDTs).\n\nForeign currency transactions processed via the formal banking system in the first half of 2025 totalled US$4.56 billion through FCAs, US$480 million through willing-buyer willing-seller arrangements, and US$450 million via direct RBZ interventions.\n\nMushayavanhu emphasised that these efforts are part of a broader monetary strategy to stabilise the local currency and gradually eliminate dependence on the US dollar within the next five years.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The government under President Emmerson Mnangagwa has reiterated plans to transition Zimbabwe to a single-currency system by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/mnangagwa-regime-signals-end-of-usd-era-by-2030/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Signals End Of USD Era By 2030\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Chamisa Gets Back to Work",
            "url": "https://www.zimeye.net/2025/07/25/chamisa-gets-back-to-work/",
            "content": "By James Gwati Opposition leader Nelson Chamisa has deployed a team of technical and policy experts to investigate the root causes of Tuesdays tragic Chitungwiza accident, which claimed 17 lives. The team presented its preliminary findings Wednesday morning, calling for urgent reforms to address the deeper national failures behind the horror crash.\n\nBelow is a summary of the teams observations:\n\nWhat happened on the 22nd of July 2025 along Seke Road must be more than just a passing headline. It must be a sobering turning point for our nation. The stark reality of this tragedy reflects the unbearable cost of systemic failurewe must all take a serious pause to reflect.\n\nChamisas team stressed the need to look beyond the accident and focus on the human stories behind the headlineseach name, each journey, each final moment. These lives lost speak to a nation where daily survival has become a nightmare.\n\nWhat we witnessed was not just a result of human error or technical failure. It was a manifestation of deep leadership decay, national dysfunction, and crumbling infrastructure.\n\nOne of the victims was a young couple and their child. They had set out on a routine trip to register the childs birth, a task that should have been straightforward. Instead, it ended in tragedy. Chamisa questioned why basic services like birth registration still require families to travel across towns and provinces.\n\nWhy must people travel such long distances for essential services? Why has decentralisation not been implemented to bring government closer to the people?\n\nAnother victim was an elderly woman from Murehwa who had travelled with her young relative to collect groceries in Chitungwiza. The story highlights the harsh reality of Zimbabwes broken economy, where families must endure long and dangerous journeys to access basics like food.\n\nChamisa also raised urgent concerns about the countrys disaster preparedness and emergency response systems.\n\nWhere is our national disaster preparedness? Where is our pride in protecting life? That accident scene exposed a horrifying truththere was no state-owned rescue crane, no emergency cutters. Citizens had to beg on social media for a privately-owned crane to respond. People were crying in pain under the truck while the nation stood helpless. Time is critical in such tragedies. We must fix this.\n\nHe said the collective trauma of hearing the agonising cries for helpcries that went unanswered due to poor emergency responsewill haunt the nation for years.\n\nThe teams report further cited a series of long-standing failures:\n\nThis is the Zimbabwe we are living in, Chamisa said.\n\nHe concluded with a call for national introspection and action:\n\nWe cannot continue to normalise pain, loss, and dysfunction. This tragedy must be our wake-up call. We must emerge from this moment stronger, more compassionate, and determined to rebuildwith God guiding us through it all. ~ nc\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati – Opposition leader Nelson Chamisa has deployed a team of technical and policy experts to investigate the root … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/chamisa-gets-back-to-work/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Gets Back to Work\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Several Feared Dead In Gweru Bus, Truck Collision",
            "url": "https://www.zimeye.net/2025/07/25/several-feared-dead-in-gweru-bus-truck-collision/",
            "content": "By A Correspondent\n\nSeveral people are feared dead following a horrific road accident that occurred approximately 23 kilometers from Gweru on Friday.\n\nAccording to news outlet Zvishavane 24/7, the tragedy unfolded when a bus swerved in an attempt to avoid a stationary truck that had been left on the road without any warning signs. The evasive action led to a devastating head-on collision.\n\nEyewitnesses described a chaotic scene, with passengers screaming and debris scattered across the road. The bus driver tried to avoid the truck, but it was too late. There were no cones or reflectors to warn approaching vehicles, said one witness at the scene.\n\nThe accident has once again spotlighted the growing concern over road safety in Zimbabwe, especially the persistent issue of unmarked stationary vehicles on major highways.\n\nThis is a tragic reminder of the dangers posed by poor road safety practices, said a local transport official. We continue to urge drivers and trucking companies to use proper hazard indicators and warning devices when vehicles break down.\n\nAuthorities have since launched an investigation into the crash, while emergency services were quickly deployed to assist the injured and recover the deceased. Officials have yet to confirm the exact number of fatalities.\n\nMotorists have been advised to approach the area with extreme caution as clean-up and rescue operations continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Several people are feared dead following a horrific road accident that occurred approximately 23 kilometers from Gweru … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/several-feared-dead-in-gweru-bus-truck-collision/\">Continue reading<span class=\"screen-reader-text\"> \"Several Feared Dead In Gweru Bus, Truck Collision\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Council Follows Fadzayi Mahere To Sue Own Resident For Defamation",
            "url": "https://www.zimeye.net/2025/07/25/council-follows-fadzayi-mahere-to-sue-own-resident-for-defamation/",
            "content": "High Court Rules public entities are open to criticism in a pivotal judgment.\n\nBy Court Correspondent | ZimEye | In a pivotal judgment underscoring the importance of free speech after the string of Mahere-defamation-cases, the High Court of Zimbabwe has dismissed an application by the Rusape Town Council to silence local resident Takudzwa Noel Mwashaenyi from publicly criticising its tender processes.\n\nJustice Sijabuliso Siziba sitting at the Mutare High Court delivered the ruling stating that the councils attempt to impose a final interdict on Mwashaenyi was not only unwarranted but also detrimental to the foundational principles of democracy.\n\nThe case arose after Mwashaenyi alleged corruption in the councils awarding of an $850,000 tender to Hurntspine Enterprises (Pvt) Ltd for the redevelopment of a municipal building into a shopping mall. His claims were disseminated through social media and WhatsApp, leading the council to assert that Mwashaenyi had defamed it by making false statements that harmed its reputation and hindered investment prospects.\n\nJustice Siziba ruled that public bodies like the Rusape Town Council have no legal grounds to suppress criticism under the guise of protecting their reputation. A local authority cannot be allowed to muzzle public criticism under the guise that its reputation is at stake, he emphasised in his judgment, reinforcing the principle that public accountability must prevail in a democratic society.\n\nThe court acknowledged that while some of Mwashaenyis claims regarding the tender process were inaccurate and misinformed, his right to express dissenting opinions remains protected. In a robust defense of freedom of expression, Siziba argued that the suppression of available information and of ideas can only be detrimental to the decision-making process of individuals, corporations, and governments.\n\nThe ruling dismissed all preliminary objections raised by the council, discharging an earlier interim interdict that prohibited Mwashaenyi from expressing his criticisms publicly. The judge further noted that the right to free speech is enshrined in both Zimbabwean law and international human rights instruments, positioning it as a core value essential for the progress of any democratic society.\n\nMwashaenyi was represented by his lawyer Leonard Chigadza of the Zimbabwe Lawyers for Human Rights.\n\nThe councils legal representation, Absalom & Shepherd Attorneys, had expressed concerns that Mwashaenyis statements jeopardized its public image and operational efficacy.\n\nHowever, Justice Sizibas ruling made clear that the pursuit of reputation cannot come at the expense of citizens rights to critique and question authority.\n\nThe court concluded its deliberations without imposing any costs on either party, highlighting that while inaccuracies existed in some of Mwashaenyis statements, the protection of free expression remains paramount.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "High Court Rules public entities are open to criticism in a pivotal judgment. By Court Correspondent | ZimEye | In … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/council-follows-fadzayi-mahere-to-sue-own-resident-for-defamation/\">Continue reading<span class=\"screen-reader-text\"> \"Council Follows Fadzayi Mahere To Sue Own Resident For Defamation\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Chido Chizondo Elected Chairperson of Zimbabwe Women’s Premier Soccer League",
            "url": "https://www.zimeye.net/2025/07/25/chido-chizondo-elected-chairperson-of-zimbabwe-womens-premier-soccer-league/",
            "content": "By Sports Correspondent\n\nChido Chizondo has been elected the new Chairperson of the Zimbabwe Womens Premier Soccer League (ZWPSL), marking a significant step in the leagues leadership renewal.\n\nChizondo, who chairs Platinum Royals, takes the helm at a time when womens football in Zimbabwe is seeking greater visibility, better governance, and stronger institutional support.\n\nJoining her at the top of the new executive is seasoned womens football benefactor Lewis Muzhara, who was elected Vice Chairperson unopposed.\n\nThe election, which coincided with the ZWPSL Annual General Meeting held at Heart Stadium, also saw the selection of new board members tasked with driving the league forward. The elected board members are:\n\nMercy Makuwatsine\n\nJames Shamuyarira Mupfudza\n\nRugwevera Sibusisiwe Dube\n\nTalent Chitsaka\n\nFootball stakeholders have welcomed the new leadership, expressing optimism that the Chizondo-led administration will prioritise player welfare, league expansion, and sponsorship mobilization.\n\nThe ZWPSL plays a crucial role in nurturing female football talent in Zimbabwe and is seen as a key feeder system for the national womens teams.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Chido Chizondo has been elected the new Chairperson of the Zimbabwe Women’s Premier Soccer League (ZWPSL), marking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/chido-chizondo-elected-chairperson-of-zimbabwe-womens-premier-soccer-league/\">Continue reading<span class=\"screen-reader-text\"> \"Chido Chizondo Elected Chairperson of Zimbabwe Women’s Premier Soccer League\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Mupfurutsa Elected New PSL Chairperson",
            "url": "https://www.zimeye.net/2025/07/25/mupfurutsa-elected-new-psl-chairperson/",
            "content": "By Sports Correspondent\n\nIsaiah Mupfurutsa has been elected Chairperson of the Premier Soccer League (PSL) following elections held in Harare on Friday.\n\nThe Simba Bhora Chairperson secured the mandate to lead the top-flight league after outpolling fellow contenders Dumisani Sisale of FC Platinum, Leonard Musariri of Ngezi Platinum Stars, and Masimba Chihowa of Manica Diamonds.\n\nMupfurutsa now takes over the responsibility of overseeing the administration and strategic direction of the PSL at a time when the league is facing both competitive and structural challenges.\n\nHighlanders Kenneth Mhlophe was elected Vice Chairperson unopposed, while Dynamos Moses Maunganidze and TelOnes Oscah Nduwure were voted in as Emergency Committee members, completing the new-look PSL executive.\n\nMeanwhile, elections for the Womens Premier Soccer League (WPSL) were underway at Heart Stadium, with Platinum Royals Chairperson Chido Chizondo and Black Rhinos Queens Ntokoziso Moyo vying for the Chairpersons post.\n\nWomens football benefactor Lewis Muzhara ran unopposed for the Vice Chairperson position.\n\nThe WPSL elections coincided with the leagues Annual General Meeting, also held at Heart Stadium, where stakeholders gathered to discuss the strategic future of womens football in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Isaiah Mupfurutsa has been elected Chairperson of the Premier Soccer League (PSL) following elections held in Harare … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/mupfurutsa-elected-new-psl-chairperson/\">Continue reading<span class=\"screen-reader-text\"> \"Mupfurutsa Elected New PSL Chairperson\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Unseen Enemies: Fighting Worms to Save Livestock and Farm Income",
            "url": "https://www.zimeye.net/2025/07/25/unseen-enemies-fighting-worms-to-save-livestock-and-farm-income/",
            "content": "By Dr Trywell Muzerengi\n\nDeworming is a vital component of livestock and poultry management, yet it is often overlooked by many farmers. Understanding the importance of controlling internal parasites is key to improving animal health, productivity, and profitability.\n\nInternal parasites such as worms compete with animals for nutrients. When animals are infested, the feed provided ends up benefiting the parasites more than the animals themselves. This leads to poor growth, reduced production, and in severe cases, death.\n\nSo why do we deworm our animals and poultry?The primary reason is to control internal parasites so that animals and birds can fully utilise the feed given to them. A well-fed animal with a parasite-free gut is healthier, grows faster, and produces better milk, meat, or eggs.\n\nHow Often Should Deworming Be Done?\n\nEach animal species requires deworming at specific intervals:\n\nCattle should be dewormed twice a year  once before the rainy season and again after the rainy season.\n\nPigs need to be dewormed every three months, or soon after weaning from the sows.\n\nGoats should be dewormed every three months.\n\nChickens also require deworming every three months to prevent parasite build-up in the flock.\n\nImportant Tips for Effective Deworming\n\nAlways use broad-spectrum dewormers that can control all types of internal parasites, not just selective ones.\n\nRotate deworming drugs occasionally to prevent resistance.\n\nMaintain good hygiene and proper feeding practices to reduce the risk of re-infestation.\n\nBy keeping animals parasite-free, farmers not only improve the welfare of their livestock and poultry but also enhance their overall farm productivity. Regular deworming is a simple, cost-effective practice that pays big dividends in animal performance and farmer income.\n\nInstagram: lasmuzagro1\n\nLinkedIn: Lasmuz Agro\n\n[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Deworming is a vital component of livestock and poultry management, yet it is often overlooked by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/unseen-enemies-fighting-worms-to-save-livestock-and-farm-income/\">Continue reading<span class=\"screen-reader-text\"> \"Unseen Enemies: Fighting Worms to Save Livestock and Farm Income\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Economic Ruin Under Mnangagwa Fuels Spike in Domestic Tragedies Countrywide…",
            "url": "https://www.zimeye.net/2025/07/25/economic-ruin-under-mnangagwa-fuels-spike-in-domestic-tragedies-countrywide/",
            "content": "By A Correspondent\n\nA tragic incident in Harares Hopley suburb has reignited concerns over the growing number of domestic disputes and suicides being linked to Zimbabwes worsening economic crisis under President Emmerson Mnangagwas administration.\n\nA local man reportedly took his own life on Wednesday following a heated domestic argument with his partner.\n\nThe incident has sent shockwaves through the Hopley community, where poverty, joblessness, and overcrowded living conditions have intensified social tensions in recent months.\n\nConfirming the incident, a police officer stationed in Hopley  who spoke on condition of anonymity  said:\n\nYes, we are investigating a suspected case of suicide involving a male adult.\n\nPreliminary reports suggest there was a serious domestic altercation shortly before the incident. Sadly, this is not an isolated case.\n\nEconomic pressure is pushing many families to breaking point.\n\nThe officer added that authorities are seeing a disturbing trend of rising domestic violence and self-harm cases across informal settlements like Hopley:\n\nThe majority of the people here are unemployed. Many live in extreme poverty, with no consistent access to food or income.\n\nThese hardships are directly fuelling family disputes and mental health challenges.\n\nResidents interviewed expressed a mixture of grief and frustration. Some blamed government inaction, saying the deteriorating living standards are breaking families apart.\n\nA neighbour of the deceased man, who identified herself only as Mai Tawanda, said:\n\nWe heard shouting between him and his wife, but we didnt expect it would end like this. People are struggling to survive. Theres no money, no jobs, and no hope. This government has failed us.\n\nThe Zimbabwe Republic Police (ZRP) has urged community members to seek help and engage counselling services where available, instead of resorting to violence or self-harm.\n\nHowever, with limited access to mental health care, and little government support, civil society groups fear that more lives may be lost unless urgent measures are taken to address the root causes of domestic tension  Zimbabwes ongoing economic collapse.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident in Harare’s Hopley suburb has reignited concerns over the growing number of domestic disputes … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/economic-ruin-under-mnangagwa-fuels-spike-in-domestic-tragedies-countrywide/\">Continue reading<span class=\"screen-reader-text\"> \"Economic Ruin Under Mnangagwa Fuels Spike in Domestic Tragedies Countrywide…\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Ailing Harare Giants Dynamos FC Suspended Coach Saul Chaminuka Over Poor Results",
            "url": "https://www.zimeye.net/2025/07/25/ailing-harare-giants-dynamos-fc-suspended-coach-saul-chaminuka-over-poor-results/",
            "content": "Sports Correspondent\n\nDynamos Football Club has suspended head coach Saul Chaminuka following a disappointing run of results that has seen the Harare giants win just one of their last ten matches.\n\nThe clubs leadership is reportedly finalising plans to appoint Kelvin Kaindu as the new head coach. Kaindu was dismissed by Highlanders in June, but Dynamos appear ready to offer him a lifeline.\n\nWith fans growing restless and the clubs form plummeting, all eyes are now on whether Kaindu can revive Dembares fortunes. Can he save the club from further decline?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos Football Club has suspended head coach Saul Chaminuka following a disappointing run of results that has seen … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/ailing-harare-giants-dynamos-fc-suspended-coach-saul-chaminuka-over-poor-results/\">Continue reading<span class=\"screen-reader-text\"> \"Ailing Harare Giants Dynamos FC Suspended Coach Saul Chaminuka Over Poor Results\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        },
        {
            "title": "Chiwenga Miles Ahead in ZANU PF Succession Race, Says UK-Based Analyst",
            "url": "https://www.zimeye.net/2025/07/25/chiwenga-miles-ahead-in-zanu-pf-succession-race-says-uk-based-analyst/",
            "content": "By A Correspondent\n\nVice President and former military commander General (Rtd) Constantino Chiwenga is currently the frontrunner in ZANU PFs internal succession battles, according to United Kingdom-based Zimbabwean lawyer and political analyst Brighton Mutebuka.\n\nIn a strongly worded statement released on Wednesday, Mutebuka suggested that political forces within the ruling party and the state apparatus are shifting in Chiwengas favour  at the expense of President Emmerson Mnangagwa.\n\nThe most likely outcome in the ZANU PF succession race at this moment in time is that Chiwenga will emerge victorious, Mutebuka declared. How he will achieve it, I am unable to unlock at present. All I am able to surmise is that political fundamentals are aligning and gravitating towards him.\n\nMutebuka said that much of the maneuvering is taking place behind the scenes, but signs of Chiwengas ascendancy are becoming harder to ignore.\n\nWhat is particularly significant is that for now, he is succeeding in squeezing the life out of EDs momentum in key political strategies that should already have seen light of the day at this point in the political calendar, he added.\n\nHe argued that Mnangagwas agenda is slowly being stalled.\n\nEDs political clock is simply being ground down quietly and efficiently  not yet to the point of achieving a shuddering halt, it must be cautioned, but ground down it is!\n\nAccording to Mutebuka, the clearest indicator of Chiwengas growing influence is the conspicuous lack of parliamentary action on constitutional amendments widely expected to benefit Mnangagwa and prolong his grip on power.\n\nThe very conspicuous absence of activity in Parliament to rubber-stamp proposed amendments led by the notorious proxy Tshabangu and his CCC cabal, accompanied by Ziyambi Ziyambi et al, is telling, he observed.\n\nMutebuka went on to describe the unfolding situation as a season of long knives within both ZANU PF and the broader state machinery.\n\nI predict a season of long knives in the deep state and in either faction. Many will be consumed by this ravenous Frankenstein monster of their own creation.\n\nDespite his confident assessment of Chiwengas current advantage, Mutebuka offered a word of caution.\n\nOnce its said and done and the dust is settled, we will see what remains of the carcass. I will still retain the caveat that nothing is settled though.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Vice President and former military commander General (Rtd) Constantino Chiwenga is currently the frontrunner in ZANU PF’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/25/chiwenga-miles-ahead-in-zanu-pf-succession-race-says-uk-based-analyst/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Miles Ahead in ZANU PF Succession Race, Says UK-Based Analyst\"</span></a></p>",
            "time": "18:41",
            "date": "26 Jul 2025"
        }
    ]
}