{
    "news": [
        {
            "title": "Any gifts for Chapo",
            "url": "https://www.zimeye.net/2025/05/14/any-gifts-for-chapo/",
            "content": "The Mozambican president, Daniel Chapo Guard of Honor inspection at the ZITF 2025. This year the GoZ was diplomatic on the gift given to Mozambique.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Mozambican president, Daniel Chapo Guard of Honor inspection at the ZITF 2025. This year the GoZ was diplomatic on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/14/any-gifts-for-chapo/\">Continue reading<span class=\"screen-reader-text\"> \"Any gifts for Chapo\"</span></a></p>",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "Eunor Guti Son In Law Fired Over Adultery With Another Woman",
            "url": "https://www.zimeye.net/2025/05/14/eunice-guti-son-in-law-fired-over-impregnating-another-woman/",
            "content": "Ezekiel Gutis son in law Steve Simukai has been suspended over alleged adultery. The following is a church announcement that also covers two other people.\n\nNOTICE OF DISCIPLINARY ACTION\n\nThis serves to inform you that asSADOP 91, we have taken steps to put the following people under discpline with immediate effect:\n\n1) Secretary General Mishael Nyambo2) Deputy Secretary General Steve Simukai3) Overseer Mrs Talent Mayemu\n\nThe above mentioned persons must take time to sort out their personal life issues. They are currently not fit or in a position to preach or minister on the pulpit of God until certain issues are clarified least the pulpit be defiled.We ask them to graciously step down from the Sacred Offices they hold and turn to the Lord in Repentance.\n\nJude 1:12 These are spots in your love feasts, while they feast with you without fear, serving only themselves. They are clouds without water, carried about by the winds, late autumn trees without fruit, twice dead, pulled up by the roots.\n\n1 Corin 5 v11.But now I have written to you not to keep company with anyone named a brother, who is sexually immoral, or covetous, or an idolater, or a reviler, or a drunkard, or an extortionernot even to eat with such a person.\n\nThis has been done out of the love and the Fear of God which we as SADOP 91 saw in our fathers.\n\nWe wish the above well as they take time to reflect and be restored.\n\nBest,SADOP 91\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Ezekiel Guti’s son in law Steve Simukai has been suspended over alleged adultery. The following is a church announcement that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/14/eunice-guti-son-in-law-fired-over-impregnating-another-woman/\">Continue reading<span class=\"screen-reader-text\"> \"Eunor Guti Son In Law Fired Over Adultery With Another Woman\"</span></a></p>",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "Ziyaphapha the Military Strategist",
            "url": "https://www.zimeye.net/2025/05/14/ziyaphpha-the-military-strategist/",
            "content": "Councillor Ndlovu on Ziyaphapha\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Councillor Ndlovu on Ziyaphapha",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "Main Lecture on Ziyaphapha",
            "url": "https://www.zimeye.net/2025/05/14/main-lecture-on-ziyaphapha/",
            "content": "Part 6 of Ziyaphapha Memorial Lecture\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Part 6 of Ziyaphapha Memorial Lecture",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "General Sanyatwe Steals Limelight After Army Demotion",
            "url": "https://www.zimeye.net/2025/05/14/general-sanyatwe-steals-limelight-after-army-demotion/",
            "content": "By Sports Reporter-Since his demotion from the Zimbabwe National Army and reassignment to civilian life, Lt General (Retired) Anselem Nhamo Sanyatwe has increasingly found himself in the public eyethis time not in military fatigues, but as the new Minister of Sport, Recreation, Arts and Culture.\n\nSanyatwes demotion marks the latest chapter in a gradual political fall from grace. Once a powerful figure in Zimbabwes military and political establishment, he was a central player during the 2017 coup that ousted long-time ruler Robert Mugabe. He later served as Zimbabwes Ambassador to Tanzania, before being recalled in January 2024 under murky circumstances. His reassignment to a ministerial post, widely seen as a further sidelining, came amid a reshuffle that removed him from strategic security structures and placed him in a less politically sensitive portfolio.\n\nDespite this, Sanyatwe has remained unusually visible and vocal. Last week, he toured the controversial Heart Stadium and hotel in Waterfalls, owned by self-proclaimed prophet and convicted fraudster Walter Magaya, raising eyebrows about the ministers choice of company.\n\nHe also made headlines after confronting the contractor in charge of renovating the National Sports Stadium, reportedly telling them to shape up or ship outa statement that signalled his intention to shake up the countrys troubled sports infrastructure.\n\nThis week, Sanyatwe visited Kensington Medical Centre, where four professional golfers are receiving treatment following a tragic car crash that claimed the life of a fellow player.\n\nThe deceased, Morton Kombai, a professional golfer from Zvishavane, died in a car accident late Sunday night at the intersection of Samora Machel Avenue and Seventh Street in Harare. He had just competed in the FBC-Zimbabwe Open golf tournament alongside four other professional golfers.\n\nThe injuredTonderai Masunga (Zimbabwean), Biggie Chibvuri (Zimbabwean and driver of the vehicle), Victor Kachepatsonga (Malawian), and Lucky Ayisa (Ghanaian)are currently hospitalised.\n\nSanyatwes presence at the hospital underscores his new role as minister, but also highlights the tightrope he walks between remaining politically relevant and appearing overly eager in a portfolio often seen as a political graveyard. Whether this renewed visibility will help him rebuild influence or fade quietly from the national spotlight remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter-Since his demotion from the Zimbabwe National Army and reassignment to civilian life, Lt General (Retired) Anselem Nhamo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/14/general-sanyatwe-steals-limelight-after-army-demotion/\">Continue reading<span class=\"screen-reader-text\"> \"General Sanyatwe Steals Limelight After Army Demotion\"</span></a></p>",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "Jason Ziyaphapha Moyo the unsung Hero",
            "url": "https://www.zimeye.net/2025/05/14/jason-ziyaphapha-moyo-the-unsung-hero/",
            "content": "Benny Moyo Jason Ziyaphapha Moyo Memorial Lecture about the unsung Zimbabwean Heroes and Heroines.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Benny Moyo Jason Ziyaphapha Moyo Memorial Lecture about the unsung Zimbabwean Heroes and Heroines.",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "Part 2 Jason Ziyaphapha Moyo a Liberator",
            "url": "https://www.zimeye.net/2025/05/14/part-2-jason-ziyaphapha-moyo-a-liberator/",
            "content": "Benny Ncube memorial lecture on Jason Ziyaphapha Moyo.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Benny Ncube memorial lecture on Jason Ziyaphapha Moyo.",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "Cde Geza’s Protest Push Starts To Bear Fruit As High Court Frees 89 March 31 Detainees",
            "url": "https://www.zimeye.net/2025/05/14/cde-gezas-protest-push-starts-to-bear-fruit-as-high-court-frees-89-march-31-detainees/",
            "content": "ByCrime and Courts Reporter-The High Court of Zimbabwe has today granted bail to 89 opposition-linked protesters who were arrested in connection with the crippling 31 March 2025 demonstrations, an action widely credited to war veteranBlessed Runesu  Geza, who continues to mount pressure for the release of all political detainees.\n\nPresiding over the matter, Justice Muremba overturned a lower court decision that had denied bail to the group and ordered their release upon payment of US$100 each to the Clerk of Court at the Harare Magistrates Court. Strict bail conditions were imposed, including a requirement for all accused to reside at their stated addresses and report to designated police stations every fortnight until the finalisation of their cases.\n\nAmong the named appellantsJoseph Gatsi, Kudzanai Murungweni, Memory Dehwe, and Munyaradzi Kanonamareporting stations include Chegutu, Sanyati, Rusape, and Glendale, respectively.\n\nThe group is facing charges of public violence, breach of peace, and bigotry under section 37(1)(a)(i) of the Criminal Law Code. The state alleges they engaged in unlawful assembly and incitement during the March 31 demonstrations, which saw thousands take to the streets demanding political reforms, economic relief, and respect for constitutional rights.\n\nHowever, human rights lawyers have dismissed the charges as politically motivated, arguing that the arrests were part of a broader state strategy to stifle dissent and criminalise legitimate protest.\n\nThe March 31 protests, described by observers as one of the most significant acts of civil disobedience in recent years, were largely mobilised by Cde Geza. His call to action brought cities and towns across Zimbabwe to a near-standstill, with widespread shutdowns of businesses, schools, and public services. Economists estimate that millions of dollars in business activity were lost that day, with many acknowledging that the protests impact sent shockwaves through both the government and private sectors.\n\nThe court, while granting bail, warned the appellants not to interfere with ongoing investigations.\n\nTodays ruling is a significant legal and moral win for the opposition and civic groups, coming at a time when Zimbabwes human rights record is under renewed international scrutiny.\n\nDeveloping story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-The High Court of Zimbabwe has today granted bail to 89 opposition-linked protesters who were arrested … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/14/cde-gezas-protest-push-starts-to-bear-fruit-as-high-court-frees-89-march-31-detainees/\">Continue reading<span class=\"screen-reader-text\"> \"Cde Geza’s Protest Push Starts To Bear Fruit As High Court Frees 89 March 31 Detainees\"</span></a></p>",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "DeMbare Appoint Saul Chaminuka As Head Coach",
            "url": "https://www.zimeye.net/2025/05/14/dembare-appoint-saul-chaminuka-as-head-coach/",
            "content": "Sports Stadium\n\nStruggling Harare giants Dynamos FC have appointed veteran coach Saul Chaminuka to take over the reins from Lloyd Chigove, who has come under fire following a poor run of results.\n\nUnder Chigove, popularly known as Mablanyo, Dynamos have found themselves slipping down the league standings, prompting the club to make changes to the technical team in an effort to turn their season around.\n\nIn a statement released yesterday, the club confirmed its intention to restructure the technical department as part of efforts to tackle ongoing challenges, while emphasizing that all adjustments will follow proper procedures.\n\nA full announcement outlining the new technical setup is expected on Wednesday.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Stadium Struggling Harare giants Dynamos FC have appointed veteran coach Saul Chaminuka to take over the reins from Lloyd … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/14/dembare-appoint-saul-chaminuka-as-head-coach/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Appoint Saul Chaminuka As Head Coach\"</span></a></p>",
            "time": "06:37",
            "date": "15 May 2025"
        },
        {
            "title": "High Court Grants Bail to 89 Protesters Arrested Over 31 March Demo",
            "url": "https://www.zimeye.net/2025/05/14/high-court-grants-bail-to-89-protesters-arrested-over-31-march-demo/",
            "content": "Harare  14 May 2025\n\nThe High Court of Zimbabwe has today granted bail to 89 opposition-linked protesters who were arrested in connection with the 31 March 2025 demonstrations. The ruling comes after the group, which includes high-profile activists and youths from across the country, filed a consolidated appeal against the lower courts decision to deny them bail.\n\nPresiding over the matter, Justice Muremba set aside the Magistrates earlier ruling and ordered the release of all appellants upon payment of USD$100 each to the Clerk of Court at Harare Magistrates Court. The judge also imposed strict conditions, requiring each accused to reside at their stated addresses and report to designated police stations every fortnight until the matter is finalised.\n\nSome of the named appellantssuch as Joseph Gatsi, Kudzanai Murungweni, Memory Dehwe, and Munyaradzi Kanonamawere ordered to report at Chegutu, Sanyati, Rusape, and Glendale police stations respectively.\n\nThe appellants are facing charges of public violence, breach of peace, and bigotry under section 37(1)(a)(i) of the Criminal Law Code following what authorities described as unlawful assembly and incitement. Human rights lawyers, however, argue that the arrests were politically motivated and meant to crush dissent.\n\nThe bail ruling is a significant legal victory for the accused and comes amid growing scrutiny over Zimbabwes deteriorating human rights climate.\n\nThe court warned all appellants not to interfere with ongoing investigations.\n\nDeveloping story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 14 May 2025 The High Court of Zimbabwe has today granted bail to 89 opposition-linked protesters who were … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/14/high-court-grants-bail-to-89-protesters-arrested-over-31-march-demo/\">Continue reading<span class=\"screen-reader-text\"> \"High Court Grants Bail to 89 Protesters Arrested Over 31 March Demo\"</span></a></p>",
            "time": "06:37",
            "date": "15 May 2025"
        }
    ]
}