{
    "news": [
        {
            "title": "WestProp Champions Real Estate Growth at Prestigious ZimReal Indaba",
            "url": "https://www.zimeye.net/2025/08/23/westprop-champions-real-estate-growth-at-prestigious-zimreal-indaba/",
            "content": "By Business Reporter WestProp Holdings this week, for the second consecutive year, took centre stage as themainline sponsorof the annualZimReal Property Investment Conference, a premier gathering that attracted over 300 participants, including property developers, owners, pension fund managers, bankers, and other industry professionals.\n\nThemedCementing Growth and Growing Value,the conference provided a platform to deliberate on the challenges and opportunities shaping Zimbabwes real estate sector.\n\nOpening the event,WestProp Holdings CEO Ken Sharpehighlighted stark realities confronting the sector. He noted that while real estate contributes about20% to global GDPand12% across Africa, Zimbabwes property market accounts for a mere2% of the countrys GDP. Even more concerning, he said, was that the states mortgage contribution stands atjust 0.04%, compared to125% in Switzerland.\n\nMeaningful growth cannot be achieved without unlocking capital, Sharpe stressed. Mortgages and long-term financing are the arteries of a functional property market. Without them, we build, but we do not grow. The absence of these instruments constrains not only developers, but also the dreams of ordinary Zimbabweans who aspire to own a home, a shop, or a piece of land.\n\nIn his closing remarks,WestProp Chairman Dr Michael Louisurged the industry to engage government in frank dialogue on the structural challenges undermining growth. He citedbureaucracy, infrastructure bottlenecks, policy inconsistencyparticularly around currency and exchange ratesas persistent barriersthat continue to erode investor confidence.\n\nIf we are serious about growth, these matters cannot remain at the fringes of policythey must be core agenda items, Dr Louis said. We cannot talk of cementing growth when the foundations are shifting beneath our feet.\n\nCalling for stronger collaboration, he added: Policymakers must walk with the real estate industrynot behind us, not in front of us, but beside us as true partners in progress. Stable currency policy, consistent land administration, and predictable legal frameworks must not be ambitionsthey must be the norm.\n\nDr Louis concluded by stressing that the sectors mission extends beyond constructing buildings. What we are doing is about laying strong foundationsfor families, for businesses, and for national pride. If we think long-term, act collaboratively, and lead with vision, we will not just participate in the futurewe will shape it.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – WestProp Holdings this week, for the second consecutive year, took centre stage as the mainline sponsor of the annual ZimReal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/westprop-champions-real-estate-growth-at-prestigious-zimreal-indaba/\">Continue reading<span class=\"screen-reader-text\"> \"WestProp Champions Real Estate Growth at Prestigious ZimReal Indaba\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "Mutangadura Burial Set for Today",
            "url": "https://www.zimeye.net/2025/08/23/mutangadura-burial-set-for-today/",
            "content": "By A Correspondent Prominent businessmanJoseph Mutangadura, who was shot dead during a suspected armed robbery at his Ruwa home on Sunday night, will be laid to rest today atGoromonzi Turnoff Cemetery.\n\nHe was 67. Mutangadura was rushed to hospital after the attack but was pronounced dead on arrival.\n\nPolice have since launched a manhunt forseven suspectsbelieved to be behind the killing and have vowed to bring them to justice.\n\nOn Thursday, Zimbabweans woke up to social media reports claiming that one of the suspects had been arrested after a shootout with police in the Gazebo area. The posts further alleged that the suspect had confessed that some of his accomplices were hiding in Epworth.\n\nHowever, the Zimbabwe Republic Police (ZRP) dismissed the reports as false.\n\nNational police spokesperson,Commissioner Paul Nyathi, urged the public to desist from circulating unverified information which could interfere with investigations.\n\nPeople should disregard what is being circulated on social media. The police will officially pronounce any developments regarding the Mutangadura incident. Those putting out false information risk derailing ongoing investigations, said Comm Nyathi.\n\nMeanwhile, family spokesperson and son of the late businessman,Munyaradzi Mutangadura, said the body will be collected from the parlour today before a church service at the family home in Ruwa. The body will then proceed to Goromonzi Turnoff Cemetery for burial.\n\nThe Ruwa community has been left in shock following the brutal killing.\n\nWe are still in disbelief. To take a life in cold blood like that is heartless. It makes us wonder if anyone is really safe, said one resident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Prominent businessman Joseph Mutangadura, who was shot dead during a suspected armed robbery at his Ruwa home on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/mutangadura-burial-set-for-today/\">Continue reading<span class=\"screen-reader-text\"> \"Mutangadura Burial Set for Today\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "No Arrests In Mutangadura Murder Robbery",
            "url": "https://www.zimeye.net/2025/08/23/no-arrests-in-mutangadura-murder-robbery/",
            "content": "By A Correspondent- The Zimbabwe Republic Police (ZRP) have dismissed as false, social media reports suggesting that a suspect has been arrested in connection with the murder of businessman Mr Joseph Mutangadura at his house in Ruwa during a suspected armed robbery on Sunday night.\n\nHe was pronounced dead on arrival at a hospital where he was rushed to after the shooting.\n\nHe was 67.\n\nPolice have since launched a manhunt for the seven suspects and vowed to bring them to book.\n\nThursday, Zimbabweans woke up to messages, flooding social media platforms alleging that one of the suspects had been arrested.\n\nThe social media messages even went on to give details of the alleged arrest.\n\nIn one post on Facebook, a message suggested that the said suspect was arrested in the Gazebo area after gunfire exchange with the law enforcement agents, who eventually cornered and apprehended him.\n\nThe post went on to say after the suspect was arrested, he revealed that some of his colleagues were staying in Epworth.\n\nHowever, police dismissed the posts as false.\n\nIn an interview with Zimpapers yesterday, national police spokesperson Commissioner Paul Nyathi said the public should desist from spreading false information.\n\nPeople should disregard what is being circulated on social media. The police will officially pronounce any developments regards the Mutangadura incident. Those who are putting information on social media which is not verified should be careful, lest they interfere with investigations and in the process derail what the police is doing, Comm Nyathi said.\n\nHe said investigations were ongoing.\n\nMr Mutangadura will be laid to rest at Goromonzi Turnoff Cemetery today.\n\nAccording to the late businessmans son Mr Munyaradzi Mutangadura, the body of the deceased will be collected from the parlour on Friday and a church service will be held at his house in Ruwa where it will spend the night before it is buried on Saturday.\n\nMeanwhile, the community is still in shock following the untimely death of Mr Mutangadura.\n\nWe are still in shock following this tragedy. There are people who are heartless out there. Killing someone in cold blood like that has left us wondering if all of us are really safe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- The Zimbabwe Republic Police (ZRP) have dismissed as false, social media reports suggesting that a suspect has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/no-arrests-in-mutangadura-murder-robbery/\">Continue reading<span class=\"screen-reader-text\"> \"No Arrests In Mutangadura Murder Robbery\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "Pastor Forces Self On Male Teenager",
            "url": "https://www.zimeye.net/2025/08/23/pastor-forces-self-on-male-teenager/",
            "content": "A Zvishavane-based pastor appeared before the Kwekwe Magistrates Court facing charges of aggravated indecent assault on an 18-year-old male.\n\nThe alleged incident reportedly occurred at the victims home in Redcliff on 11 August 2025.\n\nAccording to court papers, the victim woke up to find himself being caressed by the accused, who had visited the family. When the victim questioned the pastors actions, he allegedly said the victim was too handsome and that the lack of a beard made him feel as though he was in bed with a woman.\n\nThe accused is further alleged to have forcibly removed the victims shorts and threatened him with a gun if he screamed or reported the incident.\n\nThe pastor allegedly forced the victim to lie on his stomach and assaulted him three times. Following the third assault, the accused reportedly demanded the victim perform a sexual act on him, which the victim did out of fear.\n\nThe accused is said to have left the premises at 06:30 hours.\n\nThe victim reportedly informed his aunt of the incident on the same day, and the matter was subsequently reported to Redcliff Police Station, leading to the pastors arrest.\n\nThe accused was remanded in custody and is expected to appear again in court on 27 August 2025 for trial.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zvishavane-based pastor appeared before the Kwekwe Magistrates’ Court facing charges of aggravated indecent assault on an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/pastor-forces-self-on-male-teenager/\">Continue reading<span class=\"screen-reader-text\"> \"Pastor Forces Self On Male Teenager\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "Frustration Overshadows Zanu PF Grand Conference",
            "url": "https://www.zimeye.net/2025/08/23/frustration-overshadows-zanu-pf-grand-conference/",
            "content": "By A CorrespondentPreparations for the 22nd ZANU PF National Peoples Conference, set for October in Mutare, are gathering pace, with party leadership, led by National Chairperson Cde Oppah Muchinguri-Kashiri, arriving in the city on Thursday to assess progress.\n\nHowever, public sentiment remains cautious, with many residents expressing doubt over whether the party can bring meaningful change after more than four decades in power.\n\nAfter 45 years of Independence, what has ZANU PF actually done for ordinary people? asked one resident, speaking on condition of anonymity. We keep hearing about conferences and grand plans, but our daily strugglesjobs, healthcare, servicesremain unchanged.\n\nAnother citizen added, These meetings always feel like political theater. We want results, not just speeches and ceremonies. I cant see how this conference will be any different.\n\nObservers note that while the party continues to tout its achievements and long history, public skepticism underscores a widening disconnect between leadership and ordinary citizens. Many question whether these high-profile gatherings genuinely address national challenges or serve primarily as political pageantry.\n\nAs preparations continue in Mutare, the spotlight remains on whether ZANU PF can translate rhetoric into tangible improvements for the Zimbabwean people.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A CorrespondentPreparations for the 22nd ZANU PF National People’s Conference, set for October in Mutare, are gathering pace, with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/frustration-overshadows-zanu-pf-grand-conference/\">Continue reading<span class=\"screen-reader-text\"> \"Frustration Overshadows Zanu PF Grand Conference\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "Africa Must Abandon US Dollar, Declares Jacob Zuma",
            "url": "https://www.zimeye.net/2025/08/22/africa-must-abandon-us-dollar-declares-jacob-zuma/",
            "content": "By A Correspondent\n\nFormer South African President Jacob Zuma has called on African nations to ditch the US dollar and rally behind the BRICS alliance as an alternative route to economic freedom and stability.\n\nSpeaking at the 2025 UPSA Annual Leadership Lecture in Accra on Tuesday, August 19, Zuma said Africa could no longer afford to remain tied to Western financial systems that have historically disadvantaged the continent.\n\nAfrica needs to wake up and stop depending on systems that were designed to keep us poor, Zuma declared.\n\nBRICS is the future for Africa. It offers us an opportunity to rewrite the global economic rules in our favor.\n\nThe event, themedThe Geopolitics and Geo-Economics of De-dollarisation: BRICS Currency Strategy, Lessons for Africas Common Currency and Beyond, focused on the growing debate around abandoning the dollar in international trade and strengthening African economic integration.\n\nZuma, who was instrumental in expanding BRICS during his presidency, described the bloccomprising Brazil, Russia, India, China and South Africaas a powerful tool for challenging global financial dominance. We have modelled our economies to serve other nations, yet the benefits have not been ours, he said. The dollar is oppressing everyone, let us create our own.\n\nHe also criticized decades of exploitation and dependency, arguing that Africas vast resources have not translated into real development. I do not think there is a continent that has suffered more than Africa, Zuma said. Its time to stand on our own.\n\nThe former president paid tribute to Ghanas role in the liberation struggle, hailing Dr. Kwame Nkrumah as a visionary who wanted Africa to lead its own destiny.\n\nEducation Minister Haruna Iddrisu praised UPSA for sparking dialogue on economic sovereignty, noting that these conversations are critical as Africa searches for independence beyond politics and into economics.\n\nUPSA Vice-Chancellor Prof. Kwaku Mensah Mawutor emphasized the importance of the lecture series in shaping thought leadership on issues that affect Africas future. This is not just an academic exercise, Prof. Mawutor said. Its about equipping our students and the wider society to champion Africas voice in the global arena.\n\nSince its inception in 2017, the UPSA Annual Leadership Lecture has hosted prominent figures, including former President John Agyekum Kufuor, Dr. Mohammed Ibn Chambas, and Otumfuo Osei Tutu II.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former South African President Jacob Zuma has called on African nations to ditch the US dollar and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/africa-must-abandon-us-dollar-declares-jacob-zuma/\">Continue reading<span class=\"screen-reader-text\"> \"Africa Must Abandon US Dollar, Declares Jacob Zuma\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "UNICEF boss meet Prof. Jiri",
            "url": "https://www.zimeye.net/2025/08/22/unicef-boss-meet-prof-jiri/",
            "content": "UNICEF Representative Meets Zimbabwes Agriculture Ministry to Strengthen WASH Collaboration.\n\nHarare, ZimbabweThe UNICEF Representative in Zimbabwe, Ms. Etona Ekole, paid a courtesy call on the Permanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development,Prof. Dr. Obert Jiri, to strengthen collaboration in the Water, Sanitation and Hygiene (WASH) sector. The meeting underscored the critical role of water in advancing child health, education, nutrition, and protection, while also addressing the pressing challenges of climate change and water scarcity.\n\nDuring the engagement, Prof. Jiri highlighted the Ministrys mandate to coordinate all WASH activities nationwide through the National Action Committee. He outlined the robust structures already in place, including Rural WASH, Urban WASH, and Water Resources Management sub-committees, and commended UNICEF for its continued support in emergencies such as cholera outbreaks, as well as in information management through national dashboards that track sanitation and water supply across the country.\n\nMs. Ekole reaffirmed UNICEFs commitment to working with government in building resilience against climate shocks such as El Nio-induced droughts. She emphasized the disproportionate impact of water scarcity on children, noting how the burden of fetching water often compromises their protection, health, and development.\n\nShe also shared insights from her recent field visits to Matabeleland South and Manicaland, where UNICEF projects are improving access to safe water and strengthening community resilience.\n\nBoth parties stressed the importance of expanding partnerships in the water sector. Unlike health and education, which benefit from well-established consortia of development partners, WASH remains underfunded and has limited private sector involvement. Ms. Ekole proposed mobilizing bilateral and multilateral partnersincluding new actors such as China and local private sector playersto boost resource mobilization and investment in the sector.\n\nThe courtesy call concluded with a shared vision to align efforts with Zimbabwes National Development Strategy (NDS1 and NDS2) and to prepare for a high-level policy dialogue in early 2026. This platform is expected to rally stronger international and private sector partnerships for WASH, positioning water as a central driver of human capital development and resilience building.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "UNICEF Representative Meets Zimbabwe’s Agriculture Ministry to Strengthen WASH Collaboration. Harare, Zimbabwe The UNICEF Representative in Zimbabwe, Ms. Etona Ekole, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/unicef-boss-meet-prof-jiri/\">Continue reading<span class=\"screen-reader-text\"> \"UNICEF boss meet Prof. Jiri\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "Police Speak On Mutangadura Murder Arrests Claims",
            "url": "https://www.zimeye.net/2025/08/22/police-speak-on-mutangadura-murder-arrests-claims/",
            "content": "By A Correspondent The Zimbabwe Republic Police (ZRP) have dismissed as false social media reports claiming that a suspect has been arrested in connection with the brutal murder of businessmanMr Joseph Mutangaduraat his Ruwa home on Sunday night.\n\nMr Mutangadura (67) was fatally shot during a suspected armed robbery and pronounced dead on arrival at a local hospital.\n\nPolice have since launched amanhunt for seven suspects, vowing to bring them to justice.\n\nYesterday, social media platforms were awash with unverified claims that one of the suspects had been apprehended after a shootout with police in the Gazebo area, and that he allegedly revealed the whereabouts of some accomplices in Epworth.\n\nHowever, ZRP national spokespersonCommissioner Paul Nyathidismissed the reports as false, warning the public against spreading unverified information.\n\nPeople should disregard what is being circulated on social media. The police will officially pronounce any developments regarding the Mutangadura incident. Those putting out false information risk interfering with investigations and derailing the work being done, said Comm Nyathi.\n\nHe confirmed that investigations were ongoing.\n\nMeanwhile, funeral arrangements for Mr Mutangadura have been finalised. His son,Mr Munyaradzi Mutangadura, said the body will be collected from the parlour on Friday before a church service at his Ruwa home, where it will lie in state overnight. He will be buried onSaturday at Goromonzi Turnoff Cemetery.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Republic Police (ZRP) have dismissed as false social media reports claiming that a suspect has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/police-speak-on-mutangadura-murder-arrests-claims/\">Continue reading<span class=\"screen-reader-text\"> \"Police Speak On Mutangadura Murder Arrests Claims\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "Two South Africans Arrested, Fined in Harare",
            "url": "https://www.zimeye.net/2025/08/22/two-south-africans-arrested-fined-in-harare/",
            "content": "By A Correspondent  Two South African nationals and their Zimbabwean accomplice were yesterday fined for obstructing traffic at the scene of the fatal Chitungwiza accident in which 17 people lost their lives in July.\n\nCooper Daniel Colin (33), Pretorius Walter James Seymour (51), and Germishuizen Danica (23) appeared before Harare magistrate Vakai Chikwekwe, where they pleaded guilty to the offence.\n\nThe trio was each ordered to pay a fine ofUS$200or face four months imprisonment.\n\nThe court heard that Seymour and Danica are crash data forensic experts based in Johannesburg. They entered Zimbabwe on August 20 on business visas, intending to investigate the Hunyani River Bridge accident scene where the fatal crash occurred.\n\nTogether with Colin, the two proceeded to the site and began marking scrape marks using paint and a tape measure. Their actions, however, obstructed the smooth flow of traffic between Harares central business district and Chitungwiza, leading to a traffic jam.\n\nChief Inspector Mapepa, who happened to be driving along the same route, confronted the group. After failing to provide a satisfactory explanation for conducting the exercise without notifying local authorities, the three were arrested.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Two South African nationals and their Zimbabwean accomplice were yesterday fined for obstructing traffic at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/two-south-africans-arrested-fined-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Two South Africans Arrested, Fined in Harare\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        },
        {
            "title": "ZANU PF Not Worried About The Rumours Of Chamisa’s New Political Party- Dr Mavaza",
            "url": "https://www.zimeye.net/2025/08/22/zanu-pf-not-worried-about-the-rumours-of-chamisas-new-political-party-dr-mavaza/",
            "content": "By Dr Masimba Mavaza |\n\nNelson Chamisas new party, born out of his fallout with the Citizens Coalition for Change (CCC), is not regarded as a significant threat by the ruling party ZANU PF. According to ZANU PF, merely changing the name of a party does not alter its substanceit remains the same entity.\n\nHowever, some analysts have raised concerns about Chamisas leadership style, pointing to a lack of transparency and democratic practices. These concerns have already tainted his new party before it has even taken off.\n\nChamisa was once a charismatic force in Zimbabwes opposition politics. Yet his charisma proved no match for the relatively unknown but highly calculating Sengezo Tshabangu, who forced him out of the CCC. Having faced mounting criticism over his leadership style in CCC, Chamisa now promises to unveil a new outfitthough with the same colour.\n\nHis leadership approach first drew controversy when he took control from Dr. Thokozani Khupe and went on to form the CCC, sidelining established party members while relying on a bottom-up structure driven by newcomers.\n\nChamisas leadership has often been described as a demigod style, where he exercises exclusive control over decision-making. This has led to allegations of undemocratic practices, such as imposing candidates and failing to conduct transparent internal polls. Consequently, CCCs stature as a credible alternative diminished amid internal divisions and power struggles.\n\nDespite calls for a more structured and constitutional framework, Chamisas strategy remains vagueand this is now evident in his new party. Ironically, his erratic leadership has offered him a lesson: to observe how ZANU PF has maintained consistent leadership and constitutional order, while avoiding unstable movements that neglect peoples needs and development.\n\nChamisas lack of leadership depth has perpetuated divisions and infighting, further eroding his credibility as a viable alternative to ZANU PF. Senior opposition figures have voiced similar concerns, warning that his new party may suffer the same fate.\n\nKey Challenges Facing Chamisas New Party Leadership-driven collapse: The party risks an early demise due to Chamisas own leadership weaknesses. Imported divisions: The internal conflicts and power struggles from CCC have already spilled over into the new formation. Lack of transparency: Chamisas leadership style continues to be criticized as undemocratic and opaque. Eroded credibility: Internal recalls and conflict have stained the partys image before it has even begun. Cronyism and paganism: The new party is weighed down by accusations of favouritism and questionable practices.\n\nDespite all these challenges, Chamisa still believes he remains a popular figure in opposition politics. Yet, the success of his new party will depend on whether it can resolve these issues and project a united front.\n\nFor now, Chamisa and his party risk being little more than loud-sounding nothing.\n\nHis greatest dilemma is deciding who will serve as his vice president, perhaps, Thabani Mpofu Advocate Mpofu, who has been linked to attempts at reshaping the judiciary, is said to enjoy the backing of judges and senior members of the Judicial Service Commission.\n\nBy the time ZANU PF emerges from what critics call its Zvigananda opium, Chamisa may already have positioned his hand-picked judges to serve his political agenda.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | Nelson Chamisa’s new party, born out of his fallout with the Citizens Coalition for Change … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/zanu-pf-not-worried-about-the-rumours-of-chamisas-new-political-party-dr-mavaza/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Not Worried About The Rumours Of Chamisa’s New Political Party- Dr Mavaza\"</span></a></p>",
            "time": "18:33",
            "date": "23 Aug 2025"
        }
    ]
}