{
    "news": [
        {
            "title": "Kaizer Chiefs Eye Prince Dube",
            "url": "https://www.zimeye.net/2025/03/06/kaizer-chiefs-eye-prince-dube/",
            "content": "By A Correspondent\n\nKaizer Chiefs are reportedly interested in signing Zimbabwean striker Prince Dube, who currently plays for Tanzanian giants Yanga SC. According to sources, Chiefs are evaluating their options for a new striker and Dube has emerged as a promising candidate.\n\nThe club is evaluating the realistic chances of signing a striker, and as things stand, Prince (Dube) looks the most promising option, an unnamed source revealed. With Dubes impressive performance in the Tanzanian Premier League, where he tops the scoring chart with eleven goals, Chiefs are keen to bring him on board.\n\nDubes experience in the South African Premier Soccer League, having previously played for SuperSport United, makes him an attractive option for Chiefs. The club had also considered other strikers, including Michael Olunga and Fiston Mayele, but Dube appears to be the most viable option at present.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Kaizer Chiefs are reportedly interested in signing Zimbabwean striker Prince Dube, who currently plays for Tanzanian giants … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/kaizer-chiefs-eye-prince-dube/\">Continue reading<span class=\"screen-reader-text\"> \"Kaizer Chiefs Eye Prince Dube\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "Liverpool Survive PSG Onslaught To Snatch Important Win",
            "url": "https://www.zimeye.net/2025/03/06/liverpool-survive-psg-onslaught-to-snatch-important-win/",
            "content": "By A Correspondent\n\nLiverpool secured a stunning 1-0 victory over Paris Saint-Germain in the Champions League, thanks to a late winner from Harvey Elliott and heroic goalkeeping from Alisson. The Reds withstood a relentless onslaught from PSG at the Parc des Princes, before Elliotts decisive strike in the dying minutes.\n\nElliotts goal, which came against the run of play, sent the Liverpool faithful into raptures and handed the Reds a crucial advantage ahead of the second leg at Anfield. However, it was Alisson who proved to be the real hero, producing a string of breathtaking saves to deny PSGs star-studded attack.\n\nThe Brazilian goalkeepers incredible display earned him the player of the match award, as Liverpool held on for a hard-fought win.\n\nThe victory marks a significant boost to Liverpools Champions League ambitions, and sets up a thrilling second leg showdown at Anfield.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Liverpool secured a stunning 1-0 victory over Paris Saint-Germain in the Champions League, thanks to a late … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/liverpool-survive-psg-onslaught-to-snatch-important-win/\">Continue reading<span class=\"screen-reader-text\"> \"Liverpool Survive PSG Onslaught To Snatch Important Win\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "What You Need To Know About Your Fire Extinguisher",
            "url": "https://www.zimeye.net/2025/03/06/what-you-need-to-know-about-your-fire-extinguisher/",
            "content": "Fire extinguishers are an important safety tool to have in your vehicle, but proper storage and maintenance are crucial to ensuring their effectiveness in an emergency. Here are some key tips to keep your fire extinguisher in top condition and ready for use.\n\nFirst and foremost, never expose your fire extinguisher to direct sunlight.\n\nProlonged exposure to the suns rays can lead to dangerous conditions, potentially causing the extinguisher to explode, which could result in harm or damage to your vehicle.\n\nAlways store it in a cool, dry place to ensure safety.\n\nIt is equally important to store your fire extinguisher in an accessible spot inside your vehicle. Avoid keeping it in the boot, as this could prevent you from accessing it quickly in the event of a fire. During a car fire, the vehicles electronic components may fail, causing the boot to become locked. This would make it difficult or impossible to reach your extinguisher. Instead, store it under your car seat or in the glove compartment where it can be quickly retrieved.\n\nIn addition to proper storage, regular checks are vital. Always verify the expiration date on your fire extinguisher. If the extinguisher is past its expiration date and is refillable, take it to a recognized agent to have it refilled, often at a lower cost than the original purchase price.\n\nRemember, keeping a fire extinguisher in your vehicle is an essential safety measure that can save lives in an emergency. By following these simple tips, you can ensure that your fire extinguisher remains effective when you need it most.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Fire extinguishers are an important safety tool to have in your vehicle, but proper storage and maintenance are crucial to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/what-you-need-to-know-about-your-fire-extinguisher/\">Continue reading<span class=\"screen-reader-text\"> \"What You Need To Know About Your Fire Extinguisher\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "Geza to Assist Investors Defrauded By Mnangagwa Fake Inventor Maxwell Chikumbutso",
            "url": "https://www.zimeye.net/2025/03/06/geza-promises-to-assist-investors-defrauded-by-mnangagwa-fake-inventor-maxwell-chikumbutso/",
            "content": "BLESSED GEZA PROMISES TO ASSIST INVESTORS DEMANDING REFUNDS AFTER MAXWELL CHIKUMBUTSO PROVED A SCAM\n\nChikumbutsos Endless Energy Invention Unraveled as Scam.\n\nGeza Update: Dear Mr. President Mnangagwa. It is imperative that you restore your integrity within the next72 hours by processing refunds of the investors USD125,000 youve assisted an armed robber-suspect scam the public using your 1970s sentenced/poisoned-to-death talk sopic.twitter.com/WI2n3X5EDB\n\nBy A Correspondent | ZimEye | A groundbreaking energy invention promising self-sustaining electricity and infinite mobility has been exposed as an elaborate scam, leaving international investors defrauded of hundreds of thousands of euros.Maxwell Chikumbutso, the self-proclaimed inventor behind a so-called revolutionary car, helicopter, and generator that allegedly function without fossil fuels, is now at the center of a major financial scandal.\n\nInternational investors, who traveled to Zimbabwe in early 2025 to test these miraculous machines, have come forward with damning evidence that the entire operation was a carefully orchestrated fraud.\n\nA Dream Too Good to Be True?\n\nFor years, Chikumbutso had built an almost mythical reputation, claiming to have cracked the code for limitless, free energyan innovation that, if real, would have been a game-changer for global energy markets.\n\nHis promotional videos, including one featuring Zimbabwes President, created a wave of excitement, particularly across Africa, where access to sustainable energy remains a challenge.\n\nForeign investors, eager to back what they believed to be the future of green technology, flew into Zimbabwe in early 2025 to witness and verify Chikumbutsos claims firsthand. However, what they encountered was anything but a technological revolution.\n\nWe traveled all the way from the Netherlands, Germany, France, and Poland to see the so-called invention, said Arjan Gottmer, a spokesman for the investor group. But when we got there, we found nothing. No tests were allowed, no working prototypes, and no proof that any of the paid-for machines had ever been delivered.\n\nEmpty Promises, Vanishing FundsAccording to the investors, Chikumbutso and his team engaged in repeated stalling tactics, promising test drives of the self-powering vehicles only to cancel at the last minute. The group was even invited to a high-profile product launch, where they expected to see a working demonstration.\n\nInstead, they were shown a machine locked inside a glass box, flashing lights with no apparent function.We requested a test drive. First, it was supposed to be on Tuesday, then Wednesday, then Thursday. By Friday, Maxwell had left the country, Arjan revealed. Thats when we knewthis was a scam.Investigators have uncovered a trail of invoices dating back as far as 2020, revealing that multiple investors, including individuals from Switzerland, South Africa, and the USA, had paid significant sumssome as high as 125,000for Chikumbutsos devices.\n\nYet, not a single product was ever delivered.Faith and Fraud: A Dangerous CombinationPerhaps the most disturbing aspect of this case is the way Chikumbutso manipulated faith and belief to maintain his deception.The launch event started with a prayer, Arjan recounted. He used religion and hope to make people believe they were part of something greater. That is the most disgusting parthe abused peoples faith to steal their money.\n\nChikumbutso positioned himself as a visionary, a chosen one who would bring free energy to Zimbabwe and Africa as a whole. His persuasive speeches and high-profile endorsements created an illusion of credibility, drawing in investors who wanted to be part of what seemed like a revolutionary moment in history.But the truth was far less inspiring.\n\nThe Global Warning: Do Not InvestAs the evidence against Chikumbutso mounts, the investors are issuing a stern warning to others who may still be considering putting money into his projects.If this technology were real, it would be the most incredible invention of our lifetime. But its not, Arjan said bluntly.\n\nIf youre considering investing, demand a two-hour test drive. If the battery is still charging after two hours, Ill invest, too. But you wont get that chancebecause it doesnt work.With Zimbabwe already struggling with economic hardships, the revelation of this scam is a devastating blow to those who had placed their hopes in Chikumbutsos promises.\n\nMeanwhile, investors are now gathering further evidence and considering legal action to recover their lost funds.\n\nCommenting, firebrand war veteran Blessed Geza has promised to assist victims Lllls defrauded by Chikumbutso. He also promised to push to prosecute people implicated in the GoldMafia scandal.\n\nWe shall revisit that GoldMafia case soon, he told Al Jazeeras lead investigator on the project Simba Chikanza. He also added saying victims of the Chikumbutso scam will be assisted in prosecuting their case.\n\nMaxwell Chikumbutso: Where is He Now?Following the failed test demonstrations, Maxwell Chikumbutso was reported to have abruptly flown out of Zimbabwe, leaving behind a growing number of unanswered questions. However the ZimEye news network tracked him and discovered he is now at his farm 30km out of the capital city, Harare.\n\nWhile the national broadcaster ZBC spent 16 minutes interviewing him on 28 Jan 2025, the ZimEye news network has spent over 3 years interviewing him since Feb 2022. Chikumbutso has replied saying among other failure-admissions, mkoma Simba, we have never powered 300 houses, contrary to what he told the US film maker, Foster Gamble back in 2016.\n\nThe US film maker himself has since 2021 been repeating that Chikumbutso is seriously discredited. In 2 March 2025. Gamble in emailed comment once again said people should not buy anything from Chikumbuto till one of his products has been tested for a more than 6 month period.\n\nAuthorities are now being urged to investigate and take action against Chikumbutso and his associates to prevent further financial losses and restore trust in Zimbabwes business environment.As excitement turns to outrage, the defrauded investors have one final message:Do not be fooled. This was a scam from the start. If you have already invested, demand proof. And if youre considering investingdont.#blessedmhlangaFull documentary is on ZimEye\n\nAuthorities are now being urged to investigate and take action against Chikumbutso and his associates to prevent further financial losses and restore trust in Zimbabwes business environment.As excitement turns to outrage, the defrauded investors have one final message:Do not be fooled. This was a scam from the start. If you have already invested, demand proof. And if youre considering investingdont.#blessedmhlangaFull documentary is on ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BLESSED GEZA PROMISES TO ASSIST INVESTORS DEMANDING REFUNDS AFTER MAXWELL CHIKUMBUTSO PROVED A SCAM Chikumbutso’s “Endless Energy” Invention Unraveled as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/geza-promises-to-assist-investors-defrauded-by-mnangagwa-fake-inventor-maxwell-chikumbutso/\">Continue reading<span class=\"screen-reader-text\"> \"Geza to Assist Investors Defrauded By Mnangagwa Fake Inventor Maxwell Chikumbutso\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "Maxwell Chikumbutso Caught In The Act",
            "url": "https://www.zimeye.net/2025/03/06/maxwell-chikumbutso-caught-in-the-act/",
            "content": "INVESTORS DEMAND REFUNDS AFTER MAXWELL CHIKUMBUTSO PROVED A SCAM\n\nInvestors Expose Multi-Million Dollar Energy Scam\n\nChikumbutsos Endless Energy Invention Unraveled as Scam.\n\nGeza Update: Dear Mr. President Mnangagwa. It is imperative that you restore your integrity within the next72 hours by processing refunds of the investors USD125,000 youve assisted an armed robber-suspect scam the public using your 1970s sentenced/poisoned-to-death talk sopic.twitter.com/WI2n3X5EDB\n\nBy A Correspondent | ZimEye | A groundbreaking energy invention promising self-sustaining electricity and infinite mobility has been exposed as an elaborate scam, leaving international investors defrauded of hundreds of thousands of euros.Maxwell Chikumbutso, the self-proclaimed inventor behind a so-called revolutionary car, helicopter, and generator that allegedly function without fossil fuels, is now at the center of a major financial scandal.\n\nInternational investors, who traveled to Zimbabwe in early 2025 to test these miraculous machines, have come forward with damning evidence that the entire operation was a carefully orchestrated fraud.A Dream Too Good to Be True?For years, Chikumbutso had built an almost mythical reputation, claiming to have cracked the code for limitless, free energyan innovation that, if real, would have been a game-changer for global energy markets.\n\nHis promotional videos, including one featuring Zimbabwes President, created a wave of excitement, particularly across Africa, where access to sustainable energy remains a challenge.\n\nForeign investors, eager to back what they believed to be the future of green technology, flew into Zimbabwe in early 2025 to witness and verify Chikumbutsos claims firsthand. However, what they encountered was anything but a technological revolution.\n\nWe traveled all the way from the Netherlands, Germany, France, and Poland to see the so-called invention, said Arjan Gottmer, a spokesman for the investor group. But when we got there, we found nothing. No tests were allowed, no working prototypes, and no proof that any of the paid-for machines had ever been delivered.\n\nEmpty Promises, Vanishing FundsAccording to the investors, Chikumbutso and his team engaged in repeated stalling tactics, promising test drives of the self-powering vehicles only to cancel at the last minute. The group was even invited to a high-profile product launch, where they expected to see a working demonstration.\n\nInstead, they were shown a machine locked inside a glass box, flashing lights with no apparent function.We requested a test drive. First, it was supposed to be on Tuesday, then Wednesday, then Thursday. By Friday, Maxwell had left the country, Arjan revealed. Thats when we knewthis was a scam.Investigators have uncovered a trail of invoices dating back as far as 2020, revealing that multiple investors, including individuals from Switzerland, South Africa, and the USA, had paid significant sumssome as high as 125,000for Chikumbutsos devices.\n\nYet, not a single product was ever delivered.Faith and Fraud: A Dangerous CombinationPerhaps the most disturbing aspect of this case is the way Chikumbutso manipulated faith and belief to maintain his deception.The launch event started with a prayer, Arjan recounted. He used religion and hope to make people believe they were part of something greater. That is the most disgusting parthe abused peoples faith to steal their money.\n\nChikumbutso positioned himself as a visionary, a chosen one who would bring free energy to Zimbabwe and Africa as a whole. His persuasive speeches and high-profile endorsements created an illusion of credibility, drawing in investors who wanted to be part of what seemed like a revolutionary moment in history.But the truth was far less inspiring.\n\nThe Global Warning: Do Not InvestAs the evidence against Chikumbutso mounts, the investors are issuing a stern warning to others who may still be considering putting money into his projects.If this technology were real, it would be the most incredible invention of our lifetime. But its not, Arjan said bluntly.\n\nIf youre considering investing, demand a two-hour test drive. If the battery is still charging after two hours, Ill invest, too. But you wont get that chancebecause it doesnt work.With Zimbabwe already struggling with economic hardships, the revelation of this scam is a devastating blow to those who had placed their hopes in Chikumbutsos promises.\n\nMeanwhile, investors are now gathering further evidence and considering legal action to recover their lost funds.\n\nMaxwell Chikumbutso: Where is He Now?Following the failed test demonstrations, Maxwell Chikumbutso was reported to have abruptly flown out of Zimbabwe, leaving behind a growing number of unanswered questions. However the ZimEye news network tracked him and discovered he is now at his farm 30km out of the capital city, Harare.\n\nWhile the national broadcaster ZBC spent 16 minutes interviewing him on 28 Jan 2025, the ZimEye news network has spent over 3 years interviewing him since Feb 2022. Chikumbutso has replied saying among other failure-admissions, mkoma Simba, we have never powered 300 houses, contrary to what he told the US film maker, Foster Gamble back in 2016.\n\nThe US film maker himself has since 2021 been repeating that Chikumbutso is seriously discredited. In 2 March 2025. Gamble in emailed comment once again said people should not buy anything from Chikumbuto till one of his products has been tested for a more than 6 month period.\n\nAuthorities are now being urged to investigate and take action against Chikumbutso and his associates to prevent further financial losses and restore trust in Zimbabwes business environment.As excitement turns to outrage, the defrauded investors have one final message:Do not be fooled. This was a scam from the start. If you have already invested, demand proof. And if youre considering investingdont.#blessedmhlangaFull documentary is on ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "INVESTORS DEMAND REFUNDS AFTER MAXWELL CHIKUMBUTSO PROVED A SCAM Investors Expose Multi-Million Dollar Energy Scam Chikumbutso’s “Endless Energy” Invention Unraveled … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/maxwell-chikumbutso-caught-in-the-act/\">Continue reading<span class=\"screen-reader-text\"> \"Maxwell Chikumbutso Caught In The Act\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "Geza, Gomwe: I’ll Bounce Back Same Way ED Jumped Back Into ZANU in 2017",
            "url": "https://www.zimeye.net/2025/03/06/geza-gomwe-ill-bounce-back-same-way-ed-jumped-back-into-zanu-in-2017/",
            "content": "I have taken note of the decision of NDC and subsequent Politiburo announcement on my so called expulsion which is deeply flawed. I was never served any summons nor called to a hearing .I was not even aware of the preferred charges because they were never presented to my person.\n\nLet me point out clearly that i was not recruited by anyone in Zanu Pf ,but i was born and bred in Zanu Pf. Because i know no other party than Zanu Pf i will always remain a Zanu Pf member at heart, indeed and ideologically.\n\nMy political campus remain informed from the revolutionary ideology and flavour which formed Zanu Pf in Gweru ,at Mambo Conference in 1963.\n\nJust as the sitting President was unceremoniously and unlawfully dismissed prior to 2017, i will return just as he returned because Zanu Pf is a peoples party.\n\nI once again re-iterate that i will remain steadfast and unshakable in rejection of the so called 2030 ndinenge ndichipo mantra,corruption,nepotism and moral decadence.\n\nI am without doubt deeply agitating for the implementation and adoption of the Zanu Pf Code Of Conduct of 1984 which was a full and adopted Conference Resolution addressing the root problem of corruption,nepotism and inequality. It Is well Cdes.\n\nAluta Continua .\n\nCde Gifford GomweMashonaland West cadre\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I have taken note of the decision of NDC and subsequent Politiburo announcement on my so called expulsion which is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/geza-gomwe-ill-bounce-back-same-way-ed-jumped-back-into-zanu-in-2017/\">Continue reading<span class=\"screen-reader-text\"> \"Geza, Gomwe: I’ll Bounce Back Same Way ED Jumped Back Into ZANU in 2017\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "State Increases Surveillance on Activists Amidst 2030 Succession Debate",
            "url": "https://www.zimeye.net/2025/03/06/state-increases-surveillance-on-activists-amidst-2030-succession-debate/",
            "content": "By A Correspondent\n\nAs Zimbabwe hurtles towards the 2030 presidential election, the government has intensified its surveillance on activists, opposition leaders, and journalists.\n\nThe move is seen as a concerted effort to muzzle dissenting voices and maintain a tight grip on power.\n\nThe ruling partys social media activists have been orchestrating a campaign of hate speech and incitement against prominent opposition figures, including former Zengeza MP Job Sikhala, Gift Ostallos Siziba, and Peter Mutasa, the former president of the Zimbabwe Congress of Trade Unions (ZCTU).\n\nThese individuals have been vocal in their rejection of the proposed constitutional amendment that would allow President Mnangagwa to seek a third term.\n\nActivists and journalists across the country are being trailed by suspected state security agents, and many have reported incidents of harassment and intimidation. The regime is seeking to silence critics and potential protest leaders, and the blessing of war veterans leaders is being sought to legitimize the crackdown.\n\nThe recent arrest of prominent journalist Blessed Mhlanga, who has been in detention for 9 days, has raised concerns about the states intentions. Mhlangas arrest is seen as a warning shot to the media and civil society, and has sent a chilling message about the consequences of speaking truth to power.\n\nAs anticipation for protests rises, the state is monitoring activists, and the Minister of Information, Publicity, and Broadcasting Services, Jefferson Muswere, has warned against any attempts to destabilize the country.\n\nThe government has accused activists and the opposition of seeking to incite violence and undermine the authority of the state.\n\nHowever, human rights defenders and opposition leaders argue that the governments actions are a clear attempt to suppress dissent and maintain a grip on power. They point to the proposed constitutional amendment as a clear indication of the governments intention to subvert the democratic process and cling to power.\n\nThe surge in surveillance has a chilling effect on freedom of expression and assembly, as individuals become wary of being monitored and potentially targeted by the state.\n\nThe use of advanced surveillance capabilities, including digital surveillance, has increased the potential for the state to spy on its citizens and further clamp down on free speech.\n\nAs Zimbabwe teeters on the brink of a major political crisis, the international community is watching with bated breath.\n\nThe situation demands a concerted effort from regional and international actors to press for the respect of human rights, the rule of law, and democratic principles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As Zimbabwe hurtles towards the 2030 presidential election, the government has intensified its surveillance on activists, opposition … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/state-increases-surveillance-on-activists-amidst-2030-succession-debate/\">Continue reading<span class=\"screen-reader-text\"> \"State Increases Surveillance on Activists Amidst 2030 Succession Debate\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "Zanu PF Expels War Veteran Blessed Geza",
            "url": "https://www.zimeye.net/2025/03/06/zanu-pf-expels-war-veteran-blessed-geza/",
            "content": "By A Correspondent\n\nZanu PF has officially expelled war veteran Blessed Geza from the party.\n\nThe announcement was made on Thursday by Patrick Chinamasa, the partys Secretary for Legal Affairs.\n\nGeza, known for his outspoken views, had been calling for the removal of President Emmerson Mnangagwa, which led to tensions within the party.\n\nHis expulsion comes after he made headlines last month for publicly demanding the resignation of President Mnangagwa. Additionally, Geza had been a vocal critic of Zanu PFs 2030 agenda, further intensifying his opposition within the party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF has officially expelled war veteran Blessed Geza from the party. The announcement was made on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/zanu-pf-expels-war-veteran-blessed-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Expels War Veteran Blessed Geza\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "Zanu PF Youths Violently Disrupt School Development Committee Meeting in Masvingo",
            "url": "https://www.zimeye.net/2025/03/06/zanu-pf-youths-violently-disrupt-school-development-committee-meeting-in-masvingo/",
            "content": "By A Correspondent\n\nA violent disruption occurred at a School Development Committee (SDC) meeting in Masvingo on Sunday, allegedly led by Zanu PF youths under the direction of Masvingo Urban Ward 10 councillor Sengerai Manyanga.\n\nReports from parents and stakeholders indicate that the youths, who appeared to be visibly intoxicated, aggressively pushed and shoved attendees while hurling abusive language.\n\nThe incident unfolded during an SDC Annual General Meeting at Rujeko Primary School on Saturday, where the group of youths, allegedly led by Councillor Manyanga, sought to impose Patience Mapfumo as the new chairperson of the committee.\n\nOne parent, who spoke on condition of anonymity, condemned the disruptive behavior, stating, The drunk Zanu PF youths shouted obscenities and forced their way into the meeting. They imposed one Patience Mapfumo to the post of SDC chairperson.\n\nAnother parent added, They pushed and shoved us for simply seeking transparency.\n\nThe violent and unruly actions have sparked outrage among parents, who are calling for accountability and for the meeting to have been conducted in a peaceful and orderly manner.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A violent disruption occurred at a School Development Committee (SDC) meeting in Masvingo on Sunday, allegedly led … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/zanu-pf-youths-violently-disrupt-school-development-committee-meeting-in-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Youths Violently Disrupt School Development Committee Meeting in Masvingo\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        },
        {
            "title": "Mnangagwa Subtly Expresses Desire To Rule Beyond 2028",
            "url": "https://www.zimeye.net/2025/03/06/mnangagwa-subtly-expresses-desire-to-rule-beyond-2028/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has subtly expressed his intention to remain in office beyond 2028, after instructing Politburo members to uphold conference resolutions that pave the way for his extended rule.\n\nSpeaking at a Politburo meeting in Harare on Wednesday, Mnangagwa emphasized the importance of unity and discipline within the party.\n\nWe must expose and reject those who engage in political grandstanding, along with those who support them, Mnangagwa asserted, stressing that any actions aimed at creating discord will not be tolerated.\n\nThe conference resolutions, which Mnangagwa has endorsed, propose extending his term in office beyond 2028.\n\nThis move would require constitutional amendments to take effect.\n\nMnangagwa reminded members to adhere to the values and principles of ZANU PF, both individually and collectively, and to follow the partys line without exception. We must follow the correct line of the Party, without exception, he emphasized.\n\nThe President also highlighted the importance of remembering the sacrifices of ZANU PFs fallen heroes and heroines, emphasizing the qualities of loyalty, patriotism, and service to the cause. Persistence, consistency, loyalty, patriotism, and sacrifice define our service to the Party and are the core of true comradeship and heroism, he noted.\n\nIn conclusion, Mnangagwa stressed the need for ZANU PF to maintain unity and discipline, referencing the partys Constitution as a critical guideline. The continued implementation of our Conference decisions, policies, and programs must reflect the partys commitment to progressive nation-building, he emphasized.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has subtly expressed his intention to remain in office beyond 2028, after instructing Politburo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/mnangagwa-subtly-expresses-desire-to-rule-beyond-2028/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Subtly Expresses Desire To Rule Beyond 2028\"</span></a></p>",
            "time": "20:35",
            "date": "06 Mar 2025"
        }
    ]
}