{
    "news": [
        {
            "title": "WATCH LIVE: Reactions To Prophet Wutaunashe Bounce Back To Geza",
            "url": "https://www.zimeye.net/2025/03/30/watch-live-reactions-to-prophet-wutaunashe-bounce-back-to-geza/",
            "content": "I never said Emmerson Mnangagwa is Jesus Christ, pleads Prophet Wutaunashe.\n\nThe following is a transcript of Emmerson Mnangagwas prophet and kingmaker Andrew Wutaunashe on Sunday 30 March 2025, during his church sermon:\n\nYou know there is a publication; it works from UK- I now understand there is a fellow called Chikanza or something , who just loves to take everything I say, twist it, and lie. Lies are very good for newspaper people. because people see three lines, and lies spread like wildfire. Amen, Hallelujah. Someone said lies have got wings, but truth comes more slowly, but it abides, and it will overcome lies.\n\nEDs Prophet Wutaunashe Performs U-Turn On Blessed Geza, Praises Him As The Man Fixing And Bathing The Whole Countrypic.twitter.com/0kFMaNijpk\n\nI only say this because there is a man of God who heard two lines of the liar from UK, who said Prophet Wutaunashe said Mnangagwa is Jesus Christ, and then a wildfire spread; there were lecturers, towards me and so forth, how can you say Mnangagwa is Jesus Christ? Come on, you know I never said that. I just said that man did a lot of good for this country, let us not mistreat him. Lets allow him to finish his race well. Say Hallelujah. Let us not crucify those who do good for us. and just like they crucified Jesusand so this week that real message was being drowned. How many of you here are thankful to God for the changes that have happened in Zimbabwe since 2017?\n\nCan I see your hand, sincerely? Theres no hand which is down. Say hallelujah. And I want you to understand that no matter what grievances you have in your heart, with one another as politicians, dont deny the good that has happened to this country. Can somebody say Hallelujah! Praise God.\n\nBut there is just one thing I realise that for this past few weeks, we have really prayed for the president, for the nation, for the vice president, and so forth. There is one man we left out, and today I want you to pray for him, this man fought for the liberation of this country, Amen; And at some point when he saw some problems in this country which pained him, he decided just like is his name, that this country needs a bath. You understand that?\n\nDeep in the heart of that man, is something that just says the country needs a bath, thats why his name is Geza, and today comrade Geza we want you to know, we appreciate all your sacrifices you did for our nation, and we appreciate the desires that you have, that the wrongs and the things that are negative may be righted in our nation. [PREVIOUSLY DESCRIBED BY THE SAME PROPHET WUTAUNASHE ON 23 MARCH 2025 AS  AN AWEFUL INSANE, DEMONIC MAN WHO WANTS TO HEAD TO STREETS TO REMOVE MNANGAGWA LIKE CRUCIFYING JESUS.]\n\nBut we are going to pray for you comrade Geza, because there is something in the word of God called thewayofpeace. The way of peace.\n\nSay Hallelujah. There are some people described in thebookofRomans, they dont know the way of peace, they think everything must just be settled with destruction. somebody say hallelujah. One day I heard one man of God speaking to the comrades, and he said comrades, you have fought and you have put food before us, and food is not eaten with axes and spears. Hallelujah, you use peaceful instruments. It is time for peace in the nation of Zimbabwe, and comrade Geza, we bless you, we pray for you. We thank God for the contributions you have done to this nation. But we pray for you that you may find the way of peace. If we begin bombing one another, if we begin speaking hate everyday, it will never end. Its easy to start a war, its almost impossible to stop it. and so I bless you comrade Geza, may the Lord help you to find the way of peace\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I never said Emmerson Mnangagwa is Jesus Christ, pleads Prophet Wutaunashe. The following is a transcript of Emmerson Mnangagwa’s prophet … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/watch-live-reactions-to-prophet-wutaunashe-bounce-back-to-geza/\">Continue reading<span class=\"screen-reader-text\"> \"WATCH LIVE: Reactions To Prophet Wutaunashe Bounce Back To Geza\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "FULL TEXT: ED’s Prophet Wutaunashe Performs U-Turn On Blessed Geza, Praises Him As The Man Fixing And Bathing The Whole Country",
            "url": "https://www.zimeye.net/2025/03/30/full-text-eds-prophet-wutaunashe-performs-u-turn-on-blessed-geza-praises-him-as-the-man-fixing-and-bathing-the-whole-country/",
            "content": "I never said Emmerson Mnangagwa is Jesus Christ, pleads Prophet Wutaunashe.\n\nThe following is a transcript of Emmerson Mnangagwas prophet and kingmaker Andrew Wutaunashe on Sunday 30 March 2025, during his church sermon:\n\nYou know there is a publication; it works from UK- I now understand there is a fellow called Chikanza or something , who just loves to take everything I say, twist it, and lie. Lies are very good for newspaper people. because people see three lines, and lies spread like wildfire. Amen, Hallelujah. Someone said lies have got wings, but truth comes more slowly, but it abides, and it will overcome lies.\n\nEDs Prophet Wutaunashe Performs U-Turn On Blessed Geza, Praises Him As The Man Fixing And Bathing The Whole Countrypic.twitter.com/0kFMaNijpk\n\nI only say this because there is a man of God who heard two lines of the liar from UK, who said Prophet Wutaunashe said Mnangagwa is Jesus Christ, and then a wildfire spread; there were lecturers, towards me and so forth, how can you say Mnangagwa is Jesus Christ? Come on, you know I never said that. I just said that man did a lot of good for this country, let us not mistreat him. Lets allow him to finish his race well. Say Hallelujah. Let us not crucify those who do good for us. and just like they crucified Jesusand so this week that real message was being drowned. How many of you here are thankful to God for the changes that have happened in Zimbabwe since 2017?\n\nCan I see your hand, sincerely? Theres no hand which is down. Say hallelujah. And I want you to understand that no matter what grievances you have in your heart, with one another as politicians, dont deny the good that has happened to this country. Can somebody say Hallelujah! Praise God.\n\nBut there is just one thing I realise that for this past few weeks, we have really prayed for the president, for the nation, for the vice president, and so forth. There is one man we left out, and today I want you to pray for him, this man fought for the liberation of this country, Amen; And at some point when he saw some problems in this country which pained him, he decided just like is his name, that this country needs a bath. You understand that?\n\nDeep in the heart of that man, is something that just says the country needs a bath, thats why his name is Geza, and today comrade Geza we want you to know, we appreciate all your sacrifices you did for our nation, and we appreciate the desires that you have, that the wrongs and the things that are negative may be righted in our nation. [PREVIOUSLY DESCRIBED BY THE SAME PROPHET WUTAUNASHE ON 23 MARCH 2025 AS  AN AWEFUL INSANE, DEMONIC MAN WHO WANTS TO HEAD TO STREETS TO REMOVE MNANGAGWA LIKE CRUCIFYING JESUS.]\n\nBut we are going to pray for you comrade Geza, because there is something in the word of God called thewayofpeace. The way of peace.\n\nSay Hallelujah. There are some people described in thebookofRomans, they dont know the way of peace, they think everything must just be settled with destruction. somebody say hallelujah. One day I heard one man of God speaking to the comrades, and he said comrades, you have fought and you have put food before us, and food is not eaten with axes and spears. Hallelujah, you use peaceful instruments. It is time for peace in the nation of Zimbabwe, and comrade Geza, we bless you, we pray for you. We thank God for the contributions you have done to this nation. But we pray for you that you may find the way of peace. If we begin bombing one another, if we begin speaking hate everyday, it will never end. Its easy to start a war, its almost impossible to stop it. and so I bless you comrade Geza, may the Lord help you to find the way of peace\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I never said Emmerson Mnangagwa is Jesus Christ, pleads Prophet Wutaunashe. The following is a transcript of Emmerson Mnangagwa’s prophet … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/full-text-eds-prophet-wutaunashe-performs-u-turn-on-blessed-geza-praises-him-as-the-man-fixing-and-bathing-the-whole-country/\">Continue reading<span class=\"screen-reader-text\"> \"FULL TEXT: ED’s Prophet Wutaunashe Performs U-Turn On Blessed Geza, Praises Him As The Man Fixing And Bathing The Whole Country\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Cottco losses bale ties worth USD 23 000 to employee",
            "url": "https://www.zimeye.net/2025/03/30/cottco-losses-bale-ties-worth-usd-23-000-to-employee/",
            "content": "By A Correspondent| The Cotton Company of Zimbabwe allegedly lost sixteen thousand bale ties worth over twenty thousand United States dollars to an employee with the suspect dragged to court on theft charges.\n\nLawrence Chiriri who is employed as a stores person by Cottco was remanded in custody pending his bail ruling set for this Monday.\n\nChiriri stands accused of stealing 16000 bale ties worth around 23 000 United Srates dollars.\n\nIt is alleged that Chiriri connived with accomplices who are yet to be apprehanded to steal the bale ties which they allegedly loaded in a truck that came to collect ginned seed to Afro Run Co based in Norton.\n\nThe court heard that a tip off was received by Cottco Loss Control leading a physical stock count exercise of the bale ties.\n\nThe stock take revealed that about 16000 bale ties were missing and the accused person, being the custodian of the bale ties failed to account for the missing ties leading to his arrest.\n\nChiriris court appearance had its fair share of drama as his boss Cottco Area manager for Chiredzi Innocent Gukwe secured the lawyer for the accused at the same time compromising his fiduciary duties.\n\nGukwe also threatened the Investigating Officer that if he keeps on investigating Director of CID will thoroughly deal with him.\n\nGukwe is not new to controversies as he was once arrested by the Zimbabwe Anti-corruption Commission (ZACC) last year on allegations of theft and corruption though the then company leadership failed to arraign him before a disciplinary hearing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Cotton Company of Zimbabwe allegedly lost sixteen thousand bale ties worth over twenty thousand United States … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/cottco-losses-bale-ties-worth-usd-23-000-to-employee/\">Continue reading<span class=\"screen-reader-text\"> \"Cottco losses bale ties worth USD 23 000 to employee\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Joy and Jubilation as Tytie Confirms: “Finally It’s a Boy!”",
            "url": "https://www.zimeye.net/2025/03/30/joy-and-jubilation-as-tytie-confirms-finally-its-a-boy/",
            "content": "March 30, 2025\n\nBy Dorrothy Moyo | ZimEye | All social media is on fire as, popular Facebook personality Tytie has announced the gender of their expected baby in a beautiful, joy-filled reveal: Its a boy!\n\nDressed in matching white outfits and surrounded by cheering loved ones, Tytie and their partner set off gender reveal cannons that filled the air with vibrant blue smokesignifying the arrival of a baby boy. The scene, captured in a vibrant reel captioned Finally its a boy!!, has gone viral with over 12.7K likes and 2.4K comments within an hour of posting.\n\nThe online community has responded with an outpouring of love, congratulations, and emotion. Tanyaradzwa Khumbula commented, This is beautiful! I dont know why Im crying now, this is sweet. Tytie congratulations. Kaydee simply said, Now I can rest, while others like MaPrince M Wandire shared personal reflections, saying, I remember on my first pregnancy I also looked beautiful and it was a boy.\n\nEven humorous remarks made the rounds. Its a blessed chi gezai, quipped one follower, while another, Ngwenya Givemore, threw playful shade at skeptics, writing: Where are the ones who always shout there is no pregnancy?\n\nAmong the emotional messages, one stood out for its heartfelt simplicity: Congratulations guys, wow! We pray for the baby and moms protection, wrote Talent Shava.\n\nThis moment of celebration has united thousands online in a collective wave of happiness, demonstrating once again the power of joy to bring people together.\n\nFrom the ZimEye team: Congratulations to Tytie and family on this beautiful blessing!\n\nStay tuned for more updates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "March 30, 2025 By Dorrothy Moyo | ZimEye | All social media is on fire as, popular Facebook personality Tytie … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/joy-and-jubilation-as-tytie-confirms-finally-its-a-boy/\">Continue reading<span class=\"screen-reader-text\"> \"Joy and Jubilation as Tytie Confirms: “Finally It’s a Boy!”\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "UK: Zim Support Worker Wins Golden Buzzer",
            "url": "https://www.zimeye.net/2025/03/30/uk-zim-support-worker-wins-golden-buzzer/",
            "content": "London, UK  March 30, 2025\n\nBy Showbiz Reporter | ZimEye | A 21-year-old Zimbabwean support worker based in the UK has captured the hearts of millions after delivering a soul-stirring performance on Britains Got Talent that earned her the coveted golden buzzer.\n\nLinda Mudzenda, introduced on stage as a support worker, left the judges and audience visibly moved as she belted out a powerful rendition that showcased both vocal depth and emotional range. With her eyes closed and heart open, Mudzendas performance drew a standing ovation and praise from all four judges, culminating in one of them hitting the golden buzzer  sending her straight through to the live shows.\n\nIn a time when the diaspora often shines in sports and business, Mudzendas triumph is being hailed as a cultural moment for Zimbabwean creatives globally. Social media has erupted in celebration, with users proudly declaring, Zimbabwe is probably the most talented country on the African continent.\n\nThe young performers story has resonated deeply with Zimbabweans both at home and abroad. Many see her rise as symbolic of the perseverance and brilliance often overlooked due to systemic struggles back home.\n\nMudzenda now joins a growing list of Zimbabweans making waves on international stages, and her journey on Britains Got Talent is just beginning. If her debut is anything to go by, the world should prepare to witness something extraordinary.\n\nStay tuned for more updates on Linda Mudzendas rise to stardom.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "London, UK – March 30, 2025 By Showbiz Reporter | ZimEye | A 21-year-old Zimbabwean support worker based in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/uk-zim-support-worker-wins-golden-buzzer/\">Continue reading<span class=\"screen-reader-text\"> \"UK: Zim Support Worker Wins Golden Buzzer\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "M31 Power, How Mnangagwa’s Fake Presidency Has Ended, And What’s Now Needed",
            "url": "https://www.zimeye.net/2025/03/30/m31-power-how-mnangagwas-fake-presidency-has-ended-and-whats-now-needed/",
            "content": "ZimEye Editorial: The End of a Captured Revolution in Zimbabwe\n\nZimbabwes war veterans have finally come to a painful realization: their liberation project was capturedlong ago, and right under their noses.\n\nA monster grew out of what was meant to be a peoples revolution. That monster has destroyed not only the country and its institutions, but also the very political party that once united the two liberation armies.\n\nNow, something must be doneand urgently.\n\nAcross the border in South Africa, we are seeing the emergence of Jacob Zumas MK partya grassroots, black liberation movement. But in Zimbabwe, a similar formation is rising with far more momentum and urgency. Unlike South Africas MK, which may take years to enter government, Zimbabwes new movement could assume power in a matter of days.\n\nThis is all happening amid a growing body of evidence that Emmerson Mnangagwa was never a liberator. He was, and remains, an infiltratorclearly handled by the Rhodesian Special Branch to sabotage the liberation effort from within. By 1980, according to multiple official disclosures, Zimbabwes post-independence button is supposed to be reset. After the Lancaster House Agreement and the 1980 elections, the plan was to re-establish a law-and-order concern that can be spinned back to yesteryear with a single button.\n\nthe operator would be a criminal who by then is or was supposed to have eliminated true liberators like Herbert Chitepo, Josiah Tongogara, and even Robert Mugabe. The result is what we now see: Zimbabwe run as a Rhodesian-style Law and Order concern, under Mnangagwa.\n\nNext week, starting Monday, the regime is expected to block protests in urban areas. Mnangagwa will likely respond with threats and provocation. This could quickly spiral into violence, pushing the country toward a Rwanda-like scenario. Fear, hopelessness, and provocationnot just military forcecould catalyze the violence.\n\nIn such a volatile environment, communities may turn on one another. Revenge attacks may erupt within villages, locations, and townships. Government installations and police stations could face petrol bombings. A COVID-style lockdown may be imposed, but it will not stop the chaos.\n\nAs retaliation from Mnangagwas supporters intensifies, a cycle of violence will feed itself. The army may hesitate to actnot because it lacks capacity, but because ZIPRA elements now in command of the military fear being accused of launching a coup on behalf of ZAPU or ZANU. That political paralysis could cost Zimbabwe precious time and lives.\n\nBut eventually, the demand for decisive action will become overwhelming. Once the massesand liberation war veterans from both ZANLA and ZIPRAcall on the army to intervene, it will likely act in order to save lives and the state itself.\n\nAt that point, ZANU-PF may not survive. A new political configuration may emergeperhaps something akin to South Africas MK Party, built on a genuine ZIPRA-ZANLA coalition.\n\nThis moment could be Zimbabwes worst tragedyor its best opportunity. Out of the rubble, the country might finally begin to work again.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ZimEye Editorial: The End of a Captured Revolution in Zimbabwe Zimbabwe’s war veterans have finally come to a painful realization: … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/m31-power-how-mnangagwas-fake-presidency-has-ended-and-whats-now-needed/\">Continue reading<span class=\"screen-reader-text\"> \"M31 Power, How Mnangagwa’s Fake Presidency Has Ended, And What’s Now Needed\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "“Kumagumo Kune Nyaya”: Has Thomas Chizhanje Turned Into a Prophet?",
            "url": "https://www.zimeye.net/2025/03/30/kumagumo-kune-nyaya-has-thomas-chizhanje-turned-into-a-prophet/",
            "content": "By Dorrothy Moyo | March 30, 2025\n\nHarare  Zimbabwean social media was set ablaze this morning after media personality Thomas Chizhanje dropped a cryptic post on Facebook, triggering a spiritual frenzy and a flood of wild interpretations, gospel allusions, and hilarity from his followers.\n\nIn the now-viral post, Chizhanje declared, Goliath akatanga achi saiza David. But kumagumo kune nyaya!! Loosely translated, he was referring to the biblical battle between David and Goliathsuggesting that initial appearances of strength may not determine the ultimate outcome. But to his followers, the post carried far more than spiritual reflectionit was prophecy.\n\nWithin minutes, the comment section turned into a firestorm of reactions. From one follower saying, Very true! to another humorously recounting a mishap involving anointing oil used to fry eggs, the responses ranged from the spiritual to the downright comedic.\n\nSome users speculated whether the post was veiled commentary on Zimbabwes political landscape. Others jokingly questioned who the modern-day David might be, with one follower cheekily warning, Tisataure mazita, (lets not mention names).\n\nA particularly viral comment read: Dorcas ndiye watiri kuda kumamisa matako ega ega iwayo, further confusing readers on whether this had morphed from biblical allegory into personal vendetta or satire.\n\nOne top fan even pleaded to upload an audio version of the phrase, requesting to sing the now-iconic line kumagumo kune nyaya, hinting at the phrases potential as the next gospel hit or political jingle.\n\nProphetic Shift or Classic Thomas?\n\nKnown for his sharp wit and cultural commentary, Thomas Chizhanje has often blurred the line between satire and spiritual depth. But todays post has followers wonderinghas he crossed over into the prophetic realm? Or is this just another masterpiece of digital theatre?\n\nAs comments like Pacharutswa paTaundi and Saka David ndiyani? continue pouring in, its clear: whatever his intention, Thomas has once again captured the national imagination.\n\nWhether prophet, preacher, or provocateurone thing is certain: kumagumo kune nyaya.\n\nStay tuned as ZimEye continues to follow this developing story.\n\nWould you like a graphic or meme to go with this for social media?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | March 30, 2025 Harare – Zimbabwean social media was set ablaze this morning after media personality … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/kumagumo-kune-nyaya-has-thomas-chizhanje-turned-into-a-prophet/\">Continue reading<span class=\"screen-reader-text\"> \"“Kumagumo Kune Nyaya”: Has Thomas Chizhanje Turned Into a Prophet?\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Chris Oyakhilome Who Accuses Geza, Is The Real Satanic Charlatan – Nyoni",
            "url": "https://www.zimeye.net/2025/03/30/chris-oyakhilome-who-accuses-geza-is-the-real-satanic-charlatan-nyoni/",
            "content": "Chigananda ichi! He was given that position of Ambassador At Large to Europe and the Americans by ED for that reason  of being a Runnerpic.twitter.com/8UiOPVw83s\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Walter Magaya Employees Given Police-Uniforms",
            "url": "https://www.zimeye.net/2025/03/30/walter-magaya-employees-given-police-uniforms/",
            "content": "In the pictures below are employees of the disgraced preacher Walter Magaya as they were being given police uniforms earlier in the week.\n\nDO YOU RECOGNISE THESE FACES? | NAME THEM ONE BY ONE BELOW\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In the pictures below are employees of the disgraced preacher Walter Magaya as they were being given police uniforms earlier … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/walter-magaya-employees-given-police-uniforms/\">Continue reading<span class=\"screen-reader-text\"> \"Walter Magaya Employees Given Police-Uniforms\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Flu Outbreak Hits Bulawayo…",
            "url": "https://www.zimeye.net/2025/03/30/flu-outbreak-hits-bulawayo/",
            "content": "By A Correspondent\n\nA recent surge in respiratory illnesses among young children has prompted health officials in Bulawayo to sound the alarm. Authorities at Mpilo Central Hospital report a notable increase in toddlers seeking treatment for flu-like symptoms.\n\nAccording to Clinical Director Solwayo Ngwenya, While we havent identified a specific flu strain, theres a clear uptick in respiratory cases among young children. This could be a seasonal trend, but we urge parents to remain vigilant and seek medical attention if their child exhibits severe symptoms such as high fever, sneezing, and coughing.\n\nNgwenya emphasized the importance of keeping severely ill children at home to prevent the spread of infection, particularly in school settings.\n\nLocal pharmacies have also reported a significant spike in demand for childrens flu medication over the past three weeks. A health expert noted, The rapid increase in parents seeking medication for their toddlers suggests the flu bug is spreading quickly. Unfortunately, weve temporarily sold out of childrens flu medication, but were working to restock as soon as possible.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A recent surge in respiratory illnesses among young children has prompted health officials in Bulawayo to sound … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/30/flu-outbreak-hits-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Flu Outbreak Hits Bulawayo…\"</span></a></p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        }
    ]
}