{
    "news": [
        {
            "title": "Mnangagwa Named in SA High-Profile Corruption Scandal",
            "url": "https://www.zimeye.net/2025/07/27/mnangagwa-named-in-sa-high-profile-corruption-scandal/",
            "content": "South Africa  Outspoken KwaZulu-Natal police commissioner General Nhlanhla Mkhwanazi has rocked regional politics by directly implicating Zimbabwes ruling party, Zanu PF, and the office of President Emmerson Mnangagwa in a high-level criminal syndicate operating in South Africa.\n\nIn a detailed provincial report submitted to South African President Cyril Ramaphosa, Mkhwanazi alleged that crime networks in the country increasingly involve international actors, specifically naming Zanu PF officials and individuals linked to the Zimbabwean presidency. According to the report, these networks collaborate with ANC insiders to illegally move cash, minerals, and goods across borderscircumventing international sanctions placed on Zimbabwean elites.\n\nMkhwanazis explosive report claims Zanu PF figures and allies of Mnangagwa, including controversial businessmen Wicknell Chivayo and Kudakwashe Tagwirei, help launder illicit funds from South Africa. The report further alleges that, in exchange for facilitating illegal trade, Zanu PF supplies untraceable, military-trained gunmen who have been implicated in political killings in KwaZulu-Natal.\n\nChallenging the widely held belief that cash-in-transit heists and similar crimes are solely the work of local criminal syndicates, Mkhwanazi asserts he has evidence showing active participation by serving members of the Zimbabwe National Army (ZNA).\n\nThe commissioner also warns that Zimbabwe has effectively become a hub for laundering dirty money from South Africa, with direct involvement from people close to Mnangagwa.\n\nIn a particularly pointed recommendation, Mkhwanazi urges President Ramaphosa to confront Mnangagwa at the meeting of former liberation movements held over the weekend. He argues that the Zimbabwean leadership is worsening South Africas crime crisis by backing and sheltering professional criminals, thus making law enforcement efforts far more difficult.\n\nMkhwanazi, who has gained a reputation for his frank criticism of both political interference and rising violent crime in South Africa, did not mince words. He described Zanu PF as no longer functioning as a genuine liberation movement but as a criminal organization enriching ANC and Zanu PF elites at the expense of ordinary citizens.\n\nThis latest development comes amid heightened regional concerns over cross-border crime, political violence, and entrenched corruption networks linking powerful business and political figures across southern Africa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa – Outspoken KwaZulu-Natal police commissioner General Nhlanhla Mkhwanazi has rocked regional politics by directly implicating Zimbabwe’s ruling party, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/mnangagwa-named-in-sa-high-profile-corruption-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Named in SA High-Profile Corruption Scandal\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "🔴 BREAKING NEWS | MURDER: Three Auxillia  Hotplate Caterers Chase Out Manhize Miner, Kill Him, Dump Body in Flowing Sewage",
            "url": "https://www.zimeye.net/2025/07/27/%f0%9f%94%b4-breaking-news-murder-three-auxillia-mnangagwa-hotplate-caterers-chase-out-chris-mutsvangwas-manhize-miner-kill-him-dump-body-in-flowing-sewage/",
            "content": "By ZimEye Investigations Desk | MASVINGO  A shocking murder has rocked the Dinson Iron and Steel Company community after three men working as caterers under First Lady Auxillia Mnangagwas Hot Plate food scheme allegedly murdered a Manhize-based miner linked to Presidential Advisor Chris Mutsvangwa.\n\nAccording to a police Request for Remand Form (CR 551/7/25) seen by ZimEye, the accused  Simbarashe Muneri (39), Munyaradzi Muneri (32), and Junior Thando Nkomo (34)  are alleged to have fatally assaulted the now deceased, Simbarashe Chingururuve, on the night of 28 June 2025.\n\nThe fatal incident unfolded at the Dinson Iron and Steel Companys Hot Plate Bar, a site widely known for serving thousands of workers under a feeding program launched by Auxillia Mnangagwa in 2023. Witnesses say a confrontation erupted between the three men and Chingururuve, a miner reportedly seconded to Manhize by high-level political allies within ZANU PF.\n\nCCTV Footage, Confessions, and a Sewer Dump.\n\nPolice investigations revealed that the three accused chased the victim for over 200 meters from the Hot Plate Bar before assaulting him with an unknown object. He succumbed to the injuries on the spot.\n\nThe accused then dragged his body to a nearby sewage pond, where they dumped it, hoping it would wash away undetected.\n\nThe body was discovered 18 days later, floating in a flowing sewer channel.\n\nEvidence obtained includes CCTV footage of the accused pursuing the victim and recorded confessions, with one of the suspects allegedly admitting to throwing a half-brick at the deceased during the attack.\n\nBail Opposed as Accused Face Harsh Charges\n\nThe three men were arrested on 15 July 2025 and appeared in the Masvingo Magistrates Court where police opposed bail. Authorities say the accused, all originally from Bulawayo, are flight risks, and may intimidate key witnesses.\n\nTheir employers, Dinson Iron and Steel Company, have distanced themselves from the trio, stating they were not directly employed but operated independently through the Hot Plate scheme.\n\nA High Court bail application (Case No. HCMSCR960/25) by Mutendi, Mudisi and Shumba Legal Practitioners was filed on behalf of Munyaradzi Muneri and Junior Thando Nkomo, with Simbarashe Muneri named in separate proceedings.\n\nPolitical Ramifications?\n\nThe case raises serious questions about the governance and supervision of Auxillia Mnangagwas flagship feeding program. Critics argue that the programs lack of regulation and transparency may have enabled rogue elements to infiltrate critical national infrastructure sites.\n\nEqually concerning is the political dimension: sources confirm that the deceased, Simbarashe Chingururuve, was a contracted technician at Manhize, seconded via networks tied to Chris Mutsvangwa, the ZANU PF Spokesman.\n\nZimEye will continue tracking this developing story.\n\nIf you have additional information or were present at the Hot Plate Bar on 28 June, contact our investigations desk anonymously at:[emailprotected].\n\nMore to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By ZimEye Investigations Desk | MASVINGO – A shocking murder has rocked the Dinson Iron and Steel Company community after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/%f0%9f%94%b4-breaking-news-murder-three-auxillia-mnangagwa-hotplate-caterers-chase-out-chris-mutsvangwas-manhize-miner-kill-him-dump-body-in-flowing-sewage/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 BREAKING NEWS | MURDER: Three Auxillia  Hotplate Caterers Chase Out Manhize Miner, Kill Him, Dump Body in Flowing Sewage\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "Susan Mutami Drops Explosive Allegations Against Mnangagwa and Mzembi",
            "url": "https://www.zimeye.net/2025/07/27/susan-mutami-drops-explosive-allegations-against-mnangagwa-and-mzembi/",
            "content": "By A Correspondent-Controversial Australia-based philanthropist Susan Mutami has reignited political tensions with a series of explosive claims involving President Emmerson Mnangagwa, former Tourism Minister Walter Mzembi, and other high-profile figures in Zimbabwes ruling elite.\n\nIn a lengthy social media rant, Mutami questioned the wisdom behind Mzembis return to Zimbabwe, warning that Mnangagwa, whom she described as vindictive and unforgiving, could pose a serious threat to the former ministers life.\n\nCan yall please explain to me why you dont listen when I give warnings? No one knows Mnangagwa and his crew the way I do, Mutami posted. Who advised Walter Mzembi to return to Harare without a proper change of guard?\n\nShe alleged that Mnangagwa and Mzembi have long been at odds, tracing their fallout to an incident in London during Mzembis tenure as Tourism Minister. According to Mutami, Mzembi witnessed something he wasnt supposed to see, leading to lasting animosity between the two.\n\nMnangagwa doesnt forgive and he doesnt forget. He will lure you in and crush you like a fly, she warned.\n\nMutami further claimed that Mzembi had tried to prevent the alleged assassination of the late Foreign Affairs Minister Sibusiso Moyo, but his warning went unheeded.\n\nThe day SB Moyo was assassinated, Walter called Loice Matanda-Moyo to warn her, but she dismissed him. He tried to save SB Moyo, Mutami wrote.\n\nShe also dragged in other political figures, including businessman Kuda Tagwirei and exiled former minister Saviour Kasukuwere, saying theres no honour among thieves. Mutami alleged that Vice President Constantino Chiwenga survived an assassination attempt by Mnangagwa only because of Chinese intervention.\n\nIf it wasnt for Xi Jinping and his trusted professionals, Chiwenga would be dead, she said.\n\nMutami ended her rant with a cryptic message suggesting she holds more damaging secrets:Musoro wangu wakatakura ma secrets kufa kwako kucharwadza vakawanda my baby daddy, she said, in what appeared to be a dig at former Norton MP Temba Mliswa.\n\nHer claims, though unverified, have sparked heated debate on social media and further fuelled intrigue around internal Zanu PF rivalries.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Controversial Australia-based philanthropist Susan Mutami has reignited political tensions with a series of explosive claims involving President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/susan-mutami-drops-explosive-allegations-against-mnangagwa-and-mzembi/\">Continue reading<span class=\"screen-reader-text\"> \"Susan Mutami Drops Explosive Allegations Against Mnangagwa and Mzembi\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "CIO Minister Who Briefly Handed Over Country To Tsvangirai As Election Winner, Turns 89.",
            "url": "https://www.zimeye.net/2025/07/27/cio-minister-who-briefly-handed-over-country-to-tsvangirai-as-election-winner-turns-89/",
            "content": "By A Correspondent | ZimEye | The Former Politburo Member and state security minister, Didymus Mutasa, has turned 89.\n\nCde DNE Mutasa, also known as Didymus Noel Edwin Mutasa, is now 89 years old, and was born on July 27, 1935. Hes had a long and influential career in Zimbabwean politics, serving in various roles, including Speaker of Parliament and Minister of State for National Security, Lands, Land Reform, and Resettlement.\n\nHon Mutasa who is the most mocked minister by President Emmerson Mnangagwa for accepting the election results that elevated the late Morgan Tsvangirai to a presidential win in March 2008.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | The Former Politburo Member and state security minister, Didymus Mutasa, has turned 89. Cde … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/cio-minister-who-briefly-handed-over-country-to-tsvangirai-as-election-winner-turns-89/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Minister Who Briefly Handed Over Country To Tsvangirai As Election Winner, Turns 89.\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "BREAKING: Temba Mliswa Elected VP",
            "url": "https://www.zimeye.net/2025/07/27/breaking-temba-mliswa-elected-vp/",
            "content": "video loading below\n\nTemba Mliswa Elected Vice President of African Parliamentarians Network Against Corruption (APNAC)\n\nBy ZimEye Newsdesk | 27 July 2025 | Cotonou, Benin | Former Norton MP, Temba Mliswa, has been elected Vice President of the African Parliamentarians Network Against Corruption (APNAC), in a landmark move that positions Zimbabwe at the heart of Africas legislative fight against corruption.\n\nThe decision was made unanimously during APNACs Board Meeting held from July 23 to 25, 2025, in Cotonou, Benin. Mliswa replaces Hon. Edouardo Namburete of Mozambique, who has recently been appointed as ambassador.\n\nZimEye first revealed on Saturday that members gathered in Benin had resolved to vote for the outspoken former legislator, with formal confirmation coming in the networks final communique issued Sunday night.\n\nAPNACs Statement\n\nIn the communique, APNAC declared:\n\nHonourable Peter Mliswa Temba (Zimbabwe) is elected as the Vice-president of the Board to replace the Honourable Edouardo Namburete (Mozambique), who has been appointed as an ambassador.\n\nThe board, comprised of delegates from Benin, Cameroon, Cte dIvoire, Ghana, Rwanda, and Zimbabwe, deliberated on a number of institutional reforms and new anti-corruption strategies, including:\n\nSymbolic Victory for Zimbabwe\n\nMliswas appointment marks a rare international endorsement of a Zimbabwean parliamentarian, elevating the countrys role in continental anti-corruption efforts. Known for his fiery independence and past clashes with top political figures, Mliswas elevation could inject momentum into APNACs visibility drive.\n\nCommenting shortly after his election, Mliswa told ZimEye:\n\nI am very humbled .. this is through my standing for the people of Zimbabwe I am very excited about having been given this opportunity .\n\nAPNACs next Biennial General Meeting will be hosted by Ghana in November 2025, where further decisions on constitutional amendments and funding strategies will be tabled.\n\nAbout APNAC:\n\nThe African Parliamentarians Network Against Corruption is a continental coalition of national parliamentary chapters, formed to promote accountability, transparency, and the rule of law through coordinated legislative action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below Temba Mliswa Elected Vice President of African Parliamentarians’ Network Against Corruption (APNAC) By ZimEye Newsdesk | 27 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/breaking-temba-mliswa-elected-vp/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Temba Mliswa Elected VP\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "WATCH: President Mnangagwa Deleted VP Chiwenga And Marry In His Official Biography",
            "url": "https://www.zimeye.net/2025/07/27/watch-president-mnangagwa-deleted-vp-chiwenga-and-marry-in-his-official-biography/",
            "content": "WAR VETS: WE DONT BOW TO THE PHILLIP TYPEhttps://t.co/6JsxwYBT3R\n\nvideo loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "FC Platinum Bus Collides With Car After Match Victory",
            "url": "https://www.zimeye.net/2025/07/27/fc-platinum-bus-collides-with-car-after-match-victory-2/",
            "content": "By Sports Correspondent\n\nThe FC Platinum team bus was involved in a road traffic accident on Saturday evening, just 33 kilometres from Triangle, shortly after the teams Castle Lager Premier Soccer League clash against Green Fuel.\n\nAccording to reports, the accident occurred when a vehicle attempted to overtake another but failed to notice an oncoming car, swerving into the FC Platinum bus to avoid a head-on collision. The impact caused minor damage, but no serious injuries were reported.\n\nThe incident took place as the team was travelling back after securing a 1-0 victory against Green Fuel.\n\nAuthorities are yet to release an official statement, but preliminary indications suggest reckless driving by the overtaking vehicle may have contributed to the crash.\n\nThe FC Platinum camp has not issued any comment, but all players and officials are reported to be safe.\n\nThe match earlier in the day saw FC Platinum edge Green Fuel with a narrow 1-0 win, strengthening their campaign in the ongoing Premier Soccer League season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent The FC Platinum team bus was involved in a road traffic accident on Saturday evening, just 33 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/fc-platinum-bus-collides-with-car-after-match-victory-2/\">Continue reading<span class=\"screen-reader-text\"> \"FC Platinum Bus Collides With Car After Match Victory\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "Zimfest Organisers Fined £3,000 After Revelers Caught Peeing in Public Spaces",
            "url": "https://www.zimeye.net/2025/07/27/zimfest-organisers-fined-3000-after-revelers-caught-peeing-in-public-spaces/",
            "content": "By A Correspondent\n\nThe organisers of Zimbabwes flagship diaspora event, Zimfest UK, have been hit with a 3,000 fine by British authorities after at least 15 heaps of human faeces were discovered around the venue and surrounding roads following the event.\n\nHeld over the weekend, the festival drew scores of Zimbabweans in celebration of their music, food, and culturebut the aftermath left a stain on its reputation.\n\nCouncil workers and local residents were shocked by the sight of human stool littering public areas, along with used condoms and overflowing rubbish bins.\n\nA viral image of a woman squatting during the festival has intensified public backlash, with many criticising the organisers for failing to provide enough toilet facilities.\n\nThis is an absolute embarrassment for the community, said one attendee. You cant host thousands and not have proper sanitation.\n\nIn a brief statement, Zimfest organisers acknowledged the issue but blamed a small number of attendees for acting irresponsibly. They vowed to implement stricter sanitation measures going forward.\n\nMeanwhile, the viral photo has triggered debates over online decency, with activists warning against using the incident to shame individuals, especially women, while still calling for accountability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The organisers of Zimbabwe’s flagship diaspora event, Zimfest UK, have been hit with a £3,000 fine by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/zimfest-organisers-fined-3000-after-revelers-caught-peeing-in-public-spaces/\">Continue reading<span class=\"screen-reader-text\"> \"Zimfest Organisers Fined £3,000 After Revelers Caught Peeing in Public Spaces\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "Tagwirei Still In The Game, Says Brighton Mutebuka",
            "url": "https://www.zimeye.net/2025/07/27/tagwirei-still-in-the-game-says-brighton-mutebuka/",
            "content": "By A Correspondent\n\nProminent Zimbabwean businessman Kudakwashe Tagwirei has once again found himself at the centre of political debate following a public show of camaraderie with President Emmerson Mnangagwa on the golf course  a moment political analyst Brighton Mutebuka says was no accident, but a calculated signal that Tagwirei remains a key player in the ZANU PF power matrix.\n\nThe footage, which shows Tagwirei sharing a light-hearted side embrace with President Mnangagwa while the two laugh together, has reignited speculation about the internal dynamics within the ruling party  particularly after Tagwireis recent failed bid to join ZANU PFs Central Committee.\n\nUK-based legal expert and political commentator Brighton Mutebuka believes the embrace was more than a casual moment.\n\nThrough that public side embrace of ED, nonchalantly gliding into his personal space  with both giggling  the signal was clear, said Mutebuka. The two are somewhat joined at the hip and enjoy intimate and cordial relations away from the prying eyes.\n\nJust days earlier, Tagwirei had been dealt what appeared to be a political blow when his bid for a seat in the powerful Central Committee was blocked  a move interpreted as a victory for his rivals in the party, including spokesperson Chris Mutsvangwa and Vice President Constantino Chiwenga.\n\nAccording to Mutebuka, Tagwireis body language on the golf course was no accident.\n\nIt seemed like it was an assignment borne out of the collision of desperation and cunning, he said, so that Tagwirei could showcase his defiance, resilience and closeness to ED to his political enemies and the rest of the country  and reinforce the message that he retains EDs confidence, is not isolated, teetering or going anywhere.\n\nMutebuka also noted that President Mnangagwas body language appeared slightly restrained, possibly due to the political sensitivities surrounding the moment.\n\nEDs fairly guarded manner could be down to his subconscious ode to protocol  or his awareness of the political difficulties that could arise from projecting public over-cosiness to a man who has gained notoriety as the Alpha Chigananda nationally  particularly so soon after the Central Committee debacle, Mutebuka explained.\n\nLooking ahead, Mutebuka believes the incident signals more political manoeuvring to come.\n\nWe have likely not heard the last of the attempt to catapult Tagwirei into the Central Committee, he said. Based on what I have seen there, which is just a microcosm of the strength of ties between the two  we should expect a more full-blooded tilt at it, with ED giving it all his might and mobilising all his assets and the power of incumbency to help overcome Chiwenga, Mutsvangwa et als spirited resistance.\n\nMutebuka added that the golf embrace was designed to send a message to all power players within ZANU PF and beyond.\n\nMake no mistake about it  egos were mightily bruised, and this is what has been cobbled up as the perfect response, he said. Through this footage, ZANU PFs structures, state institutions, EDs allies and enemies alike have all been put on notice that Tagwirei is still very much part of the fabric regardless of whether or not he is a Chigananda.\n\nThe incident marks yet another chapter in the ongoing saga of ZANU PF succession politics  one where symbolism, appearances, and carefully staged moments carry enormous weight in determining who remains in the game.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Prominent Zimbabwean businessman Kudakwashe Tagwirei has once again found himself at the centre of political debate following … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/tagwirei-still-in-the-game-says-brighton-mutebuka/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Still In The Game, Says Brighton Mutebuka\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        },
        {
            "title": "FC Platinum Bus Collides With Car After Match Victory",
            "url": "https://www.zimeye.net/2025/07/27/fc-platinum-bus-collides-with-car-after-match-victory/",
            "content": "By A Correspondent\n\nThe FC Platinum team bus was involved in a road traffic accident on Saturday evening, just 33 kilometres from Triangle, shortly after the teams Castle Lager Premier Soccer League clash against Green Fuel.\n\nAccording to reports, the accident occurred when a vehicle attempted to overtake another but failed to notice an oncoming car, swerving into the FC Platinum bus to avoid a head-on collision. The impact caused minor damage, but no serious injuries were reported.\n\nThe incident took place as the team was travelling back after securing a 1-0 victory against Green Fuel.\n\nAuthorities are yet to release an official statement, but preliminary indications suggest reckless driving by the overtaking vehicle may have contributed to the crash.\n\nThe FC Platinum camp has not issued any comment, but all players and officials are reported to be safe.\n\nThe match earlier in the day saw FC Platinum edge Green Fuel with a narrow 1-0 win, strengthening their campaign in the ongoing Premier Soccer League season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The FC Platinum team bus was involved in a road traffic accident on Saturday evening, just 33 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/27/fc-platinum-bus-collides-with-car-after-match-victory/\">Continue reading<span class=\"screen-reader-text\"> \"FC Platinum Bus Collides With Car After Match Victory\"</span></a></p>",
            "time": "09:41",
            "date": "28 Jul 2025"
        }
    ]
}