{
    "news": [
        {
            "title": "Mnangagwa Fires Another Chiwenga Ally",
            "url": "https://www.zimeye.net/2025/03/07/mnangagwa-fires-another-chiwenga-ally/",
            "content": "By Munacho Gwamanda-The ongoing power struggle between President Emmerson Mnangagwa and his deputy, Vice President Constantino Chiwenga, has claimed another political casualty, with the Zanu PF Politburo expelling Gutu East MP Benjamin Ganyiwa.\n\nHis removal follows a broader purge targeting Chiwengas keyallies,as Mnangagwa consolidates his grip on power ahead of looming internal party contests.\n\nGanyiwawas expelledon allegations of attempting to unconstitutionally remove six district chairpersons, fanning factionalism, and holding unauthorised meetings where President Mnangagwawas reportedly criticised.\n\nHis ousting is the latest in a series of dismissals aimed at dismantling Chiwengas support base within the ruling party.\n\nThe announcement was made by Zanu PFs legal affairs secretary, Patrick Chinamasa, on Thursday.\n\nWhile Ganyiwawas expelled, Roy Bila, the MP for Chiredzi North, was exonerated of all charges, whileCalisto Bangu was referred to the National Disciplinary Committee to address accusations of undermining the party.\n\nThe purge extended beyond Ganyiwa, with several other senior party members removed.\n\nGifford Gomwe from Mashonaland Westwas expelledfor creating a WhatsApp groupallegedlyundermining the party.\n\nIn Masvingo, Kudakwashe Gopowas dismissedfor disrupting District Coordinating Committee (DCC) meetings and forming a similar WhatsApp group.\n\nIn Harare, former Provincial Political Commissar Kudakwashe Damson was handed a three-year suspension for multiple charges, while DCC 2 chairman Godwin Gomwewas expelledfor factionalism and indiscipline.\n\nAnother Harare provincial figure, Edson Ringwa, was expelled for illegally parcelling out stands in Chitungwiza, among other allegations.\n\nThe purge also claimed Victor Manungo,accusedof spreading falsehoods and sowing disunity within the party through social media.\n\nAccording to Chinamasa, Manungohaddemonstrated disloyalty through online platforms,leadingto his expulsion.\n\nSimilarly, Spencer Muterowas expelledfor administering a social media groupthat wasdeemed antagonistic to the partys agenda.\n\nChinamasa stated that Mutero personally attacked Mnangagwa, violating party regulations.\n\nInitially, the province had recommended a three-year suspension, but the Politburo opted for outright expulsion due to the severity of the offence.\n\nMeanwhile, Blessing Kambumu, accused of secretly creating a fake social media account and insubordination, was stripped of his position but retained as a card-carrying member without leadership privileges for three years.\n\nFormer Harare Provincial Womens League chairperson Ratidzo Mukarati,whowaspreviously suspendedfor fanning factionalism, was demoted to a lesser influential position within the league.\n\nThis latest crackdown follows the earlier expulsion of key Chiwenga allies, including Blessing Geza, highlighting the widening rift between Mnangagwa and his deputy.\n\nMnangagwa has been systematically removing individuals perceived as loyal to Chiwenga, reinforcing his hold on the party and neutralising any potential challengers.\n\nThe intensifying power struggle stems from deep-seated factional tensions dating back to the 2017 military coup that ousted the late Robert Mugabe.\n\nWhile Chiwenga played a pivotal role in installing Mnangagwa, relations between the two have soured, with Chiwengas faction reportedly pushing for leadership change ahead of Zanu PFs internal elections.\n\nThe purge signals Mnangagwas determination to weaken his deputys influence, ensuring that any dissent within the partyis swiftly dealtwith.\n\nAs the factional battle escalates, more Chiwenga alliesare expectedto face similar consequences, further consolidating Mnangagwas dominance within Zanu PF.\n\nChinamasa emphasised that the actions taken reflect the partys commitment to discipline and unity, though critics argue they are a strategic move to eliminate political rivals. It is crucial that we uphold discipline within the party, he stated.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-The ongoing power struggle between President Emmerson Mnangagwa and his deputy, Vice President Constantino Chiwenga, has claimed another … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/mnangagwa-fires-another-chiwenga-ally/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Fires Another Chiwenga Ally \"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "No Joy for Chimombe as the Supreme Court Tosses Off his Appeal",
            "url": "https://www.zimeye.net/2025/03/07/no-joy-for-chimombe-as-the-supreme-court-tosses-off-his-appeal/",
            "content": "By A Correspondent | ZimEye | It never rains but pours for incarcerated businessman Mike Chimombe who just had his appeal for bail thrown out by the Supreme Court.\n\nChimombe is accused of abusing funds related to Presidential goat-pass-on scheme and is jointly charged with Moses Mpofu.\n\nMpofus appeal before the same Court is yet to be finalised.\n\nChimombe had approached the upper court arguing that the High Court erred in failing to find that he was suitable for bail.\n\nHe also accused High Court judge Pisirayi Kwenda of relying on the ruling by the magistrate in determining the appeal yet there were changed circumstances.\n\nBut the Supreme Court found no favour with his arguments and ruled the High Courts ruling will stand.\n\nOn 6 March 2025, the Supreme Court dismissed Mike Chimombes bail appeal, upholding the High Courts decision to deny him bail.\n\nThe court found that the state had established compelling reasons for his continued detention, including the likelihood of absconding, the seriousness of the charges and the risk of interfering with witnesses, said the National Prosecuting Authority.\n\nChimombe has and his partner have been languishing in jail since June last year.\n\nAll their efforts to secure freedom have failed.\n\nTheir trial has however failed to take off since last year, hearing gets postponed for varying reasons.\n\nChimombe is represented by Ashiel Mugiya and Lovemore Madhuku.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | It never rains but pours for incarcerated businessman Mike Chimombe who just had his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/no-joy-for-chimombe-as-the-supreme-court-tosses-off-his-appeal/\">Continue reading<span class=\"screen-reader-text\"> \"No Joy for Chimombe as the Supreme Court Tosses Off his Appeal\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "Bosso Seek Redemption",
            "url": "https://www.zimeye.net/2025/03/07/bosso-seek-redemption/",
            "content": "Sports Correspondent\n\nHighlanders coach Kelvin Kaindu has attributed the teams defeat to MWOS in their opening match of the season to inadequate pre-season preparations.\n\nBosso were defeated 1-0 by PSL newcomers MWOS in a game played at Baobab Stadium in Ngezi on Sunday. The lone goal of the match came in the 67th minute, with Tafadzwa George finding the back of the net for the hosts.\n\nAfter the loss, Kaindu expressed disappointment with his teams performance, acknowledging the lack of a strong response. He said, Not a good start, it was a difficult game, difficult for both teams. We didnt have flashy moments, and its unfortunate we gave away an easy goal. In a game like this, its difficult to come back.\n\nKaindu further explained that their poor pre-season preparations contributed to the outcome, stating, During pre-season we didnt have training grounds. I think we went for nearly a month without a proper training ground, so we are trying to use these early games to condition ourselves and catch up.\n\nDespite the setback, the coach remains optimistic, saying, I think there is big room for improvement. Like I said, its the first game, it was just for us to assess where we are, and Im convinced we can do better.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Highlanders coach Kelvin Kaindu has attributed the team’s defeat to MWOS in their opening match of the season … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/bosso-seek-redemption/\">Continue reading<span class=\"screen-reader-text\"> \"Bosso Seek Redemption\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "Caps United, Scottland FC Clash In Epic Tie",
            "url": "https://www.zimeye.net/2025/03/07/caps-united-scottland-fc-clash-in-epic-tie/",
            "content": "By A Correspondent\n\nThe Castle Lager Premier Soccer League (PSL) continues to showcase exciting matchups as the second round of fixtures kicks off this weekend. Among the highly anticipated games, Caps United will face off against Scottland FC in what promises to be an epic encounter on Sunday, 9th March 2025, at the iconic Rufaro Stadium.\n\nWith both teams eager to prove their mettle early in the season, this clash is set to be one of the highlights of Match Day 2. Caps United, traditionally one of the powerhouses in Zimbabwean football, will be looking to bounce back from any early setbacks and make a statement, while Scottland FC, fresh off their PSL debut, are keen to impress in front of their growing fan base.\n\nOther fixtures scheduled for the weekend include a thrilling Friday matchup between Yadah FC and Chicken Inn FC on 7th March at the Heart Stadium, followed by an action-packed Saturday with games such as Telone FC versus Triangle United, Ngezi Platinum Stars facing Greenfuel FC, and more.\n\nFor the full rundown of the Castle Lager Premier Soccer League fixtures:\n\nFriday, 7th March 2025:\n\nYadah FC vs Chicken Inn FCVenue: Heart StadiumTime: 15:00hrs\n\nSaturday, 8th March 2025:\n\nTelone FC vs Triangle United FCVenue: Baobab StadiumTime: 15:00hrs\n\nNgezi Platinum Stars FC vs Greenfuel FCVenue: Sakubva StadiumTime: 15:00hrs\n\nBikita Minerals FC vs MWOS FCVenue: Mandava StadiumTime: 15:00hrs\n\nFC Platinum vs Manica Diamonds FCVenue: Nyamhunga StadiumTime: 15:00hrs\n\nZPC Kariba FC vs Simba Bhora FCVenue: Rufaro StadiumTime: 15:00hrs\n\nHerentals College FC vs Dynamos FCVenue: Barbourfields StadiumTime: 15:00hrs\n\nSunday, 9th March 2025:\n\nCaps United FC vs Scottland FCVenue: Rufaro StadiumTime: 15:00hrs\n\nHighlanders FC vs Kwekwe United FCVenue: Barbourfields StadiumTime: 15:00hrs\n\nAs the league progresses, these games will provide the perfect opportunity for teams to build momentum or correct early-season mistakes. The upcoming fixtures offer plenty of promise, and fans can expect thrilling football action across Zimbabwes football venues.\n\nAll matches are set to kick off at 15:00hrs local time, and with teams eager to secure crucial points, the Castle Lager Premier Soccer League remains as exciting as ever.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Castle Lager Premier Soccer League (PSL) continues to showcase exciting matchups as the second round of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/caps-united-scottland-fc-clash-in-epic-tie/\">Continue reading<span class=\"screen-reader-text\"> \"Caps United, Scottland FC Clash In Epic Tie\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "Share the Road: A Reminder of Pedestrian Safety and Road Courtesy",
            "url": "https://www.zimeye.net/2025/03/07/share-the-road-a-reminder-of-pedestrian-safety-and-road-courtesy/",
            "content": "When we think about roads, its easy to focus on the vehicles that use them. But roads arent just meant for cars, trucks, and bikes; they are shared spaces where pedestrians also have the right to walk.\n\nAs drivers, we have a responsibility to ensure the safety of everyone using the road, including those on foot.\n\nPedestrians are vulnerable road users. Whether they are crossing at a designated crosswalk or walking along the roadside, they deserve the same respect and attention that drivers give to other vehicles.\n\nSlowing down when approaching a pedestrian crossing isnt just a courtesyits a critical safety measure. Pedestrians have the right of way, and as drivers, its our job to make sure they can cross the road safely.\n\nIf you spot a pedestrian already in the crosswalk, dont hesitate to stop and allow them to finish crossing before proceeding. Its essential to give them the time they need to move safely without rushing or creating a dangerous situation. It only takes a few seconds, but it can make all the difference in ensuring that no one gets hurt.\n\nPracticing road courtesy doesnt only apply to pedestrians. As a responsible driver, your actions behind the wheel should always prioritize safety, not just for yourself but for everyone around you. Being aware of pedestrians, staying alert to crossing signals, and yielding when necessary are all parts of safe defensive driving.\n\nUltimately, safety begins with us. Its not enough to drive safely in terms of speed limits and traffic signals; we must also be vigilant and empathetic toward those who might be at greater risk on the roads. So, lets share the road and respect pedestrian rightsby doing so, we can help create a safer, more considerate environment for everyone.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When we think about roads, it’s easy to focus on the vehicles that use them. But roads aren’t just meant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/share-the-road-a-reminder-of-pedestrian-safety-and-road-courtesy/\">Continue reading<span class=\"screen-reader-text\"> \"Share the Road: A Reminder of Pedestrian Safety and Road Courtesy\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "SADC Countries’ Truckers Join Blessed Geza To Demand Mnangagwa Removal",
            "url": "https://www.zimeye.net/2025/03/07/sadc-countries-truckers-join-blessed-geza-to-demand-mnangagwa-removal/",
            "content": "SADC TRUCK DRIVERS DEMAND MNANGAGWA MUST STEP DOWNhttps://t.co/0v5Xzdn9EO\n\nhttps://t.co/uxivJ5SjnH\n\nTruck drivers of various countries executed a protest yesterday demanding Emmerson Mnangagwa must step down.pic.twitter.com/aKPPmdsygm\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "Desperate Mnangagwa Regime In Secret Plan To Detect Ghost Accounts On Social Media",
            "url": "https://www.zimeye.net/2025/03/07/desperate-mnangagwa-regime-in-secret-plan-to-detect-ghost-accounts-on-social-media/",
            "content": "By A Correspondent\n\nIn a desperate move to monitor and control internal party communication, the Mnangagwa regime is planning to employ new technology to detect and shut down ghost accounts on social media.\n\nThis covert plan aims to clamp down on the growing issue of fake and anonymous accounts that are believed to be fueling discord within the ruling party, Zanu PF.\n\nDuring a media briefing in Harare on Thursday, Patrick Chinamasa, the partys Secretary for Legal Affairs, disclosed that the government had started developing an advanced system to track these ghost accounts, a move he claimed was critical to safeguarding party unity and maintaining discipline among members.\n\nWe now have technology capable of detecting ghost accounts on social media, Chinamasa announced, signaling a more aggressive approach to monitoring online activity.\n\nThis will help us identify and neutralize those who use fake accounts to destabilize the party.\n\nThe revelation of the Mnangagwa regimes plans follows a surge in factionalism within the party, largely fueled by the uncontrolled spread of misinformation and division through platforms like WhatsApp and other social media channels. Chinamasa added, We must take a firm stance and address indiscipline. Anyone who uses social media to undermine the party will be held accountable.\n\nThe Growing Concern Over Social Media Disruption\n\nThe decision to employ high-tech surveillance tools comes after a series of disciplinary actions within the party, including the expulsion of several members accused of using social media to undermine the unity of Zanu PF. These actions were highlighted in Chinamasas address, where he stressed that the Politburo had taken significant steps to maintain party discipline.\n\nChinamasa revealed that high-ranking members were expelled or faced suspensions after they were found to be involved in disruptive social media activity. Among the most notable cases was the expulsion of Blessed Geza, who was accused of creating fake social media accounts that undermined the partys interests.\n\nOther notable expulsions included Gifford Gomwe, who created a WhatsApp group believed to be working against party cohesion, and Victor Manungu, who was dismissed for spreading falsehoods and causing disunity through social media.\n\nChinamasa confirmed that, moving forward, Zanu PF will be implementing a more structured approach to managing its digital presence. The Commissariat will develop a Social Media policy, with a team consisting of the Commissariat, Legal Department, Science Department, and Information Department, he stated. The new policy mandates that all party WhatsApp groups must receive prior approval and that administrators will be held responsible for the activities within these groups.\n\nTechnological Oversight in the Age of Social Media\n\nOne of the most notable aspects of the new plan is the introduction of technological oversight to track and detect fake social media accounts. Chinamasa explained, The technology we are developing will allow us to detect ghost accounts that have been used to create division and spread harmful content.\n\nThe introduction of this technology aligns with the regimes broader efforts to monitor and control public discourse, particularly when it comes to protecting the interests of the ruling party. Chinamasas statement comes amid growing concerns about the role of social media in shaping political narratives and influencing public opinion.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a desperate move to monitor and control internal party communication, the Mnangagwa regime is planning to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/desperate-mnangagwa-regime-in-secret-plan-to-detect-ghost-accounts-on-social-media/\">Continue reading<span class=\"screen-reader-text\"> \"Desperate Mnangagwa Regime In Secret Plan To Detect Ghost Accounts On Social Media\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "Police Officer Shot Dead in Bulawayo While on Duty",
            "url": "https://www.zimeye.net/2025/03/07/police-officer-shot-dead-in-bulawayo-while-on-duty/",
            "content": "By A Correspondent\n\nA tragic incident occurred in Bulawayo on Thursday night, March 6, 2025, when Detective Constable Cassandra Hove, a member of the Zimbabwe Republic Polices CID Homicide division, was shot dead while on duty.\n\nThe fatal shooting took place in the Harbek area, located in Pumula South, as Constable Hove was actively pursuing suspects involved in an armed robbery.\n\nIn an official press statement released on March 7, 2025, the Zimbabwe Republic Police confirmed the death of Constable Hove.\n\nThe statement emphasized that investigations are underway to uncover the full details of the tragic event. The police also expressed their condolences to the bereaved family of the fallen officer.\n\nInvestigations are being conducted in connection with the tragic and unfortunate death of Detective Constable Cassandra Hove of CID Homicide Bulawayo, the statement read. She was killed while pursuing armed robbery suspects in the Harbek area, Pumula South, Bulawayo.\n\nCommissioner-General of Police, Stephen Mutamba, also expressed his deep sorrow, offering condolences to the family of Constable Hove. On behalf of the entire Zimbabwe Republic Police, I would like to express our heartfelt condolences to the family of Detective Constable Hove, said Commissioner Mutamba. This is an extremely sad and unfortunate event, and we assure the public that comprehensive investigations are underway to establish exactly what transpired.\n\nThe police force reaffirmed its commitment to combating armed robbery and other violent crimes, reiterating that there would be no going back in their efforts to fight such criminal activities in the country. The statement urged the public to remain vigilant and report any information on criminal movements. Members of the public were encouraged to reach out through the ZRPs designated numbers: 0242703631 for desk inquiries and 0712800197 via WhatsApp for confidential tips.\n\nWhile we mourn the loss of one of our own, the fight against armed robberies and other violent crimes continues. We urge the public to cooperate with the police and report any suspicious activity to assist in bringing perpetrators to justice, the statement concluded.\n\nConstable Hoves death marks a somber reminder of the dangers faced by law enforcement officers as they work to maintain peace and security in the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident occurred in Bulawayo on Thursday night, March 6, 2025, when Detective Constable Cassandra Hove, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/police-officer-shot-dead-in-bulawayo-while-on-duty/\">Continue reading<span class=\"screen-reader-text\"> \"Police Officer Shot Dead in Bulawayo While on Duty\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "Mnangagwa Administration Blames US Dollar For Surge in Drug Abuse",
            "url": "https://www.zimeye.net/2025/03/07/mnangagwa-administration-blames-us-dollar-for-surge-in-drug-abuse/",
            "content": "By A Correspondent\n\nGovernment spokesperson Nick Mangwana sparked controversy on Thursday when he placed the blame for the rise in drug abuse in Zimbabwe squarely on the use of the US dollar.\n\nWriting on social media platform X, Mangwana claimed that the widespread use of the US dollar in the country had inadvertently fueled the proliferation of drug and substance abuse.\n\nThe widespread use of the USD in Zimbabwe has inadvertently created a haven for drug peddlers and pushers, Mangwana wrote. These unscrupulous individuals are drawn to the countrys dollarized economy, seeking to capitalize on the lucrative opportunities it presents.\n\nMangwanas comments quickly drew criticism, with many questioning his reasoning and the logic behind attributing drug abuse to Zimbabwes use of foreign currency. While some supported his argument, others were quick to point out that the issue of drug abuse is far more complex.\n\nA senior medical doctor based in Masvingo, who chose to remain anonymous, strongly disagreed with Mangwanas hypothesis. Surely there is need for us to get down to the serious matters leading to the high incidence of drug abuse. You cant blame the US dollar for the proliferation of drug abuse. Its absurd, the doctor said.\n\nDrug abuse is a complex social issue involving a wide range of factors, including poverty, lack of education, and mental health challenges, not simply the currency used in transactions.\n\nThe doctors remarks reflect growing frustration with oversimplified explanations for the drug crisis in Zimbabwe. The country has seen a marked increase in the abuse of substances like crystal meth (mutoriro) and marijuana, a trend that has raised alarms among health professionals and community leaders alike.\n\nMangwanas statement has sparked a broader debate about the root causes of drug abuse in Zimbabwe. While some may agree with the government spokespersons viewpoint, the majority argue that economic instability, inadequate rehabilitation services, and societal pressures are more significant drivers of the issue.\n\nAs Zimbabwe continues to grapple with drug abuse, many believe that more attention should be placed on tackling the underlying causes, rather than pointing fingers at external factors like the US dollar.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Government spokesperson Nick Mangwana sparked controversy on Thursday when he placed the blame for the rise in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/mnangagwa-administration-blames-us-dollar-for-surge-in-drug-abuse/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Administration Blames US Dollar For Surge in Drug Abuse\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        },
        {
            "title": "Release Blessed Mhlanga: Citizens Youth Leader Tells Mnangagwa",
            "url": "https://www.zimeye.net/2025/03/07/release-blessed-mhlanga-citizens-youth-leader-tells-mnangagwa/",
            "content": "By A Correspondent\n\nFormer CCC Youth Assembly spokesperson Stephen Sarkozy Chuma has called on President Emmerson Mnangagwa to release jailed journalist Blessed Mhlanga.\n\nMhlanga was arrested and denied bail after interviewing outspoken war veteran Blessed Geza.\n\nSpeaking in St Marys, Ward 3, on Friday, Chuma accused the Zanu PF regime of violating citizens rights.\n\nChuma was accompanied by Councillor Chabuka and local youths from the ward during the address.\n\nWatch: Stephen Sarkozy Chuma Demands Immediate Release Of Journalist Blessed Mhlangapic.twitter.com/vFJgkFCgH5\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former CCC Youth Assembly spokesperson Stephen Sarkozy Chuma has called on President Emmerson Mnangagwa to release jailed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/07/release-blessed-mhlanga-citizens-youth-leader-tells-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Release Blessed Mhlanga: Citizens Youth Leader Tells Mnangagwa\"</span></a></p>",
            "time": "20:40",
            "date": "07 Mar 2025"
        }
    ]
}