{
    "news": [
        {
            "title": "Chinese Nationals In Fierce Fight In Chitungwiza",
            "url": "https://www.zimeye.net/2025/04/15/chinese-nationals-in-feirce-fight-in-chitungwiza/",
            "content": "By Crime and Courts Reporter- Police in Chitungwza have arrested Chinese national Huang Ping, 63, for stabbing his partner Duan Bingeng, 64, several times following a misunderstanding during a business meeting.\n\nHuang Ping, 63, of Heiyin Pvt Limited Tilco Industries in Chitungwiza was reported to have used a butchers knife to stab his partner Duan Bingeng, 64, several times and the victim sustained injuries on both hands and thigh.\n\nDuan was rushed to Mbuya Dorcas Hospital in Waterfalls where he was admitted.\n\nThe two were having a business meeting in the boardroom at Heiyin (Pvt) Limited Tilco Industries in Chitungwiza.\n\nDuring the meeting, Duan was watching an investment video from his laptop when he had a misunderstanding with Huang on the business terms and conditions.\n\nHuang was reported to have walked out of the boardroom and went into the kitchen.\n\nAfter a while he returned armed with a butchers knife.\n\nDuan sustained four deep cuts on both hands and three cuts on the right thigh and Huang was restrained from further assaulting Duan another Chinese national Yaung Zhengfang.\n\nNational police spokesperson Commissioner Paul Nyathi could not immediately be reached for comment.\n\nHowever, Huang is currently detained at ZRP Chitungwiza on docket number DB 762/25. H Metro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- Police in Chitungwza have arrested Chinese national Huang Ping, 63, for stabbing his partner Duan … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/chinese-nationals-in-feirce-fight-in-chitungwiza/\">Continue reading<span class=\"screen-reader-text\"> \"Chinese Nationals In Fierce Fight In Chitungwiza\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Woman at Centre of Emmanuel Mahamba’s Death Breaks Silence, Investigation Linked to Bryanston Police Station",
            "url": "https://www.zimeye.net/2025/04/15/woman-at-centre-of-emmanuel-mahambas-death-breaks-silence-investigation-linked-to-bryanston-police-station/",
            "content": "By Farai D Hove | ZimEye | In the case of the SA based Emmanuel Mahambas death, a woman alleged to have been in a relationship with him has finally spoken out. Her interview was broadcast live by Greathope Funeral Director Moreboys Munetsi, who has taken an active interest in the unfolding investigation.\n\nMunetsi, who was addressing his followers during a Facebook Live session, confirmed that the womanwho remains unnamedwas directly linked to the events that allegedly led to Emmanuels fatal altercation involving a Ugandan national. The live video, viewed by nearly 4,000 people in under an hour, promises to shed light on what transpired on the day Emmanuel was allegedly struck by a vehicle three times.\n\nThe live broadcast description read:\n\nI am talking to the lady arikunzi Emmanuel Mahamba was in a relationship with and she is the one who caused kuti Emmanuel aurayiwe ne this guy from Uganda. She is going to explain what happened on that day and what triggered kuti atsikwe nemota 3 times.\n\nIn his live remarks, Munetsi urged caution and strategy in handling the case, citing widespread police corruption and political interference. There is a lot of information that has surfaced tonight that we didnt know, he said. We need to be very careful and strategic with a lot of politics and corruption in the police, the investigating officer might be corrupted.\n\nMost significantly, Munetsi revealed that the murder case is now believed to be under the jurisdiction of Bryanston Police Station. While emphasizing that he was not drawing conclusions about the current officers involved, he warned of past incidents involving bribery and the silencing of key witnesses.\n\nThere is a recent case where a witness was gunned inside court. You will have to find a way of dealing with the case in a smart way, he cautioned. If they discover youre the one who is at the front, they can send someone to you to gun you down.\n\nWhile refusing to go into the legal merits of the case, Munetsi called for the protection of witnesses and suggested engaging trusted channels within the Sandton Police Station, where he claims to have strong professional relationships.\n\nThe public awaits further statements and potential arrests as Munetsi pledges to pursue the truth strategically. The case has captured national attention and raised questions about the intersection of personal tragedy, justice, and institutional integrity in South Africa.\n\nMore updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | In the case of the SA based Emmanuel Mahamba’s death, a woman alleged … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/woman-at-centre-of-emmanuel-mahambas-death-breaks-silence-investigation-linked-to-bryanston-police-station/\">Continue reading<span class=\"screen-reader-text\"> \"Woman at Centre of Emmanuel Mahamba’s Death Breaks Silence, Investigation Linked to Bryanston Police Station\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zimsec Stops Printing June Exams After Suspected Leak",
            "url": "https://www.zimeye.net/2025/04/15/zimsec-stops-printing-june-exams-after-suspected-leak/",
            "content": "A By Muancaho Gwamanda- The Zimbabwe School Examinations Council (ZIMSEC) has stopped printing Ordinary and Advanced level June examination papers after authorities in Kwekwe arrested a 23-year-old man for planning to leak them.\n\nTadiwanashe Frank Chiminya, a student at a local polytechnic college, appeared before Harare magistrate Ruth Moyofacingcharges of fraud.The name of his institution was not disclosedin court.\n\nChiminyais accusedof creating a WhatsApp group with over 900 members as part of a scheme to distribute the leaked exam papers. The complainant in the case is ZIMSEC.\n\nInvestigatingofficer,Detective Constable Inspector SizinkosiNcube,opposed bail, stating that Chiminyas actions had disrupted ZIMSECs exam preparations, forcing the suspension of printing while police investigated the alleged leak.\n\nNcube further told the court that Chiminya initially refused to unlock his phone for over six hours and posed a flight risk due to the seriousness of theoffence.\n\nThe court reserved its ruling on bail until Thursday.\n\nAccording to the prosecution, led by Ms. Nomsa Kangara, Chiminya allegedly created a WhatsApp group titledJune 2025 ZIMSEC Group and Exam Papersin November 2024 using an Econet number, 0787815406.\n\nHe claimed to have access to leaked ZIMSEC papers and solicited payments frommembers of the group.\n\nGroup memberswere instructedto send payments via Innbucks to an account registered underthe nameAdmireMagaya,using the number 0784128996.\n\nZIMSEC received a tip-off and joined the group using an invite link. Investigations revealed that Chiminya had misrepresented himself as a source of leaked exams, tarnishing the councils image and credibility.\n\nThe matter was then reportedto the police.\n\nChiminyawas arrestedon April 12 at his home in Kwekwe.\n\nPolice seized an iPhone and two Econet SIM cards0787815406 and 0784128996allegedly used in the operation.\n\nA Tecno Spark 9 device with a NetOne line, along with the WhatsApp group itself,was also taken as evidence.\n\nProsecutors said Chiminyas actions caused significant damage to ZIMSECs reputation and disrupted its administrative processes.\n\nState Media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A By Muancaho Gwamanda- The Zimbabwe School Examinations Council (ZIMSEC) has stopped printing Ordinary and Advanced level June examination papers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/zimsec-stops-printing-june-exams-after-suspected-leak/\">Continue reading<span class=\"screen-reader-text\"> \"Zimsec Stops Printing June Exams After Suspected Leak\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Manyenyeni Arrested",
            "url": "https://www.zimeye.net/2025/04/15/manyenyeni-arrested/",
            "content": "By A Correspondent | ZimEye | Former Mayor for Harare City Council Bernard Manyenyeni and ex-Acting Town Clerk Josephine Ncube have been arrested on charges of criminal abuse of duty.\n\nAllegations are that Manyenyeni and Ncube unlawfully amended a land development agreement between the City of Harare and Shelter Zimbabwe, costing the city an estimated $20 million in revenue.\n\nSometime in 2013, Harare City Council entered into an agreement authorising the development of 1 500 residential stands on 657 hectares in Tafara, Mabvuku, with Shelter Zimbabwe responsible for infrastructure.\n\nUnder the original terms, the Council was to allocate and sell the stands after servicing and reimburse Shelter Zimbabwe thereafter.\n\nHowever, in 2017, Ncube and Manyenyeni altered the agreement and authorised Shelter Zimbabwe to sell un-serviced stands.\n\nShelter Zimbabwe sold the stands but failed to develop the land and remit the money to the local authority.\n\nThe accused persons are set to appear at Harare Magistrate Court on April 16, 2025.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Former Mayor for Harare City Council Bernard Manyenyeni and ex-Acting Town Clerk Josephine Ncube … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/manyenyeni-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"Manyenyeni Arrested\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Triangle Sack Vahombe",
            "url": "https://www.zimeye.net/2025/04/15/triangle-sack-vahombe/",
            "content": "Sports Correspondent\n\nTriangle United have terminated the contract of head coach Luke  Vahombe Masomere following a dismal start to the season.\n\nThe Sugar Boys are currently propping up the Premier Soccer League table with just one point from six matches.\n\nMasomeres sacking comes as no surprise, given the teams struggles to find form and consistency. The decision is likely aimed at revitalizing the teams fortunes and pushing for a more successful campaign. Triangle United fans will be hoping that the change in leadership will bring about a much-needed turnaround in their teams performance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Triangle United have terminated the contract of head coach Luke ” Vahombe” Masomere following a dismal start to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/triangle-sack-vahombe/\">Continue reading<span class=\"screen-reader-text\"> \"Triangle Sack Vahombe\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zimsec Exams Leak",
            "url": "https://www.zimeye.net/2025/04/15/zimsec-exams-leak/",
            "content": "By Muancaho Gwamanda- Authorities in Kwkwe have arrested a23-year-oldman for planning to leak the Zimbabwe School Examinations Council (ZIMSEC) Ordinary and Advanced level June examination papers.\n\nTadiwanashe Frank Chiminya, a student at a local polytechnic college, appeared before Harare magistrate Ruth Moyofacingcharges of fraud.The name of his institution was not disclosedin court.\n\nChiminyais accusedof creating a WhatsApp group with over 900 members as part of a scheme to distribute the leaked exam papers. The complainant in the case is ZIMSEC.\n\nInvestigatingofficer,Detective Constable Inspector SizinkosiNcube,opposed bail, stating that Chiminyas actions had disrupted ZIMSECs exam preparations, forcing the suspension of printing while police investigated the alleged leak.\n\nNcube further told the court that Chiminya initially refused to unlock his phone for over six hours and posed a flight risk due to the seriousness of theoffence.\n\nThe court reserved its ruling on bail until Thursday.\n\nAccording to the prosecution, led by Ms. Nomsa Kangara, Chiminya allegedly created a WhatsApp group titledJune 2025 ZIMSEC Group and Exam Papersin November 2024 using an Econet number, 0787815406.\n\nHe claimed to have access to leaked ZIMSEC papers and solicited payments frommembers of the group.\n\nGroup memberswere instructedto send payments via Innbucks to an account registered underthe nameAdmireMagaya,using the number 0784128996.\n\nZIMSEC received a tip-off and joined the group using an invite link. Investigations revealed that Chiminya had misrepresented himself as a source of leaked exams, tarnishing the councils image and credibility.\n\nThe matter was then reportedto the police.\n\nChiminyawas arrestedon April 12 at his home in Kwekwe.\n\nPolice seized an iPhone and two Econet SIM cards0787815406 and 0784128996allegedly used in the operation.\n\nA Tecno Spark 9 device with a NetOne line, along with the WhatsApp group itself,was also taken as evidence.\n\nProsecutors said Chiminyas actions caused significant damage to ZIMSECs reputation and disrupted its administrative processes.\n\nState Media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Muancaho Gwamanda- Authorities in Kwkwe have arrested a 23-year-old man for planning to leak the Zimbabwe School Examinations Council (ZIMSEC) Ordinary … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/zimsec-exams-leak/\">Continue reading<span class=\"screen-reader-text\"> \"Zimsec Exams Leak\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Munetsi Praises Wolverhampton Wanderers Boss",
            "url": "https://www.zimeye.net/2025/04/15/munetsi-praises-wolverhampton-wanderers-boss-marshall/",
            "content": "By Sports Correspondent\n\nWolverhampton Wanderers midfielder Marshall Munetsi has expressed his gratitude to Wolves boss Vitor Pereira for the trust and confidence he has shown in him since joining the English Premier League side. Munetsi, who signed from Stade de Reims in January, has quickly become a regular starter for the team.\n\nMunetsi praised Pereiras approach to the game, saying, The first thing we appreciate as a player is a coach that gives you the idea of his game plan, his philosophy. He presents it to you in a way that is simple and you can understand, you can fit in very well.\n\nPereiras encouragement and support have been instrumental in boosting Munetsis confidence. After Munetsi missed some scoring opportunities in one of his early games, Pereira told him, What I love about you is that youre getting into the right positions, dont hesitate, next time go in again, keep on trying. Munetsi appreciated Pereiras words, saying they gave him the confidence to know that his coach trusts him and believes in his abilities.\n\nMunetsi also praised Pereiras leadership style, describing him as a father figure who creates a sense of identity and belonging within the team. Hes a person who gives you the identity of the club and he also makes you feel like hes a father that you can be able to talk to and you can be able to work for him, Munetsi said. With Pereiras guidance, Munetsi is working to refine his finishing skills, recognizing that its the final piece of the puzzle in his development as a player.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Wolverhampton Wanderers midfielder Marshall Munetsi has expressed his gratitude to Wolves boss Vitor Pereira for the trust … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/munetsi-praises-wolverhampton-wanderers-boss-marshall/\">Continue reading<span class=\"screen-reader-text\"> \"Munetsi Praises Wolverhampton Wanderers Boss\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Utilize Your Seatbelt Always",
            "url": "https://www.zimeye.net/2025/04/15/utilize-your-seatbelt-always/",
            "content": "By Staff Reporter\n\nBuckle up, folksbecause your life depends on it.\n\nWearing a seatbelt is not just a good idea, its a legal requirement and one of the simplest yet most effective ways to protect yourself and your loved ones on the road. Whether youre driving to the corner store or embarking on a cross-country journey, fastening your seatbelt should be second nature.\n\nIts Not OptionalIts the LawSeatbelt use is mandated by law in many countries, including Zimbabwe, and failure to comply can result in fines, license penalties, or worseserious injury or death. Statistics consistently show that seatbelts significantly reduce the risk of fatal injuries during car accidents.\n\nEvery Trip CountsNo Matter the DistanceMany people tend to neglect seatbelts on short trips, believing that the lower speed or familiar roads make them safe. But research proves otherwise. Most accidents occur within a short radius of a persons home. That means even a quick drive without a seatbelt could turn deadly.\n\nProtect the Little OnesChildren must be properly secured in age-appropriate car seats or booster seats every time they travel. These safety devices are specifically designed to protect young passengers, whose bodies are more vulnerable during collisions. As the campaign says: Children should be buckled on child booster seats. No exceptions.\n\nClick It Every TripMaking seatbelt use a habit is a small action with life-saving results. Every time you enter a vehicle, take a moment to buckle upand ensure everyone else does, too.\n\nIts Simple: Click It and Stay SafeRoad safety begins with you. The seatbelt is your first line of defense against the unexpected. So next time you get into a vehicle, remember: its not just about avoiding a ticketits about coming home alive.\n\nBuckle up. Every trip. Every time.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Staff Reporter Buckle up, folks—because your life depends on it. Wearing a seatbelt is not just a good idea, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/utilize-your-seatbelt-always/\">Continue reading<span class=\"screen-reader-text\"> \"Utilize Your Seatbelt Always\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Drunk Driver Bribes Cops After Hitting Pedestrian in Masvingo CBD",
            "url": "https://www.zimeye.net/2025/04/15/drunk-driver-bribes-cops-after-hitting-pedestrian-in-masvingo-cbd/",
            "content": "By A Correspondent\n\nMASVINGO  Outrage is mounting after a visibly drunk driver reportedly hit a pedestrian near the Family of God Church in Masvingos Central Business District and walked away without facing any consequencesallegedly after bribing police officers on the scene.\n\nAccording to eyewitnesses, the dreadlocked motorist was clearly intoxicated when he struck a pedestrian on Monday afternoon, causing panic among bystanders.\n\nInstead of showing concern, the driver allegedly became aggressive and hurled insults at onlookers who rushed in to help the injured person.\n\nHe was swerving all over the road and didnt even slow down after hitting the guy, said one witness who asked to remain anonymous. When people tried to assist, he just shouted at them and told them to mind their business.\n\nWhat has shocked residents even more is what reportedly happened next.\n\nThe driver then bribed ZRP cops with cash before driving away, another eyewitness claimed. We saw him take out some moneylooked like 15 US dollarsand handed it to the police officers. After that, they just let him go.\n\nSources at the scene said three Zimbabwe Republic Police (ZRP) officers were present but made no attempt to arrest or question the driver after receiving the alleged bribe.\n\nThe condition of the pedestrian remains unclear, and efforts to identify them are ongoing.\n\nThis incident has sparked fresh concerns about law enforcement accountability and the growing culture of impunity on Zimbabwes roads.\n\nLocal residents are now calling on authorities to investigate the matter thoroughly. Its disgraceful. If police can be bought off that easily, what hope do ordinary citizens have for justice? said another concerned bystander.\n\nThe ZRP is yet to issue a formal statement on the matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO – Outrage is mounting after a visibly drunk driver reportedly hit a pedestrian near the Family … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/drunk-driver-bribes-cops-after-hitting-pedestrian-in-masvingo-cbd/\">Continue reading<span class=\"screen-reader-text\"> \"Drunk Driver Bribes Cops After Hitting Pedestrian in Masvingo CBD\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        },
        {
            "title": "Tshabangu Boasts of Court Victory After ‘Stealing People’s Project’",
            "url": "https://www.zimeye.net/2025/04/15/tshabangu-boasts-of-court-victory-after-stealing-peoples-project/",
            "content": "Tinashe Sambiri\n\nControversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has celebrated a recent High Court ruling in his favor, describing himself as a peoples servant despite mounting criticism over his role in the party.\n\nThe High Court dismissed an application filed by senior CCC member Welshman Ncube, who had sought Tshabangus expulsion from the opposition party.\n\nIn a statement released on Tuesday, Tshabangu hailed the ruling as a personal and political triumph.\n\nGood morning. Im glad to inform you all that following my unlawful expulsion both as CCC Secretary General and from the party in general, I lawfully challenged the expulsion and the High Court dismissed it as null and void. I have bounced back as the partys Secretary General, he said.\n\nTshabangus return has sparked outrage among some CCC supporters, who accuse him of hijacking the partys agenda and undermining democratic processes within the opposition movement. Critics have labeled his maneuvers as stealing the peoples project, a reference to CCCs grassroots-driven origins.\n\nDespite the backlash, Tshabangu remains defiant, insisting his position is legitimate and backed by the courts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Controversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has celebrated a recent High Court ruling in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/15/tshabangu-boasts-of-court-victory-after-stealing-peoples-project/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Boasts of Court Victory After ‘Stealing People’s Project’\"</span></a></p>",
            "time": "21:46",
            "date": "16 Apr 2025"
        }
    ]
}