{
    "news": [
        {
            "title": "Warriors Seek To End Winless Run",
            "url": "https://www.zimeye.net/2025/11/17/warriors-seek-to-end-winless-run/",
            "content": "Sports Correspondent  Zimbabwes national football team, the Warriors, are looking to break their year-long winless streak when they take on Qatar in an international friendly match today .\n\nThe last time the Warriors tasted victory was in October 2023, when they defeated Namibia 3-1 in an AFCON qualifier.\n\nThe match against Qatar, scheduled for 18:30 HRS CAT at the Abdullah bin Khalifa Stadium, marks the second game in charge for new coach Marian Marinica. Marinicas appointment has brought a mix of optimism and controversy, with some players expressing concerns over his management style.\n\nDespite the challenges, team captain Marvelous Nakamba remains positive, emphasizing the teams focus on preparing for the upcoming AFCON 2025 tournament. We are pushing each other; its all about implementing what the new technical staff is teaching us, Nakamba said.\n\nThe match will be broadcast live on ZBC and ZTN, providing fans with an opportunity to cheer on the Warriors as they seek to snap their winless streak .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Zimbabwe’s national football team, the Warriors, are looking to break their year-long winless streak when they take … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/warriors-seek-to-end-winless-run/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Seek To End Winless Run\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Struggling ZESA Promises New Units While Blackouts Persist",
            "url": "https://www.zimeye.net/2025/11/17/struggling-zesa-promises-new-units-while-blackouts-persist/",
            "content": "Tinashe Sambiri  ZESA Holdings has unveiled plans to add four new electricity generation units to Zimbabwes grid, but the announcement has done little to reassure citizens who continue to experience frequent blackouts across the country.\n\nThe plan was revealed during an oversight visit by the Parliamentary Portfolio Committee on Energy and Power Development to Hwange Thermal Power Station. The committee assessed ongoing projects and ZESAs preparedness to meet future energy demand.\n\nEngineer Cleopas Nyachowe, ZESA Holdings Group Acting Chief Executive Officer, said the new unitsHwange 9, 10, 11, and 12would be part of a mix of thermal, solar, and geothermal projects. This initiative is being pushed alongside green energy projects, such as solar and geothermal, which are also prominent around this place, Nyachowe explained.\n\nWhile Units 7 and 8 have recently been commissioned, providing some relief, power cuts remain a daily reality for households and businesses. Experts warn that merely adding more units will not solve systemic problems. The issue is not generation alone; distribution, maintenance, and management are equally critical, said an energy analyst.\n\nThe Parliamentary Portfolio Committee highlighted the importance of closely monitoring ZESAs operations ahead of the 2026 national budget, noting the capital-intensive nature of the utility.\n\nCritics argue that expansion plans may be more symbolic than practical. ZESA keeps announcing new projects, but citizens are still left in the dark, said one Harare resident. Without structural reform, these new units may end up benefiting a few politically connected interests rather than the public.\n\nWith industrial and household demand rising, skepticism remains high that ZESA can deliver reliable electricity in the near term, despite the ambitious expansion plans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – ZESA Holdings has unveiled plans to add four new electricity generation units to Zimbabwe’s grid, but the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/struggling-zesa-promises-new-units-while-blackouts-persist/\">Continue reading<span class=\"screen-reader-text\"> \"Struggling ZESA Promises New Units While Blackouts Persist\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Mnangagwa Ally Tagwirei Builds Vast Empire While Pretending to Empower Communities",
            "url": "https://www.zimeye.net/2025/11/17/mnangagwa-ally-tagwirei-builds-vast-empire-while-pretending-to-empower-communities/",
            "content": "Tinashe Sambiri  Newly co-opted ZANU PF Central Committee member Dr Kudakwashe Tagwirei, widely regarded as President Emmerson Mnangagwas blue-eyed boy and a controversial businessman, has announced multi-million-dollar projects in Hatcliffe and Chitungwiza, prompting critics to accuse him of prioritizing personal gain over genuine community development.\n\nSpeaking at an inter-district meeting on Sunday in Hatcliffe, Tagwirei outlined plans to construct a multi-million-dollar complex at PaDust market, claiming it would accelerate growth in the Micro, Small and Medium Enterprises (MSME) sector.\n\nThe move is meant to empower everyone under the mantra of leaving no one and no place behind, he said.\n\nTagwirei also launched a US$200,000 revolving fund for all wings of the party in Hatcliffe Zone 4, with each wing expected to receive US$50,000. In addition, he announced community upliftment projects, including plans to drill 80 boreholes across Chitungwiza to improve access to clean water.\n\nDespite these promises, citizens and analysts have questioned the true motives behind Tagwireis initiatives. This is political cronyism at its finest, said one political analyst. Tagwirei is using these projects to build his empire and reinforce his position as Mnangagwas ally, rather than genuinely empowering communities.\n\nTagwirei framed his plans within the governments Vision 2030 programme, praising the presidents achievements. We have witnessed massive development in all sectors of the economy. A number of projects have been completed. We have seen the massive construction of dams, the New Parliament Building, rehabilitation of Robert Mugabe International Airport, food self-sufficiency, rehabilitation of major roads, among others, have been completed, he said.\n\nSocial media users and citizens were quick to express scepticism.\n\nHe talks about empowerment, but we all know about his controversial business dealings, one resident said.\n\nAnother added, These funds and mega-projects benefit Tagwirei and his allies more than ordinary Zimbabweans.\n\nObservers warn that lavish projects led by politically connected businessmen risk being viewed as self-serving, and that without transparency and accountability, these initiatives may fail to deliver meaningful benefits. When someone with vast wealth and political connections spearheads community projects, you have to ask who truly benefits, said a Harare resident.\n\nAs Zimbabwe continues to struggle with inflation, high unemployment, and limited access to basic services, critics say Tagwireis announcements highlight the contrast between political spectacle and the everyday realities of ordinary citizens.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Newly co-opted ZANU PF Central Committee member Dr Kudakwashe Tagwirei, widely regarded as President Emmerson Mnangagwa’s “blue-eyed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/mnangagwa-ally-tagwirei-builds-vast-empire-while-pretending-to-empower-communities/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ally Tagwirei Builds Vast Empire While Pretending to Empower Communities\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Another Fatal Crash Near Rutenga…",
            "url": "https://www.zimeye.net/2025/11/17/another-fatal-crash-near-rutenga/",
            "content": "Another Fatal Crash Near RutengaA deadly collision occurred near Rutenga on Monday after a side tipper reportedly crashed into a refrigerated truck along the BeitbridgeHarare highway, according to SA Trucker. Authorities are yet to release full details, but the incident haspic.twitter.com/Qqn859X3j6\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Operation Dudula Leader Dies",
            "url": "https://www.zimeye.net/2025/11/17/operation-dudula-leader-dies/",
            "content": "South Africa  Operation Dudula has announced the death of one of its senior figures, Daniel Radebe, triggering a wave of public reactions that reflect both sympathy and the deep controversy surrounding the movements anti-immigrant campaigns.\n\nIn a statement posted on social media, the organisation confirmed the passing of Radebe, described as theformer National Deputy Chairperson, one of the Executors of the organisation.A tribute poster shared by the movement reads:Rest in eternal peace, commander morning,accompanied by Radebes image in military-style attire, a visual aesthetic long associated with Dudulas paramilitary identity.\n\nWhile Dudula members and sympathisers expressed condolences, other social media users responded with sharp commentary referencing the groups long-standing campaign against undocumented foreign nationals. One user wrote:He has gone to a place where documentation is not an issue. RIP,a pointed remark highlighting Dudulas reputation for aggressively targeting migrants accused of lacking immigration papers.\n\nRadebe was among the prominent figures involved in the movements early mobilisation, which began around 2021 in Soweto before spreading to Johannesburg, Pretoria, Durban, Rustenburg, Cape Town and other urban centres. Operating through community patrols, protests, and business inspections, Operation Dudula positioned itself as a citizens movement fighting crime, drug trafficking and what it described as the economic displacement of South Africans by foreign nationals.\n\nHuman rights groups, however, have repeatedly criticised the movement, accusing it of vigilantism, unlawful profiling, intimidation and fuelling xenophobic attitudes. Reports over the past three years have documented Dudula activists shutting down informal businesses operated by migrants, conducting street-level ID checks, and demanding police action against foreign traders and residents. International organisations, including Amnesty International and Human Rights Watch, have warned that such actions risk escalating violence and undermining constitutional protections.\n\nDespite the controversy, Dudula has maintained a significant grassroots following, particularly in low-income communities affected by unemployment and service delivery failures. The movements leaders have argued that government inaction on immigration enforcement left ordinary citizens with no choice but to intervene. Radebe, in particular, was viewed as one of the architects of Dudulas organisational structure and mobilisation strategies.\n\nHis death comes at a moment when Operation Dudula is attempting to reposition itself nationally through its political wing, the Dudula Movement South Africa (DMSA), which has signalled intentions to influence local and national policy debates. Analysts say Radebes passing may shift internal dynamics within the movement, though it remains unclear whether his role will be filled or reorganised.\n\nReactions to the news have therefore mirrored the broader national divide on immigration, security, and community activism. For supporters, Radebe is remembered as a patriot advocating for South Africans rights. For critics, his legacy is inseparable from Dudulas confrontational and exclusionary campaigns.\n\nOperation Dudula has not released information on the circumstances of Radebes death, funeral arrangements, or succession plans. However, the online tributes and criticisms underscore the enduring complexity of South Africas debates on migration, belonging and grassroots policingissues that will continue to shape the movement long after one of its key leaders has been laid to rest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa — Operation Dudula has announced the death of one of its senior figures, Daniel Radebe, triggering a wave … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/operation-dudula-leader-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Operation Dudula Leader Dies\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Mnangagwa Gives Tsenengamu Tough Homework Of Luring Opposition Members To Zanu PF",
            "url": "https://www.zimeye.net/2025/11/17/mnangagwa-gives-tsenengamu-tough-homework-of-luring-opposition-members-to-zanu-pf/",
            "content": "Tinashe Sambiri  A week after publicly seeking forgiveness from President Emmerson Mnangagwa, controversial political figure Godfrey Tsenengamu has been tasked with a challenging mission: convincing opposition members to join Zanu PF.\n\nTsenengamu, who once held a leadership role in the Zanu PF Youth League, met with Mnangagwa last week, signaling a reconciliation after a period of public criticism against the ruling party.\n\nOn Sunday, Tsenengamu shared his progress on Facebook, writing:\n\nA DAYS EFFORT\n\nSekutamba sekuseka 20 more votes added to ZANUPF today tobva tati plus their spouses and parents tinenge tave plus /minus 60. These new members will be guided and redirected through the KHE (Kumusha Home Ekhaya) program to the rightful office holders in their respective provinces, DCCs and Wards for admission and formalisation of their membership into the revolutionary party. Usasare famba nevamwe ndibate pa whatsapp +263775519111.\n\nThe post highlights Tsenengamus strategy of bringing new members into the party, including their families, and integrating them into Zanu PFs local structures.\n\nTsenengamus return to Zanu PF follows a turbulent period in which he was expelled from the party and openly criticized Mnangagwa. His current role represents both a personal political comeback and a significant operational task for the ruling party.\n\nObservers say his ability to persuade opposition members could influence local political dynamics ahead of future elections, though the move is being watched closely by both supporters and critics alike.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – A week after publicly seeking forgiveness from President Emmerson Mnangagwa, controversial political figure Godfrey Tsenengamu has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/mnangagwa-gives-tsenengamu-tough-homework-of-luring-opposition-members-to-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Gives Tsenengamu Tough Homework Of Luring Opposition Members To Zanu PF\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Citizens Dismiss Tagwirei’s Anti-Corruption Speech, Citing His Controversial Deals",
            "url": "https://www.zimeye.net/2025/11/17/citizens-dismiss-tagwireis-anti-corruption-speech-citing-his-controversial-deals/",
            "content": "Tinashe Sambiri ZANU PF Central Committee member Kuda Tagwirei on Sunday addressed the partys DCC 4 Inter-District Meeting in Harare, denouncing corruption and outlining ambitious economic reforms.\n\nHowever, many Zimbabweans remain unconvinced, citing the businessmans controversial dealings as evidence that his anti-corruption rhetoric is hollow.\n\nSpeaking at the meeting, Tagwirei emphasised the importance of ethical governance. We say no to corruption and money laundering. These practices harm our nation and must be eliminated, he said. He also promised to support small and medium enterprises, stating that SMEs would be capitalized to drive economic growth.\n\nTagwirei further advocated for protecting local industries, saying certain sectors of the economy should be reserved for Zimbabweans. He also pledged to expand free WiFi to public spaces nationwide, describing it as a tool to empower citizens.\n\nDespite these assurances, social media and public commentary painted a starkly different picture. He talks about corruption, yet we all know about his controversial business deals, one Harare resident commented. Another added, Free WiFi and SME support sound nice, but how can we trust him to follow through when hes been involved in shady dealings for years?\n\nAnalysts warn that statements like these risk being dismissed as political theatre. When someone with a contested business history speaks out against corruption, it undermines the message entirely, one political commentator said.\n\nAs Zimbabwe continues to grapple with inflation, unemployment, and shortages of basic commodities, many citizens are questioning whether anti-corruption pledges from figures like Tagwirei are genuine or merely a public relations exercise.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– ZANU PF Central Committee member Kuda Tagwirei on Sunday addressed the party’s DCC 4 Inter-District Meeting in Harare, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/citizens-dismiss-tagwireis-anti-corruption-speech-citing-his-controversial-deals/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens Dismiss Tagwirei’s Anti-Corruption Speech, Citing His Controversial Deals\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Mhondoro Roads Neglected for 45 Years: Chivaura Laments After Motsi Bus Accident",
            "url": "https://www.zimeye.net/2025/11/17/mhondoro-roads-neglected-for-45-years-chivaura-laments-after-motsi-bus-accident/",
            "content": "By Hon Vengai Chivaura\n\nWhen I heard that the Motsi bus, which plies the MhondoroMubaira route, had been involved in an accident in September, I rushed to the scene to assess injuries and the extent of the damage.\n\nI want to thank all those who swiftly assisted the injured, ensuring they received immediate help from health professionals. I am deeply grateful for your prompt and vital support to those affected.\n\nMost roads in MhondoroMubaira have been neglected for over 45 years, posing great danger to all who use them.\n\nIt is unfortunate that most of the gravel used at the Trabablas interchange was taken from Mhondoro, mainly along Skyline Road, yet Skyline Road itself is in a dire state.\n\nThe heavy trucks used to transport the gravel caused even more damage, while excavators left behind mountains of unleveled gravel, sand and dangerous water pools. These pose serious risks to both people and animals, especially during the rainy season.\n\nMinistry of Transport and Infrastructural Development\n\nVengai Chivaura Foundation\n\nEmail :[emailprotected]\n\nX: Vengai Chivaura Foundation ( @VChivaura)\n\nInstagram: vengaichivaurafoundation\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Hon Vengai Chivaura When I heard that the Motsi bus, which plies the Mhondoro–Mubaira route, had been involved in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/mhondoro-roads-neglected-for-45-years-chivaura-laments-after-motsi-bus-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Mhondoro Roads Neglected for 45 Years: Chivaura Laments After Motsi Bus Accident\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Mnangagwa’s Birthday Declared National Holiday Amid Economic Crisis?",
            "url": "https://www.zimeye.net/2025/11/17/mnangagwas-birthday-declared-national-holiday-amid-economic-crisis/",
            "content": "Tinashe Sambiri In a move critics say highlights government priorities out of touch with ordinary Zimbabweans, ZANU PF Harare Province announced over the weekend that President Emmerson Mnangagwas birthday will be declared a national holiday.\n\nThe announcement came during the DCC 4 Inter-District Meeting held in Hatcliffe, Harare at the weekend.\n\nSenator Charles Tavengwa, Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Province, defended the decision.\n\nPresident Emmerson Mnangagwas tireless efforts in nation-building deserve to be celebrated. That is why Munhumutapa Day, on 15 September, will be declared a national holiday in his honour, Tavengwa said.\n\nThe meeting also unveiled a series of initiatives under the governments Vision 2030 agenda, including the expansion of the Chitepo School of Ideology to accommodate more cadres, expedited vetting of non-combatants, and the development of industrial hubs for small and medium enterprises.\n\nHowever, critics argue that these pledges do little to address Zimbabwes deepening economic and social challenges. Despite promises, farmers continue to face delayed payments, commodity prices remain high, and the majority of citizens struggle to afford basic necessities.\n\nTavengwa also announced plans to make 1 July National Heritage Day in honour of Dr Joshua Nkomo, monitor consumer prices, and implement safety nets for the less privileged. Re-engagement will continue as it is bearing fruit, he added.\n\nAnalysts, however, warn that symbolic gestures such as a presidential birthday holiday may be seen as political pageantry rather than meaningful reforms. Declaring a holiday for one individual while millions struggle economically sends the wrong message, one observer said.\n\nWith Zimbabweans grappling with inflation, unemployment, and shortages, many question whether celebrating Mnangagwas birthday as a national holiday is timelyor responsible.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– In a move critics say highlights government priorities out of touch with ordinary Zimbabweans, ZANU PF Harare Province … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/mnangagwas-birthday-declared-national-holiday-amid-economic-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Birthday Declared National Holiday Amid Economic Crisis?\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        },
        {
            "title": "Watch: Mahiya Declares Whether You Like It Or Not, Mnangagwa Will Be In Office, Come 2030",
            "url": "https://www.zimeye.net/2025/11/17/watch-mahiya-declares-whether-you-like-it-or-not-mnangagwa-will-be-in-office-come-2030/",
            "content": "Tinashe Sambiri  ZANU PF Secretary for War Veterans Affairs in the Politburo, Douglas Mahiya, has sparked outrage after delivering a controversial and openly defiant declaration regarding President Emmerson Mnangagwas political future.\n\nSpeaking at a ZANU PF inter-district meeting in Harare over the weekend, Mahiya dismissed the role of voters, constitutional limits, and democratic processes, insisting that Mnangagwa will remain in power beyond 2028regardless of public opinion.\n\nIn his remarks, delivered partly in Shona, Mahiya boldly announced:Panyaya ye2030 ZANU PF haisi kukumbira vanhu asi iri kuudza vanhu nekuti 2030 President ED Mnangagwa will be in office.\n\nLoosely translated, he asserted that ZANU PF is not asking the people about 2030 but telling the people that Mnangagwa will be in office by thenan outright dismissal of elections, constitutionalism, and the will of the electorate.\n\nMahiya attempted to justify his stance by misrepresenting democratic principles, bizarrely stating:According to the principle of democracy, majority prevails over majority,a statement that left many questioning both the logic and intent behind his claims.\n\nHis remarks have been widely condemned as a shocking display of authoritarianism and disregard for constitutional order. Human rights activists and political commentators described the utterances as dangerous, undemocratic, and symptomatic of a government that believes its power is guaranteednot earned.\n\nAnalysts warned that such statements undermine Zimbabwes already fragile democracy. This is not just political rhetoric; it is a direct assault on constitutional term limits, one observer noted. When senior party officials publicly declare that elections dont matter, it signals a deeper crisis of governance.\n\nAs the debate over Mnangagwas possible extension to 2030 intensifies, Mahiyas comments have only added fuel to growing fears that ZANU PF intends to override constitutional norms in order to prolong its grip on power.\n\nZANUPF Secretary of War Veterans Affairs in the Politburo, Cde Mahiya said ,Panyaya ye2030 ZANUPF haisi kukumbira vanhu asi iri kuudza vanhu nekuti 2030 President ED Mnangagwa will be in office.He added that, according to the principle of democracy, majority prevails overpic.twitter.com/tTgCMzeAQS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – ZANU PF Secretary for War Veterans Affairs in the Politburo, Douglas Mahiya, has sparked outrage after delivering … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/17/watch-mahiya-declares-whether-you-like-it-or-not-mnangagwa-will-be-in-office-come-2030/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Mahiya Declares Whether You Like It Or Not, Mnangagwa Will Be In Office, Come 2030\"</span></a></p>",
            "time": "09:46",
            "date": "18 Nov 2025"
        }
    ]
}