{
    "news": [
        {
            "title": "First Lady Will Not Be Intimidated By Lord Oates And John Burke – Mavaza",
            "url": "https://www.zimeye.net/2025/05/10/first-lady-will-not-be-intimidated-by-lord-oates-and-john-burke-mavaza/",
            "content": "BY DR MASIMBA MAVAZA | In a British Parliament where the legislators and the Lords were discussing issues on the protection of journalists, a certain Lord who is confused by ego snapped out of topic and started to berate the First Lady of Zimbabwe.\n\nWhat Lord Oates did not know is that the First Lady of Zimbabwe is not a politician. She is a philanthropist and a mother to her nation. The First Lady, like most First Ladies, cannot control the police or the justice system. Lord Oates had even incited ministers and people to besiege the First Lady of Zimbabwe and question her on issues she has no say in.It is important to understand the work of the First Lady of Zimbabwe.The First Lady of Zimbabwe, Auxillia Mnangagwa, has undertaken numerous initiatives to improve the lives of Zimbabweans, particularly women and vulnerable communities. Some of her notable works include Empowering Women and Girls:Providing sanitary wear to poor women and girls, and promoting menstrual hygiene through reusable sanitary wear clubs.\n\nThe First Lady offers scholarships to girls from underprivileged communities to stem child marriages and ensure access to education.\n\nInitiating women empowerment projects, such as livestock ownership and handcrafts, to improve their economic well-being. She has established a bank which caters for the interests of the women. The very first womens bank in the world is in Zimbabwe. The First Lady improves the lives of an African girl child. This is the work which angers Lord John Oates. His fight against the First Lady has nothing to do with politics but pure anti-African action by Lord Oates.\n\nIn pursuing the girl child track, the First Lady initiated Healthcare Initiatives.\n\nUnlike what John Oates does for his people, the First Lady is providing free medical specialist services to marginalized communities through outreach programs.\n\nThe First Lady of Zimbabwe is offering accessible and free cervical, breast, and prostate cancer screening. This John Oates can never dream of doing in his lifetime.\n\nUnlike John Oates, the First Lady launched the National Human Papillomavirus Vaccination program to benefit over 800,000 girls. This John Oates has never done even for his own children, yet he has the guts to intimidate the First Lady of Zimbabwe. In all the languages on earth, John Oates is described as a coward who is only good at intimidating women in action.\n\nIn case Lord Oates has forgotten, the First Lady has again made sure that Food Security and Nutrition is sufficient for the people of Zimbabwe.She implemented a nationwide school feeding program to address poor school performance due to malnutrition and hunger. She promoted nutrition gardens and fishponds to enhance food self-sufficiency.\n\nShe is taking a lead in Community Development:Working with traditional leaders spouses as agents of change and empowerment.\n\nThe First Lady initiated projects to promote environmental preservation and sustainable livelihoods.Can someone tell Lord Oates that the First Lady of Zimbabwe is providing support to marginalized communities, such as the San and Doma people of Zimbabwe.The First Lady has become an advocate of awareness: advocating for safe sanitary wear and menstrual hygiene.Raising awareness about cervical and breast cancer, and promoting health-seeking behaviors. She has continued engaging men in discussions on gender-based violence, child marriages, and sexual abuse. This is what Zimbabweans are happy about and, surprisingly, this is what John Oates hates so much.John Oates must realise that the First Ladys efforts have been recognized both locally and internationally, inspiring other African First Ladies to replicate her initiatives. She has been appointed Ambassador for Health and Childcare, Patron of Environment, and Ambassador for Days for Girls, among other roles.It is surprising that some Zimbabweans like Hopewell Goat Chinono are supporting Lord Oates to undermine the First Lady. The First Lady of Zimbabwe must not be intimidated by the coward Lord Oates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BY DR MASIMBA MAVAZA | In a British Parliament where the legislators and the Lords were discussing issues on the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/first-lady-will-not-be-intimidated-by-lord-oates-and-john-burke-mavaza/\">Continue reading<span class=\"screen-reader-text\"> \"First Lady Will Not Be Intimidated By Lord Oates And John Burke – Mavaza\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "How Gambakwe’s Trapped Nyokayemabhunu With Dirty-Money And Fake-Geza-50-Soldiers-Story",
            "url": "https://www.zimeye.net/2025/05/10/how-gambakwes-trapped-nyokayemabhunu-with-dirty-money-and-fake-geza-50-soldiers-story/",
            "content": "HOW GAMBAKWE HAS JAILED NYOKAYEMABHUNU WITH FAKE 50 GEZA SOLDIERS STORY\n\nThree weeks after the YouTuber, Pardon Gambakwe, had falsely claimed on 20 March 2025 that the Blessed Geza movements 31 March protest was struggling for financesjust as he also claimed that he had pictures of injuries he said he sustained from poisoning by Emmerson Mnangagwa in July 2024a large group of mostly fake protesters were captured by unknown men on 13 April 2025.\n\nAround this time, the ZimEye news network had raised a red flag that citizens who were engaging Gambakwe and a woman only identified as Chimhamha were either regime agents or people sacrificing (kuchekeresa) innocent people. Later, over 200 predominantly fake-activists were kidnapped on 13 April 2025, after the ZANU PF activist Wellington Masiwa (Nyokayemabhunhu) was trapped using a financial donations trick.\n\nIf I show you injuries that I got from the poisoning in Zambia some of you wont sleep over what happened; these people are witches; Mnangagwa and his family they are witches, announced Gambakwe as he dangled bank account numbers for donations for the 31 March demonstration, whose organisers had however made clear that it doesnt need any money. (video loading below)\n\nHOW GAMBAKWE HAS JAILED NYOKAYEMABHUNU WITH FAKE 50 GEZA SOLDIERS STORYThree weeks after the YouTuber, Pardon Gambakwe, had falsely claimed on 20 March 2025 that the Blessed Geza movements 31 March protest was struggling for financesjust as he also claimed that he hadhttps://t.co/Hn8KhXSFAxpic.twitter.com/FptFHxkoSW\n\nGambakwe did not stop there, but went on to make further announcements to the effect that he represents the group that was arranging the demonstration. As if that was not enough, his mouth took another twist this time to name drop Blessed Geza, the war veteran, whose protest he alleged was going to fail because it does not have money.\n\nWe are on our own, he said.\n\nHe then went on to impose Gezas name onto the self styled activist Wellington Masiwa, in a way that is bound to now implicate the war veteran over Gambakwes own fund raising trick. Unbeknown to his victims, the method was for the purpose of ensnaring many victims.\n\nHe said:2 million US dollars. The people from Dubai have given them $300,000, which they when they bought scarf, they bought it for 300,000, so unfortunately, on the side of Geza.\n\nAh, Cde Nyokayemabhunu, I was talking to him. Ah, less than an hour ago, there is no money. Theres no funding available, so we are on our own. This man Mnangagwa is putting everything, all the resources, to remove. Dont let this man come back. Mnangagwa had gone, but, he said.\n\nHow presidential spokesman George Charamba is gyrating over the matter is a program funded by a ZANU PF Sandton branch that had by this time pulled together a total R6mil to finance a counterintelligence operation that was hoped would lead to the arrest of Masiwa and Geza. Lawyers struggled to locate the group throughout the day as Masiwa was tortured.\n\nAt the end of the day, he was located at Central Police Station, where a certain male named Honest Sibanda asked officers to charge Masiwa over theft of R25,000. The police officers responsible for the arrest were receiving orders from the said Sibanda, ZimEye sources reveal.\n\nIn the conversation, Masiwa confirmed to the police that he recognises Sibanda. The officers were being fed this information as Sibanda was trying to create a docket over the R25,000. Masiwa acknowledged receiving the money. Sibanda failed to prove evidence of the handover of the money. Sibanda also failed to prove that the money was obtained through deception.\n\nMasiwa declared that the money was for the demos needs and was distributed among his campaign team. As a result, the charge over the R25,000 was abandoned. Masiwa is now battling immigration charges.\n\nTo this day, Gambakwe has failed to reveal the injuries he once announced that he sustained at Mnangagwas hands. He has also refused to reverse his statements with which he continues to attempt to link Masiwa with the war veteran Geza and or members of the security forces, soldiers.\n\nOn 10 May, he broadcast a video with which he claimed that so-called 50 Geza soldiers were arrested on 14 April. ZimEye replays a recording of him as he was confronted for answers.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "HOW GAMBAKWE HAS JAILED NYOKAYEMABHUNU WITH FAKE 50 GEZA SOLDIERS STORY Three weeks after the YouTuber, Pardon Gambakwe, had falsely … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/how-gambakwes-trapped-nyokayemabhunu-with-dirty-money-and-fake-geza-50-soldiers-story/\">Continue reading<span class=\"screen-reader-text\"> \"How Gambakwe’s Trapped Nyokayemabhunu With Dirty-Money And Fake-Geza-50-Soldiers-Story\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "MR USHE | Remembering the unwavering pillar John Takaendesa Ushe (1945–2025)",
            "url": "https://www.zimeye.net/2025/05/10/mr-ushe-remembering-the-unwavering-pillar-john-takaendesa-ushe-1945-2025/",
            "content": "By Dr Masimba Mavaza and Ilyana Sithole. | A heartfelt tribute to a long-serving worker as we acknowledge his years of dedication, The impact he made on those he met no one is able to explain it. All we can do expresses appreciation for his contributions. Its a chance to recognize his loyalty and celebrate his legacy within Zimbabwe and all our embassies dotted across the world.Zimbabweans across the United Kingdom and around the world are in mourning at the death of John Takaendesa Ushe, whose quiet devotion and tireless work ethic earned him the status of colossus of Zimbabwe House in London for a staggering 45 years. Mr. Ushe, who died peacefully on May 6th, 2025, at the age of 79, leaves behind a legacy of devotion, experience, and profound national love.\n\nBorn on September 17th, 1945, at Chivhu, Mashonaland East, John was the fifth child of seven Early life at Tegwani High School fostered a keen mind, especially an affinity for mathematics and puzzles. His adventurous spirit took him to Europe in 1970 and in 1972 he made his way to the United Kingdom. In 1975 after pursuing further education he received a Higher National Diploma in Electrical Engineering from North East London Polytechnic.\n\nDespite his noteworthy academic endeavors Mr. Ushes impact was primarily defined by his natural kindness and desire to assist others. He served as a crucial point of contact for numerous Zimbabweans who came to the UK in the 1970s and later providing them with direction and assistance as they made their way through a foreign nation. Many people found their place and started a life in the UK thanks to his unifying presence.\n\nIt was in 1981 that Mr. Ushe started his remarkable streak at Zimbabwe House. As embassy security and caretaker, he was a treasure, the longest-serving employee in the history of Zimbabwean embassies. For more than four and a half decades, he saw the tide and decline of diplomatic life under two presidents, Robert Mugabe and Emmerson Mnangagwa, his commitment a reflection of his intense national pride and unbreakable loyalty to Zimbabwe. He has seen several Ambassadors coming and going as he manned the gates of the embassy and catching the wind of any gossip and any issue.\n\nHe was a introvert onlooker, a historian of embassy life, a treasure trove of the past with an exceptional knowledge of embassy complexities. All this accumulated experience has now vanished with his passing away.\n\nOutside of his work, Mr. Ushe discovered long-lasting joy with his wife, Gertrude (nee Ngombe), to whom he was married in May 1984. Their union was one of strength and happiness, and the couple created a happy family consisting of seven children and seven grandchildren.As Ushe departs we bid farewell to a dedicated and valued member of our team. His contributions over the years have been immense, and his presence will be deeply missed.\n\nWere grateful for Ushes commitment, expertise, and passion. His legacy will live on through the countless lives he has touched and the work he has accomplished.\n\nWell remember his [unique qualities, achievements, or memories]. His dedication to our country and colleagues has been inspiring.\n\nThough he is no longer with us physically, his impact will remain. Well continue his work, building on the foundations Ushe has laid.Farewell, and may his memory be a blessing to us all.\n\nTo his close acquaintances, John Ushe was a friend or colleague but far more. He was a stalwart member of the Zimbabwean community in Britain, an unsung hero whose commitment and service touched many an individuals existence. We will deeply miss his constant presence, his readiness to help and his strong ties to Zimbabwe, a void noone can replace.\n\nMr. Ushe is survived by his wife, Gertrude, his seven children, and seven grandchildren. His legacy of strength, wisdom, and love will surely be continued through them. Zimbabweans in the UK and back home lament his passing by recalling a humble man whose passion and commitment had left an indelible mark in the countrys diplomatic history as well as in the lives of people around the world. He will be missed for being profoundly present, but never forgotten for the long and arduous dedication that he served. He didnt just do his job he inspired excellence. His work ethic set the standard for all of us. He led by example and mentored with patience. His dedication transformed our embassy.Zimbabwe is so proud to have Ushe as part of our work family. We hope that his predecessor will keep up the good work for many years to come!To the Ushe family we say Thank you for giving us Cde Ushe for 45 years he was such a valuable member of our team and nation.\n\nOnly God can comfort you in this dark moment.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza and Ilyana Sithole. | A heartfelt tribute to a long-serving worker as we acknowledge his years … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/mr-ushe-remembering-the-unwavering-pillar-john-takaendesa-ushe-1945-2025/\">Continue reading<span class=\"screen-reader-text\"> \"MR USHE | Remembering the unwavering pillar John Takaendesa Ushe (1945–2025)\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "Top Masvingo School Head Arrested For Fraud",
            "url": "https://www.zimeye.net/2025/05/10/top-masvingo-school-head-arrested-for-fraud/",
            "content": "By A Correspondent Police in Masvingo have arrested Victoria High School headmaster, Lovemore Chabaya, on allegations of corruption involving fraudulent travel and subsistence (T&S) claims.\n\nChabaya appeared at the Masvingo Magistrates Court this week, facing fraud charges related to facilitating double claims for T&S allowances for a senior official in the Ministry of Primary and Secondary Education.\n\nHe is jointly charged with Chivi District Schools Inspector (DSI), Evershine Ndongwe, who allegedly claimed US$355 in allowances and fuel for a trip to Bulawayo to collect a 72-seater bus procured from Vordim Bus Company on behalf of Ngundu High School.\n\nNdongwe has also been implicated in a separate case involving the Masvingo Provincial Education Director, Shylatte Mhike, and Provincial Education Finance Director, Liniah Chinoda. The trio is accused of making false travel and allowance claims.\n\nMagistrate Franklin Mkwananzi refused to place Chabaya and Ndongwe on remand, ruling that the State was not ready to proceed with the trial. Prosecutor Godknows Mugondo informed the court that the Zimbabwe Anti-Corruption Commission (ZACC) had not yet submitted crucial documents for the case. The accused will be summoned to court at a later date.\n\nNgundu High School Development Committee (SDC) chairperson, Zivai Tinago, is the complainant in the matter, representing the State. The two accused are being represented by Takunda Chikwati of Matutu and Mureri Legal Practitioners.\n\nAccording to court documents, Chabaya previously served as headmaster at Ngundu High before his transfer to Chongogwe Secondary. In January 2024, Ngundu High arranged to collect a newly procured school bus from Bulawayo. Acting on Chabayas guidance, the school administration and SDC resolved to send a nine-member delegationincluding Ndongweto retrieve the bus.\n\nDespite his transfer, Chabaya allegedly remained a signatory to Ngundu Highs bank account. He is accused of authorizing a withdrawal of US$1,983 for the trip, with US$525 allocated to himself and Ndongwe. Ndongwe reportedly received US$200 for fuel and US$155 in T&S allowances, while Chabaya was paid US$170 in T&S.\n\nCourt papers suggest that although the fuel money was supposedly split into two US$100 amounts, both men used a single vehicle for the journey. ZACC investigations later revealed that Ndongwe submitted a second set of claims for the same expenses at his district office, leading to fraud charges.\n\nThe school accountant, Ranganai Muchemedzi, and SDC vice chairperson, Retty Mutete, withdrew the funds and handed US$525 to Chabaya at Chibi Turn-Off, reads part of the court submission. Of this, US$155 was for Ndongwes T&S, US$200 for fuel, and US$170 for Chabayas T&S.\n\nIn February 2024, Muchemedzi reportedly asked Chabayavia district accountant Tapiwa Mapindanifor fuel receipts to acquit the US$200. The two accused allegedly conspired to procure fake receipts from an undisclosed Canrid Service Station, listing the buyer as the Better Schools Programme  Chivi District. Chabaya then submitted the receipts to Muchemedzi to validate the fuel expenses.\n\nBoth men were arrested by ZACC following the investigation.\n\nMasvingo Mirror\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Police in Masvingo have arrested Victoria High School headmaster, Lovemore Chabaya, on allegations of corruption involving fraudulent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/top-masvingo-school-head-arrested-for-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Top Masvingo School Head Arrested For Fraud\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "ZIFA Unveils Report on First 100 Days: “We Are Building More Than a Game”",
            "url": "https://www.zimeye.net/2025/05/10/zifa-unveils-report-on-first-100-days-we-are-building-more-than-a-game/",
            "content": "By Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has released a comprehensive report detailing its achievements in the first 100 days since the new executive assumed office, signaling a bold push toward reform, transparency, and technical excellence in the administration of football.\n\nAccording to the report, ZIFA has made significant strides across multiple fronts, with 82% of its institutional reform objectives already achieved or actively in progress. The association emphasized that it had remained faithful to the campaign manifesto, More Than A Game, which outlined five strategic pillars guiding their tenure.\n\nFrom the onset, our team articulated a bold vision in the campaign manifesto titled More Than A Game, anchored on five catalytic pillars, ZIFA said in a statement. In the first 100 days, we have remained steadfast in translating these pillars into tangible action.\n\nAmong the most notable achievements is the initiation of 100% of priority institutional audits, reflecting a commitment to accountability and transparency. The report also highlights that all key strategic initiatives are under active implementation, reinforcing the executives hands-on approach.\n\nWe are building a strong and accountable institution, ZIFA said. Institutional audits are not just checkboxes; they are foundational to regaining the trust of our stakeholders.\n\nThe association also reported encouraging progress in gender representation. A total of 36 women have been appointed to leadership positions within ZIFA, representing 28.6% of its leadership team. This development has been hailed as a deliberate step toward inclusivity and diversity.\n\nThis is not tokenism. Women in sport must be seen, heard, and empowered, ZIFA stated.\n\nOn the technical front, eight strategic initiatives are currently underway, with a focus on developing football talent and coaching capacity across all levels. The association emphasized the importance of enhancing Zimbabwes technical prowess, stating, Technical excellence is the bedrock of competitive football. We are investing in our people, our knowledge systems, and our long-term potential.\n\nTo support growth and sustainability, ZIFA reported that 10 formal partnerships or engagements have been initiated in the first three months, ranging from corporate sponsorships to development collaborations.\n\nForging meaningful partnerships is central to our strategy, the report reads. Whether its corporate sponsors, development agencies, or international football bodies, were creating win-win opportunities.\n\nThe statement concluded with a reaffirmation of the associations long-term vision.\n\nOur 100-day milestone is not a destination; its a signal of intent. The work continues, ZIFA said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent The Zimbabwe Football Association (ZIFA) has released a comprehensive report detailing its achievements in the first 100 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/zifa-unveils-report-on-first-100-days-we-are-building-more-than-a-game/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Unveils Report on First 100 Days: “We Are Building More Than a Game”\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "Outrage Over Proposed Driver Retests: Zimbabweans Call It a ‘Looting Scheme’",
            "url": "https://www.zimeye.net/2025/05/10/outrage-over-proposed-driver-retests-zimbabweans-call-it-a-looting-scheme/",
            "content": "By A Correspondent\n\nA proposed policy by Zimbabwes Vehicle Inspection Department (VID) to introduce mandatory retesting for all licensed drivers has triggered widespread public outrage, with citizens slamming the plan as a thinly veiled attempt to extract money from an already struggling population.\n\nThe move comes in response to a worrying rise in road traffic accidents. According to data from the Zimbabwe Republic Police (ZRP), the country recorded over 52,000 traffic crashes in 2024, a 17% spike from the previous year.\n\nTragically, more than 2,000 fatalities were reported, with over 90% of the crashes attributed to human error.\n\nIn a stakeholder meeting involving transport operators, the police, and urban development officials, VID official Onesimo Bumhira announced that the government intends to introduce expiry dates on drivers licences. Under the proposed system, motorists would be required to undergo medical, vision, and competency evaluations before licence renewals.\n\nDrivers physical and medical conditions change with timesome start wearing spectacles, others face cognitive or mobility challenges. These must be factored into continued eligibility to drive, said Bumhira.\n\nBut the public isnt buying it. The announcement has sparked backlash, with many accusing the government of deflecting blame and creating new ways to collect money rather than addressing the real issues behind the carnage on Zimbabwes roads.\n\nNtema Ndlovu strongly criticized the policy, calling it a wrong diagnosis of the road safety crisis.\n\nAfter that exercise the problem will continue because this is wrong diagnosis, Ndlovu said. The state of our roads is our number one problemjust fix the roads if you are serious about stopping the accidents. The second problem is our police. Whenever they mount roadblocks, they just want to collect money from motorists.\n\nHe also pointed to outdated infrastructure and congestion: There is too much congestion due to poor road infrastructure. We are seeing an increase in vehicles on our roads yet nothing is being done to increase roads and ranks for commuter omnibuses.\n\nOn the proposed retest, Ndlovu remained skeptical: Anyone going for a retest will just do it well enough to pass. But once back on these poor roads, theyll do whatever it takes to manoeuvre around potholes, congestion, and corrupt traffic police.\n\nInnocent Moyondizvo Nhira echoed the frustration: Does a retest stop accidents on the state of our hell roads?\n\nOthers were more direct in their condemnation. Theme Sibanda dismissed the plan as blatant exploitation: Just a stunt to loot money from our drivers for the Zwiganandas. Shame on you, ZANU PF.\n\nChausina Gandidzamwa focused his criticism on corruption in enforcement: A looting scheme. What of the bad roads? VID Zvishavane and ZRP Zvishavane are the most corrupt of them all.\n\nDespite the backlash, the government has not indicated any shift in position. For many Zimbabweans, however, the message is clear: before drivers are forced to retest, authorities must first address broken infrastructure, corruption, and the systemic failures that make the countrys roads dangerous in the first place.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A proposed policy by Zimbabwe’s Vehicle Inspection Department (VID) to introduce mandatory retesting for all licensed drivers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/outrage-over-proposed-driver-retests-zimbabweans-call-it-a-looting-scheme/\">Continue reading<span class=\"screen-reader-text\"> \"Outrage Over Proposed Driver Retests: Zimbabweans Call It a ‘Looting Scheme’\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "Moses Langa Wins ZANU PF Insiza North Primaries",
            "url": "https://www.zimeye.net/2025/05/10/moses-langa-wins-zanu-pf-insiza-north-primaries/",
            "content": "By Political Reporter-Moses Langa has emerged victorious in the ZANU PF primary election for the Insiza North constituency, defeating more than six other contenders in a tightly contested internal poll held on Saturday.\n\nHe now awaits formal confirmation when the Nomination Court sits on May 15.\n\nIn Gutu East, Zvarevashe Masvingise will stand as the ZANU PF candidate after winning the primaries conducted earlier on April 16.\n\nThe two seats fell vacant following the expulsion of Gutu East legislator Benjamin Ganyiwa for what party officials described as disciplinary issues, and the death of Insiza North MP Farai Taruvinga in March this year.\n\nPresident Emmerson Mnangagwa formally declared the seats vacant following a notice from the Speaker of Parliament, Advocate Jacob Mudenda, under Proclamation 3 of 2025, as gazetted in Statutory Instrument 44A of 2025.\n\nWhile Langas win appears straightforward on paper, it unfolds against a backdrop of deep-seated factionalism and bruising internal battles that have long defined ZANU PFs political machinery. Internal primary elections within the ruling party are often marred by accusations of vote-rigging, candidate imposition, intimidation, and violence  factors that have left many losing candidates and grassroots supporters disgruntled over the years.\n\nIn recent months, infighting within ZANU PF has intensified, with rival factions allegedly aligned to either President Mnangagwa or his deputy, Vice President Constantino Chiwenga, using primary contests as a proxy war to assert dominance. In some cases, candidates have accused provincial leaders of manipulating voters rolls, bussing in supporters, or using state security agents to influence outcomes.\n\nLangas victory in Insiza North could therefore be as much about strategic alignment within party hierarchies as it is about grassroots popularity. Insiders say he enjoyed backing from powerful figures in Matabeleland South, giving him an edge over rivals who were seen as aligned with rival factions.\n\nThe upcoming by-elections on June 28 will not only test ZANU PFs internal unity but also its ability to win fairly  a question that has haunted Zimbabwean elections for decades.\n\nZANU PF has a long history of using state institutions, including the Zimbabwe Electoral Commission (ZEC), traditional leaders, and security services, to tilt the playing field in its favour. Observers from both local and international missions have flagged repeated concerns over biased voter registration practices, lack of transparency in vote counting, and intimidation of opposition supporters  especially in rural constituencies like Insiza and Gutu.\n\nIn the controversial 2023 general elections, ZEC was accused of manipulating the delimitation process, delaying voting materials in opposition strongholds, and allowing a pro-ZANU PF group known as Forever Associates Zimbabwe (FAZ) to set up exit poll tables outside polling stations  a move widely condemned as voter intimidation.\n\nWith the nomination courts set to sit on May 15, all eyes will be on how ZEC conducts itself this time around, and whether the electoral environment allows for a genuinely competitive race. Opposition parties, including Citizens Coalition for Change (CCC), are expected to field candidates in both constituencies, though the continued arrests and harassment of opposition leaders and activists suggest a tough road ahead.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-Moses Langa has emerged victorious in the ZANU PF primary election for the Insiza North constituency, defeating more … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/moses-langa-wins-zanu-pf-insiza-north-primaries/\">Continue reading<span class=\"screen-reader-text\"> \"Moses Langa Wins ZANU PF Insiza North Primaries\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "School Head In Court Over Fraudulent Bus Trip Claims",
            "url": "https://www.zimeye.net/2025/05/10/school-head-in-court-over-fraudulent-bus-trip-claims/",
            "content": "By A Correspondent\n\nVictoria High School head Lovemore Chabaya and Chivi District Schools Inspector Evershine Ndongwe have appeared in court facing allegations of fraud involving double claims for a trip to Bulawayo.\n\nThe pair is accused of manipulating travel and fuel allowances during an official mission to collect a new school bus.\n\nThe case was heard at the Masvingo Magistrates Court, where presiding Magistrate Franklin Mkwananzi declined to place the accused on remand.\n\nProsecutor Godknows Mugondo told the court that the State was not yet prepared for trial due to outstanding documents still being held by the Zimbabwe Anti-Corruption Commission (ZACC).\n\nThe suspects are expected to be summoned at a later date.\n\nThe complaint was lodged byZivai Tinago, chairperson of the Ngundu High School Development Committee, who is representing the State.\n\nAccording to court documents, Chabayawho previously headed Ngundu High School but was later transferred to Chongogwe Secondaryremained a signatory to Ngundu Highs bank account.\n\nIn January 2024, Ngundu High School procured a 72-seater bus from Vordim Bus Company in Bulawayo, and Chabaya assisted the administration in organizing a collection trip involving nine officials, including Ndongwe.\n\nChabaya allegedly signed off on a US$1,983 cash withdrawal for the trip. Of this amount,US$525 was allocated to Chabaya and Ndongwe, covering fuel and travel allowances. Ndongwe reportedly receivedUS$200 for fuel and US$155 in Travel and Subsistence (T&S) allowances, while Chabaya receivedUS$170 as T&S.\n\nAlthough the two reportedly used a single vehicle for the trip, records indicate that Ndongwe later made a second claim for the same expenses at his official workstationeffectively receiving double payments, according to ZACC investigators.\n\nThe school accountant, Ranganai Muchemedzi, and the SDC vice-chairperson, Retty Mutete, withdrew the funds and met Chabaya at Chibi turn-off, where Muchemedzi handed over the US$525, the court papers state.\n\nWhen questioned about receipts to account for the fuel costs, Chabaya and a Ministry accountant,Tapiwa Mapindani, allegedly obtained two fake diesel receipts, each valued at US$100. The receipts bore the name of theBetter Schools Programme Chivi Districtand were sourced from an unnamed Canrid Service Station.\n\nThe receipts were fabricated to make it appear as though the US$200 had been spent on fuel, when in fact it had not, read the charge sheet. These fraudulent documents were then submitted to the school accountant in an attempt to acquit the funds.\n\nZACCs investigation has linked Ndongwe to a separate case involving alleged false allowance claims alongside Masvingo Provincial Education DirectorShylatte Mhikeand Provincial Finance DirectorLiniah Chinoda, further widening the net in what appears to be a broader probe into misuse of public funds in the education sector.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Victoria High School head Lovemore Chabaya and Chivi District Schools Inspector Evershine Ndongwe have appeared in court … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/school-head-in-court-over-fraudulent-bus-trip-claims/\">Continue reading<span class=\"screen-reader-text\"> \"School Head In Court Over Fraudulent Bus Trip Claims\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "4000 Chivi Families Face Eviction",
            "url": "https://www.zimeye.net/2025/05/10/4000-chivi-families-face-eviction/",
            "content": "By A Correspondent- The government is planning to relocate more than 3,600 families in Chivi District to roll out the long-awaited Tugwi Mukosi dam Master Plan\n\nAccording to a recently released draft of the master plannow open for public consultation overa three-month period3,652 households in Chivi and Masvingo Rural Districts are likely to be directly affected, primarily through displacement.\n\nThis new round of potential displacements comes on top of the relocation of around 3,300 families a decade ago, who were moved to Chingwizi in Mwenezi after dam waters inundated their homes in the Tugwi-Mukosi basin.\n\nFor Chivi District, the concerned wards have a population of 38,644, while Masvingo Rural District has 35,422 people. However, about 3,652 households are more likely to be directly affected by development in the Tugwi-Mukosi development zone. Most of these households will be displaced, reads part of the draft plan.\n\nHowever, Masvingo Provincial Affairs and Devolution Permanent Secretary, Dr Addmore Pazvakavambwa, toldTellZim Newsthat relocation would be a last resort.\n\nThe main thrust of the government is on reorganisation or rearrangement for affected families. Displacement would be a last resort.\n\nGovernment has a clear policy onthe relocation ofpeople affected by government programmes, said Dr Pazvakavambwa.\n\nThe Tugwi-Mukosi Master Plan outlines ambitious proposals for infrastructural, agricultural, tourism, and urban development around the dam, which was commissioned in 2017.\n\nThegovernment hasfor yearspromoted the area as a future economic hub for Zimbabwes southern region.\n\nStill fresh in the minds of many are the traumatic displacements of 2014, when families were hastily evacuated due to rising waters.\n\nMany of those resettled in Chingwizicontinue tolive in poor conditions, with limited access to basic services such as healthcare and education.\n\nThe new master plan envisions the creation of irrigation schemes, tourism lodges, fishery projects, urban housing developments, and upgraded road infrastructure to transform the dams catchment into a vibrant, multi-use economic zone.\n\nTellZim\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- The government is planning to relocate more than 3,600 families in Chivi District to roll out the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/4000-chivi-families-face-eviction/\">Continue reading<span class=\"screen-reader-text\"> \"4000 Chivi Families Face Eviction\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        },
        {
            "title": "Thieves Steal Mnangagwa Friend’s Transformer",
            "url": "https://www.zimeye.net/2025/05/10/thieves-steal-mnangagwa-friends-transformer/",
            "content": "By A Correspondent\n\nA ZESA electricity transformer was stolen last Tuesday at Dewure Business Centre in Gutu Central, just two months after Member of Parliament Winston Chitandoknown ally of President Emmerson Mnangagwareplaced five others previously destroyed by vandals.\n\nThe theft has plunged the area into darkness and disrupted economic activity, with several small businesses considering shutting down due to unsustainable operating costs.\n\nThis has seriously affected our operations, said one local shop owner. Were now relying on generators, and fuel is too expensive. If nothing changes soon, well be forced to close.\n\nThe transformer theft has sparked renewed suspicion among residents, many of whom believe the spate of vandalism may involve insiders at ZESA.\n\nOnly people with expert knowledge of the power system can pull this off, a resident commented. Its hard to believe these are just random criminals. This looks like an inside job.\n\nChitando, who previously oversaw the restoration of transformers at Devure Clinic, Mukoroverwa Primary School, Jaravaza, Zhavahera, and Tachi business centres, has not issued a direct statement, but party representatives say the issue has been escalated.\n\nWeve already engaged ZESA, and theyve acknowledged the report, said a Zanu PF official speaking on behalf of Chitando. Theyve assured us that efforts to restore power are underway.\n\nAs affected businesses struggle to stay afloat, community members are calling for stronger security around essential infrastructure and faster responses from authorities to prevent a repeat of the incident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A ZESA electricity transformer was stolen last Tuesday at Dewure Business Centre in Gutu Central, just two … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/10/thieves-steal-mnangagwa-friends-transformer/\">Continue reading<span class=\"screen-reader-text\"> \"Thieves Steal Mnangagwa Friend’s Transformer\"</span></a></p>",
            "time": "20:35",
            "date": "11 May 2025"
        }
    ]
}