{
    "news": [
        {
            "title": "I See No Problem With Ian Ndlovu Taking Wicknell’s Money, Car-Caller",
            "url": "https://www.zimeye.net/2025/04/10/i-see-no-problem-with-ian-ndlovu-taking-wicknells-money-car-caller/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Onana Fires Back at Matic: “I’ve Lifted Trophies with the Greatest Club”",
            "url": "https://www.zimeye.net/2025/04/10/onana-fires-back-at-matic-ive-lifted-trophies-with-the-greatest-club/",
            "content": "Sports Correspondent\n\nManchester United goalkeeper Andre Onana has responded to criticism from Nemanja Matic, who labeled him one of the worst goalkeepers in Manchester Uniteds history. Onana took to social media to defend his reputation, highlighting Matics own lack of success during his time at Old Trafford.\n\nOnanas message was clear: I would never be disrespectful to another club. We know that tomorrow will be a difficult game against a strong opponent. We focus on preparing a performance to make our fans proud. At least Ive lifted trophies with the greatest club in the world. Some cant say the same.\n\nThe exchange comes ahead of Manchester Uniteds Europa quarter-final match against Lyon, with the first leg scheduled for Thursday. Onanas comments suggest hes focused on the upcoming game and proud of his achievements with the club. Matics criticism, meanwhile, has sparked a heated debate about Onanas performances for Manchester United.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Manchester United goalkeeper Andre Onana has responded to criticism from Nemanja Matic, who labeled him “one of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/onana-fires-back-at-matic-ive-lifted-trophies-with-the-greatest-club/\">Continue reading<span class=\"screen-reader-text\"> \"Onana Fires Back at Matic: “I’ve Lifted Trophies with the Greatest Club”\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Caught With Breast And Manhood Enlargement Equipment, Pills",
            "url": "https://www.zimeye.net/2025/04/10/caught-with-breast-enlargement-equipment/",
            "content": "Foreign National Arrested in Harare Over Unregistered Medicines and Illegal Beauty Spa Operation\n\nHarare  9 April 2025\n\nBy A Correspondent | ZimEye | The Zimbabwe Republic Police (ZRP) has confirmed the arrest of a foreign national in connection with the illegal possession and sale of unregistered medicines at an unlicensed beauty spa in Harare.\n\nAccording to a press statement issued today, the suspect was apprehended on 8 April 2025 following a police raid on three properties in the capital. Acting on a tip-off, detectives from the CID Drugs and Narcotics Unit targeted premises located at 46 Van Praagh Avenue in Milton Park, 48 Harare Drive, and 157 Josiah Chinamano Avenue.\n\nAuthorities say the suspect had been operating a beauty spa without a valid license and was offering medical services such as laser wart removal and laser hair removalprocedures that require qualified personnelusing untrained staff.\n\nDuring the operation, police recovered a range of unapproved complementary medicines, including skin lightening creams and body-enhancement products with an estimated street value of ZWG 450,000. Among the seized items were products branded as Sadoer Breast Enlargement Cream, Sadoer Slimming Cream, Ampoule Serum Fresh Anti-Oxidant, Sadoer Kojic Acid, and Sadoer Anti-Wrinkle Soothing.\n\nThe public is implored to cooperate with police crack teams and report all drug peddling activities, said Commissioner Nyathi P., Chief Staff Officer (Press and Public Relations) to the Commissioner-General of Police.\n\nThe ZRP emphasized that nationwide operations are ongoing to dismantle illegal drug and cosmetic product networks, and encouraged citizens to report suspicious activities via the National Complaints Desk or WhatsApp tip line.\n\nThis arrest underscores growing concerns over the influx of unregulated health and beauty products in Zimbabwe and the potential health risks posed by unauthorized cosmetic procedures.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Foreign National Arrested in Harare Over Unregistered Medicines and Illegal Beauty Spa Operation Harare – 9 April 2025 By A … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/caught-with-breast-enlargement-equipment/\">Continue reading<span class=\"screen-reader-text\"> \"Caught With Breast And Manhood Enlargement Equipment, Pills\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Zimbabwe Set for Exciting Group C Matchups at 2025 COSAFA U17 Girls Championship",
            "url": "https://www.zimeye.net/2025/04/10/zimbabwe-set-for-exciting-group-c-matchups-at-2025-cosafa-u17-girls-championship/",
            "content": "Sports Correspondent\n\nThe 2025 COSAFA U17 Girls Championship draw has been finalized, and Zimbabwes young and talented squad has been pitted against Lesotho and Botswana in Group C.\n\nThis highly anticipated tournament promises to be an exciting competition, showcasing the best of Southern Africas young female football talent.\n\nZimbabwes group stage fixtures will see them face off against Lesotho and Botswana in what promises to be a thrilling series of matches. The tournament will provide a valuable platform for Zimbabwes young players to gain international experience, develop their skills, and compete against top-notch opponents.\n\nThe COSAFA U17 Girls Championship is an annual tournament featuring national teams from Southern Africa.\n\nThe competition aims to promote womens football in the region, providing opportunities for young female players to develop their skills and gain international exposure.\n\nZimbabwes squad is comprised of talented young players who have showcased their skills in various local and regional competitions.\n\nWith their first match against Lesotho, Zimbabwe will be looking to make a strong impression and progress to the next stage of the tournament.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The 2025 COSAFA U17 Girls Championship draw has been finalized, and Zimbabwe’s young and talented squad has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/zimbabwe-set-for-exciting-group-c-matchups-at-2025-cosafa-u17-girls-championship/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Set for Exciting Group C Matchups at 2025 COSAFA U17 Girls Championship\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Dealing With Fatigue Behind The Wheel",
            "url": "https://www.zimeye.net/2025/04/10/dealing-with-fatigue-behind-the-wheel/",
            "content": "Feeling tired behind the wheel? Its more than just uncomfortableits dangerous. Drowsy driving is a serious risk that can lead to accidents and harm, not only to you but also to others on the road.\n\nIf youre feeling fatigued, dont push through it. Take a break for a safer journey, is the crucial reminder from road safety experts. Whether youre on a long drive or simply feeling weary after a busy day, pulling over to rest can make all the difference.\n\nRemember, Every life matters. Fatigue impairs your reaction time, judgment, and focus, increasing the chances of making a critical mistake. Dont risk ittake a short break, stretch your legs, and recharge before continuing your journey.\n\nPrioritize safety, and let your well-being guide you to safer travels. If youre tired, stop, rest, and return to the road refreshed. It could save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Feeling tired behind the wheel? It’s more than just uncomfortable—it’s dangerous. Drowsy driving is a serious risk that can lead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/dealing-with-fatigue-behind-the-wheel/\">Continue reading<span class=\"screen-reader-text\"> \"Dealing With Fatigue Behind The Wheel\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Gen Nyambuya says Parliament Has A Role In National Security",
            "url": "https://www.zimeye.net/2025/04/10/gen-nyambuya-says-parliament-has-a-role-in-national-security/",
            "content": "Nyambuya Defends Parliaments Role in National Stability as Land Handouts to MPs Spark Outcry\n\nHarare  10 April 2025\n\nBy A Correspondent | ZimEye | As the Zimbabwean government faces backlash over its allocation of free residential stands to Members of Parliament, a senior parliamentary official has moved to defend the institutions role in maintaining national stability. Speaking at the Zimbabwe Defence University, Deputy President of the Senate, Hon. Lt. Gen. (Rtd) M.R. Nyambuya emphasized the critical importance of parliamentary involvement in safeguarding the countrys security and democratic processes.\n\nParliament has a vital oversight role and a responsibility to contribute meaningfully to national security and stability, Nyambuya told military officers and faculty during a presentation. His remarks come at a time when public trust in Parliament is under severe strain, following the Ministry of Local Governments confirmation that residential stands are being distributed to MPs as non-monetary benefits.\n\nAccording to a press statement from the Ministry dated 10 April, 70 stands were allocated just this week in Mabelreign, Goromonzi, and Zvimba  part of a broader program benefitting MPs from the 8th to 10th Parliaments. While government insists this is a constitutional welfare initiative, critics see it as a direct response to impeachment efforts spearheaded by anti-corruption activist Blessed Geza.\n\nThe timing of these handouts has raised eyebrows, with observers pointing to the proximity of the disbursements to Gezas 31 March protest and impeachment motion. The perception is that the ruling elite is using state resources to buy political loyalty and stave off accountability.\n\nProminent MPs have broken ranks with the establishment narrative. Harare West MP Joana Mamombe voiced her outrage on social media, stating:\n\nThis is heartbreaking! Our precious greenways in #HarareWest are being carved up to allocate MP stands  without any community consultation or consent. These green spaces sustain us in the community This is unjust and wrong!\n\nAmid the growing controversy, Nyambuyas remarks appear to be a subtle yet strategic attempt to reframe Parliaments position not as a complicit beneficiary of state largesse, but as a guardian of national interest  even as the very institution is accused of undermining that principle by accepting land on questionable grounds.\n\nWith Speaker of Parliament Jacob Mudenda already facing international scrutiny for war crimes allegations, the spotlight on Parliament has never been more intense. Whether Nyambuyas appeal to national duty will reassure the public remains to be seen, as the Geza Movement continues to rally for broader accountability and constitutional order.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Nyambuya Defends Parliament’s Role in National Stability as Land Handouts to MPs Spark Outcry Harare – 10 April 2025 By … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/gen-nyambuya-says-parliament-has-a-role-in-national-security/\">Continue reading<span class=\"screen-reader-text\"> \"Gen Nyambuya says Parliament Has A Role In National Security\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Corruption Rocks Education Ministry As Provincial Boss Is Embroiled in Scathing Scandal",
            "url": "https://www.zimeye.net/2025/04/10/corruption-rocks-education-ministry-as-provincial-boss-is-embroiled-in-scathing-scandal/",
            "content": "By A Correspondent\n\nThe Masvingo Provincial Education Director, Shylette Mhike, is facing corruption charges, with her case remanded to May 2, 2025. Mhike and Provincial Financial Director, Liniah Chinoda, are accused of corruption, prompting prosecutor Isabel Pambuka to request a further remand due to outstanding responses from three government departments: the Ministry of Primary and Secondary Education, Public Service Commission, and Treasury.\n\nThe prosecution requested a further remand, citing incomplete responses from key government departments. Mhikes lawyer, Yolander Chandata, protested the remand, arguing that investigations should have been completed by March 31, 2025, and a trial date set. Chandata claimed further delays would violate her clients right to a timely trial.\n\nCorruption in education is a widespread problem, affecting many countries, including Iraq and South Sudan. In Iraq, for example, a former education minister was accused of taking credit for a non-governmental organizations (NGO) work in rebuilding a school.\n\nIn South Sudan, corruption has led to severe consequences, including underfunding of essential public services and undermining the effectiveness of anti-corruption laws.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Masvingo Provincial Education Director, Shylette Mhike, is facing corruption charges, with her case remanded to May … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/corruption-rocks-education-ministry-as-provincial-boss-is-embroiled-in-scathing-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Corruption Rocks Education Ministry As Provincial Boss Is Embroiled in Scathing Scandal\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Wicknell Shocks Opposition Who Trust In Ian Ndlovu As He Gives Him 150K And A Car",
            "url": "https://www.zimeye.net/2025/04/10/wicknell-shocks-opposition-who-trust-in-ian-ndlovu-as-he-gives-him-150k-and-a-car/",
            "content": "FULL TEXT\n\nTRIBUTE TO A TRUE SERVANT OF GOD\n\nIn my entire LIFETIME, I have met a FEW true PROPHETS of GOD, who remain full of HUMILITY, despite having an exceptional GIFT of prophecy, EVANGELISM and giving spiritual COUNSEL to the Nation. Today I want to extend my DEEPEST gratitude to a MAN of GOD whose ministry has touched countless lives, PROPHET IAN NDLOVU.\n\nThrough the Divine Kingdom Baptist Ministries, you have stood as a BEACON of truth, unity and PEACE in the body of CHRIST. The importance of the CHURCH has been particularly important NOW, more than ever, in a nation often marked by UNNECESSARY political tension and polarization. Your CONSISTENT calls for NATIONAL prayer for our Countrys LEADERSHIP, regardless of political affiliation, is a mark of political MATURITY and spiritual INTEGRITY which warrants proper recognition.\n\nWhat I admire most is that you NEVER use the pulpit to sow division, but rather, you have used it to foster DIALOGUE and RECONCILIATION. You have carried the Zimbabwean FLAG on your shoulders with pride, patriotism and DIGNITY, a reminder that God still has a plan for our GREAT nation of ZIMBABWE.\n\nIn recognition of your remarkable contribution to the BODY of CHRIST and for remaining a true SERVANT of GOD, I am pleased to extend my small TOKEN of appreciation, a brand spanking new 2025 Toyota Land Cruiser 300 Series VXR for you and also a brand new 2025 Toyota Fortuner 2,8d GD6 for your one and only wife MRS NDLOVU to enable her travel easily when she does her amazing charity work all over Matebeleland. Please go to FARAMATSI MOTORS at their Club Chambers showroom, corner Nelson Mandela Avenue and 3rd Street and see FARAI , both your cars worth USD 280 000.00 are paid for in FULL and ready for collection. A further donation of 100 thousand dollars towards the completion of your church and another 50 thousand dollars towards Mrs Ndlovus charity work will be deposited into your church bank account.\n\nMay God continue to increase your INFLUENCE and PRESERVE your Ministry. Zimbabwe is spiritually RICHER because of men of FAITH like you \n\n#Divine_Kingdom #National_Unity\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "FULL TEXT TRIBUTE TO A TRUE SERVANT OF GOD… In my entire LIFETIME, I have met a FEW true PROPHETS … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/wicknell-shocks-opposition-who-trust-in-ian-ndlovu-as-he-gives-him-150k-and-a-car/\">Continue reading<span class=\"screen-reader-text\"> \"Wicknell Shocks Opposition Who Trust In Ian Ndlovu As He Gives Him 150K And A Car\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Govt Officially Confirms It’s Dishing Out Free Stands to MPs, As Geza-Impeachment-Pressure Hots Up",
            "url": "https://www.zimeye.net/2025/04/10/govt-officially-confirms-its-dishing-out-free-stands-to-mps-as-geza-pressure-hots-up/",
            "content": "Harare  10 April 2025\n\nBy A Correspondent | ZimEye | The Zimbabwean government has officially confirmed the allocation of residential land to Members of Parliament  a move drawing sharp public criticism, with some lawmakers themselves condemning the process as unjust and lacking transparency. The announcement follows mounting pressure on the Mnangagwa administration, particularly from anti-corruption campaigner Blessed Geza, who recently called for the presidents impeachment.\n\nIn a press statement dated 10 April 2025, the Ministry of Local Government and Public Works outlined the governments plan to allocate stands to MPs from the 8th, 9th, and current 10th Parliament as a once-off entitlement under their conditions of service. The statement confirms that 70 stands were issued on 9 April  40 in Mabelreign (Harare), 15 in Killarney (Goromonzi), and 15 in Penrose (Zvimba).\n\nThe announcement has triggered widespread backlash over what many see as a politically motivated move to shield President Emmerson Mnangagwa from accountability. Critics argue the disbursements, coming immediately after Gezas public protest, are designed to buy loyalty from legislators who may be asked to vote on impeachment proceedings.\n\nAmong the most vocal critics is Harare West MP Joana Mamombe, who took to social media to denounce the allocations, particularly their impact on public land:\n\nThis is heartbreaking! Our precious greenways in #HarareWest are being carved up to allocate MP stands  without any community consultation or consent. These green spaces sustain us in the community. How can we destroy what gives us life? This is unjust and wrong!\n\nDespite efforts to present the allocations as part of a broader welfare initiative, no clear process of public consultation has been identified, and key local authorities  including the Harare City Council and the Department of Housing in Mbare  have not issued statements to clarify the criteria or transparency mechanisms involved.\n\nThe allocations are also being viewed within the context of deeper political maneuvering. Speaker of Parliament Jacob Mudenda, under international scrutiny for unresolved war crimes allegations raised in a 2019 ZimEye interview, is believed to be central to the orchestration of the land handouts.\n\nAs the Geza Movement continues to escalate its campaign, promising further action if impeachment is blocked, the regimes resort to land giveaways has become a flashpoint. What was framed as support for MPs is now seen by many  including those within Parliament  as an abuse of state resources to protect the powerful.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 10 April 2025 By A Correspondent | ZimEye | The Zimbabwean government has officially confirmed the allocation of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/govt-officially-confirms-its-dishing-out-free-stands-to-mps-as-geza-pressure-hots-up/\">Continue reading<span class=\"screen-reader-text\"> \"Govt Officially Confirms It’s Dishing Out Free Stands to MPs, As Geza-Impeachment-Pressure Hots Up\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        },
        {
            "title": "Veteran Opposition Activist Targets Victory In Glen View South",
            "url": "https://www.zimeye.net/2025/04/10/veteran-opposition-activist-targets-victory-in-glen-view-south/",
            "content": "By Tinashe Sambiri\n\nVeteran opposition activist Tungamirai Madzokere is eyeing a strong comeback in the political arena as he contests in the Glen View South Constituency by-election set for April 12.\n\nMadzokere, running as an independent candidate, is up against ZANU PFs Tranquility Tsitsi Tawomhera, fellow independents Tonderai Chakaredza and George Makwangaidzeboth also affiliated with the oppositionand Perpetua Mukanda from the National Constitutional Assembly (NCA) led by Lovemore Madhuku.\n\nMadzokere, a long-time activist and former political prisoner, is banking on grassroots support and his track record of resilience in fighting for democratic reforms. A member of his campaign team, speaking confidently, said:\n\nWe are not just participatingwe are in this to win. Glen View South knows who stood with them in difficult times, and Tungamirai is that person.\n\nThe team member also criticized the ruling partys campaign tactics, saying voters will not be swayed by freebies. People are tired of empty promises and temporary handouts. They want real leadership, someone who understands their strugglesnot someone imposed on them with groceries and cash.\n\nWith tensions rising and the stakes high, Glen View South is shaping up to be one of the most closely watched by-elections of the year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Veteran opposition activist Tungamirai Madzokere is eyeing a strong comeback in the political arena as he contests … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/10/veteran-opposition-activist-targets-victory-in-glen-view-south/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran Opposition Activist Targets Victory In Glen View South\"</span></a></p>",
            "time": "08:38",
            "date": "11 Apr 2025"
        }
    ]
}