{
    "news": [
        {
            "title": "Lubinda Says He’s Using Lungu’s Corpse To Threaten Govt During Mourning | IS HE NOW A TERRORIST?",
            "url": "https://www.zimeye.net/2025/06/17/lubinda-says-hell-use-lungus-corpse-to-threaten-govt-during-mourning/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Vic Falls Man Survives Fierce Lion Attack",
            "url": "https://www.zimeye.net/2025/06/17/vic-falls-man-survives-fierce-lion-attack/",
            "content": "By ACorrespondent-AWoodlands Resettlement Area near Victoria Falls has survived a savage lion attack over the weekend.\n\nMetrod Tshuma(29) said heard people shouting, dogs barking, and the unmistakable roar of a lion near the village cattle grazing area.\n\nI heard people shouting and dogs barking. I ran out and heard a lion roaring where our cattle graze, so I ran to meet my colleagues to try and scare it away, Tshuma recounted.\n\nBut before he could act, disaster struck.\n\nThe lion had gone into a thicket close to where I was, with my colleagues behind me. It came from behind and attacked me, he said.\n\nThe lion bit off his thumb and clawed his head and hand, leaving him seriously injured.\n\nTshuma managed to push the animal away and crawl to safety, screaming for help until others rushed to his aid.\n\nHe was rushed to Victoria Falls Hospital, where he remains admitted and is receiving treatment for deep wounds.\n\nI thank the Almighty God for protecting me because I could have been killed by that lion, said Tshuma from his hospital bed.\n\nThe same lion is believed to have killed aneighbourscow the previous day, and shortly after attacking Tshuma, it went on to maul two donkeys.\n\nResidents in the Woodlands area say they are living in fear, with wild animals frequently invading their communities.\n\nOver 50 cattle have reportedly been lost to wildlife this year alone.\n\nI am appealing to the authorities to help us. Some of these lions are even collared. School children walk long distances to school andtheyare in danger, said a concerned resident.\n\nThe attack on Tshuma underscores a broader problem facing communities on the edge of wildlife conservation areas.\n\nAs animal habitats shrink and climate conditions worsen, encounters between humans and wildlife are becoming more frequentand often deadly.\n\nLocal leaders and residents continue to call for urgent intervention by wildlife authorities to ensure community safety while balancing conservation efforts.\n\n-ZBC\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-A Woodlands Resettlement Area near Victoria Falls has survived a savage lion attack over the weekend. Metrod Tshuma (29) said heard … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/vic-falls-man-survives-fierce-lion-attack/\">Continue reading<span class=\"screen-reader-text\"> \"Vic Falls Man Survives Fierce Lion Attack \"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Active Social Media Participation Sinks Mzembi",
            "url": "https://www.zimeye.net/2025/06/17/active-social-media-participation-sinks-mzembi/",
            "content": "By Crime and Courts Reporter Former Foreign Affairs Minister Walter Mzembi has been denied bail and remanded in custody until July 1, when his long-delayed trial is expected to commence.\n\nHarare magistrate Don Ndiroweimade the rulingon Monday, citing Mzembis continued presence on social media while in self-imposed exile as a key reason for rejecting his bail application.\n\nMzembi was arrested last Friday by officers from the Zimbabwe Anti-Corruption Commission (ZACC), shortly after quietly returning to Zimbabwe and meeting President Emmerson Mnangagwa at State House.\n\nHe is accused of defaulting on court appearances dating back to 2019 and failing to comply with three outstandingwarrants of arrest.\n\nHis lawyer, Mr. Killian Mandiki,submitted that Mzembi had not willfully absconded, arguing that his client had received court permission to temporarily retain his passport in late 2018 to seek emergency medical treatment in South Africa.\n\nDiagnosed with advanced rectal cancer, Mzembi reportedly underwent surgery there before relocating to Zambia in early 2024 due to travel document complications.\n\nMandiki told the court that upon arriving in Zambia, Mzembis condition deteriorated sharply, requiring urgent hospitalization, oxygen support, and close medical monitoring for over 10 days. Medical records were tendered to support his claim.\n\nHowever, the Staterepresented by Acting Deputy Prosecutor-General Ms. Tendai Shonhayiarguedthat Mzembi failedto make any effortto return and cancel his arrest warrants after his alleged recovery in Zambia in 2024.\n\nThe prosecution further noted that despite his medical claims, Mzembi actively campaigned on social media for Saviour Kasukuwere during the 2023 presidential elections.\n\nIn his ruling, Magistrate Ndirowei said, There is a gap as to what transpired with his medical condition. The attached reports could have been useful had he presented himself in 2019, not in 2025. He further noted that after his reported discharge in 2024, Mzembi made no effort to regularize his legal status or surrender to the courts.\n\nHe was not sick to the extent he wants the court to believe. He was active on social media and politically involved, Ndirowei stated. He concluded that the State had proven, on a balance of probabilities, that Mzembi had defaulted willfully.\n\nConsequently, Ndirowei confirmed the warrants of arrest, revoked bail, and committed Mzembi to remand prison pending trial.\n\nApart from the issue of absconding, Mzembi also faces charges of criminal abuse of office.\n\nProsecutors allege that as Minister of Tourism and Hospitality Industry, he misappropriated television sets worth US$2 million that were procured for fan parks during the 2010 FIFA World Cup in South Africa.\n\nHe is also accused of failing to return his passport by November 19, 2018, and missing a scheduled court appearance on January 18, 2019.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter– Former Foreign Affairs Minister Walter Mzembi has been denied bail and remanded in custody until … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/active-social-media-participation-sinks-mzembi/\">Continue reading<span class=\"screen-reader-text\"> \"Active Social Media Participation Sinks Mzembi\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Zimbabweans Could Be Banned From Travelling To US",
            "url": "https://www.zimeye.net/2025/06/17/zimbabweans-could-be-banned-from-travelling-to-us/",
            "content": "By A Correspondent| Zimbabwe is one of 36 countries that could soon face travel restrictions to the United States due to concerns over identity document fraud and visa violations, according to aWashington Postreport on Sunday.\n\nThe move follows a memo signed by U.S. Secretary of State Marco Rubio and circulated to American diplomats over the weekend. The document gives the affected countries 60 days to comply with new rules set by the State Department.\n\nThe memo outlines that some countries have failed to meet U.S. standards for issuing reliable identity documents, with several lacking a functional or cooperative government authority to do so. Others reportedly have high numbers of citizens who overstayed visas or violated visa terms.\n\nIn some cases, cooperationsuch as agreeing to take back third-country nationals deported from the U.S.could help mitigate U.S. concerns, the memo notes.\n\nThe list of countries potentially facing visa restrictions or travel bans includes 25 African nations, among them: Angola, Ghana, Nigeria, Ethiopia, South Sudan, Uganda, Zambia, and Zimbabwe.\n\nAlso on the list are four Caribbean nations: Antigua and Barbuda, Dominica, Saint Kitts and Nevis, and Saint Lucia; four Asian countries: Bhutan, Cambodia, Kyrgyzstan, and Syria; and three in Oceania: Tonga, Tuvalu, and Vanuatu.\n\nThese countries have until 8:00 AM Wednesday to submit an initial plan for how they intend to meet the new requirements.\n\nWhile the State Department has not publicly confirmed details of the memo, a spokesperson said the agency continually reevaluates policies to ensure the safety of Americans and lawful compliance by foreign nationals.\n\nIt remains unclear whether any travel bans or visa restrictions will immediately take effect following the deadline.\n\nThe memo was issued shortly after former President Donald Trump reinstated his controversial first-term travel ban. That directive blocks entry from 12 nations and imposes restrictions on seven others. In January, Trump also signed an order directing the State Department to identify countries with inadequate vetting systems that could justify a full or partial suspension of travel.\n\nThese actions are part of a broader immigration enforcement agenda that includes large-scale deportation plans, visa cancellations, and the rollback of protections for tens of thousands of immigrants.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Zimbabwe is one of 36 countries that could soon face travel restrictions to the United States due … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/zimbabweans-could-be-banned-from-travelling-to-us/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabweans Could Be Banned From Travelling To US\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Walter Mzembi’s Bail Revoked After Court Finds Willful Default",
            "url": "https://www.zimeye.net/2025/06/17/walter-mzembis-bail-revoked-after-court-finds-willful-default/",
            "content": "Harare  June 17, 2025\n\nFormer Cabinet Minister Walter Mzembi has had his bail revoked after the Harare Magistrates Court ruled that he willfully defaulted court proceedings without a valid explanation.\n\nPresiding over the matter, Magistrate Donald Ndirowei said Mzembi failed to justify his prolonged absence from court, despite submitting medical records. The court found that the attached documents could have only been relevant had he availed himself in 2019  not six years later in 2025.\n\nThere is a gap regarding what transpired with his medical report. The attached medical records would have sufficed if he had presented himself in 2019, not now, Magistrate Ndirowei noted.\n\nHe further observed that Mzembi made no attempt to return to Zimbabwe and cancel the outstanding warrants of arrest after being discharged from medical care in Zambia in 2024.\n\nThe court is not convinced he was as sick as he wants us to believe. He was, in fact, actively campaigning for Saviour Kasukuwere during the 2023 elections and was visibly present on social media, the magistrate said.\n\nMagistrate Ndirowei concluded that the State had successfully demonstrated, on a balance of probabilities, that Mzembis default was deliberate. The accuseds submissions fall far short. The warrants of arrest are hereby confirmed, bail is revoked, and he is committed to prison pending trial, he ruled.\n\nMzembi will now remain in custody as legal proceedings continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – June 17, 2025 Former Cabinet Minister Walter Mzembi has had his bail revoked after the Harare Magistrates Court … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/walter-mzembis-bail-revoked-after-court-finds-willful-default/\">Continue reading<span class=\"screen-reader-text\"> \"Walter Mzembi’s Bail Revoked After Court Finds Willful Default\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Hunters FC Appoint 27-Year-Old As Head Coach",
            "url": "https://www.zimeye.net/2025/06/17/hunters-fc-appoint-27-year-old-as-head-coach/",
            "content": "Sports Correspondent\n\nAmbitious Eastern Region Division One leaders Hunters FC have made a bold move by appointing 27-year-old Clifford Dzvairo as their new head coach. Dzvairo steps in to replace the experienced and well-travelled John Nyikadzino, who recently departed to take over at Bulawayo Chiefs.\n\nDzvairos appointment marks a fresh chapter for Hunters FC, who are chasing promotion and will now look to the young tactician to maintain their strong momentum. Despite his age, Dzvairo is regarded as one of the most promising young coaches in the region, with the club betting on his energy and modern approach to take them to the next level.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Ambitious Eastern Region Division One leaders Hunters FC have made a bold move by appointing 27-year-old Clifford Dzvairo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/hunters-fc-appoint-27-year-old-as-head-coach/\">Continue reading<span class=\"screen-reader-text\"> \"Hunters FC Appoint 27-Year-Old As Head Coach\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Leaked : Opposition MPs  Secretly Given Motor Vehicles by Mnangagwa",
            "url": "https://www.zimeye.net/2025/06/17/leaked-opposition-mps-secretly-given-motor-vehicles-by-mnangagwa/",
            "content": "By A Correspondent\n\nA confidential list leaked from within Parliament has revealed that several Members of Parliament  from both Zanu PF and the opposition  were quietly notified to collect brand new vehicles, allegedly as part of a strategy by President Emmerson Mnangagwa to silence critical voices within the legislature.\n\nAccording to a source within Parliament who spoke on condition of anonymity, the distribution of the vehicles was communicated on Tuesday directly from the Office of the President. The source claimed, Mnangagwa wants to silence Parliamentarians who lead key Portfolio Committees. Remember there is 2030, referencing the Presidents Vision 2030 agenda. Also, Mnangagwa fraudulently endorsed the Parirenyatwa Group of Hospitals refurbishment tender. Therefore, he has strategically thrown the dice to silence Parliamentarians thought to be influential in making noise.\n\nThe legislators reportedly receiving vehicles:\n\nNational Assembly Panel\n\n1. Tsitsi Zhou\n\n2. N. Maunganidze\n\n3. J. Tshuma\n\nSenate Panel\n\n1. Chief Mtshane Khumalo\n\n2. E. Kambizi\n\n3. A. Dube\n\nChief Whips and Leader of Opposition\n\nNational Assembly Panel\n\n1. M. Kademaunga\n\n2. C. Moyo\n\n3. C. Kambuzuma\n\n4. B. Nyandoro\n\nSenate Panel\n\n1. N. Mlotshwa\n\n2. T.V. Muzenda\n\n3. J. Gotora\n\n4. S. Chapfudza\n\nChairpersons Panel 9th Parliament\n\nNational Assembly Panel\n\n1. W. Mutomba\n\n2. T. Mavetera\n\n3. M. Khumalo\n\nSenate Panel\n\n1. Chief F. Z. Charumbira\n\n2. T. B. Mohadi\n\n3. E. Kambizi\n\nPortfolio Committees\n\n1. Samukange\n\n2. C. Hwende\n\n3. E. Mutodi\n\n4. M. Njanji\n\n5. T. Matangira\n\n6. S. Maburutse\n\n7. D. Malinganiso\n\n8. E. Maoneke\n\n9. C. Chiduwa\n\n10. G. Mutandi\n\n11. T. Karikoga\n\n12. S. Mandiwanzira\n\n13. I. D. Jere\n\n14. M. Ziyambi\n\n15. S. Matema\n\n16. J. Makombe\n\n17. C. Matewu\n\n18. V. Moyo\n\n19. V. Sihlabo\n\n20. Dr. T. Khupe\n\n21. E. Zvobgo\n\n22. J. Mamombe\n\nThematic Committee Chairpersons\n\n1. Sen. Tongogara\n\n2. Sen. Zindi\n\n3. Chief Siansali\n\n4. Chief Nechombo\n\n5. M. Mdhluri\n\n6. Sen. Mupfumira\n\n7. Sen. Mavenyengwa R.\n\n8. Sen. S. Ndebele\n\nThe inclusion of opposition MPs such as Hon C. Matewu has raised eyebrows, with observers questioning whether bipartisan silence is being bought ahead of potentially controversial government initiatives.\n\nCritics argue that the timing and secrecy of the distribution raise serious ethical concerns. Civil society watchdogs have called for transparency and accountability, warning that such covert incentives erode the independence of Parliament.\n\nIf legislators are being rewarded in the dark, how can they be expected to hold the executive to account? asked one political analyst.\n\nAs of now, neither the Presidents Office nor Parliament has issued a formal statement in response to the leaked list.\n\nThe said Parliamentarians are yet to respond to the their involvement in the said ploy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A confidential list leaked from within Parliament has revealed that several Members of Parliament — from both … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/leaked-opposition-mps-secretly-given-motor-vehicles-by-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Leaked : Opposition MPs  Secretly Given Motor Vehicles by Mnangagwa\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "FIFA Club World Cup Round-Up: Chelsea Grind Out Win as Flamengo Cruise, Boca and Benfica Share Spoils",
            "url": "https://www.zimeye.net/2025/06/17/fifa-club-world-cup-round-up-chelsea-grind-out-win-as-flamengo-cruise-boca-and-benfica-share-spoils/",
            "content": "By Sports Correspondent\n\nChelsea battled to a hard-fought 2-0 victory over Los Angeles FC in a tense FIFA Club World Cup encounter, with goals in either half securing the Blues progression.\n\nDespite dominating possession, the Premier League side struggled to break down a resolute LA defence.\n\nElsewhere, Brazilian giants Flamengo eased past ES Tunis with a confident 2-0 win, asserting their dominance early and maintaining control throughout. In the most dramatic match of the round, Boca Juniors and Benfica played out a thrilling 2-2 draw, with both sides exchanging goals in an end-to-end contest that could have gone either way.\n\nThe tournament heats up as the worlds top clubs vie for global supremacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Chelsea battled to a hard-fought 2-0 victory over Los Angeles FC in a tense FIFA Club World … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/fifa-club-world-cup-round-up-chelsea-grind-out-win-as-flamengo-cruise-boca-and-benfica-share-spoils/\">Continue reading<span class=\"screen-reader-text\"> \"FIFA Club World Cup Round-Up: Chelsea Grind Out Win as Flamengo Cruise, Boca and Benfica Share Spoils\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "R Kelly Hospitalised After Overdosing Medication",
            "url": "https://www.zimeye.net/2025/06/17/r-kelly-hospitalised-after-overdosing-medication/",
            "content": "The 58-year-old musician, whose real name is Robert Sylvester Kelly, is currently serving a 30-year sentence at the Federal Correctional Institute following his 2021 conviction in New York on charges of racketeering and sex trafficking.\n\nAccording to a court filing by his attorney, Beau B. Brindley, Kelly was placed in solitary confinement on June 10 and was administered anxiety medication by prison staff. Over the following days, he was reportedly given additional prescriptions and instructed to take them.\n\nThree days later, Kelly began experiencing severe side effects, including dizziness, faintness, and seeing black spots in his vision. He subsequently lost consciousness and was transported to Duke University Hospital for emergency treatment.\n\nThe filing further alleges that during the ambulance ride, one prison officer remarked, This is going to open a whole new can of worms.\n\nMedical personnel at the hospital are said to have discovered blood clots in Kellys legs and lungs, prompting plans for surgical intervention.\n\nBrindley claims the overdose was the result of Kelly being given dangerously high quantities of medication and has raised concerns about the quality of medical oversight within the prison system.\n\nSOURCE: The Sun\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "American R&B singer R. Kelly was rushed to hospital last week after reportedly overdosing on medication while in solitary confinement … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/r-kelly-hospitalised-after-overdosing-medication/\">Continue reading<span class=\"screen-reader-text\"> \"R Kelly Hospitalised After Overdosing Medication\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        },
        {
            "title": "Agriculture: Why You Need Records On Your Farm…",
            "url": "https://www.zimeye.net/2025/06/17/agriculture-why-you-need-records-on-your-farm/",
            "content": "By Dr Trywell Muzerengi\n\nFarming goes beyond planting crops and raising animals  it is a business that needs to be managed effectively. One of the key tools for good farm management is record keeping. Accurate and up-to-date records help farmers track activities, evaluate performance, and make informed decisions.\n\nBelow are the main types of farm records and why they matter:\n\nThese track what the farm produces, whether from crops or livestock.\n\nExamples:\n\nPlanting dates\n\nCrop types or seed varieties used\n\nHarvest quantities\n\nNumber of animals born or sold\n\nQuantity of milk, eggs, or meat produced\n\nWhy They Matter:Production records help farmers identify which crops or animals perform best. This information supports better planning, improved yields, and increased profits in future seasons.\n\nInput records show what has been used to support production on the farm.\n\nExamples:\n\nFertilizers or compost applied\n\nPesticides or organic sprays used\n\nAnimal feed purchases\n\nLabor used for various tasks\n\nWhy They Matter:These records help manage costs and ensure resources are used efficiently. Farmers can compare inputs with outputs to assess whether farming methods are cost-effective.\n\nThese detail the farms income and expenses, offering a full picture of its financial health.\n\nExamples:\n\nSales of farm produce\n\nExpenses on seeds, chemicals, or tools\n\nLoan and repayment details\n\nProfit and loss statements\n\nWhy They Matter:Financial records allow farmers to monitor cash flow, assess profitability, and make smart decisions about budgeting and investment.\n\nInventory records list all the physical assets owned or used by the farm.\n\nExamples:\n\nTools and machinery\n\nLivestock and poultry numbers\n\nStored feed, seeds, and fertilizers\n\nBuildings and storage facilities\n\nWhy They Matter:These records help keep track of valuable assets, avoid unnecessary purchases, and support farm planning and insurance claims.\n\nConclusion\n\nRecord keeping is essential for every farmer who wants to grow a successful and sustainable farming business. Whether small or large-scale, a well-documented farm gives the farmer control, clarity, and the ability to plan for a better future.\n\n[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Farming goes beyond planting crops and raising animals — it is a business that needs to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/17/agriculture-why-you-need-records-on-your-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Agriculture: Why You Need Records On Your Farm…\"</span></a></p>",
            "time": "18:42",
            "date": "18 Jun 2025"
        }
    ]
}