{
    "news": [
        {
            "title": "Kariba Crocodiles Spotted Scrambling For Suspicious Object",
            "url": "https://www.zimeye.net/2025/01/19/kariba-crocodiles-spotted-scrambling-for-suspicious-object/",
            "content": "Search Efforts Intensify for Missing Individuals in Kariba\n\nBy Desmond Shumba |The search for two missing individuals in Kariba has escalated, with teams braving rugged terrain, crocodile-infested waters, and lion-prone bushes in their mission to locate spear fisherman Matibillia and Sabina, who remain unaccounted for.\n\nA 12-member team has been scouring the lower Zambezi after receiving critical leads from Zambian fishermen. Reports of crocodiles scrambling over a floating object in the river have added urgency and a glimmer of hope. Commenting on this sighting, the member of Parliament Mutsa Murombedzi  noted, Seeing the crocodiles contesting for something floating gave us mixed emotionson one hand, its alarming, but on the other, it could be a breakthrough in locating Matibillia.\n\nUpdate on Kariba missing peopleThrough the rugged terrain & across the Zambezi, the search for missing spear fisherman Matibilila  continues.A 12-member team scoured the lower Zambezi yesterday following leads from Zambian fishermen. Reports of crocodiles contesting apic.twitter.com/aIxjTLRggp\n\nCrocodiles scrambling for a floating object in the Zambezi River is a natural behavioral phenomenon often tied to their territorial instincts or opportunistic feeding habits. These reptiles are highly sensitive to disturbances in water and are known to investigate floating debris, which they might mistake for prey or carrion. In similar incidents, such as during floods or riverine accidents, crocodiles have been observed congregating around unusual objects, particularly if there are scents or movements that mimic distressed animals. This behavior may signal the presence of organic material, such as a carcass, or simply curiosity driven by their predatory instincts. In search missions like the one in Kariba, such sightings are often taken seriously, as they may provide vital clues about missing individuals, especially in waterways where crocodiles are apex predators and scavengers.\n\nIn Ward 6, a 22-member volunteer group, led by Councillor George Masendu, is searching for Sabina in dense bushes known for lion activity. Their dedication highlights the communitys determination to bring closure to this tragic situation.\n\nMember of Parliament Mutsa Murombedzi commended the efforts, stating, Through the rugged terrain and across the Zambezi, the search continues. The resilience and courage of these teams, even in the face of wildlife threats, is truly commendable.\n\nThe search teams have planned an overnight vigil by the Zambezi Rivers edge to ensure no opportunity is missed in the quest to find the missing individuals. Updates will follow as the situation develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Search Efforts Intensify for Missing Individuals in Kariba By Desmond Shumba | The search for two missing individuals in Kariba … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/kariba-crocodiles-spotted-scrambling-for-suspicious-object/\">Continue reading<span class=\"screen-reader-text\"> \"Kariba Crocodiles Spotted Scrambling For Suspicious Object\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "“Africa is Splitting: Scientists Claim Formation of a New Ocean as Continent Divides”",
            "url": "https://www.zimeye.net/2025/01/19/africa-is-splitting-scientists-claim-formation-of-a-new-ocean-as-continent-divides/",
            "content": "The African continent is slowly splitting in two, with scientists pointing to tectonic shifts along the East African Rift System as the catalyst for a new oceans eventual formation. This process, occurring over millions of years, could reshape Africas geography, potentially giving landlocked countries like Zambia and Uganda access to coastlines.\n\nA massive crack that appeared in Kenyas Rift Valley in 2018 and a 35-mile-long fissure in Ethiopias Afar region in 2005 are among the most visible signs of this tectonic activity. According to a 2018 report byPBS NewsHour, the East African Rift System is evidence of the tectonic forces pulling apart the Somali and Nubian plates.\n\nDr. Ken Macdonald, a marine geophysicist at the University of California, Santa Barbara, explained toNBC News: Eventually, over tens of millions of years, the ocean will flood in and this part of East Africa will become a separate continent.\n\nTheGround Reporthighlights that this process is slow but inevitable, noting, The plates are moving apart at a rate of a few millimeters per year, but the result will eventually be a completely new ocean basin.\n\nWhile this monumental transformation is far beyond the timescale of human observation, these fissures are providing a glimpse into the Earths dynamic and ever-changing geology.\n\nThe claim that Africa is gradually splitting into two landmasses due to tectonic activity is supported by geological evidence. The East African Rift System (EARS) is a significant tectonic feature extending over 3,000 kilometers from the Gulf of Aden in the north towards Zimbabwe in the south, effectively dividing the African Plate into the Somali and Nubian plates.\n\nNotable manifestations of this tectonic activity include a massive crack that appeared in Kenyas Rift Valley in 2018, which caused part of the Nairobi-Narok highway to collapse, and a 35-mile-long fissure that emerged in Ethiopias Afar region in 2005.\n\nOver millions of years, the continued divergence of these plates is expected to lead to the formation of a new ocean, potentially granting currently landlocked countries like Zambia and Uganda access to coastlines. However, this process is exceedingly slow, occurring at a rate of a few millimeters per year, and is estimated to take between 5 to 10 million years to result in significant geographical changes.\n\nIn summary, the geological processes leading to Africas gradual split and the eventual formation of a new ocean are well-documented, but these transformations will unfold over an extended geological timescale, far beyond the span of human lifetimes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The African continent is slowly splitting in two, with scientists pointing to tectonic shifts along the East African Rift System … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/africa-is-splitting-scientists-claim-formation-of-a-new-ocean-as-continent-divides/\">Continue reading<span class=\"screen-reader-text\"> \"“Africa is Splitting: Scientists Claim Formation of a New Ocean as Continent Divides”\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "School Sends Off 9 Year Old Over School Fees Leading To His Death",
            "url": "https://www.zimeye.net/2025/01/19/school-sends-off-9-year-old-over-school-fees-leading-to-his-death/",
            "content": "By Farai D Hove |A nine-year-old boy from Rutavo Village, Mwenezi, lost his life after drowning in a dam on January 15, 2025. Junior Lunga was sent home from Matando Primary School over unpaid fees, a decision that not only denied him his constitutional right to education but also set off a chain of events leading to his untimely death. Stripped of his dignity and dejected, Lunga stopped by a local dam on his way home, where he drowned while swimminga heartbreaking culmination of negligence, poverty, and institutional insensitivity.\n\nThis case brings into sharp focus the intersection of legal, moral, and social issues: a childs right to education, the responsibilities of schools to protect their students, and the broader societal obligations to safeguard vulnerable children. It is a story of dehumanization, systemic inequality, and the devastating cost of neglect, challenging both Zimbabwe and the international community to confront the hidden dangers of policies that prioritize financial concerns over a childs life and dignity.\n\nViolation of Zimbabwean Laws\n\n1.The Right to Education (Constitution of Zimbabwe, 2013)\n\nSection 75 of Zimbabwes Constitution enshrines the right to basic education, explicitly stating that every child is entitled to education regardless of circumstances. By sending Junior Lunga home for unpaid fees, Matando Primary School violated this constitutional guarantee. Schools, as public institutions, have a legal obligation to provide access to education and cannot prioritize financial considerations over a childs rights.\n\n2.Child Protection and Welfare (Childrens Act, Chapter 5:06)\n\nUnder the Childrens Act, the State has a duty to protect children from neglect, abuse, and situations that could endanger their lives. Sending a minor home alone due to unpaid fees, especially in rural areas with known hazards like water bodies, demonstrates negligence. The act of sending Lunga home exposed him to a foreseeable risk, culminating in his tragic death.\n\n3.Negligence by Duty-Bearers\n\nThe decision by school authorities to send Lunga home without considering his safety falls under gross negligence. Zimbabwean tort law recognizes a duty of care owed by institutions to minors under their supervision. By failing to ensure Lungas safety, the school breached this duty, making it potentially liable for wrongful death claims.\n\nViolations of International Legal Standards\n\n1.United Nations Convention on the Rights of the Child (UNCRC)\n\nZimbabwe is a signatory to the UNCRC, which emphasizes the childs right to education (Article 28) and protection from harm (Article 19). By sending Lunga home and exposing him to emotional distress and physical danger, the school failed to uphold these obligations, contravening the principles of the Convention.\n\n2.International Covenant on Economic, Social and Cultural Rights (ICESCR)\n\nArticle 13 of the ICESCR affirms the right to free and compulsory primary education. Zimbabwes obligations under this covenant require it to ensure that no child is denied access to school due to financial barriers. Lungas exclusion for unpaid fees demonstrates a failure to meet this international standard.\n\n3.Human Dignity and Non-Discrimination\n\nThe UNCRC also upholds the principle of non-discrimination (Article 2), requiring states to protect children from differential treatment. Sending Lunga home because of his familys financial struggles not only dehumanized him but also reinforced systemic inequalities, violating his dignity and self-worth.\n\nLegal and Ethical Considerations\n\n1.Emotional and Psychological Harm\n\nThe humiliation and dejection Lunga experienced as a result of being sent home can be construed as a form of psychological abuse. The act of singling out children for unpaid fees fosters stigmatization, a practice that could amount to inhumane and degrading treatment prohibited under Zimbabwean and international human rights law.\n\n2.State and Institutional Accountability\n\nThe State has a duty to regulate schools and ensure compliance with legal standards protecting children. The failure to enforce policies prohibiting the exclusion of children for unpaid fees points to systemic inadequacies. Furthermore, the Ministry of Primary and Secondary Education bears responsibility for ensuring that schools prioritize the welfare of students over financial considerations.\n\nRecommendations\n\n1.Policy Reform on School Fees\n\nZimbabwe must enforce stricter regulations prohibiting schools from sending children home for unpaid fees. Alternatives such as government subsidies or deferred payment plans should be explored to prevent similar tragedies.\n\n2.Training and Awareness for Schools\n\nEducational institutions must receive training on child rights and the legal implications of their actions. A clear protocol should be established to address situations involving unpaid fees without jeopardizing a childs safety or dignity.\n\n3.Legal Recourse for Families\n\nJunior Lungas family has grounds to pursue legal action for negligence and violations of constitutional and statutory rights. Civil litigation could serve as a deterrent against future violations and push for systemic change.\n\n4.Community and State Interventions\n\nGreater efforts are needed to address poverty and systemic barriers to education in rural areas. This includes providing safe transport, ensuring water bodies are secure, and raising awareness about child safety.\n\nThe death of Junior Lunga is not just a personal tragedy but a symptom of broader systemic failures. It reflects the urgent need for Zimbabwe to uphold its legal obligations to protect children, both at home and in schools. By failing to safeguard Lungas rights to education, safety, and dignity, the school and the State have violated fundamental legal principles. Moving forward, the nation must prioritize legal and policy reforms to ensure no child is subjected to such preventable harm again.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | A nine-year-old boy from Rutavo Village, Mwenezi, lost his life after drowning in a dam … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/school-sends-off-9-year-old-over-school-fees-leading-to-his-death/\">Continue reading<span class=\"screen-reader-text\"> \"School Sends Off 9 Year Old Over School Fees Leading To His Death\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "Man Nearly Kills Neighbour Over Chimukuyu",
            "url": "https://www.zimeye.net/2025/01/19/man-nearly-kills-neighbour-over-chimukuyu/",
            "content": "By A Correspondent\n\nIn a shocking incident, Kholwani Ndlovu, a 38-year-old man from Kezi in Matabeleland South Province, has been sentenced to 350 hours of community service for severely attacking his neighbor, Polani Ngwenya, over stolen biltong.\n\nNdlovu pleaded not guilty to the assault charge but was convicted after trial. He was initially sentenced to 15 months imprisonment, with five months suspended on condition that he doesnt commit any offense involving violence or force on a person. The remaining 10 months were suspended on condition that he performs community service at Kezi Magistrates Courts.\n\nThe court heard that Ndlovu confronted Ngwenya at his homestead on November 3 last year, accusing him of stealing biltong from a neighbors home. An argument ensued, and Ndlovu became furious, attacking Ngwenya with fists and stones. Ngwenya attempted to flee but was pursued and caught by Ndlovu, who inflicted further blows. Community members eventually restrained Ndlovu.\n\nIn a victim impact statement, Ngwenya expressed his trauma and financial loss due to the incident, requesting reimbursement for his medical bills. The magistrate emphasized that courts do not tolerate individuals who resort to violence to resolve disputes, advising people to engage pastors, police, or courts instead. The sentence aims to send a strong message to potential offenders, given the prevalence of assault cases in the area.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a shocking incident, Kholwani Ndlovu, a 38-year-old man from Kezi in Matabeleland South Province, has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/man-nearly-kills-neighbour-over-chimukuyu/\">Continue reading<span class=\"screen-reader-text\"> \"Man Nearly Kills Neighbour Over Chimukuyu\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "Seh Calaz Back With A Bang",
            "url": "https://www.zimeye.net/2025/01/19/seh-calaz-back-with-a-bang/",
            "content": "By Showbiz Reporter | ZimEye |The Twisted Narrative|In the heart of the bustling Zimbabwean streets, where stories are currency and reputations are built or broken in whispers, a storm was brewing. Tawanda Mubhanditi Calaz, the dancehall king who reigned supreme in both rhythm and rhyme, found himself at the center of a cruel twista calculated distortion of his truth.\n\nFor years, Calazs voice was a beacon for the streets, his flow like water cutting through the stone of struggle. People marveled at his ability to weave raw reality into music that resonated in every corner of the ghetto. But with greatness often comes envy, and there were those who sought to tear him down.\n\nIt started subtly, like a crack in a mirror. A rumor surfaced online: Calaz had lost weight. His once robust frame, often adorned in his signature streetwear, had slimmed down noticeably. Whispers turned into accusations, and accusations morphed into outright slander. The talk of the town was no longer his latest hit or his upcoming clash; it was a diagnosisone he never received.\n\nThey say he has AIDS, someone laughed in a crowded shebeen, clinking their bottle against a friends. Have you seen the way he looks now? Mans just withering away.\n\nIn the comments section of a viral post, the story grew legs. One comment stood out: Remove the C in Calaz and what do you get? Aids! Laughter erupted online as the twisted narrative gained traction.\n\nBut this wasnt just a random joke; it was deliberate. Calaz, a master wordsmith, had once used the phrase acids in a song to symbolize the burning trials of life. Now, his metaphor was being twisted into a weapon. His acids became AIDS in the mouths of his detractors.\n\nThe Fightback\n\nCalaz was not one to bow to pressure. The streets that birthed him had taught him resilience. He took to social media with a powerful message. Standing tall despite his apparent weight loss, he addressed his fans directly.\n\nMwari vane kamuitiro kavo. Zvese zviri kuonekwa. Some of you have laughed, twisted my words, and tried to bring me down. But listenMambo ndiye Mambo! The streets know the truth, and no amount of lies will ever dim my light.\n\nThe backlash to the rumors was swift. Fans flooded his posts with support, denouncing the accusations and sharing his message of strength. Even veteran journalist Hopewell Chinono chimed in, condemning the toxic culture of misinformation.\n\nCalaz represents a voice for the voiceless, Chinono tweeted. We must stand against this kind of baseless defamation. The truth will always outlive lies.\n\nA Moment of Reflection\n\nIn the midst of the chaos, Calaz found solace in his roots. He visited his grandmother, a wise elder who had weathered her own storms. Sitting by her side, he shared his pain.\n\nGogo, vanhu vari kutaura zvinhu zvandisiri. Theyve taken my words, my struggles, and turned them into weapons against me.\n\nShe looked at him with knowing eyes. Mwanangu, kana uri chiedza, unokwezva masvosve. Asi chiedza hachimbodzima. Do not let their darkness dim your light.\n\nInspired, Calaz poured his emotions into a new song. It was raw, unapologetic, and deeply personal. The chorus hit like a hammer:\n\nTheyve twisted my acids, into an AIDS diagnosis,\n\nBut the streets know the truth, Mambo ndiye Mambo!\n\nThe track became an anthem, silencing his critics and reaffirming his place as the king of the streets. It wasnt just a song; it was a declaration of victory over lies and a reminder that the truth always triumphs.\n\nThe Legacy\n\nThe rumors faded, as all falsehoods eventually do, but the lesson remained. Calazs story became a cautionary tale about the power of words and the importance of standing firm in the face of adversity.\n\nMambo ndiye Mambo, the streets echoed long after the dust had settled. You can twist the truth, but you can never break a king.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter | ZimEye | The Twisted Narrative | In the heart of the bustling Zimbabwean streets, where stories … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/seh-calaz-back-with-a-bang/\">Continue reading<span class=\"screen-reader-text\"> \"Seh Calaz Back With A Bang\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "Neymar Jr Speaks On Relationship With Mbappe At PSG",
            "url": "https://www.zimeye.net/2025/01/19/neymar-jr-speaks-on-relationship-with-mbappe-at-psg/",
            "content": "Sports Correspondent\n\nBrazilian superstar Neymar has revealed that his former Paris Saint-Germain teammate Kylian Mbappe became jealous of his close relationship with Lionel Messi.\n\nThe tension, Neymar claims, stemmed from Mbappes insecurity when Messi joined the French club in 2021.\n\nSpeaking on a podcast hosted by Brazilian legend Romario, Neymar reflected on the complicated dynamics between the three stars during their time together at PSG. Despite initial camaraderie,\n\nNeymar admitted that he and Mbappe clashed, citing a little fight between them.\n\nNeymar praised Mbappes early contributions to the team, saying he was fundamental and that he had always supported and encouraged the young French striker. However, Neymar believes that Mbappes behavior changed dramatically with Messis arrival.\n\nMessi and Neymar had previously played together at Barcelona from 2013 to 2017, forging a strong bond. Neymar suggested that Mbappe felt threatened by their pre-existing relationship, leading to tension within the team.\n\nThe revelation sheds light on the challenges faced by PSG in integrating three of the worlds top players into a cohesive unit. Despite their individual brilliance, the trio struggled to gel, and the teams performances suffered as a result.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Brazilian superstar Neymar has revealed that his former Paris Saint-Germain teammate Kylian Mbappe became “jealous” of his close … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/neymar-jr-speaks-on-relationship-with-mbappe-at-psg/\">Continue reading<span class=\"screen-reader-text\"> \"Neymar Jr Speaks On Relationship With Mbappe At PSG\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "ZRP Statement on Viral Kombi Crash Incident",
            "url": "https://www.zimeye.net/2025/01/19/zrp-statement-on-viral-kombi-crash-incident/",
            "content": "The Zimbabwe Republic Police (ZRP) has confirmed that the driver of a kombi, who jumped out and caused the vehicle to crash into a tree, was arrested and escorted to Marimba Police Station for a road traffic offence. Commissioner Paul Nyathi stated that while the kombis owner has been identified, the drivers identity remains unknown.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Zimbabwe Republic Police (ZRP) has confirmed that the driver of a kombi, who jumped out and caused the vehicle … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/zrp-statement-on-viral-kombi-crash-incident/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Statement on Viral Kombi Crash Incident\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "33 Zimbabweans Arrested in Abandoned Mine Operation",
            "url": "https://www.zimeye.net/2025/01/19/33-zimbabweans-arrested-in-abandoned-mine-operation/",
            "content": "By A Correspondent\n\nA recent operation at an abandoned mine in Stilfontein, North West, has led to the arrest of 246 illegal miners, including 33 Zimbabwean nationals. The operation, which began on Monday, has been intense and tragic, with 78 dead bodies recovered so far .\n\nAccording to Brigadier Athlenda Mathe, the National Police spokesperson, the operation at Shaft 11 of the old Buffelsfontein gold mine has been challenging. The breakdown of those arrested reveals a significant cross-border issue, with 128 Mozambicans, 80 Lesotho nationals, 33 Zimbabweans, and five South Africans among the detained individuals.\n\nThe operation, led by the South African Police Service (SAPS), aims to combat illegal mining, which has been escalating in the country. Minister of Police Senzo Mchunu reported that over 1,576 illegal miners had been arrested between August 2024 and January 12, 2025.\n\nThe incident highlights the risks of illegal mining, particularly in abandoned mines, and the strain it places on both the safety of the miners and the resources of the South African government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A recent operation at an abandoned mine in Stilfontein, North West, has led to the arrest of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/33-zimbabweans-arrested-in-abandoned-mine-operation/\">Continue reading<span class=\"screen-reader-text\"> \"33 Zimbabweans Arrested in Abandoned Mine Operation\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "Bulawayo Plunged Into Mourning for Councillor Joyce Ndlovu",
            "url": "https://www.zimeye.net/2025/01/19/bulawayo-plunged-into-mourning-for-councillor-joyce-ndlovu/",
            "content": "By Dorrothy Moyo | ZimEye |Bulawayo is in mourning following the untimely passing of Joyce Ndlovu, a former Ward 2 councillor and tireless advocate for the citys residents. A moving memorial service was held today at Stanley Square in Makokoba, where citizens, political leaders, and activists gathered to pay their final respects to a woman described as a true servant of the people.\n\nJoyce Ndlovu, who passed away last week after a courageous battle with illness, leaves behind a legacy of unwavering commitment to the betterment of Bulawayo. Her efforts as a councillor were marked by her vocal advocacy for the welfare and rights of her constituents, consistently placing the communitys needs above her own.\n\nA Leader for the People\n\nGift Ostallos Siziba, the Citizens Coalition for Change (CCC) MP, spoke passionately during the service, describing Ndlovu as a pillar of strength and dedication. In his tribute shared online, Siziba stated, Joyce was a true servant of the people, dedicating her life to the betterment of our community and city. He further emphasized her indelible impact on Bulawayos residents, highlighting her tireless efforts to address their needs.\n\nUnity in Grief\n\nThe memorial was a demonstration of unity, with citizens and democratic activists coming together to give Joyce Ndlovu a fitting sendoff. The hall was filled with mourners reflecting on her profound contributions, with many wearing expressions of deep sorrow while listening to tributes that celebrated her life and work.\n\nWe salute every citizen and democratic activist who has come together to give Joyce a fitting sendoff. This is who we arewe stand together, shoulder to shoulder, until victory, Siziba added, urging the community to draw inspiration from Ndlovus legacy in their continued fight for democracy and social justice.\n\nA Call to Action\n\nJoyce Ndlovus passing is a stark reminder of the challenges faced by public servants who dedicate their lives to serving communities under difficult circumstances. Her death has reignited calls for continued unity and perseverance in the fight for justice, equality, and better living conditions for all Zimbabweans.\n\nAs Bulawayo bids farewell to one of its most dedicated leaders, the city stands together in mourning and in hope, vowing to carry forward the values and principles Joyce Ndlovu embodied.\n\nRest in Power, Sis Joyce.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | Bulawayo is in mourning following the untimely passing of Joyce Ndlovu, a former Ward … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/bulawayo-plunged-into-mourning-for-councillor-joyce-ndlovu/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Plunged Into Mourning for Councillor Joyce Ndlovu\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        },
        {
            "title": "Citizens Mourn Opposition Councillor Joyce Ndlovu",
            "url": "https://www.zimeye.net/2025/01/19/citizens-mourn-opposition-councillor-joyce-ndlovu/",
            "content": "Bulawayo residents gathered in unity on Saturday to bid a final farewell to Joyce Ndlovu, a former Ward 2 councillor, who passed away after a courageous battle with illness. Known for her tireless service to the community, Ndlovu was remembered as a dedicated advocate for the people she represented.\n\nIn a statement on Saturday, former CCC spokesperson Gift Ostallos Siziba expressed heartfelt sentiments about Ndlovus legacy. He said, Today, we gathered in Bulawayo to bid a final farewell to the remarkable Joyce Ndlovu, former Ward 2 councillor, who sadly passed away last week after a brave battle with illness.\n\nSiziba further highlighted Ndlovus unwavering commitment to the welfare of her constituents, noting, Joyce was a true servant of the people, dedicating her life to the betterment of our community and city. He emphasized that her contributions were not only visible through her work but also in the lasting impact she had on those around her. Her tireless efforts and unwavering commitment to the welfare of Bulawayos residents have left an indelible mark on our city, Siziba added.\n\nAs a councillor, Ndlovu was known for her strong advocacy for the rights and needs of her community. As a councilor, Joyce was a vocal advocate for the rights and interests of her constituents, always putting their needs above her own, said Siziba. Her focus on community well-being was evident throughout her tenure, and her passing has left a gap in the hearts of those who knew her.\n\nIn honor of Ndlovus legacy, Siziba also saluted those who came together to ensure she was given a fitting sendoff. We salute every citizen and democratic activist who has come together to give Joyce a fitting sendoff, he remarked, reflecting on the unity and strength of the community during this time of mourning.\n\nThe farewell marked a poignant moment for the city, as many citizens reflected on the significance of Ndlovus work and dedication to the people of Bulawayo. This is who we are, we stand together shoulder until victory, Siziba concluded, a final tribute to a woman whose efforts will continue to inspire future generations.\n\nNdlovus legacy will undoubtedly live on in the city she loved and served. Rest in peace, Joyce Ndlovu.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo residents gathered in unity on Saturday to bid a final farewell to Joyce Ndlovu, a former Ward 2 councillor, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/citizens-mourn-opposition-councillor-joyce-ndlovu/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens Mourn Opposition Councillor Joyce Ndlovu\"</span></a></p>",
            "time": "18:37",
            "date": "19 Jan 2025"
        }
    ]
}