{
    "news": [
        {
            "title": "ZEC Speaks On Guvamatanga, Chivayo US$42 Million Election Looting Scandal",
            "url": "https://www.zimeye.net/2025/04/12/zec-speaks-on-guvamatanga-chivayo-us42-million-election-looting-scandal/",
            "content": "By Crime and Courts Reporter-The Zimbabwe Electoral Commission (ZEC) has gagged the media from questioning it over a controversial US$42 million election tender awarded to Zanu PF-linked businessman Wicknell Chivayo, Finance Ministry Secretary GeorgeGuvamatanga,and their associatesinsisting it isnot their issue.\n\nChivayo, a convicted fraudster, allegedly secured the tender through Betterbrands Security (Pvt) Ltd in partnership with South African firm Ren-Form CC.\n\nMore than R1.1 billionwas paidbyZimbabwesTreasury to Ren-Form ahead of the disputed August 2023 elections.\n\nOf that, over R800 million (approximately US$42 million) was funnelled to companies linked to Chivayowithout any services delivered.\n\nSouth African authorities, including the Financial Intelligence Centre (FIC),are investigatingpossible cross-border money laundering, fraud, and racketeering.\n\nLeaked documents reveal inflated invoicessuch as R23 million for a server worth R90,000 and US$16,000 for voter kits that normally cost US$3,600.\n\nAt thecentreis Guvamatanga,Mnangagwaskey Treasury ally, whose approval was essential for releasing the funds.\n\nThe FIC has flaggedGuvamatangasSouth African property empireheld through shell companiesas suspicious, raising serious questions about illicit enrichment.\n\nPresidentMnangagwassilence on the scandal is deafening.\n\nAnalysts argue that Chivayo, Guvamatanga, and their network operate under his protection, using election-related tendersas a vehicle for lootingpublic funds.\n\nChivayo, in leaked audios, boasted about bribing top officials to push the deal, laterapologisingto Mnangagwa, CIO boss Isaac Moyo, Cabinet Secretary Martin Rushwaya, and ZEC chair Priscilla Chigumbabut never denying the transactions.\n\nDespite growing public outrage, Zimbabwean authorities have failed to act.\n\nMeanwhile, whistleblowers Mike Chimombe and Moses Mpofu remain in jail on unrelated charges, suspectedto bepolitical retaliation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-The Zimbabwe Electoral Commission (ZEC) has gagged the media from questioning it over a controversial US$42 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/zec-speaks-on-guvamatanga-chivayo-us42-million-election-looting-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"ZEC Speaks On Guvamatanga, Chivayo US$42 Million Election Looting Scandal\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zanu PF Varakashi Claim Victory In Glen View South",
            "url": "https://www.zimeye.net/2025/04/12/zanu-pf-varakashi-claim-victory-in-glen-view-south/",
            "content": "By A Correspondent\n\nZanu PF online foot soldiers on Saturday evening claimed victory in the Glen View South by-election.\n\nOne Cleopas Mukungunugwa a Zanu PF online foot soldier said :\n\nCongratulations toTsitsi for reclaiming Glenview South Urban for ZANU PF!\n\nWhile the opposition spends its time on lies and division, our party under President @edmnangagwa keeps DELIVERING real results for the people.\n\nAnother proofZANU PF is the ONLY party that works!\n\nTawomhera battled it out with two independent candidates and another one from the NCA led by Lovemore Madhuku.\n\nThere were reports of vote buying and rigging before the by-election.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF online foot soldiers on Saturday evening claimed victory in the Glen View South by-election. One … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/zanu-pf-varakashi-claim-victory-in-glen-view-south/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Varakashi Claim Victory In Glen View South\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Ponera Construction Partners with Zimbabwe Women’s Premier Soccer League in Landmark Sponsorship Deal…",
            "url": "https://www.zimeye.net/2025/04/12/ponera-construction-partners-with-zimbabwe-womens-premier-soccer-league-in-landmark-sponsorship-deal/",
            "content": "Sports Correspondent\n\nIn a significant boost to womens football in Zimbabwe, Ponera Construction has announced a $10,000 sponsorship deal in support of the 2025 Zimbabwe Womens Premier Soccer League. This partnership is a major step forward in empowering womens football and creating opportunities for growth and excellence in the sport.\n\nThe sponsorship deal is a testament to Ponera Constructions commitment to supporting local sports and promoting the development of young female footballers. By investing in the Zimbabwe Womens Premier Soccer League, the company is helping to build a brighter future for womens football in the country.\n\nThe partnership is expected to have a positive impact on the league, providing much-needed resources to support the teams and players. It will also help to increase visibility and recognition for womens football in Zimbabwe, inspiring more young girls and women to take up the sport.\n\nThe sponsorship deal is a win-win for both Ponera Construction and the Zimbabwe Womens Premier Soccer League. By supporting local sports, the company is demonstrating its commitment to the community and contributing to the development of young talent. At the same time, the league will benefit from the much-needed resources and exposure.\n\nThe partnership has been widely welcomed by football fans and stakeholders in Zimbabwe. Many have praised Ponera Construction for its vision and commitment to supporting womens football.\n\nThe $10,000 sponsorship deal is a significant investment in the future of womens football in Zimbabwe. It is expected to have a lasting impact on the sport, inspiring a new generation of young female footballers and helping to build a stronger, more competitive league.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a significant boost to women’s football in Zimbabwe, Ponera Construction has announced a $10,000 sponsorship deal in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/ponera-construction-partners-with-zimbabwe-womens-premier-soccer-league-in-landmark-sponsorship-deal/\">Continue reading<span class=\"screen-reader-text\"> \"Ponera Construction Partners with Zimbabwe Women’s Premier Soccer League in Landmark Sponsorship Deal…\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Harare Elite Junior League Launches Inaugural U14 Tournament to Combat Age Cheating and Boost Youth Talent",
            "url": "https://www.zimeye.net/2025/04/12/harare-elite-junior-league-launches-inaugural-u14-tournament-to-combat-age-cheating-and-boost-youth-talent/",
            "content": "By Sports Correspondent\n\nIn a bold step toward promoting fairness and development in junior football, the Harare Elite Junior Football Development League will host its first-ever Under-14 tournament on April 11th and 12th, 2025, at Prince Edward High School. This event serves as the season opener for a league that will run through to December 2025, focusing on nurturing young football talent and stamping out age cheating in the sport.\n\nThe league, which comprises 14 teams spread across five age groups from U10 to U18, is more than just a competitive platformits a movement to restore integrity and proper development in Zimbabwes youth football scene.\n\nThe aim is to create a transparent and competitive environment where players grow at the right pace and in the right categories, said Organizing Secretary Reuben Dauti. We are determined to eliminate age cheating in junior football and ensure every child plays in their correct age group. Thats the foundation for real development.\n\nThe U14 tournament will bring together teams from across Harare and surrounding areas, showcasing the best of local talent. Among the highlights is the participation of Gracious Saviere, a rising star from Real Vision Football Academy, who will compete against boysmaking a strong statement for gender inclusivity in sport.\n\nWhile the U10 and U12 age groups will focus on festival-style football that emphasizes fun and talent discovery, the U14, U16, and U18 categories will feature structured competition. This approach, the league believes, is vital in identifying players capable of progressing to elite levels, both locally and internationally.\n\nAdding prestige to the event, former national team striker and junior development product Edward Sadomba will attend as a guest, inspiring young players with his story of rising from grassroots football to become a celebrated African footballer.\n\nThe league is also calling on the corporate sector to support its mission. This is not just about football; its about shaping disciplined, ambitious, and talented youth, Dauti emphasized. We invite corporate partners to walk this journey with us and invest in the future of Zimbabwean football.\n\nAs the first whistle prepares to blow at Prince Edward High School, all eyes will be on the budding stars, hopeful that this initiative sets a new standard for junior football in Harare and beyond.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent In a bold step toward promoting fairness and development in junior football, the Harare Elite Junior Football … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/harare-elite-junior-league-launches-inaugural-u14-tournament-to-combat-age-cheating-and-boost-youth-talent/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Elite Junior League Launches Inaugural U14 Tournament to Combat Age Cheating and Boost Youth Talent\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Be Wary Of Distractions",
            "url": "https://www.zimeye.net/2025/04/12/be-wary-of-distractions/",
            "content": "Every time you get behind the wheel, youre making a commitmentnot just to reach your destination, but to protect your life and the lives of others on the road. Driving may feel routine, but it is a complex task that demands full attention. Even a momentary lapse in concentration can result in serious, sometimes fatal, consequences.\n\nToday, distracted driving is one of the leading causes of road accidents worldwide. And while most drivers are aware of the dangers, many still engage in risky behaviors without realizing how devastating the consequences can be.\n\nHere are some of the most common distractions that take your focus off the roadand why avoiding them could save lives:\n\n Never Text While Driving\n\nTexting while driving remains one of the most dangerous distractions. When you take your eyes off the road to send or read a message, even for just five seconds, you could travel the length of a football field without seeing whats in front of you. According to road safety experts, You are 23 times more likely to crash if youre texting while driving. No message is worth a lifekeep your phone out of sight and out of mind until youre safely parked.\n\n Dont Eat Behind the Wheel\n\nMany drivers think grabbing a quick bite during their commute is harmless. But eating while driving can be just as dangerous as texting. Holding food, unwrapping packaging, or dealing with spills forces you to take one or both hands off the wheel and diverts your attention. Taking your hand off the wheel to grab that burger can mean the difference between stopping in time and causing a crash, says a road safety spokesperson.\n\n Dont Let the Stereo Steal Your Focus\n\nMusic is a great way to enhance a drivebut fiddling with the stereo, adjusting volume, skipping tracks, or switching playlists can be distracting. If youre focused on your playlist instead of the traffic around you, youre not fully driving, warn experts. Pre-set your music before hitting the road or use voice-activated controls to keep your hands and eyes where they belong.\n\n Never Apply Makeup While Driving\n\nMultitasking while driving is a mythespecially when it involves something as delicate and time-consuming as applying makeup. Not only does it take your eyes off the road, but it also compromises your reaction time. Grooming behind the wheel is shockingly common, yet incredibly dangerous, say authorities. If youre running late, its better to arrive a few minutes behind schedule than not arrive at all.\n\n Dont Let Passengers Distract You\n\nFrom lively conversations to rowdy kids, passengers can be a major source of distraction. While its natural to talk during a drive, drivers must set boundaries. Its okay to ask passengers to keep it down if youre feeling overwhelmedyour main job is to drive safely, driving instructors advise. When dealing with children or upset passengers, its always safest to pull over before addressing the situation.\n\nThe Bottom Line\n\nDriving is not the time to divide your attention. Each of the above distractionsno matter how trivial they may seemcan be deadly when combined with the speed and unpredictability of the road.\n\nRemember: You cant drive safely unless the task has your full attention. Stay alert, stay focused, and arrive alive.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Every time you get behind the wheel, you’re making a commitment—not just to reach your destination, but to protect your … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/be-wary-of-distractions/\">Continue reading<span class=\"screen-reader-text\"> \"Be Wary Of Distractions\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Kudakwashe Tagwirei Political Rise Sparks Wide Rift In SDA Church…",
            "url": "https://www.zimeye.net/2025/04/12/kudakwashe-tagwirei-political-rise-sparks-wide-rift-in-sda-church/",
            "content": "Tinashe Sambiri\n\nThe growing political clout of businessman Kudakwashe Tagwirei is stirring controversy within the Seventh-day Adventist (SDA) Church, with some members voicing strong opposition to his alignment with ZANU PF and potential ascension to higher political office.\n\nTagwirei, a prominent SDA member and influential figure in Zimbabwes business sector, was recently endorsed by ZANU PFs Harare Province for a seat on the partys powerful Central Committee.\n\nHe is increasingly seen as President Emmerson Mnangagwas possible successoran idea that has reportedly unsettled some within the church.\n\nDissenting voices within the SDA community have taken their grievances to the international stage, petitioning the churchs global leadership to revoke a prestigious honor awarded to Tagwirei. In their appeal to the General Conference, the Zimbabwe Union Conference, and the Southern Africa-Indian Ocean Division (SID), the concerned members argued that his political affiliations compromise the integrity of the church.\n\nThe controversy centers around a Global Award of Excellence presented to Tagwirei at Solusi University last month, making him the first Black recipient of the accolade from the General Conference. Critics argue the award sends the wrong message.\n\nHis involvement in partisan politics, especially at such a high level, is incompatible with the values we uphold as a church, read part of the petition.\n\nBut not everyone agrees with the criticism. Some SDA leaders have come to Tagwireis defense, alleging that the backlash is driven by personal vendettas and unmet financial expectations.\n\nHeather Dube, a member of the City Centre Church, dismissed the accusations as a smear campaign. It is crucial to recognise that since Mr. Tagwirei entered the mainstream political arena, the intensity of these allegations has significantly increased, she said. This organised campaign is rooted in frustration; these detractors were unable to secure financial backing from Tagwirei for their own agendas, prompting them to resort to character assassination.\n\nThe internal discord highlights a broader tension over the role of politics in religious spaces, with Tagwireis rising profile becoming a flashpoint in that debate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri The growing political clout of businessman Kudakwashe Tagwirei is stirring controversy within the Seventh-day Adventist (SDA) Church, with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/kudakwashe-tagwirei-political-rise-sparks-wide-rift-in-sda-church/\">Continue reading<span class=\"screen-reader-text\"> \"Kudakwashe Tagwirei Political Rise Sparks Wide Rift In SDA Church…\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Terrible Blow To Democracy As Mnangagwa Endorses Controversial PVO Bill…",
            "url": "https://www.zimeye.net/2025/04/12/terrible-blow-to-democracy-as-mnangagwa-endorses-controversial-pvo-bill/",
            "content": "By Tinashe Sambiri\n\nPresident Emmerson Mnangagwa has officially enacted the contentious Private Voluntary Organisations (PVO) Amendment Act, cementing broad state authority over the operations of civic and non-governmental organisations in Zimbabwe.\n\nThe legislation, recently approved by Parliament, hands the government power to interfere directly in NGO affairs. It authorises the responsible minister to suspend organisation leaders and appoint replacements, sparking alarm over the autonomy and independence of civil society institutions.\n\nThe enactment was made public through General Notice 620 of 2025, released via the Government Gazette on 11 April.\n\nConfirming the development, Chief Secretary to the President and Cabinet, Dr. Martin Rushwaya, stated:The following law, which was assented to by His Excellency the President, is published in terms of subsection 6(a) of section 131 of the Constitution of Zimbabwe  Private Voluntary Organisations Amendment Act (No. 1) of 2025.\n\nThe law has been met with widespread condemnation from local and international civil society actors. Many warn that the act severely compromises the independence of NGOs by enabling the state to remove executives without judicial oversight and exert control over leadership transitions.\n\nThe act also empowers the government to shut down organisations suspected of political involvement and increase oversight of their foreign financial support. While authorities insist the move is aimed at curbing terrorist financing and money laundering, watchdog groups argue it is a thinly veiled attempt to muzzle dissent.\n\nJustice Minister Ziyambi Ziyambi has stood by the legislation, asserting it is in line with the Financial Action Task Force (FATF)s guidance and aims to shield Zimbabwes economy from illegal financial flows.\n\nBut rights organisations remain deeply concerned. The Zimbabwe Lawyers for Human Rights (ZLHR) has condemned the bill, warning that it grants authorities unchecked control over civic entities.\n\nAmnesty International has also raised the alarm, branding the law a serious blow to freedoms of association, expression, and assembly.\n\nThe Observatory for the Protection of Human Rights Defenders echoed these concerns, cautioning that the law could be exploited to target groups advocating for democracy, transparency, and fundamental rights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri President Emmerson Mnangagwa has officially enacted the contentious Private Voluntary Organisations (PVO) Amendment Act, cementing broad state … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/terrible-blow-to-democracy-as-mnangagwa-endorses-controversial-pvo-bill/\">Continue reading<span class=\"screen-reader-text\"> \"Terrible Blow To Democracy As Mnangagwa Endorses Controversial PVO Bill…\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Hopewell Chin’ono Finally Blocked By Chamisa On X After Spending 7 Years Advising Army To Hunt Down Opposition",
            "url": "https://www.zimeye.net/2025/04/12/hopewell-chinono-finally-blocked-by-chamisa-on-x-after-spending-7-years-advising-army-to-hunt-down-opposition/",
            "content": "By Investigative Reporter | ZimEye | After over 7 years, of accusing the Chamisa led civil society of tension with the army, Hopewell Chinono has finally been blocked on X by the opposition leader.\n\nChinono who has been acclaimed in some circles as a relentless critic of Zimbabwes government, a champion of democracy, and a staunch defender of human rights, has on the other hand been an accuser of the opposition l, not just on social media, but inside meetings with the Ministry of Defence.\n\nMid afternoon Saturday, the journalist posted a message containing revelations that he has since been blocked by Nelson Chamisa. He said he has been blocked over a Bible verse, and suggested that Chamisa would arrest him the same way Mnangagwa has done if he was president.\n\nChamisa who did not comment, has previously told ZimEye, that he finds Chinono to be a low life individual who has no credibility.\n\nIncidents from the last seven-year period reveals with repeating detail that behind this carefully crafted persona lies a different realityone that involves evading questions over illicit money, deceit, and a long history of covering up other activities dating back to 1995, a period during which he has changed his own name.\n\nHopewell Chinono, who has spent the past seven years corrupting Defense Ministers, starting with Vice President ConstantinoChiwenga (watch video)made headlines yesterday by accusing Nelson Chamisa of abandoning his supporters.\n\nIn July 2022, Chinono was recorded trying to convince the jailed legislator, Job Sikhala, his accusation that Chamisa has abandoned him in prison. (listen to recording)\n\nhttps://www.facebook.com/share/v/AkGc5FrpUoDxymUG/?mibextid=KsPBc6\n\nChinonos Seven-Year Cover-Up of Suspicious Money Activities Under the Guise of Journalism.\n\nChinono, who also spent years accusing Chamisa of neglecting his supporters, has been exposed for using his supposed opposition to the Zimbabwean government as a faade to mask his involvement in illicit financial activities that have, in fact, supported the very system he claims to oppose.\n\nOne of the most damning pieces of evidence concerns Chinonos claim that he acquired significant wealth at a young age. According to Chinono, his journey into property ownership began in 1996 when, at the age of 25, he received a 50,000 credit from a UK institution, which he used to purchase a sports car. This car was then exported to Zimbabwe, without proper documentation, and sold illegally to fund the purchase of a luxurious home in the affluent Chisipite suburb of Harare.\n\nHowever, evidence clearly shows that Chinonos account of his financial success is riddled with inconsistencies. Despite his claims of legitimate business dealings, including a more recent assertion that he made his fortune selling cellphones between 2003 and 2006, he has consistently failed to disclose the name of the UK institution that granted him such a substantial credit at such a young age. This glaring omission has raised serious questions about the legality of his early wealth.\n\nDuring a revealing interview with the esteemed investigative journalist Geoff Nyarota in 2021, Chinono notably avoided answering questions about the origins of his moneya tactic that only confirmed suspicions about his illicit financial activities. This avoidance is a clear indication that Chinono has been diverting attention from his fraudulent dealings by presenting himself as a social justice warrior.\n\nThe timeline also reveals that Chinono, originally known as Mukusha, changed his name during the period in which he mysteriously accumulated vast wealtha period marked by the absence of any salary or wage records to substantiate his claims of legitimate income. This name change was evidently part of his strategy to obscure the origins of his wealth and to reinvent himself as a respected journalist and activist.\n\nFurthermore, multiple credible witnesses have come forward, with some providing video testimonies, confirming that Chinono engaged in credit and cheque fraud before changing his name. Some of his former associates from that time have been convicted of fraud involving millions of pounds, underscoring the illegal nature of the activities that funded his rise to prominence.\n\nAmong the most significant testimonies is that of a human rights activist employed by the NHS, who withdrew her support for Nelson Chamisas opposition party due to its backing of Chinono following his 2020 arrest on charges of incitement to violence. The activist, who has recounted her own experiences with Chinonos bullying tactics, warned that his unchecked behavior could have devastating consequences for Zimbabwe if allowed to continue. (Listen to Dr Maboreke in audio below)\n\nAdding to these troubling revelations are allegations from women dating back to Chinonos high school days at Marlborough, Harare, where he is said to have bullied his headmaster, Arison Chiware, into accepting him despite poor academic performance. These women have come forward with harrowing accounts of sexual misconduct, further solidifying the image of a man who has long used intimidation and manipulation to achieve his ends.\n\nOne key example of this behavior comes from Dr. Nyasha Maboreke, whose family has expressed concerns about Chinonos use of their name. In a revealing audio interview, Dr. Maboreke stated, *Even my family have been deeply concerned that he sometimes uses my name as well, directly because if you notice he is now saying Nyasha Maboreke these times. So that he makes a distinction between the two of us. You know our lad he does something when, what I have realised is I can engage to tone down. I have already done so actually but sometimes he has got his own mind you know, CHUCKLE!*\n\nThis admission highlights the way in which Chinono has manipulated the narrative to suit his own ends, using the names and reputations of others to validate his questionable claims of property ownership.\n\nAs more evidence continues to emerge, it is becoming increasingly clear that Hopewell Chinonos public persona as a crusader for justice has been nothing more than a carefully constructed cover for his illicit activities. The seven years of pristine evidence leave no doubt that Chinonos actions have not only supported but also reinforced the very regime he claims to oppose, exposing him as a key player in the corruption he so vehemently pretends to fight against.\n\nThis comprehensive exposure of Chinonos activities sheds light on the true nature of his involvement in Zimbabwean politics, revealing a man who has used his platform not to challenge injustice, but to cover up his own involvement in criminal activities while maintaining the faade of a righteous activist.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigative Reporter | ZimEye | After over 7 years, of accusing the Chamisa led civil society of tension with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/hopewell-chinono-finally-blocked-by-chamisa-on-x-after-spending-7-years-advising-army-to-hunt-down-opposition/\">Continue reading<span class=\"screen-reader-text\"> \"Hopewell Chin’ono Finally Blocked By Chamisa On X After Spending 7 Years Advising Army To Hunt Down Opposition\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Tshabangu Gets Huge Reward For Bootlicking",
            "url": "https://www.zimeye.net/2025/04/12/tshabangu-gets-huge-reward-for-bootlicking/",
            "content": "Tinashe Sambiri\n\nSengezo Tshabangu, the man widely viewed as instrumental in destabilizing the Citizens Coalition for Change (CCC) led by Advocate Nelson Chamisa, has secured a high-profile appointmentraising eyebrows and fueling accusations of political favoritism.\n\nTshabangu, a controversial figure who sparked major divisions within the opposition, has now been appointed to the Committee on Health in Zimbabwes 10th Parliament, under the Inter-Parliamentary Union. The move is being seen by political analysts as a calculated reward from President Emmerson Mnangagwa for his role in weakening the opposition.\n\nAfter aiding in the fragmentation of the CCC, Tshabangus elevation is clearly a political thank-you from ZANU PF, said one analyst who requested anonymity. Its a textbook case of political patronage.\n\nTshabangu confirmed his new role in a statement released on Friday:Good morning, I wish to inform you that I was elected into the Committee on Health at the Inter-Parliamentary Union of the 10th Parliament of Zimbabwe, he said.\n\nI wish to serve my country with undoubted patriotism and contribute to the improvement of the overall health sector in Zimbabwe.\n\nCritics, however, argue that Tshabangus appointment is less about merit and more about loyalty to those in power. His role in the opposition chaos, which led to the recall of several elected MPs and caused confusion in the partys ranks, has been cited as a significant blow to Zimbabwes democratic landscape.\n\nDespite the backlash, Tshabangu insists that his focus now is on public service, particularly in the health sector. But for many, his new position symbolizes the rewards of political expediency over principle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Sengezo Tshabangu, the man widely viewed as instrumental in destabilizing the Citizens Coalition for Change (CCC) led by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/tshabangu-gets-huge-reward-for-bootlicking/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Gets Huge Reward For Bootlicking\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        },
        {
            "title": "Chaos As Auxillia Mnangagwa Disrupts Traffic Flow, Business Operations In Masvingo…",
            "url": "https://www.zimeye.net/2025/04/12/chaos-as-auxillia-mnangagwa-disrupts-traffic-flow-business-operations-in-masvingo/",
            "content": "By A Correspondent\n\nFirst Lady Auxillia Mnangagwas recent visit to Masvingo has drawn sharp criticism after her presence led to major traffic disruptions and interruptions to business operations across the city and surrounding areas.\n\nMrs. Mnangagwa was in Masvingo for a two-day visit from Thursday to Friday, during which a heavy police presence was visible .\n\nOfficers were reportedly stationed along a nearly 50-kilometre stretch from Masvingos Central Business District to Mutendi, where she is said to have spent the night.\n\nThere were officers after every few hundred metres, said a government official based at Benjamin Burombo Building in Masvingo. Mrs. Mnangagwa attended a function at Rupike and another one at Mutendi. The level of deployment was excessiveit affected movement and even access to some businesses.\n\nLocal businesses and commuters alike experienced delays and disruptions, with many expressing frustration over the lack of public communication regarding the road closures and detours. The sudden traffic management measures reportedly brought parts of the city to a near standstill.\n\nPolice sources, speaking on condition of anonymity, also expressed discontent over how the situation was handled.\n\nOur normal duties were disrupted for two whole days just to provide unnecessary visibility, said one police officer. Some of us were pulled from stations where we were actually needed. Its not policingits political grandstanding.\n\nThe disruptions have reignited public debate over the use of state resources for events involving political figures and their families, especially when such operations affect essential services and livelihoods.\n\nDespite the backlash, there was no official statement from the First Ladys office addressing the concerns raised by residents and business owners in the area.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent First Lady Auxillia Mnangagwa’s recent visit to Masvingo has drawn sharp criticism after her presence led to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/12/chaos-as-auxillia-mnangagwa-disrupts-traffic-flow-business-operations-in-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos As Auxillia Mnangagwa Disrupts Traffic Flow, Business Operations In Masvingo…\"</span></a></p>",
            "time": "18:42",
            "date": "13 Apr 2025"
        }
    ]
}