{
    "news": [
        {
            "title": "NetOne Customers Fume Over New Peak and Off-Peak Mo’Gigs Data Limits",
            "url": "https://www.zimeye.net/2025/11/04/netone-customers-fume-over-new-peak-and-off-peak-mogigs-data-limits/",
            "content": "By A Correspondent\n\nNetOne has revised its popular MoGigs data bundles, prompting widespread frustration among subscribers.\n\nIn a public notice issued on Monday, 3 November, the telecom provider announced that the bundles now include separate Peak and Off-Peak data allocations. According to NetOne:\n\nNetOnes revamped MoGigs bundles now offer Peak and Off-Peak data. This allows you to separate your essential, daytime data needs from your heavy, non-urgent data activities, helping you stretch your data budget further.\n\nUnder the new structure, Peak hours run from 7:01 AM to 12:59 AM, while Off-Peak is from 1:00 AM to 7:00 AM.\n\nThe changes mean that subscribers purchasing the US$30 monthly MoGigs bundle, which offers 30 GB, can now only use 25 GB during Peak hours, with the remaining 5 GB available during Off-Peak periods. Previously, users had unrestricted access to their full data allowance at any time.\n\nOther 30-day bundles have also been affected:\n\nThe US$7 bundle now provides 5 GB in total, with 4 GB for Peak use and 1 GB for Off-Peak.\n\nThe US$12 bundle offers 10 GB, split between 8 GB Peak and 2 GB Off-Peak.\n\nThe US$15 bundle provides 15 GB, with 12 GB allocated to Peak hours and 3 GB for Off-Peak.\n\nThe largest US$50 bundle offers 50 GB, with 40 GB for Peak use and 10 GB for Off-Peak.\n\nMany customers have taken to social media to express their displeasure, calling the changes restrictive and inconvenient, with some saying they now have to carefully plan their internet use around the new Peak and Off-Peak hours.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent NetOne has revised its popular Mo’Gigs data bundles, prompting widespread frustration among subscribers. In a public notice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/netone-customers-fume-over-new-peak-and-off-peak-mogigs-data-limits/\">Continue reading<span class=\"screen-reader-text\"> \"NetOne Customers Fume Over New Peak and Off-Peak Mo’Gigs Data Limits\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Tanzania’s Samia Suluhu Hassan Calls for Peace Amid Controversy Over Chaotic Polls …",
            "url": "https://www.zimeye.net/2025/11/04/tanzanias-samia-suluhu-hassan-calls-for-peace-amid-controversy-over-chaotic-polls/",
            "content": "By A Correspondent\n\nTanzania is grappling with unrest following President Samia Suluhu Hassans disputed election victory, with critics warning that her overwhelming 98% win has only deepened public mistrust and political tensions.\n\nAddressing the nation on Monday, President Suluhu called for calm, saying, Violence is not part of our culture, what happened is not a true reflection of what we are as a people. Now we must work together for development.\n\nHowever, observers note that the presidents message has done little to quell fears of widespread electoral manipulation.\n\nMany opposition supporters allege intimidation, ballot irregularities, and suppression of dissent throughout the October 28 polls.\n\nVice President Constantino Chiwenga attended the inauguration, lending the event regional recognition, but critics argue that the ceremony did not address the legitimacy concerns surrounding the vote.\n\nWith a margin of victory that opposition leaders and civil society groups have described as implausible, Tanzania faces a fragile political landscape, where calls for peace clash with growing frustration over what many see as a deeply flawed electoral process.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tanzania is grappling with unrest following President Samia Suluhu Hassan’s disputed election victory, with critics warning that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/tanzanias-samia-suluhu-hassan-calls-for-peace-amid-controversy-over-chaotic-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Tanzania’s Samia Suluhu Hassan Calls for Peace Amid Controversy Over Chaotic Polls …\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Bank Reverses Funds Lost in Emma Walker COS Fraud Case",
            "url": "https://www.zimeye.net/2025/11/04/bank-reverses-funds-lost-in-emma-walker-cos-fraud-case/",
            "content": "By Business Correspondent\n\nA news subscriber has confirmed that funds lost in the COS fraud case involving syndicate member Emma Walker have been successfully reversed by the bank. The refund comes after victims reported the scam to both police and financial institutions, prompting a review that led to recoveries.\n\nBelow is the full interview transcript as received.\n\nINTERVIEW TRANSCRIPT\n\nInterviewer:Im noticing a good message from you. Tell me about it.\n\nRespondent:So, you know, I told you I reported to the police, right?I also spoke to my bank  shes with the bank  when I reported to police, it was the same.To me, the deduction was for the same.\n\nAnd when my bank called me, I gave them all the pieces of evidence, and I had to use it with it, yes.\n\nInterviewer:Okay, and what did they say?\n\nRespondent:They told me again, they said they were going to use the amount  I think thats 4,000  to get in front of it.Also, I definitely think theres another person I knew who also sent money directly to my Emma.That one person also got refunded.They said, They sent me, you should reach out.And using the revenue, my guy told me to report to the Darlings  the police  before they can do all the rest.\n\nInterviewer:Absolutely. So it looks like those who sent money directly to Emma are now getting refunds.\n\nRespondent:Yeah. So what has happened is, last year, we published about Emma.And as I told you, I think you noted the article.That paragraph we exposed publicly contributed to the financial system understanding that she is a scammer.You know how one transaction, if reported thoroughly, can lead to so many others.So now, the only person theyre responding to is me, but there are so many other people along the chain  you can see that they are there, refunding.\n\nInterviewer:Yeah. So what we might need to do is publish again, to highlight to any other victims out there to quickly report.\n\nRespondent:Yeah, because the thing is, Emma is  Emma is part of a syndicate of scammers.\n\nInterviewer:Oh, okay, okay.\n\nRespondent:Yeah. So Emma Walker is just part of this whole syndicate of scammers, and so any money that shes collected needs to be refunded.Now that we have thoroughly exposed it, it all makes sense.\n\nInterviewer:Well, yes, and thats what I was trying to explain to you last time  that look, this person is not complicated, shes not as difficult as others, because shes already in the system. Weve already done some thorough background checks.\n\nRespondent:Okay, thats awesome.\n\nInterviewer:Yeah, well done. Well done.\n\nRespondent:Yeah, Im hoping that you highlight to others as well in the future.So, what Im also trying to do is  my little friend, who was in fact Emmas friend  yes, Ive been trying to get her to give me the interest, shes still in that group that Emma is in.They keep sending messages. Im trying to let her send me all those numbers so that we can follow up, but shes a bit reluctant to disclose, right?It looks like she also got part of the routine, because she also back-in-flickered the amount and gave it to her associate.\n\nBecause what Emma was doing also  she was using other people.So, this was my little benefit.But later on, they discovered that theyd been used by her.\n\nInterviewer:Okay, okay. Yeah, well done, well done. Im glad it happened so fast.I think its less than two weeks, and you now have your money. Well done, seriously.\n\nRespondent:All right. So, if I get any further information, I will let you know.And if the people want the names in terms of when theres a story, I want to call it  do they want the names to be in the public domain, or better not?\n\nInterviewer:No, no, no. What we do is we never expose victims names.Yeah, because thats inappropriate  wed never do that.Were there to help you get your money, thats all.We just make sure you get your money and your story out there.\n\nRespondent:Okay, yes. All right. Thank you, . Bless.\n\nInterviewer:Bang.\n\nThe case highlights how coordinated reporting between victims, media exposure, and cooperation with law enforcement can lead to the reversal of fraudulent transactions and the disruption of online scam syndicates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Correspondent A news subscriber has confirmed that funds lost in the “COS fraud” case involving syndicate member Emma … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/bank-reverses-funds-lost-in-emma-walker-cos-fraud-case/\">Continue reading<span class=\"screen-reader-text\"> \"Bank Reverses Funds Lost in Emma Walker COS Fraud Case\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Samia Suluhu Hassan Victory A “Complete Fraud” Declares Chamisa",
            "url": "https://www.zimeye.net/2025/11/04/samia-suluhu-hassan-victory-a-complete-fraud-declares-chamisa/",
            "content": "By A Correspondent  Opposition leader Nelson Chamisa on Monday issued a blistering statement condemning Tanzanias recently concluded general election, describing it as discredited, disputed, and deeply undemocratic, while accusing African regional bodies of turning a blind eye to electoral abuses across the continent.\n\nIn a detailed 15-point statement titled Democracy Under Siege in Africa, Chamisa said the violence, intimidation, and manipulation that surrounded Tanzanias October 28, 2025, polls represented what he called an encyclopedic record of electoral malpractice.\n\nWe condemn the excessive use of force against citizens, the killings and abductions of opposition figures, and the incarceration of credible candidates, Chamisa said. These actions represent a complete erosion of democratic values.\n\nTanzanias election pitted President Samia Suluhu Hassan of the ruling Chama Cha Mapinduzi (CCM) against opposition leader Tundu Lissu of CHADEMA. The National Electoral Commission declared Hassan the winner with more than 80% of the vote  a result immediately rejected by the opposition as a complete fraud. Reports from civil society and international observers cited widespread voter intimidation, internet shutdowns, ballot tampering, and the arrest of opposition activists.\n\nChamisa linked the Tanzanian election controversy to what he called a broader regional pattern of democratic decay, warning that Southern Africa was experiencing a rising tide of electoral manipulation and authoritarian consolidation.\n\nWe are witnessing a continental crisis of legitimacy  where elections are no longer instruments of democracy, but rituals of endorsement for those already in power, he said.\n\nThe opposition leader pointed to similar patterns in Zimbabwe and Mozambique, saying African elections were increasingly marked by the disqualification of credible candidates, tampering with voter rolls, and the silencing of dissent through intimidation, abductions, and violence.\n\nChamisa also took aim at the Southern African Development Community (SADC) and the African Union (AU), accusing them of failing to confront member states that rig elections or suppress opposition voices.\n\nSADCs ineffectiveness has been brought under the spotlight and found wanting, he said, adding that the blocs credibility was severely compromised when chaired by Zimbabwes Emmerson Mnangagwa  whose own 2023 re-election was condemned by the SADC Election Observer Mission as falling short of democratic standards.\n\nTurning to the African Union, Chamisa accused the continental body of moral abdication. The African Union has been an absent guardian, a missing guard rail. Instead of protecting African people, it now rubber-stamps tyranny, he said.\n\nChamisa concluded his Monday statement by urging the East African Community (EAC) to intervene and calling for the immediate release of detained Tanzanian opposition leader Tundu Lissu and his colleagues.\n\nThe people of Africa deserve leaders chosen freely  not through fear, fraud, and force, Chamisa said. Our continents future depends on restoring the integrity of the ballot and the sanctity of the peoples voice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Opposition leader Nelson Chamisa on Monday issued a blistering statement condemning Tanzania’s recently concluded general election, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/samia-suluhu-hassan-victory-a-complete-fraud-declares-chamisa/\">Continue reading<span class=\"screen-reader-text\"> \"Samia Suluhu Hassan Victory A “Complete Fraud” Declares Chamisa\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Beware of Chadonha, Scammers Are Back as the Festive Season Nears",
            "url": "https://www.zimeye.net/2025/11/04/beware-of-chadonha-scammers-are-back-as-the-festive-season-nears/",
            "content": "Chadonha is a Shona word meaning something that has fallen and is one of Zimbabwes most common street scams. It usually starts when someone finds a wallet or purse of money or valuables dropped on the ground. Pretending to be a good Samaritan, the scammer invites an unsuspecting passer-by to share the discovery. Moments later, the victim is tricked into handing over their own cash, phone or any valuables and the scammers vanish.\n\nThis old con has evolved with time. Today, chadonha is no longer just about a wallet or purse on the street, it is about deceit in many forms. From fake investment schemes and money-doubling WhatsApp groups to bogus job offers and online marketplace fraud, chadonha has become a symbol of how scammers exploit Zimbabweans desperation, especially during the festive season.\n\nAs December approaches, cases of fraud and scams rise sharply. The reason is simple, it is that time of the year when people are desperate to make or save money for the holidays. Scammers know it and they also need cash.\n\nWith unemployment still high and prices on their way up, many people turn to side hustles and informal deals to survive. That is where con artists thrive. They promise quick profit, instant return or unbelievable bargains. They use fake bank notifications, cloned social media accounts or even forged company documents to gain trust and then disappear once the victim pays.\n\nPolice have repeatedly warned the public about rising fraud cases between October and December. These months bring bonuses, diaspora remittances and savings meant for school fees or groceries, a time when families handle cash more than usual.\n\nBut for many, the joy of receiving money soon turns into heartbreak when they realise they have been scammed. The criminals are smart, patient and persuasive. Some even pretend to be church members, relatives or business partners.\n\nIn tough economic times, hope becomes a weakness. When someone offers an easy opportunity, it feels like a blessing not a trap. Many victims say the deals sounded too good to ignore. In reality, scammers study human behaviour and they know how to exploit trust, emotion and urgency.\n\nAs poverty deepens and unemployment rises, chadonha will continue to grow not just as a street crime but as a reflection of the economic pain many are living through.\n\nIf you are a victim of chadonha report immediately to the nearest police station or use digital fraud-reporting platforms such as scamalert.africa.\n\nAs the holiday season draws near, remember, scammers are not resting. They, too, want to celebrate and your money is their target. Let us protect one another, stay alert and ensure that chadonha doesnt steal our joy this festive season.\n\nBy Jacob Kudzayi Mutisi\n\n+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chadonha is a Shona word meaning “something that has fallen” and is one of Zimbabwe’s most common street scams. It … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/beware-of-chadonha-scammers-are-back-as-the-festive-season-nears/\">Continue reading<span class=\"screen-reader-text\"> \"Beware of Chadonha, Scammers Are Back as the Festive Season Nears\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Green Dollar Coin Pledges to Empower African SMEs Through Sustainable Digital Finance",
            "url": "https://www.zimeye.net/2025/11/04/green-dollar-coin-pledges-to-empower-african-smes-through-sustainable-digital-finance/",
            "content": "Business Correspondent\n\nLondon, UK  In a statement released last week, Green Dollar Coin (GDC) outlined its ambitious vision to economically empower small and medium enterprises (SMEs) across Africa and other underserved regions through its asset-backed digital currency.\n\nAccording to the company, GDC seeks to create a global financial ecosystem that transcends traditional barriers, offering financial inclusion to individuals and communities that have historically been marginalized by conventional banking systems.\n\nGreen Dollar Coin envisions a world where financial systems are inclusive, sustainable, and aligned with the principles of environmental stewardship, the statement read. Our goal is to provide a stable, asset-backed digital currency that empowers SMEs and promotes economic growth in regions that need it most.\n\nThe move signals a growing trend of fintech solutions aimed at addressing systemic financial inequalities in emerging markets. By offering a secure, stable digital currency, GDC aims to help African SMEs access global markets, streamline transactions, and reduce dependence on volatile local currencies.\n\nIndustry analysts say initiatives like GDCs could play a crucial role in driving economic development on the continent. For many African SMEs, access to a stable and globally recognized digital currency can reduce operational costs and open new growth opportunities, said a London-based fintech consultant.\n\nWith sustainability and inclusivity at the core of its strategy, Green Dollar Coin positions itself as more than just a digital currencyit is a financial tool designed to foster long-term economic empowerment and environmental responsibility.\n\nFollow us;Facebook:https://www.facebook.com/share/1Pk4TNG9HH/Telegram: https://t.me/+qi3SlhpoQk1mM2FkLinkedin: https://www.linkedin.com/company/greendollar/Twitter: https://x.com/greendollarcoin?s=21Instagram:https://www.instagram.com/greendollarcoin?igsh=OGo3Ym11MmE5aWYwTik Tok: https://www.tiktok.com/@greendollarcoin_?_t=ZM-8zHGSfQjPpl&_r=1WhatsApp: https://whatsapp.com/channel/0029Vb6f01JBVJkvN1dkmb05Website:www.greendollarcoin.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Business Correspondent London, UK – In a statement released last week, Green Dollar Coin (GDC) outlined its ambitious vision to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/green-dollar-coin-pledges-to-empower-african-smes-through-sustainable-digital-finance/\">Continue reading<span class=\"screen-reader-text\"> \"Green Dollar Coin Pledges to Empower African SMEs Through Sustainable Digital Finance\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Nurse Publicly Chants Zanu PF Slogan While In Uniform But Is This Safe For Citizens?",
            "url": "https://www.zimeye.net/2025/11/04/nurse-publicly-chants-zanu-pf-slogan-while-in-uniform-but-is-this-safe-for-citizens/",
            "content": "By A Correspondent\n\nA troubling video showing a nurse publicly chanting the ruling party Zanu PF slogan in the presence of Chikomba West MP and ICT Minister Tatenda Mavetera is circulating widely on social media.\n\nThe clip, reportedly recorded last week, has sparked concerns among health experts who see it as a troubling example of the increasing politicisation of key state institutions.\n\nIn the video, the nurse can be heard loudly shouting: Pasi nemhandu, Pamberi neZanu PF, Pamberi naPresident Dr ED Mnangagwa.\n\nObservers have noted that incidents like these risk undermining the perceived neutrality of public health workers, raising questions about professional ethics and the influence of politics in critical service sectors.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A troubling video showing a nurse publicly chanting the ruling party Zanu PF slogan in the presence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/nurse-publicly-chants-zanu-pf-slogan-while-in-uniform-but-is-this-safe-for-citizens/\">Continue reading<span class=\"screen-reader-text\"> \"Nurse Publicly Chants Zanu PF Slogan While In Uniform But Is This Safe For Citizens?\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Chiwenga’s Bold Gesture in Tanzania Signals a Diplomatic Reawakening",
            "url": "https://www.zimeye.net/2025/11/04/chiwengas-bold-gesture-in-tanzania-signals-a-diplomatic-reawakening-2/",
            "content": "By Shelton Muchena | Global Affairs Correspondent\n\nDar es Salaam  There are moments in political history when symbolism outweighs speeches, when a single gesture carries the emotions of millions and the scrutiny of the world. On a warm Tanzanian afternoon at the inauguration of President Samia Suluhu Hassan, Zimbabwes Vice President Constantine Chiwenga authored one such moment and in doing so, reshaped how he is seen both at home and abroad.\n\nAmid the dignitaries bearing ornate gifts of celebration, Chiwenga arrived carrying something startlingly different: a heavy iron keg. It was not crafted for elegance, nor meant to flatter. Instead, it represented Zimbabwe a nation brimming with promise yet burdened by history, celebrated for resilience yet scarred by struggle. The keg was said to hold the dualities of a country still defining itself: sacrifice and triumph, hardship and hope, containment and potential.\n\nEyes followed him. Doubts followed him too. From a background rooted in military power and political turbulence, Chiwenga has long been a figure judged by his past rather than his intentions. Many anticipated a misstep. Many expected a moment that would reinforce old narratives. But what unfolded was a quiet transformation.\n\nChiwenga carried the keg not with reluctance or fear, but with a poise that spoke of responsibility. Each stride was deliberate, steady, respectful a recognition of the weight he bore on behalf of a nation. When he reached President Samia, he set the keg gently before her, and in a voice measured by humility and certainty, he declared:\n\nThis is Zimbabwe strong, resilient, forged in sacrifice, and ready to redefine its future through partnership.\n\nThe auditorium, alive moments before, fell into thoughtful silence. In that brief stillness, a powerful message was received: Zimbabwe is not pretending to be unbroken. It is choosing to be unafraid of its truth. And through that truth, it seeks renewed relationships and regional trust.\n\nPresident Samia placed her hand upon the cold metal in acceptance not only of the symbolic gift, but of the hope and friendship sealed within it. Diplomats around them nodded, murmuring in admiration. The gesture, unexpected in its sincerity, revealed a Chiwenga willing to evolve to act not as a commander imposing authority, but as a representative earning respect.\n\nCritics, prepared to pounce, instead found themselves acknowledging a moment of diplomatic maturity. Observers called it a breakthrough, a calculated yet courageous step forward. For once, the narrative surrounding Chiwenga was not anchored to controversy, but to an elegant act of statesmanship that left little room for dismissal.\n\nIt is no secret that Zimbabwe seeks to repair strained relationships and rekindle continental cooperation. Its people yearn for stability, dignity, and a fair reintroduction to the world stage. This gesture, though symbolic, was a testament to that yearning a statement that Zimbabwe is ready to participate, contribute, and rise again through unity rather than isolation.\n\nYet symbolism, as powerful as it is, must now be matched with action. The world waits to see whether this diplomatic spark becomes a sustained fire guiding Zimbabwe toward renewal. But on this day in Tanzania, progress did not come through grand declarations or political bravado. It came through humility and the courage to carry a national burden openly.\n\nIn Dar es Salaam, Constantine Chiwenga carried Zimbabwe and he did not drop it. He placed its story, its struggle, and its future on the table of friendship. And in that gesture, he did something few expected:\n\nHe impressed.He redeemed.He signalled a new beginning.\n\nFor the first time in a long time, the applause that followed was not merely ceremonial  it was hopeful. And as the cameras captured this defining moment, one truth became clear:\n\nZimbabwe is stepping forward, and the world has turned its gaze to watch.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena | Global Affairs Correspondent Dar es Salaam — There are moments in political history when symbolism outweighs … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/chiwengas-bold-gesture-in-tanzania-signals-a-diplomatic-reawakening-2/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga’s Bold Gesture in Tanzania Signals a Diplomatic Reawakening\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Chiwenga Speaks On Chaotic Elections In Tanzania…",
            "url": "https://www.zimeye.net/2025/11/04/chiwenga-speaks-on-chaotic-elections-in-tanzania/",
            "content": "By A Correspondent\n\nZimbabwes Vice President General (Retired) Constantino Chiwenga expressed deep concern over the turmoil following Tanzanias disputed elections.\n\nSpeaking to journalists on Monday after attending the inauguration of Tanzanian President Samia Suluhu Hassan, Chiwenga described the situation as highly troubling.\n\nQuoted by Day Star News, Chiwenga said :\n\nWhat happened in Tanzania, its quite disturbing. Its something that must be avoided at all costs. I believe Tanzania has come of age. Tanzania is the mother of all liberation movements; when we fought for our independence, we were all based in Tanzania. So, to us, it is something we wouldnt want to see.\n\nObservers note that Chiwengas attendance and public comments appear to have placed him deliberately in a delicate position amid tensions with President Emmerson Mnangagwa, reflecting ongoing political sparring between the two top leaders.\n\nThe election, which saw President Suluhu claim victory with a controversial 98% margin, has been widely criticized amid allegations of irregularities and voter suppression.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s Vice President General (Retired) Constantino Chiwenga expressed deep concern over the turmoil following Tanzania’s disputed elections. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/04/chiwenga-speaks-on-chaotic-elections-in-tanzania/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Speaks On Chaotic Elections In Tanzania…\"</span></a></p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Mliswa Says Whenever “Beans-Thug” Kembo Mohadi, Is Acting President, Country Is Stable And Peaceful",
            "url": "https://www.zimeye.net/2025/11/04/mliswa-says-whenever-beans-thug-kembo-mohadi-is-acting-president-country-is-stable-and-peaceful/",
            "content": "full print\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "full print",
            "time": "20:45",
            "date": "04 Nov 2025"
        }
    ]
}