{
    "news": [
        {
            "title": "Memorial Lecture on General Lookout Masuku",
            "url": "https://www.zimeye.net/2025/05/25/memorial-lecture-on-general-lookout-masuku/",
            "content": "Today in Bulawayo, lbhetshu LikaZulu organized a memorial lecture honoring General Lookout Masuku and Dr Philani Lithandene Ndlovu a Doctor of Law at UNISA delivered the lecture below entitled,\n\nVictims or victors?Areflection of the life and legacy of LKVM and his contemporaries\n\nGreetingsladies and gentlemen\n\nIntroduction\n\nJust a little over two weeks ago,we witnessed the passing of MrsSikhubekisoMangena, the wife of the ZIPRA commander who died in 1978 during one of the military operations to liberateZimbabwe from colonial rule.Sadly,she died a paupers death despite the sacrifices she and her husband made to liberate thiscountry.\n\nThe liberation war that ushered this country into black rule in 1980was bloody and grueling. Three major armies were involved, namely, the ZPRA, ZANLA and the Rhodesian Front. To end the war, a conference was held at the Lancaster House in the United Kingdom. The agreement paved way for theintegration of thethree-armedmilitarybelligerentsinto one national army of Zimbabwewhich would be responsible for thedefenseof thenewly established Republic of Zimbabwe. The three command structureswere to be merged into one. British military instructors were assigned the duty tooverseethe process.\n\nWhen the integration exercise was done,Rex Nhongo (a.k.a Solomon Mujuru) was appointed asthe Head of the military.Ubaba uLookout Vumindaba Khalisabantu Masuku was appointed ashis deputy.Within two years of its establishment, the Joint High Commandestablishedin1980collapsed when Lookout Masuku, Dumiso Dabengwa, among others were arrested andtried for alleged acts of treason.The arrest resulted in a lengthy trial which proceeded through theHigh Court of Bulawayo right up to the Supreme Court.Interestingly, the state prosecution failed to sustain the charges against the accused ZPRA commanders, resulting in their acquittal by the Supreme Court in April 1983. The state case was too weak to sustain,bereft of evidenceand demonstrably politically motivated.Despite their acquittal, Masuku and Dabengwa were immediately detainedwith neither further charges pressed against them nor trial between 1983 and 1986.\n\nIt is common knowledge that Masukus health deteriorated significantly during that detention. Even though he was eventually released in March 1986, that release came barely a monthbefore he eventually succumbed to illness.His death on the 5thof April in 1986just two days before his 46thbirthday cast a dark shed on the prospects of the successful attainment ofthe dream of a free country for which Masuku and his compatriots had fought so hard toliberate. It is a sad reminder of how ones sacrifice can be used against himby those who have benefited from it.\n\nThe case of Masuku and Dabengwa goes into history as an unprecedented travesty of justice inZimbabwe, and a textbook case of how lawfare has been deployed tointimidate critics and opposition political activists in this country.The recent arrests and detentions of the likes of Job Sikhala, Blessing Mhlanga, andothers must be viewed against the backdrop of along-standingculture wherebycritics of government and the state face detentions tocurtail their voices and muzzle any potential criticism of theestablishment.\n\nContext\n\nBut how is the arrest of Masuku and Dabengwa to beunderstood?\n\nWas it by coincidence that the arrest, prosecution, and subsequent detention of theZPRA supremo duos arrest was immediately followed by the deployment of Gukurahundi into the provinces of Matabeleland and the Midlands? Is their trial not to be viewed within the context of the bigger Gukurahundi genocide plot?\n\nThenational question\n\nOne question that stands to be answered is: Who is a Zimbabwean? What is a Zimbabwean?\n\nWhen you say that you are Zimbabwean, what do you mean?\n\nEconomic freedom\n\nProcurement\n\nPolitical participation\n\nIs there freedom of participation\n\nGukurahundi Chiefs process\n\nChiefs process\n\nImpact\n\nPrinciples of justice\n\nJustice hinges on the twomain principles:\n\nAudi alteram partem\n\nNemo judex in causa sua\n\nReconciliation\n\nNation building\n\nHow theyoungviewthe war of independence\n\nThe young do not see a reason why Masuku went to war.\n\nOurfuture\n\nConclusion\n\nJustice has beenelusive since 1980.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Today in Bulawayo, lbhetshu LikaZulu organized a memorial lecture honoring General Lookout Masuku and Dr Philani Lithandene Ndlovu a Doctor … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/memorial-lecture-on-general-lookout-masuku/\">Continue reading<span class=\"screen-reader-text\"> \"Memorial Lecture on General Lookout Masuku\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Alternatives to Starlink Julius Malema Could Propose to Stop Musk Weaponising Internet",
            "url": "https://www.zimeye.net/2025/05/25/alternatives-to-starlink-julius-malema-could-propose-to-stop-musk-weaponising-internet/",
            "content": "By Farai D Hove | In light of recent regulatory developments affecting Starlinks operations in South Africa, stakeholders led by politicians the likes of Julius Malema are exploring alternative satellite internet solutions. This report provides an overview of the current situation and viable alternatives for high-speed internet connectivity in the region.\n\n Regulatory Landscape: Starlinks Challenges in South Africa\n\nStarlink, operated by SpaceX, has faced hurdles in launching services in South Africa due to the countrys Black Economic Empowerment (BEE) laws, which mandate that foreign telecom companies allocate 30% ownership to historically disadvantaged groups. Elon Musk has criticized these requirements as discriminatory. In response, South African authorities are considering policy adjustments, such as allowing companies to fulfill empowerment obligations through alternative means like local investments and job creation .\n\nDespite these proposed changes, political opposition remains, with parties like the Economic Freedom Fighters threatening legal action against any exemptions granted to Starlink .\n\n Alternative Satellite Internet Providers in South Africa\n\nGiven the uncertainties surrounding Starlinks entry, several other providers offer satellite internet services in South Africa:\n\n1.\n\nOneWeb (Eutelsat Group) via Liquid Intelligent Technologies\n\n2.\n\nVox Telecom\n\n3.\n\nMorClick\n\n4.\n\nWireless Internet Service Providers (WISPs)\n\n Emerging Global Competitors\n\nSeveral international players are developing satellite internet services that may become available in South Africa:\n\n Recommendations\n\nStaying informed about the evolving satellite internet landscape will be crucial for making timely and beneficial decisions regarding connectivity solutions in South Africa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | In light of recent regulatory developments affecting Starlink’s operations in South Africa, stakeholders led by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/alternatives-to-starlink-julius-malema-could-propose-to-stop-musk-weaponising-internet/\">Continue reading<span class=\"screen-reader-text\"> \"Alternatives to Starlink Julius Malema Could Propose to Stop Musk Weaponising Internet\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Chivayo Splashes US$250K, Luxury Cars On Fellow Fraudster’s Birthday",
            "url": "https://www.zimeye.net/2025/05/25/chivayo-splashes-us250k-luxury-cars-on-fellow-fraudsters-birthday/",
            "content": "By Showbiz Reporter-In a country grappling with economic decline and where millions of citizens struggle to afford three meals a day, controversial businessman and self-proclaimed benefactor Wicknell Chivayo has shocked Zimbabweans yet again  this time by gifting his long-time friend and alleged fellow fraudster,Joseph Tazviona Mhaka, overUS$250,000in cash and brand-new luxury vehicles for his birthday.\n\nIn a lengthy, flamboyant post on social media, Chivayo showered Mhaka  a man wanted in connection with allegedcard cloning and cyber fraud in the United Kingdom and the United States with effusive praise and extravagant gifts, including a 2025Toyota Land Cruiser VXR 300 Seriesand a 2025Toyota Fortuner 44for Mhakas wife, Ruby.\n\nChivayo, who often refers to himself as a loyal son of President Emmerson Mnangagwa, posted:\n\nBefore I forget, my finance director has your small birthday pocket money of US$250,000 in cash to spoil yourself and your family. This is the little I can afford,wrote Chivayo.\n\nJoseph Mhaka, also known asChief J, has long been under international scrutiny for his alleged role in transnational fraud syndicates. According to multiple reports and leaked law enforcement documents, Mhaka is suspected of operating or facilitatingcredit card cloning and wire fraud schemesin the UK and the USA during the early 2000s. Some reports link Mhaka tocybercrime ringsthat defrauded financial institutions and online payment systems, prompting investigations from authorities inLondon, Manchester, andAtlanta.\n\nThough he has since returned to Zimbabwe and assumed a low-key profile  often posting lavish content on social media  Mhaka is believed to still be under watch by international law enforcement agencies. His connections to high-profile Zimbabwean elites have reportedly shielded him from arrest or extradition.\n\nWicknell Chivayo himself is no stranger to scandal. A former convict, Chivayo served time in prison in 2005 forbank fraudinvolving a fake Barclays Bank transfer. His notoriety grew exponentially when he was awarded lucrative government energy contracts under controversial circumstances  despite not delivering any tangible work.\n\nIn 2015, Chivayos company, Intratrek Zimbabwe, receivedmillions of dollars in advance paymentsfrom the Zimbabwe Power Company (ZPC) for theGwanda Solar Project, which remains incomplete to this day. Subsequent parliamentary inquiries and Auditor-General reports revealed how Chivayo pocketed millions without producing a single megawatt of electricity. Despite this, he has continued to enjoy immunity from prosecution and remains closely associated with top ZANU PF officials.\n\nIn 2023, he rebranded himself as a philanthropist, frequently posting images of himself donating vehicles to musicians, pastors, and social media influencers. Critics, however, argue that these public displays are a strategy to launder his image while masking continued corruption and access to opaque state contracts.\n\nThe birthday gifts to Mhaka have triggered outrage across social media, with many Zimbabweans questioning the source of Chivayos vast wealth and the moral rot in the countrys political and business elites.\n\nHow is it that someone with a criminal record and an ongoing corruption scandal is allowed to flaunt cash like this, while nurses and teachers are earning less than US$200 a month? one user asked.\n\nPolitical analysts say the extravagant gifts expose a deeply entrenched culture of impunity among Zimbabwes politically connected elite. The incident also raises ethical concerns over the continued celebration of individuals implicated in financial crimes  especially at a time when the government is struggling to fund basic services and wages.\n\nIn a normal society, the public flaunting of unexplained wealth  particularly involving individuals linked to fraud  would trigger investigations or criminal proceedings. But in Zimbabwe, it appears to be a spectacle endorsed or ignored by those in power. As Chivayo continues to use his wealth for public spectacle, questions linger: who is funding these lavish gifts, and at what cost to the ordinary Zimbabwean?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-In a country grappling with economic decline and where millions of citizens struggle to afford three meals a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/chivayo-splashes-us250k-luxury-cars-on-fellow-fraudsters-birthday/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Splashes US$250K, Luxury Cars On Fellow Fraudster’s Birthday\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Live Grenade Found In Plumtree Village",
            "url": "https://www.zimeye.net/2025/05/25/live-grenade-found-in-plumtree-village/",
            "content": "By A Correspondent- Villagers in Thandawani, Ward 7 of Masendu in Plumtree, Matabeleland South, were left shaken after discovering a live hand grenade buried beneath the soil, a relic believed to date back to Zimbabwes liberation war era.\n\nThe potentially deadly device was unearthed last Thursday after heavy rains eroded the ground, exposing the rusted explosive in a local homestead. Alert community members wisely refrained from touching the grenade and immediately alerted authorities.\n\nWe think it had been buried there for decades, said one villager. Luckily, no one was injured. Soldiers came the same day and neutralised the grenade. We are relieved.\n\nThe Zimbabwe National Army (ZNA) responded swiftly, dispatching a bomb disposal unit that safely detonated the ordnance. Zimbabwe Republic Police spokesperson for Matabeleland South Province, Assistant Inspector Stanford Mguni, confirmed the incident.\n\nWe are still conducting investigations into the matter, he said. The grenade was discovered on 12 May 2025 and was safely destroyed by the Zimbabwe National Army on 15 May 2025.\n\nThis is not the first time unexploded ordnance (UXO) has been discovered in Zimbabwes rural areas. Landmines, grenades, and other remnants of war continue to pose a threat to communities  particularly in provinces such as Mashonaland Central, Mashonaland East, Manicaland, and Matabeleland South, where heavy fighting occurred during the 1970s liberation struggle.\n\nSince independence in 1980, the Zimbabwean government, with the support of international partners, has engaged in various mine clearance and ordnance disposal efforts. However, due to the sheer scale of contamination and the ruggedness of affected terrain, progress has been slow and intermittent.\n\nIn the early years following independence, Zimbabwe received support from countries such as the United Kingdom and Sweden in mapping and marking minefields. By the 1990s, international organisations including the HALO Trust and Norwegian Peoples Aid (NPA) began formal mine clearance operations, focusing primarily on anti-personnel landmines laid along the countrys borders by Rhodesian forces.\n\nDespite their success in clearing major minefields, smaller devices like hand grenades, mortars, and artillery shells  often buried or left behind during battles  remain hidden across the countryside, only to be discovered decades later by unsuspecting civilians.\n\nIn 2018, Zimbabwes government committed to theOttawa Treatydeadline to become mine-free by 2025. This led to a renewed push in demining efforts, with enhanced collaboration between the Ministry of Defence, the National Mine Action Authority of Zimbabwe (NAMAAZ), and NGOs such as Mines Advisory Group (MAG) and APOPO.\n\nThese organisations have used advanced detection equipment, trained deminers, and community education campaigns to locate and safely remove UXO. According to the Zimbabwe Mine Action Centre (ZIMAC), over 50,000 landmines and explosives have been removed in the past decade alone.\n\nDespite the progress, UXO remains a persistent danger, particularly in rural areas where children and farmers often stumble upon these forgotten weapons. Authorities have urged citizens to report any suspicious metal objects and avoid attempting to move or tamper with them.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- Villagers in Thandawani, Ward 7 of Masendu in Plumtree, Matabeleland South, were left shaken after discovering a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/live-grenade-found-in-plumtree-village/\">Continue reading<span class=\"screen-reader-text\"> \"Live Grenade Found In Plumtree Village\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Mbappe Makes History with Record-Breaking Debut Season at Real Madrid",
            "url": "https://www.zimeye.net/2025/05/25/mbappe-makes-history-with-record-breaking-debut-season-at-real-madrid/",
            "content": "Sports Correspondent\n\nKylian Mbapp has etched his name into the Real Madrid history books by becoming the first player in the clubs history to score over 30 goals in his debut La Liga season. The French superstar capped off a phenomenal campaign with his 31st league goal during Real Madrids 2-0 win over Real Sociedad on Saturday.\n\nMbapp, who joined the Spanish giants in a high-profile move last summer, has been a dominant force in La Liga, consistently delivering match-winning performances and living up to the immense expectations that followed his transfer. His blistering pace, sharp finishing, and tactical intelligence have not only made him a fan favorite at the Santiago Bernabu but have also been instrumental in Real Madrids successful league campaign.\n\nSaturdays La Liga results also saw Legans defeat Real Valladolid 3-0, while Espanyol secured a 2-0 victory over Las Palmas.\n\nWith 31 goals in his debut season, Mbapp has set a new benchmark for future Madrid forwards and further solidified his status as one of the worlds elite footballers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kylian Mbappé has etched his name into the Real Madrid history books by becoming the first player in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/mbappe-makes-history-with-record-breaking-debut-season-at-real-madrid/\">Continue reading<span class=\"screen-reader-text\"> \"Mbappe Makes History with Record-Breaking Debut Season at Real Madrid\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Another Zimbo Dies Days After Relocating to UAE",
            "url": "https://www.zimeye.net/2025/05/25/another-zimbo-dies-days-after-relocating-to-uae/",
            "content": "Every year, thousands of Zimbabweans leave the only home theyve ever known, driven by hope, desperation, and the promise of greener pastures abroad. Some find success and stability, rising above the hardships that once stifled their dreams. Others, however, are met with a harsh and unforgiving reality  one that turns ambition into tragedy.\n\nFor many families, the journey of a loved one to foreign lands is a bittersweet goodbye, filled with prayer and silent worry. And when that journey ends in heartbreak, as it did for Shepherd Mudoveri, the pain is unbearable  not just because of the loss, but because it defies logic. In the middle of this modern-day exodus, how do you make sense of a young life cut short before it even had a chance to begin anew?\n\nThis is the story of one of Zimbabwes sons who chased hope across borders, only to be met by fate in the most tragic of ways.\n\nCHIVHU  Just a week after relocating to the United Arab Emirates in search of a better life, 25-year-old Shepherd Mudoveri tragically died while attempting to escape a devastating tower fire in Al Nahda, Sharjah. His death has left a community in deep mourning, as his remains were repatriated and laid to rest in Chivhu this past Saturday.\n\nMudoveri, who had travelled to Dubai after being invited by friends, fell from the 42nd floor of a high-rise building while trying to flee the blaze using makeshift ropes. The fire tore through the building in early April, claiming the lives of five people, including the promising young Zimbabwean.\n\nHe was a brilliant young man, with a promising future. He had just arrived in Dubai and was settling in when the fire broke out, said family spokesperson Mr. Taurai Mudoveri. In his desperate attempt to survive, he used ropes to escape but tragically slipped and fell to his death. We are devastated.\n\nScreenshots from WhatsApp messages show Mudoveri reaching out with condolences to a friend who had just lost their father, only days before his own death. My condolences brother, very sorry. Its hard but ingoziiisa mumaoko amwarii, he wrote on April 10. By April 14, he was gone.\n\nA heartbroken Facebook post by Tanaka Mujaty recounts their last interaction. RIP my guy on the 10th of April you sent me a message telling me that I must leave it to God during my fathers funeral, and on the 14th you passed away.\n\nEmotional images from the funeral in Chivhu captured the raw grief of family members. Women wept uncontrollably beside the white coffin, while others tried to console each other in the presence of overwhelming pain.\n\nMudoveris tragic end has served as a painful reminder of the harsh realities many Zimbabweans face in pursuit of economic opportunities abroad. His memory now lives on through the tears and prayers of those he left behind.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Every year, thousands of Zimbabweans leave the only home they’ve ever known, driven by hope, desperation, and the promise of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/another-zimbo-dies-days-after-relocating-to-uae/\">Continue reading<span class=\"screen-reader-text\"> \"Another Zimbo Dies Days After Relocating to UAE\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Mnangagwa Tells Suffering Zimbabweans To Cherish Gains Of Independence",
            "url": "https://www.zimeye.net/2025/05/25/mnangagwa-tells-suffering-zimbabweans-to-cherish-gains-of-independence/",
            "content": "By A Correspondent\n\nHarare  May 25, 2025\n\nAs Zimbabwe joined the rest of the continent in commemorating the 62nd Africa Day, President Emmerson Mnangagwa called on Zimbabweans to remember and cherish the countrys hard-won independence, despite the social and economic challenges many continue to face.\n\nAddressing the nation during Africa Day celebrations, Mnangagwa paid tribute to the African Liberation Committee and the collective efforts of African nations that supported Zimbabwes fight for independence.\n\nZimbabwe is grateful and will forever cherish the enduring fruits of Africas fraternal support and solidarity we received through the Liberation Committee, Mnangagwa said. This helped to usher our hard-won independence and that contribution was not in vain.\n\nAfrica Day, marked annually on May 25, commemorates the founding of the Organisation of African Unity (now the African Union) in 1963 and celebrates African unity and liberation. For many Zimbabweans, however, the occasion comes amid growing concerns about poverty, inflation, and unemployment.\n\nMnangagwa acknowledged these hardships indirectly by urging the current generation to honour the sacrifices of the past by committing themselves to the goals of the African Unions development agenda.\n\nToday, us the present generation must do our part to bring to fruition the realization of the African Union Agenda, he said.\n\nHe emphasized the need for unity and continued struggle for the values of justice, equality, and human dignity across the continent.\n\nWe stand united in our shared commitment of justice, equality and dignity of all people of Africa, the president added.\n\nWhile the presidents message focused on continental solidarity and historical gratitude, critics argue that the government must also confront the pressing realities faced by ordinary citizens. Many Zimbabweans continue to struggle with limited access to basic services, persistent corruption, and economic instabilityissues that some say stand in contrast to the ideals celebrated on Africa Day.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – May 25, 2025 As Zimbabwe joined the rest of the continent in commemorating the 62nd … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/mnangagwa-tells-suffering-zimbabweans-to-cherish-gains-of-independence/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Tells Suffering Zimbabweans To Cherish Gains Of Independence\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Linda Masarira Fights In Malema Corner, Blasts Ramaphosa",
            "url": "https://www.zimeye.net/2025/05/25/linda-masarira-fights-in-malema-corner-blasts-ramaphosa/",
            "content": "By Tinashe Sambiri\n\nZimbabwean opposition leader Linda Masarira has launched a scathing attack on South African President Cyril Ramaphosa, accusing him of betraying African interests to appease U.S. President Donald Trump and other Western powers.\n\nIn a fiery statement released Friday titled Solidarity Statement with CIC Julius Malema and the People of South Africa on Land Reclamation, Masarira  who leads the Labour Economists and Afrikan Democrats (LEAD) party  pledged unwavering support for the Economic Freedom Fighters (EFF) and its leader Julius Malema over their land reform stance.\n\nAs Labour Economists and Afrikan Democrats (LEAD), we stand in resolute solidarity with the Economic Freedom Fighters (EFF) and Commander-in-Chief Julius Malema in their unapologetic stance on land expropriation without compensation, said Masarira.\n\nTaking direct aim at President Ramaphosa, Masarira accused him of siding with global interests to suppress legitimate African struggles. The ongoing attempts by global powers and certain Western interests to police, ridicule, and interfere with sovereign African policy debates, especially those rooted in historical redress, reveal a deeply entrenched colonial mindset that refuses to accept the full emancipation of the African people, she said.\n\nMasarira warned that Ramaphosas government risked becoming an enabler of foreign domination. The future of the continent cannot and must not be shaped by fear of backlash from former colonial masters or the comfort of compromised elites, she declared.\n\nHer remarks come amid heightened tensions in South Africa over the EFFs renewed push for land reform and alleged international pressure to abandon the policy. Masarira insisted that resistance to land expropriation was rooted in racist and imperialist agendas.\n\nWe echo the sentiments that no amount of foreign intelligence gossip, media manipulation, or diplomatic bullying should deter the legitimate aspirations of South Africans to reclaim what was stolen under violent settler colonialism, she said. The narrative of white genocide is not only unsubstantiated but deliberately constructed to criminalize Black resistance and delegitimize African agency.\n\nDrawing parallels with Zimbabwes own controversial land reform program, Masarira said Zimbabweans understood the high cost of reclaiming ancestral land. We know the price of reclaiming dignity. We also know that land is not just an economic asset. It is the heartbeat of identity, heritage, and sovereignty.\n\nConcluding her statement with a rallying cry, Masarira affirmed: Land must return to its rightful custodians not for political expediency but for justiceWe affirm that land expropriation without compensation is not a crime. It is the correction of one. We salute CIC Julius Malema.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Zimbabwean opposition leader Linda Masarira has launched a scathing attack on South African President Cyril Ramaphosa, accusing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/linda-masarira-fights-in-malema-corner-blasts-ramaphosa/\">Continue reading<span class=\"screen-reader-text\"> \"Linda Masarira Fights In Malema Corner, Blasts Ramaphosa\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Joseph Kabila Faces Treason Charges As Immunity Is Stripped?",
            "url": "https://www.zimeye.net/2025/05/25/joseph-kabila-faces-treason-charges-as-immunity-is-stripped/",
            "content": "By A Correspondent\n\nThe Senate of the Democratic Republic of Congo has voted to strip former President Joseph Kabila of his legal immunity, opening the door for treason and war crimes charges linked to his alleged ties with rebel forces in the countrys troubled eastern region.\n\nThe landmark decision follows a formal request by the military prosecutor, who alleges that Kabila played a role in supporting the M23 rebel group. The group has seized several strategic towns in the mineral-rich east, intensifying the conflict and humanitarian crisis.\n\nAuthorities claim they have a substantial body of documents, testimony, and material evidence connecting the former president to the rebels. Though Kabila, 53, has not issued a public response to the latest developments, he has previously denied any involvement with M23.\n\nIn a decisive move on Thursday, nearly 90 senators voted in favor of lifting his immunity, with only five opposing. Kabila did not attend the Senate session to defend himself.\n\nKabila, who ruled the DRC from 2001 to 2019, became a senator for life after leaving office, a status that previously protected him from legal prosecution. The recent Senate vote now clears the way for legal proceedings.\n\nThe former leader has been living in South Africa since 2023, officially pursuing academic studies. In early April, he announced plans to return home to help resolve the conflict in eastern Congo. Not long after, unconfirmed reports emerged claiming Kabila had already returned and was in Goma  a city currently under M23 control. His party, the Peoples Party for Reconstruction and Democracy (PPRD), dismissed these reports.\n\nTensions escalated further last month when the Congolese government banned the PPRD, citing the partys ambiguous attitude toward the occupation of territory by M23.\n\nFollowing the Senates decision, the PPRD strongly condemned the move. This is pure theatre, the party said in a statement. The government is trying to distract the population from the real problems facing our country.\n\nWhile Kabilas next steps remain unclear, the unprecedented vote marks a dramatic shift in Congolese politics and signals a willingness by the current leadership to hold former rulers accountable. Whether the prosecution will proceed and how the charges will be substantiated is now the focus of regional and international observers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Senate of the Democratic Republic of Congo has voted to strip former President Joseph Kabila of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/25/joseph-kabila-faces-treason-charges-as-immunity-is-stripped/\">Continue reading<span class=\"screen-reader-text\"> \"Joseph Kabila Faces Treason Charges As Immunity Is Stripped?\"</span></a></p>",
            "time": "21:07",
            "date": "26 May 2025"
        },
        {
            "title": "Tagwirei Confirms Precabe Meeting Going Ahead",
            "url": "https://www.zimeye.net/2025/05/25/tagwirei-confirms-precabe-meeting-going-ahead/",
            "content": "Tagwirei confirms Precabe meeting going aheadpic.twitter.com/fFVF5eLMkp\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "21:07",
            "date": "26 May 2025"
        }
    ]
}