{
    "news": [
        {
            "title": "Mthwakazi Republic Party- MRP on Roads",
            "url": "https://www.zimeye.net/2025/06/01/mthwakazi-republic-party-mrp-on-roads/",
            "content": "MBUDZI INTERCHANGE: A STARK REMINDER OF MATABELELANDS MARGINALIZATION\n\nThe Mthwakazi Republic Party condemns the governments blatant marginalization of Matabeleland, exemplified by the recent construction of the Mbudzi Interchange in Mashonaland and the promise of six more in Harare. This development highlights the glaring disparity in infrastructure priorities, where the needs of Matabeleland are consistently ignored.\n\nThe Mbudzi Interchange holds little significance for the people of Mthwakazi. What matters most is fixing the Victoria Falls road, which remains in a sorry state, crippling the lives of our people and stifling local economic growth. The Nkayi road has been stagnant for over three decades, and Bulawayos water crisis persists with no solution in sight.\n\nMeanwhile, the government exploits our regions natural resources, using our own roads to transport coal, timber, and lithium without investing in the welfare and development of our communities. This blatant disregard for our regions needs and aspirations is unacceptable.\n\nThe MRP notes a long history of systemic marginalization, including:\n\nWe call upon the government to recognize the needs and aspirations of the people of Matabeleland and to address the historical injustices that have led to our regions underdevelopment.\n\nThe Mthwakazi Republic Party remains committed to advocating for the rights and interests of our people. We will not stand idly by while our region is ignored and marginalized.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "MBUDZI INTERCHANGE: A STARK REMINDER OF MATABELELAND’S MARGINALIZATION The Mthwakazi Republic Party condemns the government’s blatant marginalization of Matabeleland, exemplified … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/mthwakazi-republic-party-mrp-on-roads/\">Continue reading<span class=\"screen-reader-text\"> \"Mthwakazi Republic Party- MRP on Roads\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "150 Foreigners Arrested In Immigration Crackdown",
            "url": "https://www.zimeye.net/2025/06/01/150-foreigners-arrested-in-immigration-crackdown/",
            "content": "By A Correspondent- The government has announced the arrest of 146 foreign nationals for allegedly violating immigration laws in the first quarter of 2025.\n\nThe arrests, revealed by Immigration Department chief director Ms Respect Gono, mark a sharp rise from the 122 detained in the same period last year.\n\nThose arrested include nationals from Malawi (37), Ethiopia (24), China (21), the Democratic Republic of Congo (19), and smaller numbers from Mozambique, Zambia, and elsewhere.\n\nThe intensification of border control measures and deportation threats bears an uncanny resemblance to South Africas increasingly xenophobic immigration policies, where migrantsparticularly from other African nationshave become scapegoats for internal socio-economic failures.\n\nFor Zimbabwe, this marks a dramatic departure from the inclusive, Pan-African values once championed by former President Robert Mugabe, who positioned Zimbabwe as a home for all Africans fleeing imperialism, colonial legacy, or political instability.\n\nPresident Emmerson Mnangagwas government has tried to frame the crackdown as part of a broader strategy to regulate migration and attract legitimate investors.\n\nMs Gono credited what she termed policy reforms and increased openness for the rise in both arrests and investor interest.\n\nModern societies are a result of well-harnessed migration opportunities, she said. Our vision for an upper-middle-income economy by 2030 is within reach, thanks in part to our strong migration governance systems.\n\nParadoxically, while arrests surged, deportations have declined. Only 239 prohibited immigrants were deported in the first quarter of 2025, compared to 385 during the same period in 2024. Ms Gono attributed this to improved screening and early interventions.\n\nDespite the governments hardline approach to irregular migration, Ms Gono maintained that Zimbabwe remains a top destination for both migrants and investors. She cited a 17% increase in traveller movement, with over 2 million entries and exits recorded in Q1 2025, up from 1.79 million in the same period the previous year.\n\nInvestor confidence, she said, was on the rise, noting that investor residence permits rose from 333 in Q1 2024 to 454 in Q1 2025. However, Temporary Employment Permits (TEPs) dipped slightly from 2,629 to 2,249.\n\nStill, the governments Comply or Leave campaign has raised eyebrows. Ms Gono revealed that 65 joint operations targeting irregular migration were conducted in the first quartermore than double the number from last year.\n\nWhile she insisted the campaign aimed to uphold safe, regular and orderly migration, observers argue it echoes the exclusionary undertones seen in South Africas Operation Dudula and similar campaigns.\n\nPolitical analysts say Mnangagwas embrace of anti-foreigner rhetoric could be a calculated political tactic.\n\nWith economic recovery still elusive and domestic discontent growing, the government may be turning to migrants as convenient scapegoats to deflect attention from its own governance failures.\n\nThe move is especially jarring in the historical context of Zimbabwes post-independence identity, which under Mugabe was anchored in African solidarity.\n\nDuring the liberation war and its aftermath, Zimbabwe provided sanctuary to freedom fighters and political refugees from across the continent.\n\nThat legacy, critics argue, is now being eroded under Mnangagwas administration.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- The government has announced the arrest of 146 foreign nationals for allegedly violating immigration laws in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/150-foreigners-arrested-in-immigration-crackdown/\">Continue reading<span class=\"screen-reader-text\"> \"150 Foreigners Arrested In Immigration Crackdown\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "LIVE: Tagwirei Officially Confirms Blessed Geza Allegations On His Own",
            "url": "https://www.zimeye.net/2025/06/01/live-tagwirei-officially-confirms-blessed-geza-allegations-on-his-own/",
            "content": "video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below…",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "Police Arrest Owner Of Killer Pitbull In Harare",
            "url": "https://www.zimeye.net/2025/06/01/police-arrest-owner-of-killer-pitbull-in-harare/",
            "content": "By A Correspondent\n\nHarare, Zimbabwe  01 June 2025\n\nPolice in Harare have arrested a 40-year-old man following the tragic death of a local resident who was allegedly mauled by a pitbull in the suburb of Mabelreign. The incident, which has shocked the community, occurred on the morning of 1 June 2025.\n\nAccording to a statement released by the Zimbabwe Republic Police (ZRP), officers from the Mabelreign Police Station apprehended Mike Mupinga, the owner of the dog, on charges of culpable homicide. The arrest came after the body of Samuel Machara, 39, was discovered near Mupingas residence bearing severe dog bite wounds.\n\nAuthorities believe that the victim was attacked by Mupingas pitbull under unclear circumstances. The dog inflicted fatal injuries, and Machara succumbed to his wounds before any assistance could be rendered. His body was transported to the Parirenyatwa Group of Hospitals mortuary, where a postmortem examination is expected to be carried out.\n\nThe case has ignited renewed concern about the risks associated with aggressive dog breeds, particularly when kept in densely populated residential areas. Although pitbulls are often used for security purposes, animal welfare experts caution that without proper training, restraint, and secure containment, they can pose significant danger to the public.\n\nPolice have indicated that investigations are ongoing to determine the full circumstances of the attack, including whether the pitbull was adequately contained and if there were any prior incidents or warnings involving the animal.\n\nThe ZRP has called on dog owners to exercise full responsibility for their animals, urging them to ensure that potentially dangerous breeds are safely enclosed and do not pose a threat to neighbors or passersby. The Mabelreign community is mourning the loss of Machara, with the tragedy serving as a stark reminder of the importance of responsible pet ownership.\n\nFurther updates will be provided as the investigation unfolds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare, Zimbabwe – 01 June 2025 Police in Harare have arrested a 40-year-old man following the tragic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/police-arrest-owner-of-killer-pitbull-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Police Arrest Owner Of Killer Pitbull In Harare\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "PSG Crush Inter Milan 5-0 to Win Historic First UEFA Champions League Title",
            "url": "https://www.zimeye.net/2025/06/01/psg-crush-inter-milan-5-0-to-win-historic-first-uefa-champions-league-title/",
            "content": "Sports Correspondent\n\nParis Saint-Germain (PSG) delivered a footballing masterclass on Saturday night, demolishing Inter Milan 5-0 to lift their first-ever UEFA Champions League trophy in a lopsided final that left fans and pundits stunned.\n\nTeen sensation Dsir Dou was the star of the night, scoring twice in a dominant display that capped a fairytale European campaign for the Parisians.\n\nThe 19-year-olds brilliance helped bury a lacklustre Inter side that simply couldnt cope with PSGs intensity and creativity.\n\nAfter years of near misses and heartbreaksincluding a 1-0 loss to Bayern Munich in the 2020 finalPSG finally delivered on their long-promised European potential under manager Luis Enrique.\n\nThe Qatari-backed club, which flirted with elimination in the group stage this season, saved its best for the grandest stage.\n\nPSG wasted no time asserting their dominance, with Achraf Hakimiironically a former Inter playeropening the scoring in the 12th minute to ignite scenes of euphoria at the Parc des Princes viewing zone. Just minutes later, Dou added a second, finishing off a clinical team move to give the French champions a 2-0 lead inside 20 minutes.\n\nInter never recovered.\n\nDou struck again in the 63rd minute, making it 3-0 before Khvicha Kvaratskhelia joined the party with a composed finish 10 minutes later. Substitute Senny Mayulu rounded off the rout in the 87th minute, sealing the biggest winning margin ever recorded in a Champions League final.\n\nBefore kickoff, Inter fans proudly chanted Theres Only Inter in a sea of blue and black. But as the whistle blew, their team vanished from the contest, completely outclassed in every department by a relentless PSG side.\n\nFrom start to finish, PSG controlled the tempo with fluid passing and constant movement. This wasnt just a winit was a statement, said a jubilant fan at the stadium. Weve waited so long for this, and now its ours.\n\nAs captain Marquinhos lifted the coveted trophy into the London sky, there was no doubt: this was PSGs night, and Europe has a new champion.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Paris Saint-Germain (PSG) delivered a footballing masterclass on Saturday night, demolishing Inter Milan 5-0 to lift their first-ever … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/psg-crush-inter-milan-5-0-to-win-historic-first-uefa-champions-league-title/\">Continue reading<span class=\"screen-reader-text\"> \"PSG Crush Inter Milan 5-0 to Win Historic First UEFA Champions League Title\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "Mavetera Celebrates Birthday with Freebies in Chikomba, But Citizens Demand Real Solutions to National Crisis",
            "url": "https://www.zimeye.net/2025/06/01/mavetera-celebrates-birthday-with-freebies-in-chikomba-but-citizens-demand-real-solutions-to-national-crisis/",
            "content": "By A Correspondent\n\nICT Minister and Chikomba West MP Tatenda Mavetera last week turned her 39th birthday into a charitable occasion, handing out food hampers and launching a sustainability fund for vulnerable residents in her constituency.\n\nHowever, the event has stirred criticism, with citizens and observers accusing the ruling ZANU PF party of fostering dependency rather than addressing Zimbabwes deep-rooted socioeconomic challenges.\n\nMy heart is full after celebrating my birthday with the resilient souls of Chikomba West Constituency, Mavetera wrote.\n\nWe shared meals, provided food hampers, and launched a sustainability fund to empower people with disabilities.\n\nA total of 187 beneficiariesincluding people with disabilities, widows, and child-headed familiesreceived food packages as part of the birthday celebration. Compassion isnt just giving a hand, its building a future where everyone thrives, Mavetera added.\n\nIn this life, its difficult to make everyone happy, but I am happy to have done what I thought could bring a smile to someone.\n\nMavetera framed her acts of charity as part of a broader commitment to public service: To serve is a lifelong promise; to give is to plant seeds of hope that outlive us. For me, true joy lies not in what we receive, but in what we leave behind. I remain forever committed to uplifting lives, because service is the legacy that never fades.\n\nYet while some praised her generosity, others questioned the political motives behind such events. Critics argue that this kind of one-off aid does little to solve long-term problems such as poverty, poor healthcare, unemployment, and lack of infrastructure in rural Zimbabwe.\n\nZANU PF is deliberately creating a culture of dependency to maintain a firm grip on rural communities, said a local civil society activist. This is not empowerment. People want functioning hospitals, jobs, and reliable servicesnot handouts timed with birthdays and election cycles.\n\nDespite the celebratory tone of the event, the broader sentiment among many Zimbabweans remains one of frustration. With the countrys economy in a prolonged crisis, citizens are increasingly demanding sustainable solutions over symbolic gestures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ICT Minister and Chikomba West MP Tatenda Mavetera last week turned her 39th birthday into a charitable … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/mavetera-celebrates-birthday-with-freebies-in-chikomba-but-citizens-demand-real-solutions-to-national-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Mavetera Celebrates Birthday with Freebies in Chikomba, But Citizens Demand Real Solutions to National Crisis\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "🔥 Feli Nandi Set to Blaze the MTN Bushfire 2025 Stage in Eswatini!",
            "url": "https://www.zimeye.net/2025/06/01/%f0%9f%94%a5-feli-nandi-set-to-blaze-the-mtn-bushfire-2025-stage-in-eswatini/",
            "content": "The flames of African music will rise higher than ever as Zimbabwes own sensational songstress Feli Nandi takes center stage at the MTN Bushfire Festival 2025, set for 30 May  01 June in the beautiful kingdom of Eswatini (formerly Swaziland). \n\nNow in its 18th edition, the MTN Bushfire Festival has earned its place as one of Africas most celebrated arts and music festivals  and this year, its turning up the heat with an electrifying lineup that includes the soulful and dynamic Feli Nandi. \n\nKnown for her rich vocals, emotional depth, and Afro-fusion flair, Feli has steadily risen to become one of Zimbabwes most powerful musical exports. Her presence at this globally acclaimed event is more than just a performance  its a cultural experience. Whether shes serenading with Munhu Wangu or igniting the crowd with her empowering anthems, Feli brings a rare kind of fire to the stage.\n\nThe MTN Bushfire Festival is more than just music  its a celebration of unity, culture, and positive change. And Feli Nandi embodies all that and more. If youre planning to be anywhere this June, make sure its Malkerns Valley in Eswatini, where the fire will be real, and the music even hotter. \n\n Catch her live and let the flames of Afro-soul consume you. More info: www.bush-fire.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The flames of African music will rise higher than ever as Zimbabwe’s own sensational songstress Feli Nandi takes center stage … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/%f0%9f%94%a5-feli-nandi-set-to-blaze-the-mtn-bushfire-2025-stage-in-eswatini/\">Continue reading<span class=\"screen-reader-text\"> \"🔥 Feli Nandi Set to Blaze the MTN Bushfire 2025 Stage in Eswatini!\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "Zimbabwe Battles Surge in Malaria, Diarrhoea Cases …",
            "url": "https://www.zimeye.net/2025/06/01/zimbabwe-battles-surge-in-malaria-diarrhoea-cases/",
            "content": "By A Correspondent\n\nZimbabwe is grappling with a sharp rise in disease outbreaks, with malaria, diarrhoea, and influenza leading the surge, according to the latest Weekly Disease Surveillance Report released on 29 May by the Ministry of Health and Child Care.\n\nThe report covers the week ending 18 May 2025 and paints a grim picture of the countrys current public health situation.\n\nA total of 9,733 new malaria cases were recorded, resulting in 22 deaths nationwide. The most affected provinces were Mashonaland Central, which accounted for 4,172 cases, and Mashonaland West with 1,901 cases. Worryingly, 1,079 of these infections involved children under the age of five, highlighting the continued vulnerability of Zimbabwes youngest citizens.\n\nThe malaria-related deaths occurred at Sally Mugabe Central Hospital in Harare (6), Guruve District in Mashonaland Central (3), and Mutare and Chipinge districts in Manicaland (one each). Additional deaths were also reported in Mashonaland East, though the exact figure was not specified. Since the beginning of 2025, the country has recorded 82,940 malaria cases and 275 deaths.\n\nThe report also highlights a spike in common diarrhoea cases, with 4,309 new cases and four deaths in the same week. Children under five made up 38% of the new cases. All reported deaths occurred in Harare Provincethree at Parirenyatwa Group of Hospitals and one at Sally Mugabe Central Hospital. The year-to-date tally stands at 138,458 diarrhoea cases and 62 deaths.\n\nInfluenza casesoften dismissed as the common coldhave also been rising steadily. The Ministry recorded 5,099 suspected influenza cases for the week, with no deaths reported. Mashonaland West (1,831 cases) and Manicaland (1,361 cases) were the worst affected. The national total for suspected influenza now sits at 90,248 cases this year.\n\nThe Midlands Province reported five new anthrax cases, two each from Gokwe North and South, and one in Kwekwe. While no deaths have been attributed to anthrax in 2025, the country has now logged 61 cumulative cases.\n\nIn addition, 19 new suspected measles cases were reported from various provinces, including Harare, Mashonaland East, Matabeleland North, Midlands, Mashonaland West, Manicaland, and Bulawayo. So far, no measles deaths have occurred this year, and the cumulative case count stands at 266.\n\nAnother lingering concern is the rising number of dog bite incidents, with 590 cases recorded during the week. Among these, 121 were from vaccinated dogs, 98 from unvaccinated dogs, and 379 from dogs of unknown vaccination status. The highest numbers were from Masvingo and Manicaland. Although no fatalities have been reported from dog bites, the total number of cases has climbed to 12,548 since the start of the year.\n\nThe Ministrys data underscores the urgent need for reinforced public health responses and preventive measures, particularly in rural and underserved areas where the brunt of these outbreaks is being felt.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe is grappling with a sharp rise in disease outbreaks, with malaria, diarrhoea, and influenza leading the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/zimbabwe-battles-surge-in-malaria-diarrhoea-cases/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Battles Surge in Malaria, Diarrhoea Cases …\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "Matuke Declares Chief Nyamandi Is A Zanu PF Activist",
            "url": "https://www.zimeye.net/2025/06/01/matuke-declares-chief-nyamandi-is-a-zanu-pf-activist/",
            "content": "By A Correspondent\n\nThe installation of Chief Nyamandi in Gutu last week erupted into disarray as Zanu PF officials and senior civil servants found themselves at odds during what was supposed to be a formal and traditional ceremony. Instead of order and dignity, the event turned into a chaotic political spectacle.\n\nThe disruption began when Archbishop Isaac Masuka of the Zambuko Apostolic Church arrived unannounced in the middle of the proceedings, accompanied by a trumpet-blaring band that brought the programme to a sudden halt.\n\nThe dramatic entrance startled officials and threw the ceremony off course.\n\nFrustrated civil servants said the incident highlighted a deeper problemthe increasing overlap between state responsibilities and ruling party activities. This was supposed to be a Government-led traditional function, one senior official said. But everything about it felt like a political rally.\n\nFrom party slogans echoing across the venue to the prominence of Zanu PF regalia and protocol, observers noted the unmistakable tone of partisan control. Sources in Gutu say Lovemore Matuke, a senior Zanu PF official, contributed to the chaos by dominating the proceedings and, in his closing remarks, declaring Chief Nyamandiborn Togara Masundaas the newest Zanu PF foot soldier in Gutu Central Constituency.\n\nEven law enforcement at the event appeared to be answering to Zanu PF officials rather than government administrators, further reinforcing the perception that the occasion was more political than ceremonial.\n\nThis is the danger of turning state functions into party platforms, a civil servant lamented. It erodes the authority of traditional leaders and blurs the lines between governance and party loyalty.\n\nThe incident has sparked renewed concern over the politicisation of traditional institutions in Zimbabwe, particularly in rural areas where chiefs often find themselves entangled in partisan politics, sometimes at the expense of their independence and the communities they serve.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The installation of Chief Nyamandi in Gutu last week erupted into disarray as Zanu PF officials and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/matuke-declares-chief-nyamandi-is-a-zanu-pf-activist/\">Continue reading<span class=\"screen-reader-text\"> \"Matuke Declares Chief Nyamandi Is A Zanu PF Activist\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        },
        {
            "title": "Horror As Pitbull Kills Harare Man",
            "url": "https://www.zimeye.net/2025/06/01/horror-as-pitbull-kills-harare-man/",
            "content": "By A Correspondent\n\nHARARE  A man in his 30s was mauled to death by a pitbull in the New Bluffhill area of Harare on Sunday, sparking outrage and renewed calls for stricter dog ownership laws.\n\nAccording to Crime Watch Zimbabwe, the fatal attack occurred near a property where the aggressive dog had previously been reported for repeatedly jumping over a half-built durawall. Despite residents earlier concerns, no action was taken to restrain or contain the dog.\n\nThe victims body is still lying a short distance from the wall, Crime Watch Zimbabwe reported, adding that the dog had been seen roaming the street freely.\n\nThe tragic incident has prompted Harare West MP Joana Mamombe to call for immediate legislative action to address the threat posed by dangerous dog breeds.\n\nWe have learnt, with sadness, of the death of a #HarareWest constituency resident after he was attacked by a pitbull dog that was roaming freely in the street, Mamombe said in a public statement. #MHSRIP. Its time, as the legislature, that we pass breed-specific legislation which restricts and bans certain dog breeds.\n\nResidents in the New Bluffhill community have expressed shock and fear following the attack. One local, who asked not to be named, said: Weve been warning the authorities about this dog for months. It was only a matter of time before something like this happened.\n\nCalls are now mounting for the enforcement of tighter animal control regulations, especially concerning breeds known for aggressive behavior. While authorities have yet to confirm what action will be taken against the dogs owner, pressure is growing for accountability and reform.\n\nThe victims identity had not yet been released at the time of publishing, pending notification of next of kin.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – A man in his 30s was mauled to death by a pitbull in the New … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/01/horror-as-pitbull-kills-harare-man/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Pitbull Kills Harare Man\"</span></a></p>",
            "time": "20:30",
            "date": "02 Jun 2025"
        }
    ]
}