{
    "news": [
        {
            "title": "Blessed Mhlanga Walks Out Of Prison | VIDEO",
            "url": "https://www.zimeye.net/2025/05/08/blessed-mhlanga-walks-out-of-prison-video/",
            "content": "Watch Video: Tears of Joy: Blessed Mhlanga Reunites with Loved Ones After Prison Releasepic.twitter.com/ntEcvYwPmE\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "More Chivayo Lobola Money Robbers in Court",
            "url": "https://www.zimeye.net/2025/05/07/more-chivayo-lobola-money-robbers-in-court/",
            "content": "By A Correspondent | Two more men suspected to be part of the group that robbed controversial businessman Wicknell Chivayos inlaws of lobola money, a few days after the ceremony were on Wednesday dragged to court charged with armed robbery.\n\nThe two are are Taurai Mushawemhuka and Felix Karimba.\n\nThey will be jointly charged with their 17 accomplices already on remand.\n\nOne of the suspects Bigboy Nampungo was jailed 30 years recently after he pleaded guilty to the allegations.\n\nMushawemhuka and Karimba are expected back on May 20 for their routine remand.\n\nAccording to court papers money stolen and valuables amounts to US$74 000.\n\nIt is alleged that on March 18 2025 at around 0100 hours, the accused persons and their accomplices planned to rob the complainants.\n\nThey proceeded to Alpha and Omega Farm in Marondera armed with three rifles, two pistols, two bolt cutters, machetes and iron bars.\n\nUpon their arrival, they confronted Petros Mabunhu, a security guard, grabbed him and assaulted him with iron bars and booted feet all over the body demanding to know the whereabouts of the other guards on duty.\n\nThey allegedly tied his hands from behind and legs with cable tiers.\n\nThey marched him into the yard where they confronted Zex Mutasa Rusike, who is employed at the farm as the internal security guard and they disarmed him of his CBC shotgun, frog-marched him to the front guardroom.\n\nThey also confronted Medic Zhakata who is a security guard, they struck him several times on the head with iron bars before they tied both his hands and legs with cable tiers, the State alleges.\n\nThe court heard that two of the security guards were left under the guard of two of the accused persons armed with a pistol and an iron bar as the rest force-marched the other security guard to the main house.\n\nOn approaching the main entry, the accused allegedly cut the key on the burglar screen with a bolt cutter, forced open the main door and entered the house.\n\nThey allegedly went on to force open the kitchen door and force-marched the guard to Gerald Mutekes bedroom where they met him in the passage and demanded cash.\n\nFearing for his life, he surrendered cash, US$18 000, a Sarsilmaz pistol loaded with eight rounds and two phones.\n\nThe accused persons then demanded to be shown the safe and on their way, they passed through Vimbai Mutekes bedroom where they demanded cash and safe keys and she surrendered cash, US$1 100, a Chubb safe key and a Samsung Galaxy A35 without a sim card.\n\nThey took her to the main bedroom where she opened the safe and surrendered cash US$55 000.\n\nWhilst the accused persons were still in the bedroom, Elphas Maruta, who was armed with a rifle loaded with four rounds, got information of the robbery and advanced towards the house and fired two shots towards the accused persons who also fired back three shots before they fled from the scene with the stolen property, the court heard.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Two more men suspected to be part of the group that robbed controversial businessman Wicknell Chivayo’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/more-chivayo-lobola-money-robbers-in-court/\">Continue reading<span class=\"screen-reader-text\"> \"More Chivayo Lobola Money Robbers in Court\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "Mnangagwa Off To Russia",
            "url": "https://www.zimeye.net/2025/05/07/mnangagwa-off-to-russia/",
            "content": "President Emmerson Mnangagwa departed Harare for Moscow on Tuesday evening to attend the 80th anniversary commemorations of Russias Victory Day. Before boarding his flight, the President took time to bid farewell to his top officials, including both Vice Presidents, the Commander of the Zimbabwe Defence Forces, senior government ministers, and top security service chiefs, who had gathered at the airport to see him off.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "President Emmerson Mnangagwa departed Harare for Moscow on Tuesday evening to attend the 80th anniversary commemorations of Russia’s Victory Day. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/mnangagwa-off-to-russia/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Off To Russia\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "Mai Jeremaya Rape Storm",
            "url": "https://www.zimeye.net/2025/05/07/mai-jeremaya-rape-storm/",
            "content": "By Courts Reporter  A dramatic twist has emerged in the rape case involving popular social media personality Mai Jeremaya, as the two accused men now claim the encounter was a paid arrangement that went sour over a fee dispute.\n\nThabo Blessing Dube (27) and Martin Charlie (25), arrested over the weekend, appeared in court on Monday facing rape charges. The complainant, known widely as Mai Jeremaya, waived her right to anonymity by posting a video detailing the alleged assault. Her account sparked widespread outrage and support from other women, including social media figures such as Mai TT.\n\nHowever, in court documents submitted by the State yesterday, the accused men presented a radically different version of events.\n\nThey allege that Dube facilitated a meeting between Charlie and Mai Jeremaya at Joina City in central Harare, where she allegedly agreed to engage in sex with Charlie for a US$20 fee. They claim the three proceeded to a lodge in Eastlea, where Mai Jeremaya willingly undressed, kissed Charlie, and had consensual sex with him, fully aware of the nature of their encounter.\n\nDube, on the other hand, denies any sexual contact with her, contrary to her allegations.\n\nAccording to their defence, trouble began after the act, when Mai Jeremaya allegedly demanded US$500 instead of the agreed US$20. They claim she still accepted the US$20, took a shower, and was escorted to a taxi by the duo.\n\nTwo days later, the men allege, she sent a private investigatorTafadzwa Detective Kedha Chidawato locate them as part of an extortion attempt. When they refused to pay more, they say, the rape allegation was made.\n\nThe State had initially consented to bail, but Magistrate Marewanazvo Gofa challenged this decision, questioning why the accused were not also facing aggravated indecent assault charges, as they allegedly forced the complainant to perform oral sex.\n\nIn its revised submission, the State acknowledged this concern but argued that both the rape and the alleged forced oral sex formed part of the same transaction. Prosecutors said charging both offences would amount to splitting of charges, as the same evidence applies to both.\n\nDespite the seriousness of the allegations, the State said it had no compelling reasons to deny bail.\n\nThere are no well-founded fears that the accused will abscond, the submission read. They have fixed addresses, no previous convictions or pending cases, and did not show any conduct suggesting flight risk.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Courts Reporter – A dramatic twist has emerged in the rape case involving popular social media personality Mai Jeremaya, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/mai-jeremaya-rape-storm/\">Continue reading<span class=\"screen-reader-text\"> \"Mai Jeremaya Rape Storm\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "Tshabangu MP Matewu Paints His Own Portrait Onto A Cheap Borehole, ED Style",
            "url": "https://www.zimeye.net/2025/05/07/tshabangu-mp-matewu-paints-his-own-portrait-onto-a-cheap-borehole-ed-style/",
            "content": "A Tshabangu MP Caston Matewu has printed his own portrait on a borehole. Mawere is still to account for the total cost of the expenditure.\n\nMatewu became a CCC MP shortly after his father, Jaison, had redirected Nelson Chamisas party funds to his personal bank accounts as it was discovered later in 2020.\n\nDid you remind them about the Chamisa money your father Jaison Matewu has looted in UK since 2020 to prepare you for your Tshabangu-Parly post (from the day he tried to get ZimEye to help him redirect the funds to his personal bank accounts away from the official\n\nPicture\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Tshabangu MP Caston Matewu has printed his own portrait on a borehole. Mawere is still to account for the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/tshabangu-mp-matewu-paints-his-own-portrait-onto-a-cheap-borehole-ed-style/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu MP Matewu Paints His Own Portrait Onto A Cheap Borehole, ED Style\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "Net Closes In On Chivayo,  Bushiri As Regional Anti-Corruption Drive Intensifies",
            "url": "https://www.zimeye.net/2025/05/07/net-closes-in-on-chivayo-bushiri-as-regional-anti-corruption-drive-intensifies/",
            "content": "Cape Town South African authorities have ramped up investigations into fugitive Malawian preacher Shepherd Bushiri and controversial Zimbabwean businessman Wicknell Chivayo, both implicated in high-level cross-border fraud and money laundering schemes that are now drawing growing regional attention.\n\nThe developments emerged during the 15th Commonwealth Regional Conference for Heads of Anti-Corruption Agencies in Africa, currently underway in Cape Town. Hosted by South Africas Special Investigating Unit (SIU), the conference has brought together anti-corruption agencies from 21 Commonwealth African countries under the theme:Enhancing Inclusive Participation of State and Non-State Actors to Prevent and Combat Corruption.\n\nChivayo is under scrutiny by South Africas Financial Intelligence Centre (FIC), the South African Revenue Service (SARS), and the police, following allegations that Zimbabwes Ministry of Finance irregularly paid over R1.1 billion to Ren-Form, a Johannesburg-based printing company contractedwithout a public tenderto supply election materials for Zimbabwes 2023 general elections.\n\nMore than R800 million of that amount is believed to have been funneled into companies linked to Chivayo, including Intratrek Holdings and Dolintel Trading. A confidential FIC report, accessed byZimLive, outlines how these funds were swiftly disbursed into Chivayo-controlled entities and then redistributed through suspicious transactions. Notably, R351 million was paid to Asibambeki Platinum Group, R5.4 million to luxury car dealership Daytona, and R4 million to the law firm Strauss Scher Inc.\n\nAlthough Chivayo insists the transactions were legitimate business operations, his defense has been severely weakened by leaked audio recordingsallegedly of himbragging about bribing senior Zimbabwean officials to secure the lucrative contract. While he later issued an apology to President Emmerson Mnangagwa and others mentioned in the tapes, he did not deny making the payments.\n\nThis is not Chivayos first run-in with the law. In early 2000, he was convicted of fraud and was, during the Mugabe era, charged with corruption in connection with a failed Zimbabwe Power Company contract. Despite this, he has maintained close ties to the ruling elite and is often seen at state functions alongside President Mnangagwa.\n\nParallel to the Chivayo investigation, South African authorities have renewed efforts to extradite self-proclaimed prophet Shepherd Bushiri, who fled to Malawi in 2020 while facing charges of fraud, money laundering, and racketeering involving over R100 million.\n\nBushiri and his wife, Mary, were initially arrested in South Africa but fled while out on bail, citing threats to their lives. However, South African prosecutors allege that the couple used their church, the Enlightened Christian Gathering (ECG), to operate elaborate miracle seed scams, defrauding investors under the guise of religious donations.\n\nEfforts to bring the Bushiris back to face trial have been stalled by legal and diplomatic hurdles, with Malawi citing procedural irregularities in the extradition process. Meanwhile, South African authorities argue that failure to extradite the couple undermines regional efforts to hold financial criminals accountableparticularly those who exploit religious platforms for personal gain.\n\nWith both cases now receiving renewed attention at the anti-corruption conference, law enforcement agencies across the continent are being urged to deepen collaboration in tracking, extraditing, and prosecuting politically connected criminals who exploit weak oversight systems across borders.\n\nSouth Africa, which loses billions annually to procurement corruption, hopes the Cape Town conference will help galvanize political will across Africa to curb illicit financial flows, strengthen accountability, and dismantle networks involved in state capture.\n\nAs evidence mounts and pressure intensifies, both Chivayo and Bushiri now stand as symbols of the continents broader struggle against impunity and corruption.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Cape Town – South African authorities have ramped up investigations into fugitive Malawian preacher Shepherd Bushiri and controversial Zimbabwean businessman Wicknell … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/net-closes-in-on-chivayo-bushiri-as-regional-anti-corruption-drive-intensifies/\">Continue reading<span class=\"screen-reader-text\"> \"Net Closes In On Chivayo,  Bushiri As Regional Anti-Corruption Drive Intensifies\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "Dumfries Delighted as Inter Milan Sink Barcelona to Reach Champions League Final",
            "url": "https://www.zimeye.net/2025/05/07/dumfries-delighted-as-inter-milan-sink-barcelona-to-reach-champions-league-final/",
            "content": "By Sports Correspondent\n\nDenzel Dumfries was left elated after Inter Milan edged Barcelona in a dramatic 4-3 second-leg victory to seal their place in the Champions League final for the second time in three years.\n\nThe Dutch wingback delivered two crucial assists during a thrilling encounter at San Siro, helping Inter secure a 7-6 aggregate win over the Spanish giants. The result sees the Nerazzurri return to the final, echoing their 2010 triumph when they also knocked out Barcelona en route to glory.\n\nWere overjoyed and Im proud of everyone, especially Marcus [Thuram], Dumfries said post-match. Yann [Sommer] was amazing as well. Were truly proud.\n\nDumfries, 29, was a standout performer despite only recently recovering from a long injury layoff. Tired? Yes, to be honest, I was really tired, he admitted. Ive just come back from a long injury, jumping straight into games like this is tough. However, Im happy I managed it.\n\nYann Sommer earned Man of the Match honors for his heroics in goal, but it was the collective determination that saw Inter overturn a late deficit in one of the most memorable semi-finals in recent years.\n\nThe Nerazzurri now await the winner of the other semi-final between Arsenal and Paris Saint-Germain. But Dumfries isnt concerned about the opponent.\n\nPSG or Arsenal? Both are great teams, well see, but the most important thing is we won this match, he said. This is a show, and Im really happy we made the final. Thirteen goals in two matches, its spectacular for the fans and football lovers.\n\nAs for celebrations? We definitely wont be going to bed early, Dumfries joked.\n\nWith momentum on their side and a chance to avenge their 2023 final loss to Manchester City, Inter Milan will look to finish the job and lift Europes most coveted trophy once again.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Denzel Dumfries was left elated after Inter Milan edged Barcelona in a dramatic 4-3 second-leg victory to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/dumfries-delighted-as-inter-milan-sink-barcelona-to-reach-champions-league-final/\">Continue reading<span class=\"screen-reader-text\"> \"Dumfries Delighted as Inter Milan Sink Barcelona to Reach Champions League Final\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "ZIFA Engages Bayern Munich in Talks Over Football Development Partnership",
            "url": "https://www.zimeye.net/2025/05/07/zifa-engages-bayern-munich-in-talks-over-football-development-partnership/",
            "content": "By Sports Correspondent\n\nZIFA President Nqobile Magwizi and Warriors head coach Michael Nees held a high-level meeting with Bayern Munich officials in Germany last week, as part of a broader effort to enhance Zimbabwean football through international partnerships.\n\nThe discussions took place at the renowned FC Bayern Campus in Munich, where the Zimbabwean delegation met with Markus Brunnschneider, Bayerns Head of Match & Tactics Analysis, Scouting, and Squad Planning. The main objective of the meeting was to explore potential collaboration opportunities between ZIFA and the German football giants.\n\nThe visit marks a continuation of ZIFAs recent international engagements, which also included talks with South African Football Association (SAFA) President Danny Jordaan and a tour of the United Kingdom.\n\nIn a statement shared on X, ZIFA described the meeting as part of a broader strategy aimed at unlocking Zimbabwes football potential on the global stage through knowledge exchange and long-term development partnerships.\n\nThe talks reflect ZIFAs ambition to build strong international ties that can support local talent development, coaching standards, and the overall growth of the sport in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent ZIFA President Nqobile Magwizi and Warriors head coach Michael Nees held a high-level meeting with Bayern Munich … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/zifa-engages-bayern-munich-in-talks-over-football-development-partnership/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Engages Bayern Munich in Talks Over Football Development Partnership\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "Varakashi4ED Vow To Magnify 2030 Agenda",
            "url": "https://www.zimeye.net/2025/05/07/varakashi4ed-vow-to-magnify-2030-agenda/",
            "content": "By A Correspondent\n\nThe pro-ZANU PF online movement, Varakashi4ED, has pledged to step up efforts in promoting and defending President Emmerson Mnangagwas Vision 2030, reaffirming their commitment to the ruling partys agenda during a strategic meeting held in Harare on Tuesday.\n\nSpeaking on behalf of the movement, Varakashi4ED Vice Chairperson Mairosi Watungwa announced that the team is fully mobilized to magnify the 2030 agenda by increasing its visibility and influence, especially across digital platforms.\n\nIn a statement posted on Facebook, Watungwa said:Today, the Varakashi4ED National leadership team, comprised of Chairman Godwin Nkatha, Vice Chairpersons Mairosi Watungwa and Maria Maria Jia Madondo Juma, and Advisor Joseph Kudiwa, held a fruitful meeting with Farai Muroiwa Marapira, the ZANU PF Director for Information, at party HQ in Harare.\n\nShe added: During this important discussion, we reaffirmed our commitment to remaining loyal to the party and showing respect for its leadership. We also emphasized the importance of discipline in our mandate to defend and promote the initiatives of our Party and Government, while also amplifying the transformative accomplishments of President Dr. ED Mnangagwa towards the attainment of Vision 2030.\n\nThe Vision 2030 blueprint, spearheaded by President Mnangagwa, aims to transition Zimbabwe into an upper-middle-income economy through a combination of industrial growth, infrastructure development, and digital transformation.\n\nWatungwa concluded the message with the hashtag #Chakabatwa, a rallying cry used by supporters to signal unity and vigilance in defending the ruling partys narrative.\n\nThe Varakashi4ED group has grown into one of ZANU PFs most visible online voices, using social media to engage with citizens, counter critics, and publicize government achievements.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The pro-ZANU PF online movement, Varakashi4ED, has pledged to step up efforts in promoting and defending President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/varakashi4ed-vow-to-magnify-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi4ED Vow To Magnify 2030 Agenda\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        },
        {
            "title": "Health Minister Struggles To Outline Achievements As Situation Across Country Deteriorates",
            "url": "https://www.zimeye.net/2025/05/07/health-minister-struggles-to-outline-achievements-as-situation-across-country-deteriorates/",
            "content": "By A Correspondent\n\nZimbabwes Health Minister, Douglas Mombeshora, faced difficulty on Tuesday in highlighting notable achievements within the health sector, as the situation across the country continues to worsen.\n\nDuring a Post-Cabinet Briefing in Harare, Mombeshora provided an update on the progress made in his ministry, specifically regarding projects under the Health and Well-being Thematic Area of the National Development Strategy 1 (NDS1).\n\nHowever, the ministers remarks appeared to lack concrete solutions to the ongoing challenges in the sector.\n\nAccording to the Ministers report on the first 100-day cycle for 2025, the following health sector achievements were noted:\n\nWhile these updates represent some progress, critics argue that the sector still faces numerous challenges, with limited resources and infrastructure gaps hampering the delivery of quality healthcare to citizens. The ministers report seemed to fall short of addressing these deeper issues, with many questioning whether these incremental steps are sufficient to address the current health crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s Health Minister, Douglas Mombeshora, faced difficulty on Tuesday in highlighting notable achievements within the health sector, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/07/health-minister-struggles-to-outline-achievements-as-situation-across-country-deteriorates/\">Continue reading<span class=\"screen-reader-text\"> \"Health Minister Struggles To Outline Achievements As Situation Across Country Deteriorates\"</span></a></p>",
            "time": "18:10",
            "date": "08 May 2025"
        }
    ]
}