{
    "news": [
        {
            "title": "“We Tried To Manipulate Polls And Failed”: Outgoing Ghanaian President Concedes Defeat",
            "url": "https://www.zimeye.net/2024/12/19/we-tried-to-manipulate-polls-and-failed-outgoing-ghanaian-president-concedes-defeat/",
            "content": "By A Correspondent\n\nIn a rare and admirable display of statesmanship, outgoing Ghanaian President Mahamudu Bawumia acknowledged his partys defeat in the recent elections and offered a candid reflection on the factors that led to the loss.\n\nSpeaking on Wednesday, Bawumia openly admitted that his partys time had simply come to an end, and no amount of political manipulation could have reversed the outcome.\n\nBawumias election concession speech was a moment of profound introspection, as he addressed both his party members and the nation. No amount of monopolization of the media space could save us. No amount of money could stop our defeat. No amount of local and international celebrity endorsements could help us. And no amount of vote buying could stand the irresistible hurricane of change that shook our nation on Wednesday, he said, acknowledging that despite all efforts, the winds of change were too strong to resist.\n\nUrging his party members to stop the blamestorming that had begun after the election, Bawumia called for unity and reflection. We must stop blaming one another so we can brainstorm on how to get ourselves out of the mess we have put ourselves in, he stated, emphasizing that the future of the party appeared bleak and required serious reevaluation.\n\nThe future of our great party looks gloomy and we have to start work on how to get ourselves out of what appears like an eternal stay in opposition, Bawumia continued. In life, when you are hit by the subduing blow of misfortune, you have two options. You can allow that blow to crush you, or you can move on with the enormous lessons such misfortunes often present.\n\nWhile unsure of his immediate future in politics, Bawumia was clear about the lessons learned from the defeat. I cannot immediately tell my next move in life, politics and my role in our great party, he confessed. But if I should ever make a comeback to politics, the lessons I have learnt from our defeat should serve as the moral code which will guide how I guide myself.\n\nAmong the lessons Bawumia shared, he remarked that the Ghanaian voter, though largely uneducated and simple, proved to be far more sophisticated than his party had previously thought. I have learnt that the Ghanaian voter, though mainly uneducated and simple, is more sophisticated than we thought, he stated.\n\nHe also acknowledged the growing discontent with corruption, incompetence, and inequality, lessons that would inform his future political approach.\n\nReflecting on the elections results, Bawumia said, I have learnt that hate of corruption can win. It has taught me that hate of incompetence can win.\n\nOur defeat has taught me that hate of impunity can win. He continued by emphasizing that hatred of corruption and the obscene display of ill-gotten wealth were driving forces behind the defeat. I have learnt that the hate of the obscene display of ill-gotten opulence wins.\n\nI have learnt that hate of mediocrity and deception definitely wins. And I have learnt that hating evil will forever triumph over the love of evil. That was what happened on Wednesday.\n\nAnother key takeaway for Bawumia was the importance of surrounding oneself with capable and principled individuals. Reflecting on his own leadership, he noted, While Rawlings appointed the likes of Dr. Mohammed Ibn Chambas as deputy ministers, I made the mistake of giving that respectable position to the likes of John Oti Bless.\n\nHe acknowledged that had he kept voices of reason around him, such as Ben Dotsei Malor and Dr. Raymond Atuguba, they would have brought much-needed stability and respectability to his administration.\n\nI have now realised, rather too late, that if I had kept the likes of Ben Dotsei Malor and Dr. Raymond Atuguba around me, they would have injected some semblance of sanity into the presidency and given that high office an aura of respectability and decency, Bawumia reflected.\n\nHe also criticized the sycophants who surrounded him, stating, The praise-singing sycophants who act on the dictates of their stomachs are only specialized at telling you what you want to hear.\n\nUnfortunately, I did not listen to voices of reason. Our elders say a disease that will kill a man first breaks sticks into his ears.\n\nBawumias concession speech marks a moment of rare humility and reflection in Ghanaian politics, as he openly confronts the failures of his party and the lessons learned from their electoral defeat. Whether this will lead to a genuine transformation of the political landscape in Ghana remains to be seen, but Bawumias candidness in accepting responsibility for his partys loss is a significant step toward introspection and growth.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a rare and admirable display of statesmanship, outgoing Ghanaian President Mahamudu Bawumia acknowledged his party’s defeat … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/we-tried-to-manipulate-polls-and-failed-outgoing-ghanaian-president-concedes-defeat/\">Continue reading<span class=\"screen-reader-text\"> \"“We Tried To Manipulate Polls And Failed”: Outgoing Ghanaian President Concedes Defeat\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Horror As Two Die In Bus, Car Collision",
            "url": "https://www.zimeye.net/2024/12/19/horror-as-two-die-in-bus-car-collision/",
            "content": "By A Correspondent\n\nA devastating head-on collision between a bus and a Toyota Fortuner occurred near Makhado Business Centre on the Bulawayo-Beitbridge highway early this morning, resulting in the tragic loss of two lives and leaving one person injured.\n\nAccording to eyewitnesses, the accident happened when the bus and the Toyota Fortuner collided head-on, causing extensive damage to both vehicles. Emergency services were quickly summoned to the scene, where they found two people deceased and one injured.\n\nThe injured victim was rushed to a nearby hospital for medical attention, while the bodies of the deceased were taken to a mortuary for further examination.\n\nThe cause of the accident is still unknown, but authorities have launched an investigation into the incident. The Bulawayo-Beitbridge highway has seen its fair share of accidents in recent times, prompting concerns about road safety in the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating head-on collision between a bus and a Toyota Fortuner occurred near Makhado Business Centre on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/horror-as-two-die-in-bus-car-collision/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Two Die In Bus, Car Collision\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Desperate Mnangagwa Regime Launches Door-to-Door Crackdown To Confiscate Smuggled Goods",
            "url": "https://www.zimeye.net/2024/12/19/desperate-mnangagwa-regime-launches-door-to-door-crackdown-to-confiscate-smuggled-goods/",
            "content": "By A Correspondent\n\nIn a bid to salvage the countrys struggling economy, the Zimbabwean government has launched a draconian, door-to-door crackdown aimed at confiscating smuggled goods that are flooding the nation, particularly during the festive season.\n\nThe move comes as the regime seeks to boost its revenue and combat the crippling losses incurred from smuggling, which officials estimate at up to US$1 billion annually.\n\nThe operation, which began as a response to the growing scale of illicit cross-border trade, is being described as one of the most aggressive measures the government has taken against smuggling in recent years.\n\nAs Zimbabweans flock home for the Christmas and New Year holidays, many of them bring goods, primarily from neighboring South Africa, leading to a surge in smuggled goods entering the country.\n\nEngineer Tafadzwa Muguti, the Permanent Secretary for Presidential Affairs in the Office of the President, spoke to the press yesterday, outlining the governments strategy for tackling this pervasive issue. This December, we will have inter-governmental agencies stationed at our major border posts to ensure zero tolerance for smugglers. The task force will conduct door-to-door inspections of all goods in wholesale and retail shops, Muguti said, emphasizing the governments commitment to eradicating smuggling at all levels.\n\nThe crackdown is not limited to the borders or businesses but extends to ordinary citizens. Those found in possession of smuggled goods will face imprisonment without the option for bail, sending a clear and chilling message to anyone involved in the trade of illicit goods. This move, while hailed by the government as necessary to protect the economy and curb tax evasion, has been met with widespread concern and resentment from the public.\n\nMany Zimbabweans, struggling under the weight of an already oppressive economic situation, view this latest initiative as another sign of a desperate regime clinging to power by any means necessary. With the country grappling with inflation, joblessness, and a broken economy, the governments sudden focus on smuggling smacks of a financially strapped administration scrambling for quick fixes rather than addressing the root causes of the nations woes.\n\nThe timing of the crackdown is particularly harsh, as it coincides with the holiday season, when many families depend on remittances and goods brought in from abroad to make ends meet. The governments actions have left citizens feeling persecuted during a time meant for celebration and family reunions. Critics argue that while smuggling may contribute to the economys woes, the governments methodstargeting struggling businesses and citizensserve only to exacerbate their suffering.\n\nWe are already living in dire conditions, and now they want to come to our homes and take whatever little we have, one local retailer lamented. The government is broke, and instead of tackling the real issues like unemployment and the collapse of industries, theyre focusing on poor people trying to survive. Its just another way to torment us.\n\nThe move has drawn comparisons to the governments previous attempts to increase state revenue through punitive measures. In 2024, the regime had already launched efforts to curb illegal businesses and smuggling at border posts and entertainment spots. However, the widespread crackdown on ordinary citizens goods has sparked a new wave of backlash, as people fear that even their personal belongings could be seized in the process.\n\nSmuggling has indeed become a serious problem, especially with many goods entering the country via informal routes. The Zimbabwean economy, which has been ravaged by years of mismanagement, corruption, and sanctions, now faces a difficult balancing act of trying to sustain itself through harsh fiscal policies while simultaneously suppressing any form of economic survival that its citizens may engage in.\n\nMinister of Finance and Economic Development, Professor Mthuli Ncube, recently addressed the issue in the context of the national budget.\n\nSmuggling undermines our economy and exacerbates the challenges faced by local industries, he said. We are prepared to take all necessary steps to safeguard our economic interests, even if it means taking tough actions against those who evade the law.\n\nDespite such assertions, the harsh measures have only underscored the governments desperation.\n\nAs one economist noted, Rather than addressing the structural issues causing smuggling, such as the lack of local production and widespread poverty, the regime is resorting to authoritarian tactics to generate quick revenue.\n\nThe governments door-to-door crackdown serves as a stark reminder of the lengths to which a financially crippled regime will go to shore up its coffers, often at the expense of its citizens. While the authorities claim that this operation is meant to protect local industries and consumer welfare, many Zimbabweans are left wondering whether their personal freedoms and hard-earned possessions will be the next casualties in the regimes desperate struggle for survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bid to salvage the country’s struggling economy, the Zimbabwean government has launched a draconian, door-to-door … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/desperate-mnangagwa-regime-launches-door-to-door-crackdown-to-confiscate-smuggled-goods/\">Continue reading<span class=\"screen-reader-text\"> \"Desperate Mnangagwa Regime Launches Door-to-Door Crackdown To Confiscate Smuggled Goods\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "“Everything Is Trabablas”: President Chamisa Taunts Mnangagwa Over Deepening Crisis",
            "url": "https://www.zimeye.net/2024/12/19/everything-is-trabablas-president-chamisa-taunts-mnangagwa-over-deepening-crisis/",
            "content": "By Tinashe Sambiri\n\nZimbabwes opposition leader, Advocate Nelson Chamisa, has launched a scathing critique of President Emmerson Mnangagwas government, describing the countrys current state as trabablas.\n\nChamisas comments follow a controversial decision by the government to rename the Mbudzi Interchange in Harare to the Trabablas Interchange. The name change has sparked widespread public debate, with many seeing it as symbolic of the countrys spiraling troubles.\n\nIn a statement issued on Thursday, Chamisa seized on the renaming as a metaphor for Zimbabwes broader woes, which he argues are driven by an incompetent and disorganized administration.\n\nITS ALL TRABABLAS We are living in Trabablas times. Its really a trabablas administration, running a trabablas economy, with trabablas policies and a trabablas currency! Especially after trabablas elections, Chamisa declared, highlighting what he perceives as the absurdity of the governments actions amid widespread economic and political crises.\n\nChamisas use of the term trabablas is a direct attack on the ruling regime, suggesting that Mnangagwas government is ineffective and chaotic.\n\nThe term has quickly resonated with many Zimbabweans, who are grappling with a collapsing economy, high inflation, unemployment, and a currency that has lost much of its value.\n\nThe decision to rename Mbudzi Interchange, a key junction in Harare, has been widely criticized, with critics arguing that it reflects the governments misplaced priorities. Instead of focusing on addressing pressing issues such as poverty, healthcare, and infrastructure, Mnangagwas administration has been accused of engaging in symbolic gestures that do little to alleviate the countrys problems.\n\nChamisa, who has consistently challenged Mnangagwas legitimacy since the controversial 2018 elections, argues that Zimbabwes political and economic systems are in disarray under the current government. We have a country where everything is falling apart: the economy is crumbling, businesses are closing, and ordinary Zimbabweans are struggling to survive, he said.\n\nBut instead of focusing on real solutions, the government is changing names and engaging in trivial distractions.\n\nHis remarks also refer to the recent presidential elections, which he and many international observers have criticized as neither free nor fair. Especially after trabablas elections, Chamisa added, alluding to the contested nature of the polls that many believe were marred by irregularities and voter suppression.\n\nIn this context, trabablas has become more than just a catchphrase; its a symbol of the frustration and disillusionment felt by many Zimbabweans.\n\nThe term was also used by Mnangagwas deputy, Constantino Chiwenga three years ago at Great Zimbabwe Ruins.\n\nChamisas critique of the government resonates with the growing public sentiment that Mnangagwas administration is not only failing to address critical issues but is also increasingly out of touch with the realities faced by the people.\n\nAs Zimbabwe continues to grapple with a myriad of challenges, Chamisas pointed remarks underscore the discontent that many Zimbabweans feel about the direction in which the country is headed. Whether the ruling government will heed these criticisms or continue with its current approach remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Zimbabwe’s opposition leader, Advocate Nelson Chamisa, has launched a scathing critique of President Emmerson Mnangagwa’s government, describing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/everything-is-trabablas-president-chamisa-taunts-mnangagwa-over-deepening-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"“Everything Is Trabablas”: President Chamisa Taunts Mnangagwa Over Deepening Crisis\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Female Robber Attacks Police Boss, Steals Cash in Harare",
            "url": "https://www.zimeye.net/2024/12/19/female-robber-attacks-police-boss-steals-cash-in-harare/",
            "content": "By A Correspondent\n\nIn a brazen robbery, Assistant Inspector Dickson Mashada, a senior police officer, was violently attacked and robbed of $420 in cash and his service identity documents while riding a pirate taxi in Harare.\n\nIncident Details\n\nMashada was traveling from the Harare Central Business District to Newlands when two female passengers and one male passenger turned on him near Harare Central Remand Prison. One woman grabbed him by the neck, while the other produced a knife, demanding his wallet. After a brief struggle, they took his wallet, containing his police identity card, national identity card, bank cards, and cash.\n\nInvestigation and Concerns\n\nHarare provincial police spokesperson, Inspector Luckmore Chakanza, confirmed the incident and stated that the police are investigating and pursuing leads to apprehend the perpetrators. The robbery highlights the escalating crime rates in Harare and the vulnerability of law enforcement officials.\n\nRelated Incidents\n\nAnother robbery occurred in Hopley, where 28-year-old Vimbai Mufungi was robbed of $920 by two men armed with knives. They stole her handbag, containing an iPhone, Itel cellphone, national identity card, medical aid cards, power bank, and house keys.\n\nInspector Chakanza emphasized the polices commitment to addressing these escalating crimes, urging citizens to report any information about the incidents. The robberies underscore the need for enhanced security measures to protect citizens and prevent impersonation of police officers for fraudulent activities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a brazen robbery, Assistant Inspector Dickson Mashada, a senior police officer, was violently attacked and robbed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/female-robber-attacks-police-boss-steals-cash-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Female Robber Attacks Police Boss, Steals Cash in Harare\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Fresh Details Emerge On Mnangagwa Spy Agent’s Mysterious Death",
            "url": "https://www.zimeye.net/2024/12/19/fresh-details-emerge-on-mnangagwa-spy-agents-mysterious-death/",
            "content": "By Crime and Courts-The family of the late member of the Military Intelligence who died in unclear circumstances is demanding answers from Authorities.\n\nHillary Nleya went missing last month after being last seen at Redwood along the Plumtree-Bulawayo road.\n\nHis body was later discovered hanging from a tree in Figtree, Matabeleland South.\n\nSince then, the authorities have not provided clear answers to how the spy soldier died and rather said they were treating the case as a potential suicide.\n\nHowever, sources close to the investigation said the death was linked to his work in military intelligence, raising speculation about foul play.\n\nThe Military Intelligence operates as a covert arm of the Zimbabwe National Army, tasked with managing high-level state security matters.\n\nIts methods reportedly include eliminating individuals deemed security risks, with a chilling record of disappearances and killings.\n\nThe department is believed to have been involved in the disappearance of journalist and activist Itai Dzamara on March 9, 2015, whose fate remains unknown nearly a decade later.\n\nAnother infamous case tied to military intelligence is that of Rashiwe Guzha, a typist with the Central Intelligence Organisation (CIO) who disappeared in May 1990, amid reports of her romantic involvement with the late CIO Deputy Director Edson Shirihuru.\n\nShirihuru himself died in 1993 after vowing to reveal the truth behind Guzhas disappearance if convicted in court.\n\nFollowing the 2017 military coup that ousted President Robert Mugabe, President Emmerson Mnangagwa restructured the state security framework, sidelining the CIO, which he viewed as pro-Mugabe, and consolidated state security responsibilities under Zimbabwe Military Intelligence.\n\nCritics have accused Mnangagwa of using this unit to target his perceived enemies and suppress dissent.\n\nThe mysterious death of Hillary Nleya has drawn public attention, particularly after his relative, Senator Lwazi Sibanda, who delivered an emotional address in Parliament.\n\nSpeaking during a recent debate on the Death Penalty Abolition Bill, Sibanda described Nleyas death as a murder by unknown assailants.I rise with a heavy heart, she said. I am a woman, a mother, and a Senator of this country, yet I stand here with a cousin lying in the mortuaryHillary Nleyawhom we searched for over two weeks, only to find him dead in Figtree. He was murdered by a person we do not yet know.The Senator recounted the anguish of planning her cousins burial while fulfilling her parliamentary duties. Nleya is to be buried in Dombodema, Plumtree.\n\nIn her address, Sibanda condemned the increasing violence in Zimbabwe, citing a recent case in which a familys hut was burned down by unknown assailants while they were asleep inside.\n\nShe also lamented the challenges of forgiving perpetrators who show no remorse, highlighting the pain felt by families of murder victims.\n\nHer remarks resonated with broader concerns about the state of law and order in Zimbabwe, where politically motivated killings and disappearances have long been a source of public fear and distrust.\n\nEfforts to obtain a comment from the Zimbabwe National Army were unsuccessful.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts-The family of the late member of the Military Intelligence who died in unclear circumstances is demanding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/fresh-details-emerge-on-mnangagwa-spy-agents-mysterious-death/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh Details Emerge On Mnangagwa Spy Agent’s Mysterious Death\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Chamisa Rebel MPs Pocket Mthuli Bribes",
            "url": "https://www.zimeye.net/2024/12/19/chamisa-rebel-mps-pocket-mthuli-bribes/",
            "content": "ByPolitical Reporter-Finance Minister Mthuli Ncube has lavished money, residential stands, and fuel perks on Members of Parliamentin a bidto win their loyalty.\n\nThiscomes amid growing discontent among lawmakers, particularly those affiliated with the controversial Sengezo Tshabangu-led Citizens Coalition for Change (CCC), who refused to step down after CCC founder Nelson Chamisa stepped aside.\n\nThe rebellious MPs, who had previously threatened to block the national budget, have now been silenced by Ncubes generous incentives.\n\nMany of these parliamentarians were vocal in their demands forthefulfillmentofgovernment promises, including residential stands and other benefits.\n\nOne such MP, Marondera Centrals Caston Matewu, criticized the government for failing to pay for lawmakers hotel accommodations, describing their situation as embarrassing and unsustainable. We have been reduced to a laughingstock, Matewu lamented.\n\nIn response, Ncube announced a substantial increase in budgetary allocations for Parliament, aimed at addressing MPs grievances.\n\nHe unveiled the following package:\n\nNcube also pledged to engage the Ministry of Local Government to expedite the provision of residential stands for MPs.\n\nThis move has sparked criticism, with some observers accusing Ncube of using state resources to buy the loyalty of MPs at a time when ordinary citizens are struggling to make ends meet.\n\nThe development further highlights the deepening divisions within the CCC and raises questions about the ethical implications of the governments handling of public funds.\n\nWith the budget crisis temporarily averted, the focus now shifts to the long-term implications of this unprecedented financial largesse.\n\nCritics argue that such tactics undermine democratic accountability and set a dangerous precedent for leveraging public funds to resolve political disputes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-Finance Minister Mthuli Ncube has lavished money, residential stands, and fuel perks on Members of Parliament in a bid to win … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/chamisa-rebel-mps-pocket-mthuli-bribes/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Rebel MPs Pocket Mthuli Bribes \"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Doctor, Nurse, Pharmacist Cleared In Drugs Allegations",
            "url": "https://www.zimeye.net/2024/12/19/doctor-nurse-pharmacist-cleared-in-drugs-allegations/",
            "content": "By A Correspondent| A top Harare medical doctor who was arrested together with a registered nurse and a pharmacist after being implicated in an illegal drugs scandal involving pethidine have been cleared of the allegations.\n\nTanaka Chimuka, Tapiwa Mutebuka and Sam Chasaya were arrested by detectives from CID drugs who claimed to have had received information from an informant linking them to the scandal.\n\nThis was after the capture of one Osla Mpamhanga who was allegedly on his way to deliver the drugs, 40 by 100mgs pethidine solution and 40 injection needles.\n\nFrom the onset, the three argued that they are personel in the medical industry exempt from arrest as they are part of the authorized persons to administer, possess and supply drugs like pethidine.\n\nHowever, the State insisted on prosecuting them but failed to lead incriminating evidence that the trio was dealing in the alleged drugs resulting in the collapse of the case after the trio mounted an application for discharge.\n\nThis follows their failure to have the recovered drugs produced in court as exhibits and also failure to have the biker, Mupamhanga, testify in court, to confirm whether he had been sent by the trio or not.\n\nIn their application for discharge, the trio represented by Admire Rubaya, Stephen Chikotora and Malvern Mapako, the trio described the prosecution as a classical failed fishing expedition where the State has failed to even catch a small tadpole.\n\nThey argued that the State had failed to lead anything incriminating against them and had also failed to prove that pethidine was a dangerous drug at law.\n\nIt was their argument that the State had failed to prove the said drug was pethidine and had not led any expert evidence to support that the recovered items were indeed pethidine.\n\nThe State was obliged to prove that the alleged drug was pethidine in the first place. The State failed to produce the said drug into evidence and failed to prove that the subject matter was a dangerous drug called pethidine, their lawyers argued.\n\nThe suspects also argued that they were never arrested in possession of the alleged drugs but only through implication by a person who was never arrested or through information by an informant who was never brought to court to testify against them.\n\nThere is no evidence which has been led by the State that the Accused persons had the requisite knowledge of the existence of the alleged Pethidine since it was in the physical control of a person who was never arrested by the police and has not been accounted for.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A top Harare medical doctor who was arrested together with a registered nurse and a pharmacist after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/doctor-nurse-pharmacist-cleared-in-drugs-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Doctor, Nurse, Pharmacist Cleared In Drugs Allegations\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Another Chiwenga Ally Fired",
            "url": "https://www.zimeye.net/2024/12/19/another-chiwenga-ally-fired/",
            "content": "By Political Reporter-Zanu PF in Masvingo has fired a ward councilor for suporting Vice President Constantino Chiwenga.\n\nBrighton Mushekwa the partys Bikita ward 12 councillor was verbally dismissed by Zanu PF Deputy Secretary for Youth Affairs John Paradza during a District Coordinating Committee (DCC) meeting.\n\nMushekwa stands accused of refusing to chant the contentious slogan 2030 vanenge vachipo, perceived as an endorsement of President Emmerson Mnangagwas continued rule beyond 2028, despite the slogan lacking official approval from the partys Central Committee.\n\nThe councillor, however, claims his expulsion is based on unfounded allegations that he supports Chiwengas faction in the partys escalating succession battle.\n\nFactional tensions have been brewing within Zanu PF as Mnangagwa and his deputy, Chiwenga, jockey for influence ahead of the 2028 elections.\n\nChiwenga, a former army general instrumental in ousting Robert Mugabe in 2017, is seen by many as vying for the top position.\n\nMeanwhile, Mnangagwas allies are pushing a narrative of his leadership extending into the next decade, symbolized by the controversial 2030 vanenge vachipo slogan.\n\nThis slogan has sparked a divide in the party, with Mnangagwa loyalists using it as a litmus test for allegiance, while others, like Mushekwa, argue that it has not been constitutionally endorsed.\n\nMushekwa denies belonging to any faction, emphasizing his commitment to Zanu PFs constitution and its processes.I support the sitting President and the partys constitutional obligations. The Central Committee is the highest decision-making body, and no one has the authority to enforce unapproved slogans, Mushekwa stated.\n\nHe added that his refusal to chant the slogan does not signify disloyalty but adherence to party rules. These baseless allegations are being used to abuse power and settle political scores, he said.\n\nMushekwa also criticized the use of verbal expulsions, pointing out that Zanu PFs constitution mandates formal hearings and proper protocols for disciplinary actions.\n\nHis claims were backed by Zanu PF Masvingo Provincial Spokesperson Pepukai Chiwewe, who clarified that any expulsion without due process is invalid.\n\nDespite Mnangagwa previously indicating he would not stand in 2030, figures like Paradza and other provincial leaders have aggressively championed the slogan.\n\nThey have reportedly threatened to punish members who refuse to endorse it, further inflaming divisions within the party.\n\nMasvingo Province remains a hotbed for factional activity, with leaders leveraging slogans and public rallies to consolidate power.\n\nChiwewe, however, downplayed the disputes, calling insults during rallies normal and advising against taking them seriously.Source-TellZimNews\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-Zanu PF in Masvingo has fired a ward councilor for suporting Vice President Constantino Chiwenga. Brighton Mushekwa the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/another-chiwenga-ally-fired/\">Continue reading<span class=\"screen-reader-text\"> \"Another Chiwenga Ally Fired\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        },
        {
            "title": "Magaya’s Boarding School Continues Advertising Despite Long History of Kids’ Abuse",
            "url": "https://www.zimeye.net/2024/12/19/magayas-boarding-school-continues-advertising-despite-long-history-of-kids-abuse/",
            "content": "Magaya-Linked School Filchrist Hill Faces Controversy Amid New Advertisements\n\nBy Dorrothy Moyo |Filchrist Hill Boarding School, a Shamva-based institution linked to controversial preacher Walter Magaya, has resurfaced in the spotlight after a new advertisement for student enrollment was posted on social media. The advert, promoted through a socialites Facebook page, has reignited concerns surrounding the school, which has faced repeated allegations of abuse and misconduct over the years.\n\nBackground of Controversy\n\nThe school, led by headmaster Jebes Muchapondwa, has been at the center of scandal since 2019, when parents accused him of sexually, physically, and emotionally abusing students. Reports allege that Muchapondwa subjected students to inappropriate behavior, including making girls work long hours, verbally abusing them, and entering female hostels unannounced.\n\nThe most alarming allegations involve claims that Muchapondwa cut the hair of female students and took it to Magayas church for suspected rituals. Concerned parents toldZimEyethey feared their children were being groomed for purposes beyond education.\n\nOne parent revealed:\n\nFemale pupils are called to the headmasters office at 10 p.m. for closed-door discussions. There is no matron, and the headmaster enters the female hostels even when learners are bathing. My daughter was verbally abused and told she had jelly buttocks. When I confronted him, he blocked me.\n\nDespite the gravity of these accusations, no concrete actions were taken to address them, leaving parents disillusioned and fearful for their childrens safety.\n\nBoardroom Squabbles and Leadership Issues\n\nIn addition to allegations of abuse, Filchrist Hill has also been plagued by internal management problems. Earlier this year, Jebes Muchapondwa stepped down from his role in the Premier Netball League due to irreconcilable differences. This resignation further cast a shadow over his leadership at the school.\n\nMuchapondwa, who has also withdrawn his teams from national netball leagues, cited frustration with unresolved conflicts, adding to questions about his ability to manage both sports and educational initiatives effectively.\n\nMagayas Involvement\n\nThe connection between Filchrist Hill and Walter Magaya, a convicted medical fraudster, has fueled public skepticism about the schools integrity. Magayas controversial history, coupled with allegations of ritualistic practices at the school, has led to calls for increased scrutiny and accountability.\n\nNew Advertisements Amid Old Scandals\n\nThe schools recent Facebook advertisement, encouraging parents to enroll their children, has sparked mixed reactions. Many wonder whether the institution can rebuild trust given its history of abuse allegations and managerial disputes.\n\nThe advertisement, featuring a socialite endorsing the school, promotes opportunities at Filchrist Hill Boarding School while omitting its checkered past. Observers have questioned whether families will be willing to send their children to an institution mired in controversy.\n\nPublic Reaction and Calls for Accountability\n\nThe resurfacing of Filchrist Hill in the public eye has reignited calls for government intervention and thorough investigations into the allegations against Muchapondwa and the schools connection to Walter Magaya.\n\nThis school has a history that no amount of advertising can erase. Parents must think twice before enrolling their children here, said one concerned citizen.\n\nAs Filchrist Hill attempts to attract new students, its ability to address past accusations and restore its reputation remains uncertain. The situation raises broader questions about accountability and governance in private educational institutions across Zimbabwe.\n\nThis is a developing story. Updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Magaya-Linked School Filchrist Hill Faces Controversy Amid New Advertisements By Dorrothy Moyo | Filchrist Hill Boarding School, a Shamva-based institution … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/19/magayas-boarding-school-continues-advertising-despite-long-history-of-kids-abuse/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya’s Boarding School Continues Advertising Despite Long History of Kids’ Abuse\"</span></a></p>",
            "time": "18:29",
            "date": "19 Dec 2024"
        }
    ]
}