{
    "news": [
        {
            "title": "UK: Zim Care Worker Jailed for Raping A Patient: A Betrayal of Trust at Colchester Hospital",
            "url": "https://www.zimeye.net/2025/10/23/care-worker-jailed-a-betrayal-of-trust-at-colchester-hospital/",
            "content": "the rape story\n\nBy Shelton Muchena in England\n\nHIGHWOODS, ESSEX  In a case that has sent shockwaves through both the healthcare sector and the wider public, a Zimbabwean-born care worker, Nelson Ncube, 57, of Gratian Close, Highwoods, has been sentenced to a lengthy prison term after being found guilty of engaging in sexual activity with a mentally vulnerable patient at Colchester Hospitals secure unit.\n\nThe sentencing, delivered at Ipswich Crown Court yesterday, brought to light a profound breach of trust within one of the most sensitive areas of healthcare. Judge Martyn Levett condemned Ncubes conduct as a flagrant abuse of authority and a deep betrayal of professional duty. The court heard that Ncube took advantage of his position as a healthcare assistant to exploit a patient who lacked the capacity to consent.\n\nProsecutors outlined how the offences occurred during periods when Ncube was entrusted with the victims supervision and care. Chilling evidence presented in court included surveillance footage and detailed witness statements, painting a disturbing picture of deliberate manipulation and deception.\n\nJudge Levett told the defendant, You were placed in a role of significant responsibility, charged with the wellbeing of a vulnerable person. Instead of fulfilling that duty, you used your access and authority for your own gratification. Your actions have caused immense emotional harm and damaged the publics trust in those who care for the most fragile among us.\n\nThe case has prompted widespread condemnation from healthcare advocates, mental health organisations, and community leaders, who are calling for an urgent review of the systems designed to protect patients from abuse. Dr. Hannah Lister, a spokesperson for the Mental Health Alliance, said the incident highlights serious shortcomings in the oversight and training of frontline care staff. She added, This tragedy exposes the need for stronger safeguards, more rigorous background checks, and clearer channels for staff to report inappropriate behaviour without fear of reprisal.\n\nColleagues of Ncube, who once described him as quiet and dependable, expressed disbelief at the revelations. Many have been left questioning how such behaviour could go unnoticed within a professional setting built on compassion and trust.\n\nLocal residents in Highwoods were equally stunned. He seemed like a decent man, always polite, one neighbour said. Its frightening to think that someone working in a hospital, trusted with vulnerable people, could commit something like this.\n\nThe NHS Trust responsible for Colchester Hospital has since launched an internal review into its safeguarding policies and staff supervision procedures. In a statement, a spokesperson said, We are appalled by this individuals actions. Our thoughts are with the victim and their family. We are fully cooperating with the authorities to ensure that lessons are learned and measures strengthened to prevent any recurrence.\n\nFor the victim, whose identity is protected by law, the ordeal has left deep psychological scars. Support workers are now focusing on their long-term recovery and reintegration into a safe environment.\n\nAs Ncube begins his prison sentence, his once-respected career in healthcare has ended in disgrace. His actions have cast a long shadow over an institution built on care and compassion, leaving both colleagues and patients struggling to reconcile the enormity of his betrayal.\n\nThe case serves as a stark reminder of the vulnerability of those who depend on others for their most basic needs and the heavy responsibility carried by those who provide that care. It also stands as a call to action for the healthcare system to strengthen protections and restore the publics trust in those entrusted with societys most fragile lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "the rape story By Shelton Muchena in England HIGHWOODS, ESSEX — In a case that has sent shockwaves through both … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/care-worker-jailed-a-betrayal-of-trust-at-colchester-hospital/\">Continue reading<span class=\"screen-reader-text\"> \"UK: Zim Care Worker Jailed for Raping A Patient: A Betrayal of Trust at Colchester Hospital\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "Spy Chiefs Expose Deep-Rooted Partisan Politics in CIO",
            "url": "https://www.zimeye.net/2025/10/23/spy-chiefs-expose-deep-rooted-partisan-politics-in-cio/",
            "content": "By a Correspondent  Two former Central Intelligence Organisation (CIO) bosses, Happyton Bonyongwe and Lovemore Itai Mukandi, have exposed the long-standing politicisation of Zimbabwes intelligence services and their entanglement in ZANU-PF succession politics. The revelations, contained in their recently published memoirs, have reignited debate over the security sectors role in political transitions since the 2017 military-assisted change of power.\n\nIn an opinion piece published byZimEye,Professor Allen Munoriyarwaof Walter Sisulu University argues that the two former spy chiefs accounts reveal how the intelligence agency serves not national interests but the narrow political objectives of the ruling party. He warns that the continued involvement of state security structures in internal party battles echoes the same patterns that preceded the 2017 coup, reflecting a worrying recurrence of what he terms institutional capture and parallel intelligence operations.\n\nBelow is the opinion piece by Prof Munoriyarwa:\n\nBy Professor Allen Munoriyarwa-This year has been a pivotal one for Zimbabwean politics. The ongoing succession dispute between the President and his Vice President shows no sign of abating. All signs point to a dog-eat-dog contest in the coming years, with the potential for a brutal, even violent, conclusion.\n\nTo understand the unfolding crisis, let us rewind to February 2025. Former CIO Director-General Happyton Bonyongwethe longest-serving head of the countrys state security service under the late ex-president Robert Mugabelaunched an autobiography titledOne Among Many: My Contribution to the Zimbabwean Story.Almost immediately after, another former CIO Deputy Director-General, Lovemore Itai Mukandi, published his own tell-all book,How Mnangagwa Blindsided Robert Mugabe and Grabbed Zimbabwe.\n\nIt now seems fashionable for former spy chiefs to document their organisational experiences. The icing on the cake, however, came with the ruling partys annual conference, which served as comic relief amid the release of the two explosive books. At this ZANU-PF conference, the party resolved to extend the Presidents tenure to 2030. Notably, in Bulawayo last year, Patrick Chinamasa had announced the same resolution.\n\nThese three developments are deeply interlinked, and their coincidence bodes ominously for the country. Yet, it is hardly productive to dwell on the ZANU-PF conference itselfit has become a predictable annual ritual, recycling the same hollow rhetoric. The usual party stalwarts shouted the same slogans, applauded by hungry, unemployed, and disillusioned youths, cheering proclamations of imaginary economic progress.\n\nThe Mutare and Bulawayo conferences, stripped to their core, are about one thing: the vicious succession dispute between President Mnangagwa and Vice President Chiwenga. The two men, to their credit, have not publicly exchanged blowsat least not yet. But their proxies are already at war on their behalf.\n\nWe are repeatedly told that the President has no interest in a third term. He has reportedly assured Chinamasa and others that he is a constitutionalist. For those who lived through November 2017, this claim may sound ironicbut that is beside the point.\n\nOne wonders: where are the third-termists drawing their energy from? This crusade would have died a natural death had the President emphatically declared his intention to step down in 2028. The fact that the debate persists suggests encouragement from within. Some even suspect that 2028 is merely a stepping stone toward abolishing term limits altogether. Otherwise, why all this noise and polarisation over just two years?\n\nAs in 2017, the final arbiters of this conflict will not be ZANU-PFs rank and filelong accustomed to uncritical obediencebut the states coercive institutions. Already, movements within the Central Intelligence Organisation (CIO) hint at such an outcome.\n\nWhat makes this fight particularly dangerous for ordinary Zimbabweans is the involvement of the intelligence agency itself. The two books mentioned earlier expose the CIOs long-standing entanglement with partisan politics. Both authors confirm that the institution serves not national interests but the narrow political objectives of the ruling partyjust as the military did during the 2017 coup and arguably continues to do today.\n\nIn Bonyongwes memoir, he admits trying to persuade Mugabe to retireeven seeking a meeting with Grace Mugabe to do so. This was not the work of a national intelligence head but that of a political operative. Was Mugabes succession a national security issue? Clearly not. If it were, why did ZANU-PF nominate him as a candidate in 2013, and why did subsequent party congresses endorse him despite his advanced age?\n\nMukandis book goes further. He alleges that President Mnangagwa continued to run aparallel CIO structureafter leaving the Ministry of State Security in 1999, holding meetings in Gweru with faction-aligned operatives who briefed him behind Mugabes back. These revelations expose the deep partisanship and capture of the intelligence services.\n\nThe November 2017 coup revealed the extent of institutional capture in Zimbabwe. The army, after defending Mugabe for 37 years, suddenly turned against him. The CIO played its part, while ordinary citizens were mobilised to march against Mugabe under false pretences. Reports later emerged that some security and intelligence officers involved in the coup were promised money and goldtransforming them from professionals into mercenaries.\n\nMukandis allegations about the existence of a parallel intelligence structure are therefore deeply alarming. They highlight how politicisation and personalisation of intelligence can destabilise a nation. Mugabe himself was accused of maintaining a similar structure during his rule. The repetition of such practices points to systemic failure in the oversight and governance of security institutions.\n\nTo prevent further deterioration, Zimbabwe must first ensure that intelligence officers are properly remunerated. Underpaid and impoverished agents can easily be co-opted into political or factional service. Furthermore, ZANU-PFs reported involvement in recruiting party-aligned youth into the CIO compounds the problemit embeds partisanship within the institution itself.\n\nThis raises a fundamental question: can citizens still trust such institutions? And if so, on what grounds?\n\nZimbabwe urgently needs to reflect on the kind of intelligence agency it desiresone that is professional, well-compensated, and non-partisan. The fact that individuals can run parallel intelligence structures or that top spies intervene in party succession disputes shows how deeply flawed our oversight mechanisms are.\n\nWe need acivilian-driven oversight modelfor intelligence institutionsone that monitors their welfare, budget, and conduct to shield them from political interference. Such reform would require a bold constitutional process involving civil society and independent experts. Admittedly, those benefiting from the current politicisationparticularly within ZANU-PFwould resist it, fearing the loss of their grip on power.\n\nBut this reform should not be viewed as an attack on any political party. It would, in fact, strengthen national institutions and safeguard democracy. ZANU-PFs greatest illusion is the belief that it will rule forever. It will not. Therefore, the party itself would benefit from institutions that serve the nation rather than transient political elites.\n\nThe convergence of an unrestrained, partisan intelligence apparatus and a volatile succession struggle within ZANU-PF is a ticking time bomb. For a nation already weighed down by poverty, unemployment, and despair, the spectre of collapse looms large.\n\nHow we reform and depoliticise our intelligence agencies will determine whether Zimbabwe retains even the remnants of democracyor slides further into authoritarian decay.\n\nProfessor Allen Munoriyarwa is a Professor of Journalism at Walter Sisulu University, South Africa. This article forms part of an eight-country research project titled Public Oversight of Digital Surveillance for Intelligence Purposes: A Comparative Case Study of Oversight Practices in Southern Africa, supported by the British Academy Global Professorship Programme through the University of Glasgow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent — Two former Central Intelligence Organisation (CIO) bosses, Happyton Bonyongwe and Lovemore Itai Mukandi, have exposed the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/spy-chiefs-expose-deep-rooted-partisan-politics-in-cio/\">Continue reading<span class=\"screen-reader-text\"> \"Spy Chiefs Expose Deep-Rooted Partisan Politics in CIO\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "Vemuganga FM: A Vital Platform for Mental Health Awareness in Chipinge",
            "url": "https://www.zimeye.net/2025/10/23/vemuganga-fm-a-vital-platform-for-mental-health-awareness-in-chipinge/",
            "content": "By Claris Madhuku| Mental health remains a pressing challenge in our society, often misunderstood and stigmatized. The rising uptake of drugs and substance abuse among young people, frequently viewed as coping mechanisms for economic hardships, has contributed to mental health crisis. This article highlights the essential role of Vemuganga FM in providing accurate information and fostering knowledge sharing to demystify mental health issues in Chipinge.\n\nUnderstanding Mental Health\n\nAccording to the World Health Organization (WHO), mental health is a state of well-being where individuals recognize their abilities, cope with life stresses, work productively, and contribute to their communities. Mental health challenges arise from a combination of biological, psychological, and social/environmental factors, including genetic predispositions, trauma, stressful life events, and social influences.\n\nSigns and Symptoms of Mental Health Issues\n\nMental health issues can manifest in various symptoms, such as prolonged sadness, excessive fear, extreme mood swings, and social withdrawal. Physical symptoms might include unexplained aches and pains. Understanding these signs is critical for early intervention and support.\n\nThe Role of Vemuganga FM\n\nVemuganga Community Radio has emerged as a beacon of hope in addressing mental health challenges in Chipinge. By collaborating with organizations like the Platform for Youth and Community Development (PYCD) and Sustainable Agricultural Technology (SAT), the station provides free services aimed at raising awareness about mental health.\n\nBreaking Down Stigma\n\nThe radio station is committed to breaking down stigma and correcting misconceptions surrounding mental health. Through its programming, Vemuganga FM emphasizes that mental health is a vital component of overall well-being, rather than a personal failing. The station promotes the idea that mental health conditions arise from a myriad of factors and that effective treatments exist.\n\nEngaging the Community\n\nVemuganga FM has hosted a Talk Show series featuring professional counsellors from PYCD. These shows engage the public in meaningful conversations, fostering a supportive environment where individuals feel comfortable seeking help. This initiative is crucial, especially considering that one in six adolescents experiences a mental health condition, with suicide being a leading cause of death.\n\nAdvocacy and Support\n\nThe collaboration with PYCD has led to significant advocacy efforts aimed at young people and their caregivers. Vemuganga FM supports initiatives that provide psychosocial counselling, particularly for vulnerable groups like girls and young women. By incorporating cultural approaches into education and promoting health-seeking behaviours, the station strengthens the community fabric in Chipinge.\n\nA Collaborative Approach\n\nIn partnership with SAT, Vemuganga FM is raising awareness through sporting activities targeting both in-school and out-of-school youth. This cross-sector coordination involves health, education, social welfare, and youth initiatives, creating a comprehensive approach to mental health.\n\nConclusion\n\nVemuganga FM has proven to be a reliable information hub, successfully raising awareness about mental health and discouraging reliance on traditional healers who often attribute mental health issues to spiritual causes. This progressive approach, grounded in stakeholder engagement and participatory action research, is fostering a more informed and supportive community in Chipinge. Through its efforts, Vemuganga FM is not just advocating for mental health awareness but is actively contributing to the well-being of its community.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Claris Madhuku| Mental health remains a pressing challenge in our society, often misunderstood and stigmatized. The rising uptake of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/vemuganga-fm-a-vital-platform-for-mental-health-awareness-in-chipinge/\">Continue reading<span class=\"screen-reader-text\"> \"Vemuganga FM: A Vital Platform for Mental Health Awareness in Chipinge\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "Is Mnangagwa Reducing Chiwenga To A Mere Gardener?",
            "url": "https://www.zimeye.net/2025/10/23/is-mnangagwa-reducing-chiwenga-to-a-mere-gardener/",
            "content": "By A Correspondent\n\nVice President Constantino Chiwengas current assignment to oversee rural development and irrigation projects has sparked speculation that President Emmerson Mnangagwa is gradually sidelining his deputy amid a simmering struggle for political power.\n\nChiwenga is in Makorokoro Village, Jinjika, inspecting the Makorokoro Nutrition Garden, a project commissioned by Mnangagwa in 2021. He was welcomed by the Minister of State for Matabeleland South Provincial Affairs and Devolution, Albert Ngulube, as part of a three-day tour across the province.\n\nOfficially, the tour aims to ensure that local communities benefit from government initiatives. The Vice Presidents itinerary also includes the Maphisa Arda Irrigation Scheme, Bishopstone Estate and Factory, Nottingham Estate, Palm River Energy Project, Gwanda Lithium Mine, Tuli-Manyange Dam, and Garanyemba Village Business Unit.\n\nWe are here to ensure that our people can fully leverage the benefits of these projects, Chiwenga told reporters. The Makorokoro Nutrition Garden is just one example of how we are working to improve food security and promote sustainable agriculture in our communities.\n\nHowever, political analysts suggest the assignment reflects Chiwengas diminishing influence in national politics. Chiwenga has been reduced to inspecting gardens and irrigation schemes while Mnangagwa consolidates power in Harare, said one source familiar with party dynamics.\n\nLocal leaders welcomed the Vice Presidents visit, expressing optimism that it would enhance project implementation. Government officials emphasized that no one and no place is being left behind in the countrys development journey.\n\nStill, behind the official narrative, observers say the optics are telling  a once-powerful general now touring gardens while the fight for political dominance quietly intensifies in the corridors of power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Vice President Constantino Chiwenga’s current assignment to oversee rural development and irrigation projects has sparked speculation that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/is-mnangagwa-reducing-chiwenga-to-a-mere-gardener/\">Continue reading<span class=\"screen-reader-text\"> \"Is Mnangagwa Reducing Chiwenga To A Mere Gardener?\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "Zanu PF Epworth South MP Accused of Orchestrating Demo to Block Minister’s Tour Over Alleged Land Scandal",
            "url": "https://www.zimeye.net/2025/10/23/zanu-pf-epworth-south-mp-accused-of-orchestrating-demo-to-block-ministers-tour-over-alleged-land-scandal/",
            "content": "By A Correspondent\n\nZanu PF Epworth South legislator Hon. Mutana Mbofana Taedzwa has been accused of mobilising a demonstration against Harare Resident Minister of Provincial Affairs, Senator Charles Z. Tawengwa, in an alleged attempt to stop him from touring devolution-funded projects in the area  reportedly fearing exposure of land scams linked to his name.\n\nAccording to senior Zanu PF officials and community administrators in Epworth, the planned demonstration failed to take off as expected. Senator Tawengwa had been conducting an assessment tour of various devolution projects to monitor progress and evaluate ongoing development initiatives in the constituency.\n\nSources claim that Hon. Taedzwa feared the Ministers visit would expose areas where he allegedly invaded land and developed several projects on illegally occupied space. He is accused of working with some residents associations he is affiliated with to mobilise people to stage a protest at the Epworth Local Board offices in an attempt to block the Ministers visit.\n\nHowever, the plan reportedly backfired after officials close to the Minister noticed groups of people milling around the offices and quickly diverted Senator Tawengwa to another meeting venue. Authorities who were part of the Ministers entourage said the decision was made amid fears the demonstrators could become violent.\n\nAnonymous local officials allege that Hon. Taedzwa used his political influence to fraudulently allocate residential stands on a site originally reserved for the construction of a district general hospital  a crucial facility that Epworth currently lacks. The land, designated for the hospital under the Epworth Master Layout Plan approved by the Ministry of Local Government and Public Works, is now occupied by more than 600 families, up from an initial 200.\n\nThese families were supposed to be relocated to proper residential areas for free under the Presidential Title Deeds Programme. However, it is alleged that the MP colluded with residents associations to allocate additional stands on the hospital site to new settlers, inflating the number of households eligible for reallocation and thus increasing his potential gain.\n\nReports further suggest that about five years ago, as the Presidential Title Deeds Programme was being prepared, Taedzwa allegedly misled home seekers by claiming that the ruling party was identifying loyal members who would benefit from the programme. He is accused of allocating temporary shelter to them on the hospital site, collecting money under the pretext of facilitating eventual formal allocation of stands with title deeds.\n\nWhen contacted for comment, the Epworth South legislator dismissed the allegations outright. Ok hapana hapana  nothing like that. Ill call you, said Hon. Taedzwa, insisting he had nothing to hide. Go ahead, nyora nhema idzodzo, hazvina kana basa, he added, referring to the allegations as lies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Epworth South legislator Hon. Mutana Mbofana Taedzwa has been accused of mobilising a demonstration against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/zanu-pf-epworth-south-mp-accused-of-orchestrating-demo-to-block-ministers-tour-over-alleged-land-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Epworth South MP Accused of Orchestrating Demo to Block Minister’s Tour Over Alleged Land Scandal\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "🔴 BREAKING- Lupane Hospital Doctor Schales Has Died",
            "url": "https://www.zimeye.net/2025/10/23/%f0%9f%94%b4-breaking-lupane-hospital-doctor-schales-has-died/",
            "content": "By Correspondent | ZimEye | LUPANE  The Matabeleland North community is mourning the death of Dr Hans Schales, a respected medical practitioner who served for many years at Lupane Hospital.\n\nThe news was confirmed by Bulawayo Mayor David Coltart, who described Dr Schales as a reserved but warm human being with deep affection for the people of Matabeleland North, indeed for all Zimbabweans.\n\nDr Schales, believed to have been of German nationality, dedicated decades of his life to providing medical care to poor rural communities in Zimbabwe. Known for his humility and exceptional professionalism, he was praised for his tireless service and commitment to improving rural healthcare.\n\nHe will be sorely missed by all who knew him. Although not a Zimbabwean citizen, he will remain one of our true heroes, said Mayor Coltart.\n\nSocial media has since been flooded with condolence messages from former patients, colleagues, and community members:\n\nDr Schales passing marks the end of an era for Lupane Hospital, where his compassion and skill touched countless lives across Matabeleland North.\n\n May his dear soul rest in eternal peace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Correspondent | ZimEye | LUPANE – The Matabeleland North community is mourning the death of Dr Hans Schales, a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/%f0%9f%94%b4-breaking-lupane-hospital-doctor-schales-has-died/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 BREAKING- Lupane Hospital Doctor Schales Has Died\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "Leaked ZANU PF Bank Statement Exposes Regime’s Hidden Wealth",
            "url": "https://www.zimeye.net/2025/10/23/leaked-zanu-pf-bank-statement-exposes-regimes-hidden-wealth/",
            "content": "By A Correspondent  A leaked ZANU PF bank statement has revealed that the ruling party is sitting on a staggering war chest of nearly US$10 million, even though it has not yet received its statutory allocation under the Political Parties (Finance) Act.\n\nThe figures  contained in the central committee report tabled at the partys 22nd National Peoples Conference in Mutare last week  show that ZANU PFs accounts hold US$9 819 821.64 and ZWG722 860.97, placing it among the wealthiest political organisations in Southern Africa.\n\nThe disclosure has reignited public outrage over how the party continues to amass vast resources in a collapsing economy  where hospitals lack basic supplies, civil servants earn below the poverty line, and millions of citizens languish in deprivation.\n\nFor over four decades, ZANU PF has sustained its political dominance through an intricate web of state-linked financial extraction, fusing government institutions, parastatals, and private businesses into its economic bloodstream. Analysts have long described this as a shadow financing system  one that keeps the ruling elite thriving while the rest of the nation sinks deeper into crisis.\n\nSince the 1980s, state-owned enterprises such as the National Railways of Zimbabwe (NRZ), Grain Marketing Board (GMB), ZESA Holdings, TelOne, and the Zimbabwe Mining Development Corporation (ZMDC) have been routinely compelled to donate cash, vehicles, fuel, and equipment to bankroll ZANU PFs programmes and election campaigns. These so-calledpatriotic contributionshave blurred the lines between state resources and party finances, effectively transforming public assets into partisan tools.\n\nCivil servants have also been ensnared in the system. Teachers, nurses, agricultural officers, and district administrators have for years complained about forced donations deducted from their salaries  funds critics say are channelled into ZANU PFs political machinery.\n\nIn the private sector, the pressure is more subtle but no less coercive. Executives in mining, construction, and tobacco industries quietly admit that survival often depends onunofficial donationsto the ruling party. Access to government contracts, tenders, and licences is widely perceived to hinge on financial loyalty to ZANU PF.\n\nThis entrenched patronage economy has enabled the party to convert political power into perpetual wealth, even as the national economy withers.\n\nAgainst this backdrop, ZANU PFs national fundraising committee  chaired by flamboyant businessman Philip Chiyangwa and including figures such as James Makamba, Supa Mandiwanzira, Betty Kaseke, John Paradza, Patience Tapomwa, and gold dealer Scott Sakupwanya  has raised millions in both local and foreign currency. The committee oversees the mobilisation of resources for party operations, staff salaries, congresses, and restructuring exercises.\n\nAccording to the leaked report, ZANU PF collected US$120 869 and ZWG40 216 from membership subscriptions, with provincial structures instructed by treasurer-general Jacob Mudenda to ensure full annual payments by all senior party officials  including Politburo, Central Committee, and District Coordinating Committee members.\n\nThe party also reported US$9.17 million and ZWG361 644.97 in donations, US$163 595 from vehicle sales, US$268 690 from conference contributions, and US$95 103.64 from tent hire. On the expenditure side, ZANU PF disbursed US$3.98 million in staff salaries and US$1.74 million in gratuities.\n\nEven without its state allocation under the Political Parties (Finance) Act  or dividends from its investment arms  the partys robust balance sheet demonstrates its ability to sustain itself independently of formal public funding. Critics, however, argue that this financial strength stems from decades of systemic resource extraction from state-controlled entities and businesses dependent on government favour.\n\nThe partys commissariat report further boasts of 81 167 cells and villages nationwide, representing a membership base of 4 058 350. Analysts note that this vast structure is maintained not only through ideological loyalty but through material incentives  food aid, contracts, and loans tied to political allegiance. The report also lists 150 affiliate organisations, many of which benefit from the Presidential Empowerment Revolving Fund, a scheme opposition parties and civil society describe as a vehicle for distributing patronage.\n\nWhile the party claims to have introduced mechanisms for financial accountability, previous audits of empowerment initiatives  including the Youth Fund, Command Agriculture, and the Presidential Inputs Scheme  exposed rampant looting by politically connected elites.\n\nPolitical scientist Professor Eldred Masunungure has long described ZANU PFs financial model as a fusion of public and partisan finance, warning that it corrodes democratic competition and entrenches corruption by rewarding loyalty over merit.\n\nMeanwhile, ZANU PFs digitalisation project, slated for completion by September 2025, is being touted as a transparency measure  but critics argue it doubles as a surveillance tool designed to monitor loyalty and tighten social control.\n\nThe leaked ZANU PF bank statement, therefore, is more than just an accounting record. It is a window into the ruling partys enduring machinery of political extraction  a system that bleeds the state to enrich the few while impoverishing the many.\n\nIn a country where public hospitals are on life support and citizens endure chronic shortages, the ruling partys financial abundance underscores Zimbabwes enduring paradox: a regime that prospers as the nation collapses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — A leaked ZANU PF bank statement has revealed that the ruling party is sitting on a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/leaked-zanu-pf-bank-statement-exposes-regimes-hidden-wealth/\">Continue reading<span class=\"screen-reader-text\"> \"Leaked ZANU PF Bank Statement Exposes Regime’s Hidden Wealth\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "ZANU-PF’s Succession Dispute and the Dangers of Politicised Surveillance",
            "url": "https://www.zimeye.net/2025/10/23/zanu-pfs-succession-dispute-and-the-dangers-of-politicised-surveillance/",
            "content": "By Professor Allen Munoriyarwa-This year has been a pivotal one for Zimbabwean politics. The ongoing succession dispute between the President and his Vice President shows no sign of abating. All signs point to a dog-eat-dog contest in the coming years, with the potential for a brutal, even violent, conclusion.\n\nTo understand the unfolding crisis, let us rewind to February 2025. Former CIO Director-General Happyton Bonyongwethe longest-serving head of the countrys state security service under the late ex-president Robert Mugabelaunched an autobiography titledOne Among Many: My Contribution to the Zimbabwean Story.Almost immediately after, another former CIO Deputy Director-General, Lovemore Itai Mukandi, published his own tell-all book,How Mnangagwa Blindsided Robert Mugabe and Grabbed Zimbabwe.\n\nIt now seems fashionable for former spy chiefs to document their organisational experiences. The icing on the cake, however, came with the ruling partys annual conference, which served as comic relief amid the release of the two explosive books. At this ZANU-PF conference, the party resolved to extend the Presidents tenure to 2030. Notably, in Bulawayo last year, Patrick Chinamasa had announced the same resolution.\n\nThese three developments are deeply interlinked, and their coincidence bodes ominously for the country. Yet, it is hardly productive to dwell on the ZANU-PF conference itselfit has become a predictable annual ritual, recycling the same hollow rhetoric. The usual party stalwarts shouted the same slogans, applauded by hungry, unemployed, and disillusioned youths, cheering proclamations of imaginary economic progress.\n\nThe Mutare and Bulawayo conferences, stripped to their core, are about one thing: the vicious succession dispute between President Mnangagwa and Vice President Chiwenga. The two men, to their credit, have not publicly exchanged blowsat least not yet. But their proxies are already at war on their behalf.\n\nWe are repeatedly told that the President has no interest in a third term. He has reportedly assured Chinamasa and others that he is a constitutionalist. For those who lived through November 2017, this claim may sound ironicbut that is beside the point.\n\nOne wonders: where are the third-termists drawing their energy from? This crusade would have died a natural death had the President emphatically declared his intention to step down in 2028. The fact that the debate persists suggests encouragement from within. Some even suspect that 2028 is merely a stepping stone toward abolishing term limits altogether. Otherwise, why all this noise and polarisation over just two years?\n\nAs in 2017, the final arbiters of this conflict will not be ZANU-PFs rank and filelong accustomed to uncritical obediencebut the states coercive institutions. Already, movements within the Central Intelligence Organisation (CIO) hint at such an outcome.\n\nWhat makes this fight particularly dangerous for ordinary Zimbabweans is the involvement of the intelligence agency itself. The two books mentioned earlier expose the CIOs long-standing entanglement with partisan politics. Both authors confirm that the institution serves not national interests but the narrow political objectives of the ruling partyjust as the military did during the 2017 coup and arguably continues to do today.\n\nIn Bonyongwes memoir, he admits trying to persuade Mugabe to retireeven seeking a meeting with Grace Mugabe to do so. This was not the work of a national intelligence head but that of a political operative. Was Mugabes succession a national security issue? Clearly not. If it were, why did ZANU-PF nominate him as a candidate in 2013, and why did subsequent party congresses endorse him despite his advanced age?\n\nMukandis book goes further. He alleges that President Mnangagwa continued to run aparallel CIO structureafter leaving the Ministry of State Security in 1999, holding meetings in Gweru with faction-aligned operatives who briefed him behind Mugabes back. These revelations expose the deep partisanship and capture of the intelligence services.\n\nThe November 2017 coup revealed the extent of institutional capture in Zimbabwe. The army, after defending Mugabe for 37 years, suddenly turned against him. The CIO played its part, while ordinary citizens were mobilised to march against Mugabe under false pretences. Reports later emerged that some security and intelligence officers involved in the coup were promised money and goldtransforming them from professionals into mercenaries.\n\nMukandis allegations about the existence of a parallel intelligence structure are therefore deeply alarming. They highlight how politicisation and personalisation of intelligence can destabilise a nation. Mugabe himself was accused of maintaining a similar structure during his rule. The repetition of such practices points to systemic failure in the oversight and governance of security institutions.\n\nTo prevent further deterioration, Zimbabwe must first ensure that intelligence officers are properly remunerated. Underpaid and impoverished agents can easily be co-opted into political or factional service. Furthermore, ZANU-PFs reported involvement in recruiting party-aligned youth into the CIO compounds the problemit embeds partisanship within the institution itself.\n\nThis raises a fundamental question: can citizens still trust such institutions? And if so, on what grounds?\n\nZimbabwe urgently needs to reflect on the kind of intelligence agency it desiresone that is professional, well-compensated, and non-partisan. The fact that individuals can run parallel intelligence structures or that top spies intervene in party succession disputes shows how deeply flawed our oversight mechanisms are.\n\nWe need acivilian-driven oversight modelfor intelligence institutionsone that monitors their welfare, budget, and conduct to shield them from political interference. Such reform would require a bold constitutional process involving civil society and independent experts. Admittedly, those benefiting from the current politicisationparticularly within ZANU-PFwould resist it, fearing the loss of their grip on power.\n\nBut this reform should not be viewed as an attack on any political party. It would, in fact, strengthen national institutions and safeguard democracy. ZANU-PFs greatest illusion is the belief that it will rule forever. It will not. Therefore, the party itself would benefit from institutions that serve the nation rather than transient political elites.\n\nThe convergence of an unrestrained, partisan intelligence apparatus and a volatile succession struggle within ZANU-PF is a ticking time bomb. For a nation already weighed down by poverty, unemployment, and despair, the spectre of collapse looms large.\n\nHow we reform and depoliticise our intelligence agencies will determine whether Zimbabwe retains even the remnants of democracyor slides further into authoritarian decay.\n\nProfessor Allen Munoriyarwa is a Professor of Journalism at Walter Sisulu University, South Africa. This article forms part of an eight-country research project titled Public Oversight of Digital Surveillance for Intelligence Purposes: A Comparative Case Study of Oversight Practices in Southern Africa, supported by the British Academy Global Professorship Programme through the University of Glasgow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Professor Allen Munoriyarwa-This year has been a pivotal one for Zimbabwean politics. The ongoing succession dispute between the President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/zanu-pfs-succession-dispute-and-the-dangers-of-politicised-surveillance/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU-PF’s Succession Dispute and the Dangers of Politicised Surveillance\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "Wicknell Chivayo’s Business Partners Convicted of US$7 Million Fraud",
            "url": "https://www.zimeye.net/2025/10/23/wicknell-chivayos-business-partners-convicted-of-us7-million-fraud/",
            "content": "By Crime and Courts Reporter-Two businessmen closely linked to flamboyant Zanu PF benefactor Wicknell ChivayoMike Mbudzi Chimombe and Moses Mpofunow face lengthy jail terms after being convicted of fraud in one of Zimbabwes most audacious corruption scandals involving the US$87 million Presidential Goat Pass-On Scheme.\n\nThe High Court, presided over by Justice Pisirayi Kwenda, found the pair guilty after a full trial, marking a major legal blow to the network of politically connected businessmen accused of looting public funds through bogus government contracts. The two have already spent 16 months in custody, and sentencing is expected next week.\n\nJustice Kwenda ruled that Mpofu and Chimombe offered weak and self-incriminating defences, having shot themselves in the foot by failing to call witnesses. He concluded that Mpofu knowingly submitted falsified tender documents, while Chimombe actively directed operations of the fraudulent company, Blackdeck Livestock and Poultry Farming.\n\nA company is just a person in terms of the law. Its really not a natural person created by God. It being a fiction, you cant touch it. It does not have a brain of its own, so its very difficult to separate the acts of a company from the acts of the person who represents it, said Justice Kwenda.\n\nThe judge further noted that Mpofus failure to bring forward witnesses affected his credibility, while Chimombes claim that he was merely attending meetings as part of the Economic Empowerment Group was not convincing.\n\nWe found that the second accused was controlling the affairs of the entity. His liability flows from his participation, Justice Kwenda ruled.\n\nAccording to State Prosecutor Witness Mabhaudhi, the scam arose from the governments 2021 Presidential Goat Pass-On Scheme, designed to reduce rural poverty through livestock distribution. The Ministry of Lands, Agriculture, Water, Fisheries and Rural Development invited tenders to supply and deliver 632,001 goats worth US$87,757,168.\n\nMpofu and Chimombe, using the unregistered Blackdeck Livestock and Poultry Farming, forged ZIMRA and NSSAcertificates to win the lucrative tender. The Ministry advanced ZWL$1.6 billion (US$7.7 million) to the company, but investigations revealed the pair only supplied 4,208 goats valued at US$331,445, converting the remainderUS$7.38 millionto personal use.\n\nJustice Kwenda said their actions demonstrated a clear intent to defraud the State, depriving thousands of rural families of a vital poverty-alleviation programme.\n\nThe conviction has cast fresh light on Wicknell Chivayos shadowy business empire and his close association with Chimombe and Mpofu, all of whom have been central figures in a series of controversial government tenders allegedly used to channel state funds into ruling party networks.\n\nChivayo, who became notorious for the US$173 million Gwanda Solar Projectwhich collapsed despite massive advance paymentshas repeatedly been linked to politically connected procurement deals. His relationship with Chimombe and Mpofu deepened during the 2023 election period, when they reportedly worked together on state-funded contracts under the guise of empowerment initiatives.\n\nIn mid-2024, leaked audio recordings surfaced in which Chimombe and Mpofu were heard angrily demanding payment from Chivayo for proceeds from election-related tenders allegedly secured through the Central Intelligence Organisation (CIO), senior Zimbabwe Electoral Commission (ZEC) officials, and Finance Ministry permanent secretary George Guvamatanga.\n\nIn the audios, the two accused accused Chivayo of pocketing funds meant to pay their share from the deals, boasting that they had facilitated some of the transactions and were owed their cut. The recordings caused a political storm, exposing how high-level state institutions and ruling party insiders allegedly colluded to exploit election procurement contracts for personal enrichment.\n\nAlthough government spokespersons dismissed the recordings as fabrications, the scandal reinforced public perception of systemic corruption at the heart of Zimbabwes political economywhere a small circle of politically protected businessmen dominate multi-million-dollar state contracts.\n\nChimombe and Mpofus downfall now marks a spectacular reversal for two men who once flaunted their proximity to power, often seen in luxury cars and at Zanu PF functions alongside Chivayo. Their conviction adds to mounting pressure on authorities to investigate the broader web of tender irregularities linked to politically connected business elites.\n\nThe two will return to court on October 31 for a pre-sentencing hearing, where they could face lengthy prison terms. Their conviction, analysts say, could become a turning point in exposing how state tenders, political patronage, and personal greed have undermined governance and development in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Two businessmen closely linked to flamboyant Zanu PF benefactor Wicknell Chivayo—Mike “Mbudzi” Chimombe and Moses Mpofu—now … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/wicknell-chivayos-business-partners-convicted-of-us7-million-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Wicknell Chivayo’s Business Partners Convicted of US$7 Million Fraud\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        },
        {
            "title": "Chinese Businessmen in US$400,000 Fraud Scandal",
            "url": "https://www.zimeye.net/2025/10/23/chinese-businessmen-in-us400000-fraud-scandal/",
            "content": "By Crime and Courts Reporter-Two Chinese nationals have been arrested in Harare on allegations of defrauding their business partner of more than US$400,000 in a botched investment deal.\n\nThe accused, Mu Jirui and Li Miao, appeared before Harare magistrate Marewanazvo Gofa on Wednesday facing charges of fraud and forgery. They were each granted US$500 bail and ordered to surrender their passports, reside at their known addresses, and report to the CID once a fortnight.\n\nThe complainant, Wang Li, a fellow Chinese national and shareholder in Katsu Agro Chemical (Pvt) Ltd, alleged that the two connived to defraud her through a fake investment refund scheme. Katsu Agro Chemical deals in agricultural pesticides.\n\nAccording to the State, in April this year, Wang, Jirui, and Miao agreed to jointly invest in Kenova Crop Science (Pvt) Ltd, another pesticide company owned by Miao. The company was said to be performing well, prompting the three to pool resources.\n\nOn April 14, Wang injected US$420,000 into the business, acquiring 44 percent of the companys shares. Jirui contributed US$210,000 for 22 percent, while Miao invested US$330,000 for 34 percent. The funds were handed to Miao, who provided proof of payment to Wang.\n\nHowever, Wang never received her share certificates or any formal ownership documentation for her 44 percent stake.\n\nIn August, Miao allegedly filed an application at the High Court (HCH 485/25) demanding money and a car from Wang, claiming they belonged to Katsu Agro Chemical (Pvt) Ltd. When Wang reviewed the court documents, she discovered a forged Investment Refund Agreement falsely stating that Miao had reimbursed her US$420,000.\n\nMiao also reportedly filed a police report attaching the same falsified document, purportedly signed by Wang and Jirui, to suggest that Wang had been refunded.\n\nWang denied ever receiving the money or signing such an agreement. The State alleges that the pairs actions caused her a financial prejudice of US$420,000, with nothing recovered to date.\n\nRufaro Chonzi appeared for the State.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Two Chinese nationals have been arrested in Harare on allegations of defrauding their business partner of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/23/chinese-businessmen-in-us400000-fraud-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Chinese Businessmen in US$400,000 Fraud Scandal\"</span></a></p>",
            "time": "18:39",
            "date": "23 Oct 2025"
        }
    ]
}