{
    "news": [
        {
            "title": "Minister Mavetera Loses Three Relatives In Car Crash",
            "url": "https://www.zimeye.net/2025/04/17/minister-mavetera-loses-three-relatives-in-car-crash/",
            "content": "By A Correspondent\n\nIn a heartbreaking incident that highlights the perilous state of the countrys roads, ICT Minister Tatenda Mavetera tragically lost three relatives in a horrific car accident last week.\n\nIn a statement, Mavetera shared the devastating news, expressing the immense pain her family has endured:\n\nThis past week, our family was walking through an unimaginable storm. We lost our beloved son-in-law, Edward Tatenda Mubaiwa, in a tragic car accident. Tatenda was a loving husband, a devoted father, and a man of great kindness. His sudden departure has left us shattered.\n\nAdding to the grief, Mavetera revealed that their daughter, Chido, is currently hospitalized, fighting for her life after the crash. The couples 2-month-old baby, Treasure Mutsawashe, now faces a future without the father who adored her.\n\nTo make matters even more painful, our daughter Chido is currently hospitalised, fighting for her health. They have a precious 2-month-old baby, Treasure Mutsawashe, who now needs all the love and prayers we can gather.\n\nMavetera expressed her deep sorrow, calling for prayers for her daughters recovery, the strength to endure the tragedy, and the well-being of little Treasure, who will grow up knowing how deeply her father loved her.\n\nAt this dark hour, we humbly ask for your prayers for Chidos healing, for strength to endure this pain, and for little Treasure, who will grow up knowing how much her father loved her.\n\nTatendas memory, Mavetera stated, will forever remain in their hearts, and the family is relying on faith to help them through the unbearable loss.\n\nHis memory will forever remain in our hearts. We trust God to carry us through this unbearable loss. The Lord is close to the brokenhearted and saves those who are crushed in spirit. Psalm 34:18.\n\nThe tragic accident also highlighted the worsening condition of the countrys roads, which have become increasingly hazardous. A light gone too soon, Mavetera reflected as she announced the burial of her son-in-law in Macheke last Friday.\n\nThis loss is a glaring reminder of the dangers we face every day on our roads, which have unfortunately become a death trap.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a heartbreaking incident that highlights the perilous state of the country’s roads, ICT Minister Tatenda Mavetera … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/minister-mavetera-loses-three-relatives-in-car-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Mavetera Loses Three Relatives In Car Crash\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Tshabangu Can’t Garner 100 Votes Countrywide – Zivhu",
            "url": "https://www.zimeye.net/2025/04/17/tshabangu-cant-garner-100-votes-countrywide-zivhu/",
            "content": "By A Correspondent\n\nOutspoken Zanu PF official Killer Zivhu has taken aim at Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu, branding him a political misfit with minimal national support.\n\nIn a strongly worded statement on Thursday, Zivhu dismissed Tshabangus political influence, stating:\n\nTshabangu may win court battles, but uniting with him would be a disaster for the nation and the economy. His lack of support across the country is clear  he cant even muster 100 votes nationwide. What matters most right now is putting the countrys interests first.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Outspoken Zanu PF official Killer Zivhu has taken aim at Citizens Coalition for Change (CCC) Secretary General … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/tshabangu-cant-garner-100-votes-countrywide-zivhu/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Can’t Garner 100 Votes Countrywide – Zivhu\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "LEAKED LETTER: Guvamatanga in USD60 Million DishOut To Shady Company",
            "url": "https://www.zimeye.net/2025/04/17/leaked-letter-guvamatanga-in-usd60-million-dishout-to-shady-company/",
            "content": "BREAKING: Guvamatanga Exposed in $60 Million Scandal  Leaked Letter Shows Finance Secretary Compromised Treasury to Guarantee Shady Private Loan\n\nHarare, 17 April 2025  Zimbabwes Permanent Secretary for Finance, George Guvamatanga, has been exposed in a potentially explosive corruption scandal after a leaked government letter revealed he personally committed $60 million in public funds to guarantee a questionable $20 million private loan.\n\nThe letter, dated 24 March 2025 and addressed to Ecobank Zimbabwe, shows Guvamatanga acting on behalf of the Ministry of Finance to guarantee loan repayments for Valley Seeds (Private) Limited, a shadowy private company. The Ministry commits to pay $5 million per month over 12 months  totaling $60 million, three times the actual loan amount.\n\nBREAKING: Guvamatanga Exposed in $60 Million Scandal  Leaked Letter Shows Finance Secretary Compromised Treasury to Guarantee Shady Private LoanHarare, 17 April 2025  Zimbabwes Permanent Secretary for Finance, George Guvamatanga, has been exposed in a potentially explosivepic.twitter.com/o04eTgojJ1\n\n..\n\nIn the letter, Guvamatanga writes:\n\nMOF do hereby irrevocably guarantee and bind ourselves to the said Bank as sureties and co-principal debtors for the repayment on demand of all such sum or sums of money as Valley Seeds (Private) Limited hereafter will owe under the above mentioned facility\n\nThe Ministry goes even further, promising:\n\nMOF irrevocably undertakes to expunge the above Legacy Debt at a rate of USD 5,000,000.00 (Five Million United States Dollars) monthly\n\nEven more shockingly, Guvamatanga authorizes Ecobank to directly debit government funds if Valley Seeds defaults:\n\nMOF hereby grants Ecobank the right to directly debit an amount of up to USD5,000,000.00 from the MOF if there are any delays in receipt of the Legacy Debt payments\n\nThis Is Stinking Corruption\n\nProminent activist Jealousy Mawarire condemned the deal, declaring:\n\nThis is stinking corruption Why is the Ministry of Finance paying $60 million for a $20 million loan? Does it therefore imply that Ecobank is making a profit of $40 million from a structure where they outlaid $20 million?\n\nHe also questioned why such a deal was signed outside the Public Debt Management Act, without Parliaments approval:\n\nAll Gvt Loans and guarantees should be subject to the Public Debt Management Act and Parliament should be informed at all times.\n\nWhy Is Guvamatanga the Sole Executor?\n\nGuvamatangas name is the only one on the letter. He signs off the deal alone, stating that he has been authorized to:\n\nrepresent the Ministry and sign this document and give effect to the above said arrangement until the facility has been paid in full.\n\n@mawarirej Mawarire blasted this setup, asking:\n\nWhy would the Ministry appoint Guvamatanga to be the principal executor in a private transaction? If everything is transparent, why cant future Finance Permanent Secretaries uphold the same deal?\n\nSerious Red Flags\n\nThis arrangement has triggered widespread alarm for several reasons:Public funds are backing a private entity with no clarity on ownership or public benefit.The Ministry promises immunity from future policy changes, shielding the deal from incoming administrations.There is no evidence Parliament approved this guarantee, as required by law.The deal commits taxpayers to pay triple the loan value, without explanation.\n\nThe letter states that all facility fees will be borne by Valley Seeds, but with the Ministry essentially covering the entire $60 million, this clause appears meaningless.\n\nWho Is Valley Seeds?\n\nDespite being listed in Treasury books as holding over $191 million in legacy debt, Valley Seeds remains an opaque, private firm with no known public profile. Its strategic importance remains unexplained.\n\nWith Zimbabweans reeling from inflation, unemployment, and public sector collapse, the revelation that the Treasury is secretly backing a private firms debts with $60 million in taxpayer money has triggered urgent calls for investigation.\n\nMore to follow as we trace the money and the people behind Valley Seeds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BREAKING: Guvamatanga Exposed in $60 Million Scandal — Leaked Letter Shows Finance Secretary Compromised Treasury to Guarantee Shady Private Loan … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/leaked-letter-guvamatanga-in-usd60-million-dishout-to-shady-company/\">Continue reading<span class=\"screen-reader-text\"> \"LEAKED LETTER: Guvamatanga in USD60 Million DishOut To Shady Company\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Tragic Road Crash at Magunje Turn-Off Claims Six Lives",
            "url": "https://www.zimeye.net/2025/04/17/tragic-road-crash-at-magunje-turn-off-claims-six-lives/",
            "content": "By Farai D Hove | ZimEye | Magunje, Zimbabwe  April 17, 2025 | A devastating road traffic accident at Magunje Turn-Off along the Chinhoyi-Karoi highway has claimed the lives of at least six people, according to initial reports on Thursday.\n\nThe tragic collision occurred when a light vehicle, believed to be a white Nissan AD van, was involved in a head-on crash with a heavy freight truck belonging to KRL Freight Logistics. The impact of the crash was so severe that the smaller vehicle was mangled beyond recognition, with its entire front section completely torn apart.\n\nEyewitnesses at the scene described the aftermath as horrifying, with debris scattered across the roadside and emergency services struggling to retrieve bodies from the wreckage. It was a terrible sight. You couldnt even tell how many people were in the car initially, said one bystander who arrived shortly after the crash.\n\nPreliminary reports suggest that excessive speed or a possible misjudgment during overtaking may have contributed to the collision, although official investigations are still underway.\n\nPolice and emergency responders arrived at the scene quickly, but sadly, six people were confirmed dead on the spot. The identities of the deceased have not yet been released as authorities work to notify the next of kin.\n\nThe Chinhoyi-Karoi highway has seen a worrying rise in fatal accidents in recent years, raising concerns over road safety enforcement and driver behavior on this major route linking key towns in Mashonaland West.\n\nAuthorities are urging motorists to exercise extreme caution, particularly on highways where traffic volumes and speeds are high. Meanwhile, the Zimbabwe Republic Police (ZRP) has launched a full investigation into the incident.\n\nFurther details will be provided as they become available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | Magunje, Zimbabwe – April 17, 2025 | A devastating road traffic accident at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/tragic-road-crash-at-magunje-turn-off-claims-six-lives/\">Continue reading<span class=\"screen-reader-text\"> \"Tragic Road Crash at Magunje Turn-Off Claims Six Lives\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Rising Football Giants Clash In Uhuru Cup",
            "url": "https://www.zimeye.net/2025/04/17/rising-football-giants-clash-in-uhuru-cup/",
            "content": "Sports Correspondent\n\nFootball fans are in for a thrilling showdown this Friday as rising football powerhouses Simba Bhora and FC Platinum face off in the Uhuru Cup, set to take place in Gokwe.\n\nThe match is part of the festivities celebrating Zimbabwes 45th year of Independence, with preparations already in full swing in the Midlands town. The game promises high energy and intense competition as both teams look to make a statement in this symbolic fixture.\n\nSimba Bhora, quickly establishing themselves as serious contenders in Zimbabwean football, will be eager to prove their mettle against the seasoned and decorated FC Platinum side. FC Platinum, a dominant force in the domestic league over the past few years, will be looking to maintain their strong reputation and show their class in this national event.\n\nLocal authorities and organizers in Gokwe are making final touches to ensure a successful and memorable Uhuru Cup. The event is expected to draw large crowds and foster a spirit of unity and celebration in honor of Zimbabwes Independence Day.\n\nFans across the country will be watching closely as these two football giants collide in a match thats more than just about points  its about pride, passion, and national identity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Football fans are in for a thrilling showdown this Friday as rising football powerhouses Simba Bhora and FC … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/rising-football-giants-clash-in-uhuru-cup/\">Continue reading<span class=\"screen-reader-text\"> \"Rising Football Giants Clash In Uhuru Cup\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Welshman Ncube Officially Admits Sengezo Tshabangu’s Court Win Is As Irreversible As Mahere’s",
            "url": "https://www.zimeye.net/2025/04/17/welshman-ncube-officially-admits-sengezo-tshabangus-court-win-is-as-irreversible-as-maheres/",
            "content": "As ZANU PF UZ-grantee Fadzayi Mahere and the discredited Sengezo Tshabangu become the first opposition characters to win disputed court cases, Prof Welshman Ncubes CCC makeshift has admitted that the Mnangagwa campaigners win is now irreversible. The institution has released the following statement stating:\n\nSengezoTshabanguv Citizens Coalition for Change\n\nWe, together with our lawyers, have now had the opportunity tostudy JusticeDubesjudgment infavourofSengezoTshabanguwhich judgement isunappealableto the Supreme Courtbecause it is a default judgment.The judgment wasarrivedat by holding that ouropposition toTshabangusapplication wasimproperly before the court becauseof two errors which wemadein our papers.Thefirst of whichwas a typographical errorwhich wrongly referredto CCC as the1stApplicant instead of the5thRespondentin theone paragraphin which we weresaying the President isauthorized to represent the partyand thesecond of whichwas the failureto attach the correct resolutionoftheNationalExecutive authorizing thePresidentto representthe party in legal proceedings.As a result of these twoerrors, the Judge President foundthat the opposing papers were improperlybefore the court and were invalidand as such, theTshabanguapplication was unopposed.\n\nWhile we disagreewith the conclusion thatthere was no proofbefore the court that the President was authorized torepresent the party inthelitigation,given that thecorrect resolution was before the court byincorporationof the other cases in whichit was filedwe fullyrespect thejudgement and hence have instructedour lawyers to apply for itsrecession and forcondonationandextentionof timewithin which to filevalid opposing papers.\n\nIn this regard,the leadership assures party membersthatthe partyarewill opposeTshabangusmachinationsto hijack the partyand make it a personal toy to thebitter end in andoutside courts. We are fully convincedthat even if theTshabanguapplication for declaringthe party leadership as being unlawfullyin office has not beenopposed, the court should not havegranted it because the HighCourtisboundby the lawenunciated by the Supreme Courtparticularly in thecase ofCossamChiangwaandOthers vApostolicFaith Mission in Zimbabwe and othersSC 67/21Where the Supreme Courtreaffirmedthe common law positionthat:\n\nAgain, the common law principlesgoverningtheexpiration offixed tenure of officebearerswas settled in the casesofPadayichevPayadaiand Another 1994(1) SA662(w) at 677G andExparteUnited party club 1930WLD 277 at281.It is that the tenureof office of electedoffice bearers is not terminatedby theeffluxionof time but bysubsequent electionthat are held for new office bearers.\n\nWe believethat the law of the country is clear.The term of officeof the current leadership will expireatcongresswhich is to be held within the next few months,when a newleadership of the party will be elected.This is the law of the country by whichthe High Court isbound.\n\nIn these circumstances, we are duty bound to seek rescissionof theHigh Court judgementbecause it is substantively contraryto the settled law of the country.\n\nWe advise our members that the judgementhas nothing to do with JusticeChitapijudgement which remains extantand barsTshabangufrom recallingany CCC Members ofParliament andCouncillors.\n\nTshabanguwill still have to face his dayin Court and take a witnessstand to answer questions as to howand when he became the SGof the CCC.\n\nAccordingly, our Members of Parliamentshould remain focused on amplifyingour voices in Parliament in the fightagainst corruption and povertywithout being distracted bythe machinations of charlatans.\n\nThe party among the peopleshould focuson mobilizingpeoplein the communitiesin preparation for congressto be held within the next few months.\n\nFor and on behalf of the Citizens Coalition for Change(CCC)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "As ZANU PF UZ-grantee Fadzayi Mahere and the discredited Sengezo Tshabangu become the first opposition characters to win disputed court … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/welshman-ncube-officially-admits-sengezo-tshabangus-court-win-is-as-irreversible-as-maheres/\">Continue reading<span class=\"screen-reader-text\"> \"Welshman Ncube Officially Admits Sengezo Tshabangu’s Court Win Is As Irreversible As Mahere’s\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Gabon’s Aaron Boupendza Dies",
            "url": "https://www.zimeye.net/2025/04/17/gabons-aaron-boupendza-dies/",
            "content": "Gabonese football star Aaron Boupendza has tragically passed away at the age of 28 after reportedly falling from the 11th floor of a building in China, where he was currently based while playing for Zhejiang FC.\n\nThe Gabonese Football Federation confirmed the devastating news in a statement posted on social media platform X, saying: The Gabonese international died following a fall from the 11th floor of his building in China. Aged 28, Boupendza leaves us as a great striker who made his mark at the Africa Cup of Nations in Cameroon.\n\nBoupendza was a key figure in Gabons national team setup and rose to continental prominence during his standout performances at the Africa Cup of Nations. His club career took him across multiple continents, where he impressed with his goal-scoring abilities and versatility.\n\nHe began his professional journey at Bordeaux in France before making a major impact at Turkish side Hatayspor, where he emerged as the Super Ligs top scorer in the 202021 season. His prolific form earned him moves across the Middle East, including spells with Al-Arabi in Qatarwhere he won the Qatar FA Cupand Al-Shabab in the Saudi Pro League.\n\nBoupendza later featured in the United States for FC Cincinnati and then in Romania for Rapid Bucharest before moving to China to join Zhejiang FC in January 2025.\n\nThe news of his untimely death has sent shockwaves across the football community, with tributes pouring in from fans, former clubs, and teammates who remembered him not only as a gifted striker but also as a passionate and dedicated professional.\n\nBoupendzas death marks a tragic loss for both Gabonese football and the global sports fraternity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Gabonese football star Aaron Boupendza has tragically passed away at the age of 28 after reportedly falling from the 11th … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/gabons-aaron-boupendza-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Gabon’s Aaron Boupendza Dies\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Mpofu Admits Mayhem In Zanu PF",
            "url": "https://www.zimeye.net/2025/04/17/mpofu-admits-mayhem-in-zanu-pf/",
            "content": "By A Correspondent\n\nZanu PF Secretary General Obert Mpofu has acknowledged growing tensions and discontent within the ruling party, calling for renewed unity and discipline among its members.\n\nSpeaking during the Zanu PF Policy and Coordinating meeting held at the party headquarters in Harare on Monday, Mpofu emphasized the importance of cohesion ahead of Zimbabwes 45th Independence Day celebrations scheduled to take place in Gokwe Nembudziya this week.\n\nIn his address, Mpofu urged party members to remain committed to the ideals of peace and stability: Let us cherish the peace and tranquility we enjoy as a country. We must work together to preserve it, especially as we prepare to commemorate our independence.\n\nWhile congratulating Tsitsi Tawomhera and Trinity Madzinga for their recent victories in the Glen View South by-election and Rushingas Ward 19, respectively, Mpofu also hinted at internal strife brewing within Zanu PF.\n\nParty insiders revealed that the Secretary General expressed concern over increasing divisions and infighting, warning that such cracks could weaken the party from within.\n\nWe need to remain vigilant, disciplined, and united, Mpofu reportedly said. Let us not allow distractions or internal differences to derail the progress we have made.\n\nHis remarks, though carefully worded, were seen by many within the party as a rare public admission of the challenges currently facing the Zanu PF leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Secretary General Obert Mpofu has acknowledged growing tensions and discontent within the ruling party, calling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/mpofu-admits-mayhem-in-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Mpofu Admits Mayhem In Zanu PF\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Trablablas US90 million Interchange Finally Revealed As A Pile Of Mud-Sand Painted With A Grey Footpath ‘Smaller Than Wicknell’s Body’",
            "url": "https://www.zimeye.net/2025/04/17/trablablas-us90-million-interchange-finally-revealed-as-a-pile-of-mud-sand-painted-with-a-grey-footpath-smaller-than-wicknells-body/",
            "content": "USD 90 Million for a Muddy Footpath? Zimbabwes Trabablas Interchange is a National Embarrassment\n\nNext month, Zimbabweans are expected to start using the so-called Trabablas Interchangea project hyped for years as a flagship of progress, a modern marvel poised to transform Harares traffic landscape. What has been delivered, however, is a deeply underwhelming mess: a USD 90 million pile of red earth, half-baked curves, and what appears to be a glorified footpath draped over bare embankments.\n\nThe latest photos from the construction site, proudly shared by Road Watch Zimbabwe, do not inspire national pridethey provoke justified outrage. A handful of tarred segments snake through mounds of exposed soil, flanked by scattered workers and construction vehicles. Theres no coherent structure in sight, no sign of the multilayered, efficient traffic artery that was promised. The illusion of progress is created with drone angles and Photoshop-ready lighting, but the reality on the ground is crude, unsealed, and nowhere near operational standard.\n\nWhere Did the Money Go?\n\nLets be clear: USD 90 million is no small sum. Its enough to construct several fully functional interchanges in countries with honest procurement practices and competent project management. Instead, Zimbabwe has ended up with something that, at best, resembles a Google Earth sketch of what a road might become. This begs the urgent question: where did the money go?\n\nTheres no plausible justification for this cost overrun unless one includes the typical ingredients of Zimbabwean statecraftcorruption, cronyism, and cover-ups. The opacity of the tender process, the absence of an independently audited breakdown of costs, and the usual chorus of official spin all point to the same pattern weve seen time and again: infrastructure as a conduit for looting.\n\nTrabablas DownloadingBut Whos Paying?\n\nThe galling part is that officials and online propagandists have the audacity to brand this debacle with pop-culture flairTrabablas downloading, they say, as if the public should laugh off the waste. Whats really downloading is another generational debt burden for the youth of this country, another chance for elites to siphon public funds while ordinary Zimbabweans dodge potholes and walk long distances due to a broken public transport system.\n\nThis interchange, in its current state, is not an achievement. It is a monument to mediocrity. A tragic reminder that in Zimbabwe, the bar is set so low that a road with visible mud and missing safety features can be celebrated as a national milestone.\n\nWe Deserve Better\n\nThe people of Zimbabwe are not asking for miraclesthey are asking for accountability. If USD 90 million was truly spent, there should be roads fit for purpose, lanes ready for traffic, signage installed, and drainage secured. What we see instead is something that looks more like a road-making rehearsal than a finished interchange.\n\nUntil the government begins to treat infrastructure with the seriousness it deservesthrough transparency, competence, and zero tolerance for corruptionTrabablas will remain an apt metaphor. A project caught in perpetual buffering mode, downloading forever, but never truly delivered.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "USD 90 Million for a Muddy Footpath? Zimbabwe’s “Trabablas Interchange” is a National Embarrassment Next month, Zimbabweans are expected to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/trablablas-us90-million-interchange-finally-revealed-as-a-pile-of-mud-sand-painted-with-a-grey-footpath-smaller-than-wicknells-body/\">Continue reading<span class=\"screen-reader-text\"> \"Trablablas US90 million Interchange Finally Revealed As A Pile Of Mud-Sand Painted With A Grey Footpath ‘Smaller Than Wicknell’s Body’\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        },
        {
            "title": "Latest On Emmanuel Mahamba Gruesome Murder",
            "url": "https://www.zimeye.net/2025/04/17/latest-on-emmanuel-mahamba-gruesome-murder/",
            "content": "Outrage is growing across South Africa and Zimbabwe as the man accused of killing Zimbabwean national Emmanuel Mahamba continues to evade arrestnearly two weeks after the brutal incident. Despite chilling video evidence and the impounding of the suspects vehicle, he remains at large and is reportedly continuing his business operations while communicating freely via WhatsApp.\n\nBy A Correspondent |ZimEye|JOHANNESBURG A peaceful protest is being organised by Zimbabweans in Pretoria to demand justice for Emmanuel Mahamba, a 29-year-old who was tragically run over multiple times in Sandton on April 5. The protest comes amid mounting frustration over what many are calling a lack of urgency from the South African Police Service.\n\nThe protest was confirmed by activist and Greathope Funeral Director Moreboys Munetsi during a Facebook LIVE broadcast on April 17. Munetsi stated that the community had followed the legal process to secure permission for the demonstration.\n\nAs a community, we dont want to be violent, Munetsi said. We went to the police and were given permission for a demonstration. We want to do things legally. There is already interaction between the Zimbabwean and Ugandan communities. But justice must be served.\n\nMahambas death, captured in a disturbing viral video, shows him being run over while seated on the ground. The vehicle used, a Ford Ranger, has since been impounded, but the suspect remains unaccounted for.\n\nContrary to early reports, Munetsi clarified that the suspect is a Ghanaian national, not Ugandan, and is the partner of a Zimbabwean woman named Ntombi, who was briefly in a relationship with Mahamba. The couple share three children, the youngest being only four months old.\n\nThe affair between Ntombi and Emmanuel began in January. At the time, her youngest child with the Ghanaian suspect was only one month old, said Munetsi. After the murder, Ntombi and the man fled their home, and the children were sent to Zimbabwe.\n\nMunetsi, who is working closely with both the Mahamba family and police, revealed that Ntombi reached out to him to clear her name and share her side of the story.\n\nShe came to me asking to speak. She said she needed to tell the truth because people were attacking her, he said. She confirmed the relationship with Emmanuel, but she has also tried to convince the suspect to hand himself in.\n\nDespite efforts to track him, the suspect continues to evade authorities. Munetsi claims the mans phone remains active and that he is still running his business, making financial transactions that could help pinpoint his location.\n\nThis suspect is a businessman processing transactions right now. Why cant he be tracked through his phone or bank records? Munetsi asked. I asked the investigating officer why Section 205 of the law hasnt been used to compel mobile and financial service providers to assist in locating him.\n\nFrustration has grown over how law enforcement has managed the case. The Mahamba family was reportedly given the wrong case number at one point, leading to suspicions of deliberate obstruction.\n\nThe family is calm, not violent. But theyre hurt. They feel ignored, said Munetsi. This case is now viral. It is damaging the image of the Sandton Police Station. Something must be done.\n\nMunetsi also confirmed that he met with the Sandton detective team and provided them with voice recordings of the suspect speaking with associates. He criticized the slow pace of the investigation and warned that public anger could escalate if authorities continue to delay action.\n\nThe approved protest, led by Zimbabwean nationals and supported by South African citizens and diaspora groups, aims to pressure police into acting decisively. Organizers are calling for transparency in the investigation and protection for key witnesses like Ntombi.\n\nWe dont want violence. But the pain people are feeling is real, said Munetsi. The only way to ease that pain is through accountability. If the suspect is innocent, he should come forward and apply for bail. But he cannot remain free while a family is grieving and a community is in shock.\n\nAn anonymous tipster has reportedly shared the suspects possible location with Munetsis team. As the search continues, pressure is mounting for justice to be served in the name of Emmanuel Mahamba.\n\nStory developing\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Outrage is growing across South Africa and Zimbabwe as the man accused of killing Zimbabwean national Emmanuel Mahamba continues to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/17/latest-on-emmanuel-mahamba-gruesome-murder/\">Continue reading<span class=\"screen-reader-text\"> \"Latest On Emmanuel Mahamba Gruesome Murder\"</span></a></p>",
            "time": "08:43",
            "date": "18 Apr 2025"
        }
    ]
}