{
    "news": [
        {
            "title": "Ti Gonzi Loses US$5K to Magaya Criminal Syndicate",
            "url": "https://www.zimeye.net/2025/11/08/ti-gonzi-loses-us5k-to-magaya-criminal-syndicate/",
            "content": "By A Correspondent  Popular hip-hop star Ti Gonzi (real name Tinashe Gonzara) has reportedly lost US$5,000 after unknowingly buying a smuggled vehicle linked to a criminal syndicate allegedly operating within Prophet Walter Magayas PHD Ministries.\n\nThe scandal came to light after Magayas aide, Tapiwa Felix Chikondo, was arrested and charged with smuggling and fraud involving the same car. Chikondo  who is also jointly facing separate assault charges with Prophet Magaya  appeared before Harare regional magistrate Francis Mapfumo this week. He was not asked to plead and was released on US$600 bail pending trial.\n\nAccording to prosecutors, Chikondo, employed as a security aide at PHD Ministries, allegedly smuggled a Toyota Mark X from Japan between July and August 2024 and later sold it to Ti Gonzi. The vehicle was reportedly parked at Yadah Hotel in Waterfalls, one of Magayas flagship properties, where the transaction took place.\n\nThe Zimbabwe Revenue Authority (ZIMRA), represented by revenue supervisor Collins Ncube, is the complainant in the case, while Lancelot Mutsokoti appeared for the State.\n\nProsecutors allege that Chikondo identified another car  a Toyota Mark X (registration number ABX 7852) belonging to Dumisani Dube  and used its registration details to fraudulently obtain new number plates for his smuggled vehicle, which had not been cleared through customs or had import duty paid.\n\nChikondo allegedly engaged a car clearing agent, Andrew Musoni, to process fake papers through the Central Vehicle Registry (CVR). Musoni is said to have used forged documents to obtain a new registration number, AGS 2550, under Dubes name. After paying Musoni US$50, Chikondo affixed the fake plates onto the smuggled car and sold it to Ti Gonzi for US$5,000.\n\nThe car was later seized on 7 January 2025 by officers from the CID Vehicle Theft Squad after being spotted in Mbare, where Ti Gonzi was driving it. Police informed the musician that the vehicle had been illegally imported and bore fake number plates.\n\nInvestigations revealed that the car had no import records or customs clearance, leading to a loss of US$3,389.55 in unpaid import duty to ZIMRA.\n\nCourt papers indicate that Ti Gonzi purchased the vehicle in good faith from Eastlea Car Sales, after being introduced to Chikondo by dealer Jarmine Rubatika. The sale was concluded at the Yadah Hotel car park, where the smuggled vehicle was on display.\n\nDespite paying the full amount, Ti Gonzi was left empty-handed after the car was impounded by authorities.\n\nChikondo, already in the spotlight for allegedly assaulting a police officer alongside Prophet Magaya, now finds himself embroiled in yet another criminal case  one that deepens the cloud of controversy surrounding Magayas embattled empire.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Popular hip-hop star Ti Gonzi (real name Tinashe Gonzara) has reportedly lost US$5,000 after unknowingly buying … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/ti-gonzi-loses-us5k-to-magaya-criminal-syndicate/\">Continue reading<span class=\"screen-reader-text\"> \"Ti Gonzi Loses US$5K to Magaya Criminal Syndicate\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "Security Guards Kill “Gold Ore Thief”",
            "url": "https://www.zimeye.net/2025/11/08/security-guards-kill-gold-ore-thief/",
            "content": "By A Correspondent  A suspected gold ore thief in Masvingo died after falling into a 25-metre deep mine shaft while allegedly fleeing three security officers who later assaulted him at Good 17 Mine in the Manyama area on Thursday around 2pm.\n\nMasvingo Police confirmed that 22-year-old Isikolethu Munyamani died following the assault. Officers Brian Ndlovu (29), Jephius Mudzviti (27), and Josephat Ncube (25), all employed at the mine, have been arrested and are facing murder charges.\n\nAccording to authorities, Munyamani and several unidentified accomplices were allegedly stealing gold ore when the three security officers approached. While his accomplices escaped, Munyamani fell into a 25-metre deep shaft.\n\nThe trio then reportedly rescued him, taking him to a house on the mine premises where they tied his hands and legs and physically assaulted him. Munyamani lost consciousness during the attack, and the officers poured water on him in an attempt to revive him, but he did not regain consciousness.\n\nThe mine manager discovered the situation and called an ambulance to take Munyamani to the hospital, but he was already dead upon the vehicles arrival. His body was taken to Masvingo Provincial Hospital mortuary for a postmortem examination.\n\nMasvingo police urged the public to avoid taking the law into their own hands and to report criminal activity directly to law enforcement. They said, We call on everyone to allow the authorities to handle suspected crimes instead of responding with violence. Investigations are ongoing to establish exactly what happened and determine responsibility.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A suspected gold ore thief in Masvingo died after falling into a 25-metre deep mine shaft … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/security-guards-kill-gold-ore-thief/\">Continue reading<span class=\"screen-reader-text\"> \"Security Guards Kill “Gold Ore Thief”\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "Kandishaya Dismisses Letter Banning Top Soup 4ED Affiliate",
            "url": "https://www.zimeye.net/2025/11/08/kandishaya-dismisses-letter-banning-top-soup-4ed-affiliate/",
            "content": "ZANU PF Youth League Deputy Secretary for Commissariat Taurai Kandishaya has dismissed a statement issued by the group Updates4ED which called for the termination of another affiliate, TopSoup4ED.\n\nOn Saturday Kandishaya said the purported ban had no standing, emphasizing that only the Commissariat department within the ruling party has the authority to regulate or disband affiliates operating under the 4ED banner.\n\nIsu seCommissariate tisu tega tinesimba rekurambidza affiliate, kwete imwe affiliate kuzama kumisa imwe, said Kandishaya. As it stands, the letter below must be dismissed.\n\nHis remarks come after Updates4ED released a strongly worded statement condemning the emergence of TopSoup4ED, a group that claims to promote womens empowerment.\n\nIn its statement, Updates4ED said it notes with deep concern the emergence of a group calling itself TopSoup4ED, arguing that its messaging stands in stark contradiction to the values of dignity, respect, and genuine empowerment that underpin Vision 2030.\n\nThe group went on to describe TopSoup4ED as exploitation wrapped in party slogans, adding that the initiative insults the intelligence of Zimbabwean women by reducing them to political symbols rather than acknowledging them as equal partners in national development.\n\nUpdates4ED further declared that true empowerment is not about branding or publicity stunts but about creating meaningful opportunities for women through education, economic inclusion, and leadership.\n\nThe group called for the immediate termination of the TopSoup4ED initiative and urged that all stakeholders align empowerment programmes with integrity, respect, and national development priorities.\n\nHowever, Kandishayas dismissal of the letter effectively nullifies Updates4EDs call, reaffirming that decisions regarding affiliates fall strictly under the ZANU PF Commissariats jurisdiction.\n\nThe dispute highlights growing tensions within the network of 4ED affiliate groups, many of which were formed to support President Emmerson Mnangagwas Vision 2030 agenda but have recently clashed over legitimacy and authority.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ZANU PF Youth League Deputy Secretary for Commissariat Taurai Kandishaya has dismissed a statement issued by the group Updates4ED which … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/kandishaya-dismisses-letter-banning-top-soup-4ed-affiliate/\">Continue reading<span class=\"screen-reader-text\"> \"Kandishaya Dismisses Letter Banning Top Soup 4ED Affiliate\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "ZRP Should Open the Rape Reporting Platform to All — Not Only Magaya’s Victims",
            "url": "https://www.zimeye.net/2025/11/08/zrp-should-open-the-rape-reporting-platform-to-all-not-only-magayas-victims/",
            "content": "By Jacob Kudzayi Mutisi-Zimbabwe has many Magayas  men who exploit power, faith, and influence to prey on vulnerable women and girls. Protecting our daughters, sisters, mothers, and even grandmothers from such predators must become a national priority.\n\nIt is encouraging that the Zimbabwe Republic Police (ZRP) has taken decisive action in the rape, assault, and fraud allegations against Walter Magaya, the leader of PHD Ministries, and has launched new platforms for reporting such crimes. This marks a welcome shift toward accountability. However, I urge the ZRP to extend this initiative beyond this single case. The new reporting platform should be open toall survivors of rape and sexual abuseacross Zimbabwe  not just Magayas victims.\n\nIn a statement issued on8 November 2025, the ZRP announced several dedicated hotlines, including mobile and WhatsApp numbers, through which victims can report cases from within Zimbabwe or abroad. This is a commendable step forward. For too long, sexual predators  often shielded by wealth, influence, or religious authority  have acted with impunity, while victims have been silenced by fear, shame, and a justice system that rarely protects them.\n\nThis police initiative could mark the beginning of a new era in the fight against sexual violence  one in which survivors are no longer trapped by silence or stigma. But for that to happen, the reporting system must be institutionalised as anational mechanism for all survivors, not a temporary tool linked to one high-profile case.\n\nRape and sexual abuse remainwidespread across Zimbabwe, affecting women and girls in schools, workplaces, churches, and even within families. Some men and boys also experience abuse but rarely speak out because of cultural taboos and fear of ridicule. These realities demand a sustained, inclusive, and technologically empowered response from law enforcement.\n\nThe ZRP should therefore expand its current initiative to allow victims of all forms of sexual violence to report cases easily and confidentially. EmbracingInformation and Communication Technologies (ICTs)could play a transformative role. Social media platforms such asFacebook, X (formerly Twitter), and dedicated mobile apps can be used to reach survivors in remote areas or those too afraid to walk into a police station. Victims could even report anonymously, with guaranteed follow-up and protection.\n\nThis approach would not only improve access to justice but also help build trust between the police and the public  a trust that has often been eroded by perceptions of insensitivity and inaction in handling gender-based violence cases. Every report must be treated withempathy, confidentiality, and fairness, ensuring that no survivor is retraumatised by the system meant to protect them.\n\nMoreover, this moment presents Zimbabwe with an opportunity to ignite its own version of the#MeToo movement a national campaign in which survivors can safely and confidently share their experiences and demand justice. Such a movement would help dismantle the culture of silence that for decades has protected abusers and punished victims. It would also reaffirm the message that sexual violence is not a private shame but a public injustice that threatens the moral fabric of our society.\n\nThe ZRPs action should therefore be seen as thebeginning of a broader, national transformation. Justice in the Magaya case must set a precedent  not an exception. If the police sustain this momentum and open the platform to everyone, it could become a cornerstone of Zimbabwes long-overdue national strategy to combat sexual violence.\n\nWherever you are,Betty Makoni one of Zimbabwes foremost champions of girls rights  this is a moment to revisit and revive the cases you once fought so courageously to bring to light. The fight for justice that you began can find new life through this initiative if it is implemented inclusively and transparently.\n\nThis is not just about one man or one case. It is about protecting every Zimbabwean from sexual predators who exploit power and vulnerability. It is about ensuring that survivors are heard, believed, and supported. And above all, it is about building asafer Zimbabwe for everyone where justice is not selective, and where silence is no longer the default response to violence.\n\nLet this initiative be the spark for lasting change  a national movement where every survivor has a voice, and every predator knows that justice will come, no matter their status.\n\nEngineer Jacob Kudzayi Mutisi +263 772 278 161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Jacob Kudzayi Mutisi-Zimbabwe has many “Magayas” — men who exploit power, faith, and influence to prey on vulnerable women … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/zrp-should-open-the-rape-reporting-platform-to-all-not-only-magayas-victims/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Should Open the Rape Reporting Platform to All — Not Only Magaya’s Victims\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "Desperate Tsenengamu Runs Back To Mnangagwa For Redemption",
            "url": "https://www.zimeye.net/2025/11/08/tsenengamu-desperate-to-rejoin-zanu-pf-says-hes-coming-back-to-suckle/",
            "content": "By A Correspondent  Former Zanu PF Youth League Political Commissar Godfrey Tsenengamu reportedly met with President Emmerson Dambudzo Mnangagwa on Saturday in a move widely seen as an attempt at reconciliation following his expulsion from the party five years ago.\n\nZanu PF Youth League deputy secretary for commissariat Taurai Kandishaya praised Mnangagwas forgiving nature, saying:\n\nEmmerson Dambudzo Mnangagwa is such a forgiving leader, he is a father and guardian to all of us. Upon arrival, President ED vangomuti Zidzoro. Ndanyanyodzidza pavati muchiri vanaka, you make mistakes as you grow, but wakakurira mumusangano iwe misikanzwa chete. Welcome back.\n\nTsenengamu, who had publicly hinted at his desire to return to Zanu PF on social media the previous day, also expressed gratitude to Kandishaya for facilitating the meeting, stating:\n\nEmmerson Dambudzo Mnangagwa is such a forgiving leader, he is a father and guardian to all of us: upon arrival, President ED vangomuti Zidzoro. Ndanyanyodzidza pavati muchiri vanaka, you make mistakes as you grow but wakakurira mumusangano iwe misikanzwa chete. Welcome back. Thank you, mukwasha Taurai Kandishaya, for making this possible within a very short period of time. Huya utore mamwe madzimai mukwambo.\n\nOn Friday, Tsenengamu had teased his return on social media, posting: Mudhara ndiri kudzoka kuzoyamwa  munotswinya henyu nzeve but ndichiyamwa, which translates to, Old man, Im coming back to suckle again. You can twist my ear if you want, but Ill still suckle. He also appealed to Taurai Kandishaya to arrange a meeting with Mnangagwa, which took place the following day.\n\nObservers interpret Tsenengamus sudden soft tone and meeting with the President as a symbolic act of repentance and an effort to realign with the party he once criticized.\n\nResponding to Tsenengamus return, Kandishaya said:\n\nNdazvinzwa tezvara, Emmerson Dambudzo Mnangagwa ndibaba vedu tose vanokudai nemoyo wese. Regai tironge ronge makashandira musangano wedu panguva yenyu and you still have a lot to do for the peoples party.\n\nTranslated, Kandishaya added: Ive heard you, father-in-law. Emmerson Dambudzo Mnangagwa is our father who loves you dearly. Let us make arrangements  you served our party before, and you still have a lot to contribute to the peoples movement.\n\nTsenengamus Saturday meeting with Mnangagwa has reignited discussions about political loyalty and reconciliation within Zanu PF, signaling a potential reintegration of the outspoken politician into the party fold.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former Zanu PF Youth League Political Commissar Godfrey Tsenengamu reportedly met with President Emmerson Dambudzo Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/tsenengamu-desperate-to-rejoin-zanu-pf-says-hes-coming-back-to-suckle/\">Continue reading<span class=\"screen-reader-text\"> \"Desperate Tsenengamu Runs Back To Mnangagwa For Redemption\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "Zanu PF Youth League Boss “Defends” Top Soup 4ED",
            "url": "https://www.zimeye.net/2025/11/08/zanu-pf-youth-league-boss-defends-top-soup-4ed/",
            "content": "By A Correspondent  ZANU PF Youth League Deputy Secretary for Commissariat Taurai Kandishaya has dismissed a statement issued by the group Updates4ED which called for the termination of another affiliate, TopSoup4ED.\n\nOn Saturday, Kandishaya said the purported ban had no standing, emphasizing that only the Commissariat department within the ruling party has the authority to regulate or disband affiliates operating under the 4ED banner.\n\nIsu seCommissariate tisu tega tinesimba rekurambidza affiliate, kwete imwe affiliate kuzama kumisa imwe, said Kandishaya. As it stands, the letter below must be dismissed.\n\nHis remarks come after Updates4ED released a strongly worded statement condemning the emergence of TopSoup4ED, a group that claims to promote womens empowerment.\n\nIn its statement, Updates4ED said it notes with deep concern the emergence of a group calling itself TopSoup4ED, arguing that its messaging stands in stark contradiction to the values of dignity, respect, and genuine empowerment that underpin Vision 2030.\n\nThe group went on to describe TopSoup4ED as exploitation wrapped in party slogans, adding that the initiative insults the intelligence of Zimbabwean women by reducing them to political symbols rather than acknowledging them as equal partners in national development.\n\nUpdates4ED further declared that true empowerment is not about branding or publicity stunts but about creating meaningful opportunities for women through education, economic inclusion, and leadership.\n\nThe group called for the immediate termination of the TopSoup4ED initiative and urged that all stakeholders align empowerment programmes with integrity, respect, and national development priorities.\n\nHowever, Kandishayas dismissal of the letter effectively nullifies Updates4EDs call, reaffirming that decisions regarding affiliates fall strictly under the ZANU PF Commissariats jurisdiction.\n\nThe dispute highlights growing tensions within the network of 4ED affiliate groups, many of which were formed to support President Emmerson Mnangagwas Vision 2030 agenda but have recently clashed over legitimacy and authority.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – ZANU PF Youth League Deputy Secretary for Commissariat Taurai Kandishaya has dismissed a statement issued by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/zanu-pf-youth-league-boss-defends-top-soup-4ed/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Youth League Boss “Defends” Top Soup 4ED\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "Who’s Taking Over PF?",
            "url": "https://www.zimeye.net/2025/11/08/whos-taking-over-pf/",
            "content": "Who should take over Lungus PF party?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "PF Succession Race: Can Any Candidate Truly Inherit Edgar Lungu’s Divided Legacy? By ZimEye Political Desk | Lusaka As the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/whos-taking-over-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Who’s Taking Over PF?\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "Police Invite Magaya Rape & Fraud Victims To Open Cases",
            "url": "https://www.zimeye.net/2025/11/08/police-invite-magaya-rape-fraud-victims-to-open-cases/",
            "content": "By A Correspondent | ZimEye The Zimbabwe Republic Police (ZRP) has taken a decisive step in the ongoing investigation into Prophet Walter Magaya, officially releasing verified contact details for members of the public to report cases of rape, fraud, and assault allegedly committed by the Prophetic Healing and Deliverance (PHD) Ministries founder.\n\nIn a statement issued Friday, the police confirmed that they had been inundated with several calls from people all over the world seeking clarity on how to formally lodge complaints or provide information related to Magayas ongoing criminal cases.\n\nThe Zimbabwe Republic Police has availed cellphone number0776 830 226, National Complaints number(0242) 703 631, and WhatsApp number0712 800 197for anyone to freely report and allow the ZRP to conduct investigations, the statement read.\n\nThe ZRP further clarified that victims and witnesses based outside Zimbabwe  particularly inSouth Africa, the United Kingdom, Namibia, Botswana, Mozambique, Malawi, and Zambia are encouraged to make official reports through the same contact channels. Victims inSouth Africaare advised to file their reports at local police stations, have their statements notarised, and submit them via theZimbabwean Embassyfor onward transmission to Harare.\n\nIn the same statement, the police warned that anyone attempting to obstruct justice or intimidate witnesses in the Magaya cases would be arrested and charged under Section 184 of the Criminal Law (Codification and Reform) Act [Chapter 9:23], which makes it an offence to defeat or obstruct the course of justice. The Zimbabwe Republic Police warns individuals and syndicates trying to interfere with investigations or threaten witnesses that they risk being arrested for defeating or obstructing the course of justice, the statement said.\n\nThe latest ZRP announcement follows years of public confusion and misinformation about how victims could reach law enforcement, amid persistent allegations of sexual abuse and financial fraud against Magaya dating back to 2014.\n\nZimEye has been at the forefront of investigating Magayas activities for nearly a decade, publishing exclusive exposs, leaked audios, and eyewitness testimonies that detailed a pattern of sexual exploitation, psychological manipulation, and fraudulent schemes concealed under religious theatrics.\n\nIn one investigation, ZimEye published a leaked recording in which Magayas late mentor, Nigerian televangelist TB Joshua, warned him about the fall of the anointed if he continued ignoring accountability. ZimEye also exposed Magayas 2018 claim of discovering a cure for HIV and cancer, a declaration that drew international condemnation and was later withdrawn under government pressure. The publication has further documented how Magaya misrepresented ownership of properties  including former Reserve Bank Governor Dr. Gideon Gonos New Donnington Farm  to lure congregants into bogus land and agricultural investment schemes.\n\nMagaya was remanded in custody after being charged with five counts of rape and 13 counts of fraud, following a dramatic police raid at his Prospect prayer mountain last Saturday. His wife, Tendai Magaya, facing related fraud allegations, was released on US$500 bail. According to court papers, Magaya and his associates allegedly defrauded followers of over US$40,000 between 2016 and 2018 through fake investment projects in Chishawasha, Norton, Mutare, Bulawayo, and Kwekwe.\n\nCongregants were encouraged to invest through pamphlets quotingGenesis 13:9 A vast land is out there and available to you  and were told PHD Ministries had legally acquired the properties, which investigations later revealed was false. Two of Magayas aides were also arrested for obstructing justice and resisting arrest during the raid.\n\nAt his court appearance, Harare regional magistrate Marewanazvo Gofa ruled that the rape charges were serious and denied bail, noting that they fall under Third Schedule offences. Hundreds of PHD congregants flooded the courtroom, singing and praying for Magayas release, as the magistrate ordered that rape bail proceedings be held in camera to protect victim identities.\n\nSenior officials in the Ministry of Home Affairs toldZimEyethat the Magaya case represents a turning point for law enforcement agencies long accused of shielding powerful church leaders from accountability. For the first time, police have publicly confirmed official communication lines for victims, signaling a shift toward transparency and victim protection in high-profile religious abuse cases.\n\nOFFICIAL ZRP CONTACTS: Cell:0776 830 226 National Complaints:(0242) 703 631 WhatsApp:0712 800 197\n\nZimEye.com  Investigating Without Fear or Favour\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye — The Zimbabwe Republic Police (ZRP) has taken a decisive step in the ongoing investigation into … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/police-invite-magaya-rape-fraud-victims-to-open-cases/\">Continue reading<span class=\"screen-reader-text\"> \"Police Invite Magaya Rape & Fraud Victims To Open Cases\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "ZRP Finally Reveals Official Contact Numbers to Report Walter Magaya Allegations",
            "url": "https://www.zimeye.net/2025/11/08/finally-reveals-official-contact-numbers-to-report-walter-magaya-allegations/",
            "content": "By A Correspondent | ZimEye | The Zimbabwe Republic Police (ZRP) has officially released its verified contact numbers for members of the public to report allegations of rape, assault, and fraud against Prophet Walter Magaya of PHD Ministries.\n\nIn a press statement issued today, the ZRP said it had received several calls from people all over the world seeking clarification on how to lodge complaints or provide information concerning the ongoing investigations.\n\nPlease take note that the Zimbabwe Republic Police has availed cellphone number 0776 830 226, National Complaints number (0242) 703 631, and WhatsApp number 0712 800 197 for anyone to freely report and allow the ZRP to conduct investigations, the police said.\n\nVictims Abroad Urged to Report\n\nThe ZRP also confirmed that victims and witnesses based outside Zimbabwe  including in South Africa, the United Kingdom, Namibia, Botswana, Mozambique, Malawi, and Zambia  are encouraged to make formal reports through the above contacts.\n\nFor those in South Africa, victims are urged to report to their local police stations, have their statements notarised, and submit them through the Zimbabwean Embassy for onward transmission to Harare.\n\nZRP Warns Against Interference\n\nThe ZRP further issued a stern warning to any individuals or syndicates attempting to obstruct justice or intimidate witnesses in the Magaya cases.\n\nThe Zimbabwe Republic Police warns individuals and syndicates trying to interfere with investigations or threaten witnesses that they risk being arrested for defeating or obstructing the course of justice, the statement reads.\n\nThis warning falls under Section 184 of the Criminal Law (Codification and Reform) Act [Chapter 9:23], which makes it a criminal offence to obstruct or defeat the course of justice.\n\nBackground\n\nThe announcement follows years of public confusion and social media misinformation surrounding how victims could officially contact law enforcement regarding allegations against Walter Magaya, dating back to 2014.\n\nWith this latest release, the ZRP has clarified that only the three numbers listed in the official statement are valid for communication and investigation purposes.\n\n OFFICIAL ZRP CONTACTS: Cell: 0776 830 226 National Complaints: (0242) 703 631 WhatsApp: 0712 800 197\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | The Zimbabwe Republic Police (ZRP) has officially released its verified contact numbers for members … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/finally-reveals-official-contact-numbers-to-report-walter-magaya-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Finally Reveals Official Contact Numbers to Report Walter Magaya Allegations\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        },
        {
            "title": "The Unsolved “Death” of Rashiwe Guzha",
            "url": "https://www.zimeye.net/2025/11/08/the-unsolved-death-of-rashiwe-guzha/",
            "content": "In May 1990, a young typist named Rashiwe Guzha walked into her workplace at the Central Intelligence Organisation (CIO) in Harare and vanished without a trace. Thirty-five years later, her family, colleagues and an entire nation are still haunted by the unanswered question: what really happened to Rashiwe Guzha?\n\nHer story is one of Zimbabwes most chilling mysteries, a story whispered in fear, wrapped in state secrecy and buried under layers of official silence.\n\nRashiwe Guzha was known among her colleagues as disciplined, efficient and quietly ambitious. She worked as a typist within the CIO, then one of the countrys most secretive and powerful institutions.\n\nOn that fateful day in May 1990, she was reportedly called in for questioning by senior officials. Witnesses recall seeing her last in the company of men linked to Edson Shirihuru, then Deputy Director of the CIO. She was never seen again.\n\nWithin days, rumours began to circulate that she had been romantically involved with Shirihuru, that she had stumbled upon sensitive information, that she had been taken for interrogation and never returned. Some even claimed her body was dissolved in acid a rumour so horrifying it became a symbol of the brutality of that era.\n\nWhen the story first broke, public reaction was immediate. Newspapers cautiously raised the issue, but coverage was muted. The CIO remained tight-lipped and police investigations went nowhere.\n\nAn official inquiry was reportedly established, but its findings were never made public. Government spokesmen offered contradictory statements at one point suggesting she had resigned, at another hinting she might still be alive.\n\nHuman rights organisations, including Amnesty International, listed her case in their 1994 report as an unresolved disappearance. They noted that the Zimbabwean government had failed to clarify her fate or hold anyone accountable.\n\nIn 1993, before any trial could proceed, Edson Shirihuru died under unclear circumstances. At his funeral, the then President Robert Mugabe declared the case closed effectively ending any hope of justice.\n\nFor many Zimbabweans, Rashiwe Guzhas disappearance exposed how state power could be used to make a citizen disappear without consequence. It also showed how fear could silence even those who knew the truth.\n\nThe late journalist Willard Ziwoya, writing in The Sunday Mail years later, described the case as the day innocence vanished from the corridors of our intelligence system.\n\nEven decades later, her name evokes discomfort. One former colleague, who requested anonymity, said:\n\nWe were told never to mention her again. It was as if she had never worked there, as if she had never existed.\n\nThat culture of silence remains one of the darkest legacies of the 80s and 90s.\n\nOver the years, the story of Rashiwe Guzha slipped from the headlines but it never disappeared. In playground songs, whispered conversations, and community folklore, her name lived on as a warning: when power turns inward, no one is safe.\n\nThe few who dared to speak about her case were often met with threats or quiet visits from officials reminding them to let the past rest.\n\nYet for her family, there has been no rest. They have waited more than three decades for closure, with no body to bury, no grave to visit and no justice to comfort them.\n\nRashiwes story is not an isolated case. It sits within a broader pattern of enforced disappearances and state violence that marked Zimbabwes post-independence years from the Gukurahundi massacres to the mysterious deaths of political and civil service insiders through to Itayi Dzamara in 2015.\n\nIn all these cases, justice has been elusive. Files have gone missing, witnesses have died and official inquiries have produced little more than silence.\n\nEven in 2024, her name resurfaced not through a court ruling or police investigation, but in the Government Gazette, listing the liquidation and distribution of her estate under case number 1466/2021.This bureaucratic acknowledgment that she is legally deceased contrasts sharply with the states refusal to admit responsibility for her death.\n\nWhat really happened to Rashiwe Guzha?Who authorised her detention and why?Was she killed to protect secrets or silenced because of personal entanglements with those in power?\n\nThese questions remain unanswered. What is clear is that her disappearance was not merely the loss of one woman, but a wound on the national conscience, a reminder of what happens when institutions of power operate without accountability.\n\nAs Zimbabwe continues through periods of political and economic uncertainty, Rashiwes case is a warning and a lesson. Without truth and transparency, societies cannot heal.\n\nThe unresolved fate of Rashiwe Guzha challenges our collective integrity as a nation. It demands that we confront the uncomfortable past, that we insist on accountability from those who wield power in the shadows and that we finally give closure to families who have waited too long for justice.\n\nA country that buries truth, wrote the poet Charles Mungoshi, buries itself.\n\nZimbabwe must not let the truth about Rashiwe Guzha remain buried forever.\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi | In May 1990, a young typist named Rashiwe Guzha walked into her workplace at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/the-unsolved-death-of-rashiwe-guzha/\">Continue reading<span class=\"screen-reader-text\"> \"The Unsolved “Death” of Rashiwe Guzha\"</span></a></p>",
            "time": "20:41",
            "date": "08 Nov 2025"
        }
    ]
}