{
    "news": [
        {
            "title": "“Hwende Smuggling Mnangagwa Minerals Through Mozambique” | Kerina",
            "url": "https://www.zimeye.net/2024/12/28/hwende-smuggling-mnangagwa-minerals-through-mozambique-kerina/",
            "content": "Charlton Hwendes apparent position as a champion of the opposition belies a more sinister reality. In truth, he is an entrenched collaborator of Emmerson Dambudzo Mnangagwas regime, complicit in the plundering of Zimbabwes resources. The clandestine transportation of looted minerals across the Forbes border into Mozambique, facilitated by Hwendes trucks, constitutes a damning indictment of his culpability.\n\nThis duplicity is further underscored by Hwendes sanctimonious denounciations of the late Ian Smith, even as his ally, Mnangagwa, protects the interests of white farmers in the Midlands, thereby perpetuating the historical injustices inflicted upon Black Zimbabweans. Mnangagwas own tenure has been marred by horrifying corruption, including the expropriation of Precabe Farm from the CIO during his ministerial tenure, and the displacement of indigenous Zimbabweans in Chiredzi and Binga to benefit foreign white interests.\n\nHwendes involvement in the Gold Mafia, characterised by the sneaky smuggling of gold to Dubai and linked money laundering, serves as a stark illustration of his entrenched complicity in Zimbabwes corrupt nexus. The oppositions reliance on individuals of Hwendes ilk, who prioritise personal aggrandisement over the welfare of Zimbabweans, ensures that meaningful change will remain an ephemeral chimera.\n\nThe logical question persists: why does Hwende abstain from accountability for Mnangagwas transgressions? The response is straight forward: Hwende is tied under an obligation to the same corrupt infrastructure that sustains Mnangagwas regime. His links in gold mafia, his trucks contracted to ferry out our looted minerals to the Mozambican ports,surely Hwende sees ED as his Saviour the one that butters his bread at the expense of the masses of Zimbabweans.\n\nUltimately, Zimbabwes prospects for meaningful transformation are determined upon a paradigmatic shift in the oppositions leadership. Until Zimbabweans demand authentic, principled leadership, the nation will continue to languish under the weight of corruption and exploitation. Hwende and his cohorts must be held accountable for their actions, and a new era of transparency and accountability must be ushered in. Hwende you are the last sellout of our generation to even dare criticise those calling out Emmerson Dambudzo Mnangagwa as  worst than Ian Douglas Smith. ED might be your Boss yet to Zimbabweans he is a villain who deserve to be hanged by the pee balls.#edmustgo #sayno2to2030#cdesistermwenewazvo#kerinamujati\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Charlton Hwende’s apparent position as a champion of the opposition belies a more sinister reality. In truth, he is an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/hwende-smuggling-mnangagwa-minerals-through-mozambique-kerina/\">Continue reading<span class=\"screen-reader-text\"> \"“Hwende Smuggling Mnangagwa Minerals Through Mozambique” | Kerina\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "FRELIMO Adopts Zanu PF’s Baba Jukwa Tactics",
            "url": "https://www.zimeye.net/2024/12/28/frelimo-adopts-zanu-pfs-baba-jukwa-tactics/",
            "content": "By Munacho Mangwiro The ruling FRELIMO party in Mozambique appears to have taken a page out of ZanuPFs2013 election playbook, employing a shadowy social media figure,Unay Cambuma,to spread disinformation and sow confusion ahead of the controversial elections.\n\nThe character, reminiscent ofZimbabwesinfamous Baba Jukwa, has been using Facebook to posta mix ofpropaganda, conspiracy theories, and attacks against opposition leader Venncio Mondlane.\n\nThe posts aim to divert public attention from allegations of a rigged election and discourage mass protests, which have been growing in response to perceived electoral fraud.\n\nIn therun uptotheZimbabwes2013 elections, Zanu PF deployed the infamous Baba Jukwa, a supposed insider leaking information about the party.\n\nThe enigmatic figure used social media to captivate the public,simultaneouslyspreading disinformation and undermining opposition cohesion.\n\nThe tactic was part of a broader propaganda strategy that helped Zanu PF secure electoral victory despite widespread accusations of irregularities.\n\nZanuPFssister party, FRELIMO in Mozambique, seems to be employing a similar strategy and created Unay Cambuma, a digital provocateur, to distract the populace from electoral disputes and direct attention away from the growing calls for democracy and accountability.\n\nCambumasposts echo themes of resistance while subtly undermining opposition efforts. The ghostcharecterslatest messages include:\n\nThe posts mix half-truths with blatant propaganda to fracture opposition movements and bolsterFRELIMOsgrip on power.\n\nGiven the similarities between Unay Cambuma and Baba Jukwa, questions arise about potential collaboration between Zanu PF and FRELIMO.\n\nBoth parties share a history of leveraging propaganda and suppressing dissent to maintain power, and theexportation of ZanuPFsdisinformation model could be a strategic move to fortifyFRELIMOsregime.\n\nMozambiquespolitical analysts warn that such tactics could further destabilise the country, undermining democratic processes and entrenching authoritarianism.\n\nAs Mozambique faces mounting political tension,the influence of digital propaganda campaigns like Unay Cambuma cannot be underestimated.\n\nThe international community and local activists must remain vigilant, countering disinformation and advocating for electoral transparency to uphold democracy in the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Mangwiro – The ruling FRELIMO party in Mozambique appears to have taken a page out of Zanu PF’s 2013 election playbook, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/frelimo-adopts-zanu-pfs-baba-jukwa-tactics/\">Continue reading<span class=\"screen-reader-text\"> \"FRELIMO Adopts Zanu PF’s Baba Jukwa Tactics\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Three Caught With 150 ED Fertilizer Bags",
            "url": "https://www.zimeye.net/2024/12/28/three-caught-with-150-ed-fertilizer-bags/",
            "content": "BulawayoAn anti-corruption task force has uncovered 150 bags of fertilizer and seeds from the Presidential Inputs Scheme hidden in a house in Queensdale Suburb, Bulawayo.\n\nTheinputs,meant to support struggling farmers, were allegedlybeingsold on the black market in a scandal that underscores long-standing abuses of the agricultural support initiative.\n\nThebust,carried out on December 27, 2024, followed a tip-off to the National Anti-Smuggling Task Force.\n\nUpon raiding No. 15 Connolly Road in Queensdale, officers discovered the fertilizer, typically distributed under the Presidential Inputs Scheme to boost small-scale farming, concealed in the residence.\n\nA source within the task force revealed:\n\nWe were expecting to find smuggled goods but instead found large quantities of fertilizer resembling those from the Presidential Inputs Scheme.\n\nThe house owner, Wallace Mapiye (40), deniedanyconnection to the stolen inputs and implicated Edgar Bhiri (28) of Njube.\n\nBhiri,intercepted en route to a church in Emganwini, confessed to delivering the fertilizer to Mapiye and claimed to have sourced it from Tawanda Sibanda (56) of Mpopoma.\n\nSibanda,whowaslater apprehendedat his residence, revealed that the goods hadbeen suppliedby a woman known only as Yvonne, an agricultural extension officer.\n\nAccording to Sibanda, Yvonne provided himwith150 bags of 50kg compound D fertilizer and instructed him to sell them, sharing the proceeds among those involved.\n\nThe Presidential Inputs Scheme, designed to empower Zimbabwes farmers with free seeds and fertilizer, has often been dogged by allegations of corruption.\n\nReports of Zanu PF politicians,middlemen, and extension officers misappropriating inputs to enrich themselvesare frequent, underminingthe programs intent anddeprivingthousands of farmers.\n\nIn this case, all three suspectsMapiye, Bhiri, and Sibandahave been detainedandthe casereferredto the police anti-corruption unit for further investigation.\n\nThis discovery highlights the ongoing need for stringent oversight to prevent similar abuses.\n\nThe anti-corruption task force has pledged to trace thefullnetwork behind this operation as authorities continue their investigations.\n\nSource: CITE\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo – An anti-corruption task force has uncovered 150 bags of fertilizer and seeds from the Presidential Inputs Scheme hidden in a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/three-caught-with-150-ed-fertilizer-bags/\">Continue reading<span class=\"screen-reader-text\"> \"Three Caught With 150 ED Fertilizer Bags \"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Venâncio Mondlane: A Revolução Digital Contra Ditaduras e a Luta pela Libertação de Moçambique",
            "url": "https://www.zimeye.net/2024/12/28/venancio-mondlane-a-revolucao-digital-contra-ditaduras-e-a-luta-pela-libertacao-de-mocambique/",
            "content": "RESUMO DA LIVE DO UNAY CAMBUMA\n\n1- O que Venncio Mondlane est fazer, vai ficar na histria do mundo. Como o primeiro homem civil do planeta a derrotar uma ditadura militarizada, sem estar presente no pas, apenas utilizando telefone e internet.\n\n2- Pases do ocidente no ajudam Venncio Mondlane porque no precisam dele, precisam de Nyusi e Chapo, para defender seus interesses, por isso no ajudam Venncio Mondlane\n\n3- No se enganem com as naes unidas, esto todos corrompidos\n\n4- Venncio Mondlane no est apenas lutando com a FRELIMO, est tambm destruindo o colono preto em Moambique.\n\n5- Se Venncio Mondlane destru a FRELIMO, vai mostrar para a frica que  possvel destru ditaduras em frica\n\n6-A unio europeia, SADC, e outras instituies no ajudam Venncio Mondlane porque ele  um lider libertador, eles querem lderes poltica para defenderam seus interesses.\n\n7-As Manifestaes s vo doer para a FRELIMO quando visitarem suas residncias e edifcios.\n\n8- No existe verdade eleitoral, devemos arrancar o poder das mos da FRELIMO.\n\n9- Militarmente o VM7 no tem como vencer a FRELIMO, mas ele tem um poder que  mais forte do que qualquer arma do mundo, que  a unio do povo.\n\n10- No precisamos de internacionais para banir a FRELIMO, nos mesmo podemos banir a FRELIMO, s precisamos colocar VM7 no poder.\n\n11-A luta estava quase no fim, mas ns distramos com politiquises.\n\n12- No existem homens catanas  tudo distrao, o nosso foco deve ser a ponta vermelha.\n\n11- A FRELIMO est varrer as ruas para fazer o mundo pensar que est tudo bem em Moambique.\n\n12- A FRELIMO  manipulador e rei da propaganda enganosa em Moambique.\n\n13- Para ir a ponta vermelha, no devemos ser 100, 1000 ou mesmo 5000. Devemos ser milhes e simultaneamente, outras visitam as televises corrompidas pela FRELIMO, a CC, CNE, Tribunais e aeroportos, para que ningum fuja do pas.\n\n14- No vamos perder tempo com pessoas vestidas roupas da FRELIMO, devemos nos foca\n\nUNAY CAMBUMA LIVE SUMMARY 1- What Venncio Mondlane is doing will go down in world history. As the first civilian man on the planet to defeat a militarized dictatorship, without being present in the country, just using the telephone and internet.\n\n2- Western countries dont help Venncio Mondlane because they dont need him, they need Nyusi and Chapo, to defend their interests, thats why they dont help Venncio Mondlane.\n\n3- Dont be fooled by the united nations, they are all corrupt\n\n4- Venncio Mondlane is not only fighting with FRELIMO, he is also destroying the black settlers in Mozambique.\n\n5- If Venncio Mondlane destroyed FRELIMO, he will show Africa that it is possible to destroy dictatorships in Africa\n\n6-The European Union, SADC, and other institutions do not help Venncio Mondlane because he is a liberating leader, they want political leaders to defend their interests.\n\n7-The Demonstrations will only hurt FRELIMO when they visit their homes and buildings.\n\n8- There is no electoral truth, we must wrest power from the hands of FRELIMO.\n\n9- Militarily, VM7 cannot defeat FRELIMO, but it has a power that is stronger than any weapon in the world, which is the unity of the people.\n\n10- We dont need internationals to ban FRELIMO, we can ban FRELIMO ourselves, we just need to put VM7 in power.\n\n11-The fight was almost over, but we distracted it with politics.\n\n12- There are no machete men, its all a distraction, our focus should be on the red tip.\n\n11- FRELIMO is sweeping the streets to make the world think that everything is fine in Mozambique.\n\n12- FRELIMO is a manipulator and king of false propaganda in Mozambique.\n\n13- To go to the red tip, we must not be 100, 1000 or even 5000. We must be millions and simultaneously, others visit the televisions corrupted by FRELIMO, the CC, CNE, Courts and airports, so that no one flees the country.\n\n14- Lets not waste time with people dressed in FRELIMO clothes, we should focus\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "RESUMO DA LIVE DO UNAY CAMBUMA 1- O que Venâncio Mondlane está fazer, vai ficar na história do mundo. Como … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/venancio-mondlane-a-revolucao-digital-contra-ditaduras-e-a-luta-pela-libertacao-de-mocambique/\">Continue reading<span class=\"screen-reader-text\"> \"Venâncio Mondlane: A Revolução Digital Contra Ditaduras e a Luta pela Libertação de Moçambique\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Madam Boss, Jerdan In Hot Soup Over “GetAway!” Song Plagiarism |",
            "url": "https://www.zimeye.net/2024/12/28/madam-boss-jerdan-in-hot-soup-over-getaway-song-plagiarism/",
            "content": "Statement from Ronald Ngulubes Management\n\nIn 2016, Ronald Ngulube wrote and recorded the song Getaway at Diamond Studios, then located in Ashdown Park, under the production of Isaac. Ronald is the sole and rightful owner of Getaway, including every lyrical and creative element of the song. The song was officially launched on 31 December 2016 during the Heartfelt International Ministries March overnight event, a performance that remains available on YouTube.\n\nIn 2020, Ronald discovered Getaway online, falsely attributed to an artist named Jerdan Paradise. Despite approaching him to address the matter, Jerdan denied Ronalds ownership and insisted the song was his.\n\nThis year, without Ronalds consent, Jerdan Paradise re-recorded Getaway with Denzel and Madam Boss. On 14 December 2024, upon seeing the song online again, Ronald reached out to Jerdan, who once more claimed ownership, even posting on Facebook that the song was his. The post was later edited to remove the word written after public backlash, but the initial claim remains unacceptable.\n\nFollowing public outcry, the YouTube description of the song was updated to acknowledge Ronald Ngulube as the writer. However, no agreement, past or present, was ever made for the song to be recorded, distributed, or altered by Jerdan Paradise or any other party.\n\nThis behavior is a blatant violation of copyright laws and a disregard for ethical standards in the creative industry. Ronald Ngulubes management is deeply disappointed by such conduct and is exploring all legal options to address this infringement and protect Ronalds intellectual property.\n\nWe also formally demand the immediate removal of Getaway from all platforms where it has been unlawfully published or distributed.\n\nWe urge all stakeholders in the music and arts industry to respect copyright laws and uphold the values of integrity and creativity. Such actions not only undermine artists hard work but also erode trust within the artistic community.\n\nRonald Ngulube Management\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Statement from Ronald Ngulube’s Management In 2016, Ronald Ngulube wrote and recorded the song “Getaway” at Diamond Studios, then located … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/madam-boss-jerdan-in-hot-soup-over-getaway-song-plagiarism/\">Continue reading<span class=\"screen-reader-text\"> \"Madam Boss, Jerdan In Hot Soup Over “GetAway!” Song Plagiarism |\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Nyasa Big Bullets Chase Away Kalisto Pasuwa",
            "url": "https://www.zimeye.net/2024/12/28/nyasa-big-bullets-chase-away-kalisto-pasuwa/",
            "content": "Sports Correspondent\n\nKalisto Pasuwa will depart from Nyasa Big Bullets after six years as the head coach of the Malawian football powerhouse.\n\nThe club has decided not to renew Pasuwas contract, which expires on 31 December.\n\nThe Zimbabwean coach was informed of the decision last month.\n\nThis development follows a challenging 2024 season for Pasuwa, as he struggled to replicate the success of the previous year. In 2023, Bullets triumphed in all four domestic competitions, including securing their fifth consecutive league title. However, they faced difficulties this season, failing to defend three of those trophies.\n\nPasuwas Malawian agent, Felix Ngamanya Sapao, confirmed the news to The Times newspaper, stating:\n\nHe is indeed not renewing his contract with Bullets, and there is official correspondence regarding that decision from last Thursday. However, he has not yet committed to any other team.\n\nCurrently in Zimbabwe for the holidays, Pasuwa has been linked with a potential move to coach the Malawi national team, the Flames.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kalisto Pasuwa will depart from Nyasa Big Bullets after six years as the head coach of the Malawian … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/nyasa-big-bullets-chase-away-kalisto-pasuwa/\">Continue reading<span class=\"screen-reader-text\"> \"Nyasa Big Bullets Chase Away Kalisto Pasuwa\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "47 People Brutally Killed During Christmas Period",
            "url": "https://www.zimeye.net/2024/12/28/47-people-brutally-killed-during-christmas-period/",
            "content": "By A Correspondent\n\nA staggering 47 people lost their lives to murder between December 20 and 26, 2024, according to a statement by the Zimbabwe Republic Police (ZRP). This alarming rise in murder cases has prompted the ZRP to sound the alarm and call for collective action to restore peace and safety in communities.\n\nThe ZRP attributed the murders to various factors, including disputes at beer drinking places, family disputes and arguments at sporting events . This surge in violence is a concerning trend, highlighting the need for increased efforts to promote peaceful conflict resolution and community safety.\n\nThe police statement urged citizens to work together to restore peace and safety in our communities.\n\nThis call to action emphasizes the importance of collective responsibility in addressing the root causes of violence and promoting a safer, more harmonious society.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A staggering 47 people lost their lives to murder between December 20 and 26, 2024, according to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/47-people-brutally-killed-during-christmas-period/\">Continue reading<span class=\"screen-reader-text\"> \"47 People Brutally Killed During Christmas Period\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Zivhu Defends Nelson Chamisa, Calls for an End to Unnecessary Criticism",
            "url": "https://www.zimeye.net/2024/12/28/zivhu-defends-nelson-chamisa-calls-for-an-end-to-unnecessary-criticism/",
            "content": "By A Correspondent\n\nProminent Zanu PF official, Killer Zivhu, has strongly criticized critics who continue to blame opposition leader Advocate Nelson Chamisa for every issue, urging them to stop unfairly targeting him.\n\nIn a recent post on X (formerly Twitter), Zivhu expressed his frustration with the constant attacks on Chamisa, who has been a frequent subject of criticism from both political opponents and media alike.\n\nZivhu stated: Lets give this young man a break! Hes been criticized for having no plan, no party, being clueless, arrogant, & a dictator.\n\nHe went on to highlight the irony of the situation, saying that now, despite all the criticisms, people still expect Chamisa to comment on every post made on X. Zivhu added:\n\nNow, people want him to comment on every post on X? Let him enjoy his life in peace in his own country! #LetHimBe\n\nThe call for Chamisa to be left in peace comes amidst a polarized political environment, where the opposition leader often finds himself at the center of intense scrutiny. Zivhus remarks are a strong pushback against those who continue to target Chamisa, especially after the contentious 2023 general elections.\n\nZivhu, known for his bold statements and unwavering support for the ruling party, has sparked debate with his public defense of Chamisa, urging a more balanced approach to the political discourse in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Prominent Zanu PF official, Killer Zivhu, has strongly criticized critics who continue to blame opposition leader Advocate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/zivhu-defends-nelson-chamisa-calls-for-an-end-to-unnecessary-criticism/\">Continue reading<span class=\"screen-reader-text\"> \"Zivhu Defends Nelson Chamisa, Calls for an End to Unnecessary Criticism\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Mnangagwa Must Rule For Life : Zivhu",
            "url": "https://www.zimeye.net/2024/12/28/mnangagwa-must-rule-for-life-zivhu/",
            "content": "By A Correspondent\n\nControversial Zanu PF official Killer Zivhu has once again made headlines with a dramatic shift in his political stance, declaring that President Emmerson Mnangagwa should rule Zimbabwe for life.\n\nIn a statement made on Friday, Zivhu expressed strong support for Mnangagwa, saying: Now that the tide is turning, Im changing my stance  ED should rule for life! With a parliamentary majority, an amendment to extend his term is imminent. Im leading the #EDForLife campaign.\n\nZivhus comments signal a significant escalation in his backing of Mnangagwa, with the Zanu PF official suggesting that a constitutional amendment to extend the Presidents term is now inevitable due to the partys strong position in Parliament.\n\nIn addition to his remarks on Mnangagwas future, Zivhu also directed harsh criticism at white Zimbabweans, accusing them of being traitors.\n\nHe said: Whilst you wait for Smiths return, Zimbabwe ndeyeropa musazofarisa vatengesi imwi. (Translation: While you wait for Smiths return, Zimbabwe is for the people, dont fool yourselves, traders.)\n\nZivhu angrily charged:Vanoti Smith wanga akanaka vose muri ngochani dzavanhu, moda kurohwa if not kupondewa, mazipenzi avanhu, moda kudzingwa mu Nyika, moda kutorerwa make passport mose, vanhu vakaurayiwa kunge shiri na Smith, mazikava avanhu , hamuna moyo imi.(everyone who says Smith was better than the current government is a fool.You are heartless foxes).\n\nZivhus statements have drawn attention for their boldness, as they highlight not only his unwavering support for Mnangagwa but also his ongoing hostility towards the countrys white community, which has been a point of contention in Zimbabwean politics for years.\n\nHis calls for an amendment to extend Mnangagwas presidency also add fuel to the debate about the future of Zimbabwes political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF official Killer Zivhu has once again made headlines with a dramatic shift in his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/mnangagwa-must-rule-for-life-zivhu/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Must Rule For Life : Zivhu\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Mnangagwa, Auxillia In Serious Message Inconsistencies",
            "url": "https://www.zimeye.net/2024/12/28/mnangagwa-auxillia-in-serious-message-inconsistencies/",
            "content": "ByLifestyle Reporter-President Emmerson Mnangagwas eating habits have ignited heated debate following a candid revelation by First Lady Auxillia Mnangagwa during an interview on the Zimbabwe Broadcasting Corporation (ZBC).\n\nThe First Lady disclosed that Mnangagwa insists on having meat with every meal and is fond of dried kapenta fish (matemba) paired with milk.\n\nThis disclosure comes as a surprise to many, considering Mnangagwas 2022 public declaration encouraging Zimbabweans to embrace plant-based diets for health reasons.\n\nAt the time, he dubbed meat consumption unhealthy and lauded vegetables and potatoes as a healthier alternative.\n\nGovernment spokesperson Nick Mangwana amplified the First Ladys comments on X (formerly Twitter), writing, When the @ZimFirstLady was asked about the Presidents favorite food, she said there must be some meat somewhere among the dishes, but what he likes most are matemba nemukaka. On the streets, we call that keeping it real.\n\nThe revelation has drawn mixed reactions:\n\nOne Louis Muronda: Even Mugabe ainzi baba venyu havana kana mari ava vanoda simple food.Samuel Huni, recalled: Vamwe vachiti Zondo.Tich Gotwe Gwindi remembered: Paye makamboti zondo nemasese makamboti mirivo nemapotato.Vadye Mbutu asked: Mapotatoes akasiya hre kkk?.\n\nThis contrast between Mnangagwas personal preferences and his earlier health advice has reignited public discourse about the authenticity of his lifestyle recommendations.\n\nWhile the First Ladys remarks offer a relatable glimpse into the Presidents affinity for traditional Zimbabwean cuisine, they also expose inconsistencies in his public messaging.\n\nAdding to the intrigue is Mnangagwas reputation for indulgence, which includes occasional allegations of whisky-fueled antics.\n\nThese contradictions between his dietary habits, his past public health narrative, and perceptions of excessive behaviour raise questions about the Presidents alignment with the values he projects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Lifestyle Reporter-President Emmerson Mnangagwa’s eating habits have ignited heated debate following a candid revelation by First Lady Auxillia Mnangagwa during … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/mnangagwa-auxillia-in-serious-message-inconsistencies/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa, Auxillia In Serious Message Inconsistencies\"</span></a></p>",
            "time": "20:32",
            "date": "28 Dec 2024"
        }
    ]
}