{
    "news": [
        {
            "title": "Blessed Geza Full Friday day Speech In English",
            "url": "https://www.zimeye.net/2025/05/16/blessed-geza-full-friday-day-speech-in-english/",
            "content": "I do not see Geza's project I see an escalation, says@ZondoNZto@Pachisolife@HotseatEmpirehttps://t.co/wD3jTdNajd\n\nI have come to speak about General Chiwenga, says @BlessedGeza\n\nHe continues saying:We all know what happened in 2017, when President Robert Mugabe when he had become surrounded by thieves. The operation ran by Gen Chiwenga we all know it. If I remember well, Gen Chiwenga placated the constitution and said when the military find the constitution hlis under attack they have powers to enter in and fix things. The person aside him is Gen SB Moyo. I remember the words of Gen SB Moyo said we are not entering to do anything else other than addressing thieves surrounding the president. What shocks me is that this one whos ruling now who had ran away to SA. We remember very well the words of President Mugabe who said Chiwenga I decided to handover to you. This person you want to take over youll cry over him one day. Gen Chiwenga did not listen. Gen Chiwenga brought back Emmerson Mnangagwa so the problems we are now seeing in the country are because of the decision by the generals led by Chiwenga. So for that reason we say the persons to fix this are the Generals and General Chiwenga. I said Cde Bombshell and the people are saying please remove this person you imposed.Chiwenga and the generals know a war time song called Nzira dzemaSoja dzekuzvibatana nadzo. This song is the guiding light out contract with the masses, so the things in this song are the manual. When we when to the way we found Chiwenga teaching us this song. We say Gen Chiwenga the povo needs you to lead us. We are seeing that in the case of Zvigananda they took army companies without paying penny. They took command agriculture money they did not repay. He seized the national pipeline and did not pay a penny. This isnt the way of the soldiers we will be seeing this happening. When we see the issue of prisoners they need to be handled well. We have people like Sikhala the Ngarivhumes, Blessed Mhlangas; the protesters arrested for demonstrating deserve their rights. We have boys whore rotting in jail whats their crime? But we hear their crime they were together because the money went into Emmersons bank account. So why are you oppressing these boys? Why are you denying them bag them bail. This needs fixing. We are seeing that these things happening in Chiwengas eyes in Gen Sanyatwes eyes the povo has cried, please redeem us, we beg you. The problem of Emmerson and his Zviganandas, we see that he is now an invalid- theres what we call state capture. If we see in SAthis is what messed Comrade Jacob Zuma.\n\nWe see that with Mugabe the allegation was state power was sexually transmitted. This time its no longer an allegation. Its a fact.\n\nGenerals you have let us down Why is it that Gen Chiwenga youre failing to give orders to Mutamba to arrest Zviganandas? We are here stuck in the Bush and yet no one seems to care.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I have come to speak about General Chiwenga, says @BlessedGeza He continues saying:We all know what happened in 2017, when … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/blessed-geza-full-friday-day-speech-in-english/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza Full Friday day Speech In English\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Watch: Geza Appeals To General Chiwenga To Rescue Nation From Mnangagwa And Zvigananda Misrule…",
            "url": "https://www.zimeye.net/2025/05/16/watch-geza-appeals-to-general-chiwenga-to-rescue-nation-from-mnangagwa-and-zvigananda-misrule/",
            "content": "War veteran Blessed Geza appeals to General Chiwenga to rescue national from Zvigananda led by Mr Emmerson Mnangagwa\n\nWatch : Blessed Geza drops bombshell\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "War veteran Blessed Geza appeals to General Chiwenga to rescue national from Zvigananda led by Mr Emmerson Mnangagwa… Watch : … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/watch-geza-appeals-to-general-chiwenga-to-rescue-nation-from-mnangagwa-and-zvigananda-misrule/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Geza Appeals To General Chiwenga To Rescue Nation From Mnangagwa And Zvigananda Misrule…\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "ZIMRA Targets Mbinga",
            "url": "https://www.zimeye.net/2025/05/16/zimra-targets-mbinga/",
            "content": "By Political Reporter-The Zimbabwe Revenue Authority (ZIMRA) has launched a renewed campaign targeting social media influencers, musicians, celebrities, and politicians flaunting extravagant lifestyles.\n\nZIMRA insiders revealed that the tax authority is actively monitoring individuals who live lavishly to assess whether their declared income matches their visible wealth. The move comes amid growing public outcry over unchecked corruption and ostentatious displays of wealth by politically connected elites.\n\nChivayo, a controversial businessman with deep ties to the ruling ZANU PF party, was recently flagged by South African financial authorities for suspicious transactions involving millions of dollars. Despite a criminal conviction for fraud and years of public backlash over questionable government contracts, Chivayo continues to flaunt wealth on social mediaoften posing with luxury cars, designer clothes, and large cash payments.\n\nAnalysts said ZIMRAs credibility hinges on whether its lifestyle audits will go beyond low-hanging targets like musicians and YouTubers, and instead tackle politically shielded figures such as Chivayo.\n\nSources within ZIMRA said the authority is relying on open-source intelligence, including social media posts and appearances at high-profile events, to build profiles and trigger tax compliance checks.\n\nWe are not just watching celebrities; anyone whose lifestyle appears out of sync with their declared income is of interest, a senior ZIMRA source said.\n\nZIMRAs marketing and corporate affairs executive, Gladman Njanji, confirmed the lifestyle audit blitz, describing it as part of the authoritys long-standing mandate.\n\nZIMRA, as part of its established procedures, regularly conducts lifestyle auditsa practice that is not new, Njanji said.\n\nAdditionally, ZIMRA utilises various social media platforms, including Twitter and Facebook, as well as traditional media like newspapers, to gather information that is essential for fulfilling its mandate in revenue collection and tax administration.\n\nCritics remain sceptical, warning that the audits risk becoming selective and performative if politically exposed persons are not held to the same standards as ordinary citizens.\n\nTargeting musicians while turning a blind eye to people like Chivayo would only confirm what many Zimbabweans already believethat the law does not apply equally, said one observer.\n\nAs Zimbabwe reels from economic hardship and a widening wealth gap, many are watching closely to see if ZIMRAs latest campaign will finally pierce the veil of political protection shielding the countrys untouchables.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-The Zimbabwe Revenue Authority (ZIMRA) has launched a renewed campaign targeting social media influencers, musicians, celebrities, and politicians … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/zimra-targets-mbinga/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA Targets Mbinga\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Mhangura Hospital Bombed Underneath by Chinese Miners",
            "url": "https://www.zimeye.net/2025/05/16/mhangura-hospital-bombed-underneath-by-chinese-miners/",
            "content": "Mhangura, Zimbabwe  16 May 2025\n\nA major infrastructure crisis has hit Mhangura Hospital after violent underground blasting carried out by suspected Chinese mining contractors late last night caused widespread structural damage to the facility. The powerful explosions, reportedly executed in the mountains adjacent to the hospital compound, resulted in deep cracks throughout the hospital wards  sparking fears that the entire building may now be on the verge of collapse.\n\nImages taken from inside the hospital show alarming scenes of large vertical and horizontal cracks snaking through ward walls, support pillars, ceilings, and entrances. Sections of the brick structure have visibly dislodged, with some parts of the ceiling beginning to separate from the walls. In one image, a hospital visitor can be seen pointing to a gaping crack threatening a critical beam.\n\nAccording to eyewitness reports, residents felt tremors late in the night as blasting shook the ground beneath the town. Within hours, damage to the hospital infrastructure became evident.\n\nThe whole hospital trembled. Patients panicked, and cracks appeared almost instantly. Some rooms are no longer safe, said one community member present at the scene.\n\nA local councillor told ZimEye, the miner has been doing open shaft mining which is illegal.\n\nA local WhatsApp group captured the unfolding concern. Messages from users including Gen Ghoghie confirmed that a team, including local councillors, visited the site early in the morning to assess the extent of the damage. The group confirmed that residents were demanding an immediate stop to the mining activity, citing safety concerns.\n\nLegal voices in the chat pointed to Statutory Instrument 109 of 1990, which explicitly prohibits mining operations within a 500-meter radius of public infrastructure such as hospitals and schools. This blasting is not just irresponsible  its illegal, one message stated. Concerns were also raised over the lack of an Environmental Impact Assessment (EIA), further suggesting that the operation may have proceeded without proper regulatory approval.\n\nThis is a health facility, not a war zone, another resident exclaimed during a community meeting. Theyre trading lives for minerals.\n\nAuthorities are now under mounting pressure to immediately halt all blasting operations and declare the hospital building a protected zone. Calls have also been made for the Ministry of Mines and Mining Development to launch an investigation, and for the police to issue a temporary work stoppage while assessments are carried out.\n\nThere is no word yet from the Ministry of Health on whether the hospital will be evacuated or if emergency renovations will be funded. However, activists are demanding urgent intervention to prevent what they describe as an avoidable disaster in the making.\n\nZimEye will continue to monitor this developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mhangura, Zimbabwe – 16 May 2025 A major infrastructure crisis has hit Mhangura Hospital after violent underground blasting carried out … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/mhangura-hospital-bombed-underneath-by-chinese-miners/\">Continue reading<span class=\"screen-reader-text\"> \"Mhangura Hospital Bombed Underneath by Chinese Miners\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Zanu PF Veteran Dies In Uk",
            "url": "https://www.zimeye.net/2025/05/16/zanu-pf-veteran-dies-in-uk/",
            "content": "London Veteran Zanu PF cadre John Takaendesa Ushe has died.\n\nUshe passed away on May 6 in London after a long illness.\n\nThe Zanu PF UK District has written to the party leadership requesting that he be accorded national hero status.\n\nUshe is widely regarded as the longest-serving employee across all of Zimbabwes diplomatic missions, having worked at the Zimbabwe Embassy in the UK from 1980.\n\nHe joined the Zanu PF London Branch in the mid-1970s and served underthen Chief Representative,Ambassador Frederick Shava.\n\nHe played a key role in supporting Zimbabwes liberation struggle from abroad through resource mobilisation efforts across the UK and Europe, working alongside Dr Simba Makoni, who was then responsible for party affairs in Western Europe.\n\nIn 1979, Ushe served the party during the Lancaster House Conference, which led to Zimbabwes independence. When the Zimbabwe House Embassy at The Strand in London was officially opened in late 1981 under the first High Commissioner, Robert Zwinoira, Ushe was entrusted with its security and caretaking.\n\nHe worked at the embassy for 44 years in an official capacity and an additional year as its custodian before its formalopeningmarking 45 years of service to the nation.\n\nZanu PF UK District chairman Xavier Zavare confirmed the death, describing Ushe as arguably the longest-serving employee ever across all Zimbabwean Missions worldwide.\n\nEvery Ambassador and Government official who worked in London had their induction to Zimbabwe House and UK life from him, Zavare said.\n\nUshe remained active within the Zanu PF UK District, advising members and promoting the partys values and ideology.\n\nIn 2012, he was instrumental in reviving Zanu PF party structures in the UK, drawing from his experience during the liberation struggle.\n\nBorn on September 17, 1945, in Chivhu, Mashonaland East, Ushe attended Tegwani School before migrating to Europe in the early 1970s for further education.\n\nHe briefly settled in the Netherlands and studied at Argo University,during which timehe was recruited into Zanu PF.\n\nHe later moved to the United Kingdom, where he joined cadres such as Ambassador Shava and continued supporting the liberation movement while pursuing a Higher National Diploma in Electrical Engineering at Northeast London Polytechnic.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "London – Veteran Zanu PF cadre John Takaendesa Ushe has died. Ushe passed away on May 6 in London after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/zanu-pf-veteran-dies-in-uk/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Veteran Dies In Uk\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Blessed Geza Returns Tonight",
            "url": "https://www.zimeye.net/2025/05/16/blessed-geza-returns-tonight/",
            "content": "Blessed Geza returns tonight to speak specifically about Gen Constantino Chiwenga.Zimbabweans are to be treated to the insides of what the countrys favourite war veteran has to sayhttps://t.co/fZ1etTfmEfpic.twitter.com/rF1jiGLn1S\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Blessed Geza returns tonight to speak specifically about Gen Constantino Chiwenga. Zimbabweans are to be treated to the insides of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/blessed-geza-returns-tonight/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza Returns Tonight\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Winky D Promises Fireworks as Masvingo Gears Up for ‘The Undisputed Show’",
            "url": "https://www.zimeye.net/2025/05/16/winky-d-promises-fireworks-as-masvingo-gears-up-for-the-undisputed-show/",
            "content": "By A Correspondent\n\nMusic lovers in Masvingo are counting down the hours to what promises to be one of the most electrifying nights of the year. Zimbabwean Dancehall heavyweight Winky D is set to perform live this Saturday, May 17, at the iconic Caravan Park under the banner of his highly anticipated concert,The Undisputed.\n\nWinky D, affectionately known as the Gafa, is expected to deliver a powerhouse performance that will shake the winter cold off the city. Taking to his official Facebook page to address his fans, the award-winning artist declared,Hello Masvingo, winter is here but do not fear because on the 17th of May I will be there.\n\nFans are eagerly preparing for a night of high-energy entertainment, with thousands expected to gather to witness Winky Ds signature blend of socially conscious lyrics, infectious rhythms, and charismatic stage presence.\n\nJoining him on the lineup are some of Zimbabwes rising stars: Bling4, Oriyano, and Chillmaster. Their inclusion is set to provide a rich and dynamic prelude to the main act, makingThe Undisputeda true celebration of Dancehall culture.\n\nOrganizers have promised a night filled with unforgettable energy and unity through music. With the buzz already building across social media and the city streets, its clear that this is more than just a concertits a cultural event.\n\nAs temperatures dip, Masvingo is preparing to turn up the heatand all eyes will be on Caravan Park as Winky D brings the fire.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Music lovers in Masvingo are counting down the hours to what promises to be one of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/winky-d-promises-fireworks-as-masvingo-gears-up-for-the-undisputed-show/\">Continue reading<span class=\"screen-reader-text\"> \"Winky D Promises Fireworks as Masvingo Gears Up for ‘The Undisputed Show’\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Heartbreak for Zimbabwe as Young Mighty Warriors Fall to Zambia in COSAFA U17 Semifinal",
            "url": "https://www.zimeye.net/2025/05/16/heartbreak-for-zimbabwe-as-young-mighty-warriors-fall-to-zambia-in-cosafa-u17-semifinal/",
            "content": "Sports Correspondent\n\nThe Young Mighty Warriors journey in the COSAFA U17 Girls Championship came to a disappointing end after a crushing 5-1 defeat to Zambia in the semifinal on Friday.\n\nDespite entering the match with high hopes, Zimbabwe struggled to contain a dominant Zambian side that showed superior pace, coordination, and finishing throughout the game.\n\nFrom the opening whistle, Zambia applied relentless pressure and quickly took control of the midfield.\n\nAlthough the Young Mighty Warriors managed to pull one back in the second half, it was little more than a consolation goal as Zambia continued to dominate and added more goals to seal their place in the final.\n\nZimbabwes campaign had shown promise, with earlier matches highlighting their potential and fighting spirit, but the semifinal exposed defensive vulnerabilities and lack of composure under pressure.\n\nThe defeat means Zimbabwe will now compete for third place as Zambia advances to the final with confidence and momentum.\n\nCoaches and supporters alike will be looking for the team to regroup and finish the tournament on a high note, using the experience as a building block for future development in womens football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Young Mighty Warriors’ journey in the COSAFA U17 Girls Championship came to a disappointing end after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/heartbreak-for-zimbabwe-as-young-mighty-warriors-fall-to-zambia-in-cosafa-u17-semifinal/\">Continue reading<span class=\"screen-reader-text\"> \"Heartbreak for Zimbabwe as Young Mighty Warriors Fall to Zambia in COSAFA U17 Semifinal\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Barcelona Win La Liga Title",
            "url": "https://www.zimeye.net/2025/05/16/barcelona-win-la-liga-title/",
            "content": "Sports Correspondent\n\nFC Barcelona clinched the La Liga title in emphatic fashion last night with a commanding 2-0 victory over city rivals Espanyol, sealing a triumphant end to their league campaign.\n\nTeen sensation Lamine Yamal opened the scoring with a spectacular curling effort, while Fermin Lopez added a decisive second to put the match  and the title  beyond doubt. The win capped off a season of consistent excellence under head coach Hansi Flick, who has transformed the club in his debut year.\n\nFlick, who took over amid skepticism after a rocky period with the German national team, has quickly silenced critics. His leadership has restored discipline, unity, and a clear tactical identity  all key elements in Barcelonas return to domestic dominance.\n\nIn the aftermath of the title win, club president Joan Laporta confirmed plans to extend Flicks contract through 2027, citing the coachs profound impact on the squad. Speaking to Mundo Deportivo, Laporta praised Flicks influence, saying:Were very happy with the work Hansi is doing. Hes managed to turn things around and restore the teams competitive spirit.\n\nLaporta further credited Flick as a central figure in the teams success:He has rigor, discipline, mental strength, special sensitivity hes made everyone feel important. Hes one of the keys to the seasons success.\n\nWith the league title secured and a bright future ahead, Barcelona now look to build on their momentum as they prepare for next season under Flicks continued guidance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent FC Barcelona clinched the La Liga title in emphatic fashion last night with a commanding 2-0 victory over … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/barcelona-win-la-liga-title/\">Continue reading<span class=\"screen-reader-text\"> \"Barcelona Win La Liga Title\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        },
        {
            "title": "Watchdog Exposes Alarming Abuse Of Human Rights By Mnangagwa Regime…",
            "url": "https://www.zimeye.net/2025/05/16/watchdog-exposes-alarming-abuse-of-human-rights-by-mnangagwa-regime/",
            "content": "By A Correspondent\n\nThe Mnangagwa administration has come under renewed scrutiny following the release of a damning report by the Zimbabwe Peace Project (ZPP), which highlights the ruling Zanu PF and state security agencies as leading perpetrators of human rights abuses in April 2025.\n\nAccording to the ZPPs latest data, Zanu PF is responsible for 34.1% of all recorded human rights violations, making the party the biggest offender last month. The abuses include harassment, political intimidation, and violence, particularly targeting perceived opposition supporters.\n\nAnalysis of the data indicates that individuals affiliated with the ruling party, Zanu PF, were responsible for 34.1% of the reported violations, the report states.\n\nThe Zimbabwe Republic Police (ZRP) followed closely, allegedly committing 24.1% of the violations, while local authorities accounted for 15.64%. The Zimbabwe National Army (ZNA) and government officials were also implicated, responsible for 6.41% and 4.62% of reported abuses respectively.\n\nThese figures expose a systemic pattern of repression carried out by both political and state actors, a ZPP spokesperson said. Its a coordinated assault on civil liberties, especially in provinces considered hostile to the ruling elite.\n\nMasvingo Province recorded the highest number of violations with 20 cases, trailed by Harare with 14, indicating a troubling consistency with Marchs trends.\n\nThe findings directly challenge the governments ongoing narrative of democratic progress and rights reform. While President Mnangagwas administration often touts itself as a reformist regime, human rights defenders say the evidence paints a starkly different reality.\n\nThis report is not just a statistical snapshot; its a national alarm bell, said one rights advocate.\n\nThere can be no meaningful reform while abuses like these go unpunished.\n\nWith the country inching closer to more by-elections and a politically sensitive season ahead, the report underscores the urgent need for independent oversight and accountability mechanisms.\n\nThe international community cannot afford to look away, the advocate added.\n\nThe people of Zimbabwe deserve protectionnot persecution.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Mnangagwa administration has come under renewed scrutiny following the release of a damning report by the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/16/watchdog-exposes-alarming-abuse-of-human-rights-by-mnangagwa-regime/\">Continue reading<span class=\"screen-reader-text\"> \"Watchdog Exposes Alarming Abuse Of Human Rights By Mnangagwa Regime…\"</span></a></p>",
            "time": "20:27",
            "date": "17 May 2025"
        }
    ]
}