{
    "news": [
        {
            "title": "Health Ministry Records Alarming 600 Dog Bites Countrywide",
            "url": "https://www.zimeye.net/2025/11/12/health-ministry-records-alarming-600-dog-bites-countrywide/",
            "content": "Tinashe Sambiri  The Ministry of Health and Child Care has reported an alarming 602 dog bite cases across Zimbabwe in a single week, including one death, highlighting growing concerns over animal safety and public health.\n\nAccording to the Ministrys weekly disease report for the week ending 26 October 2025, the fatality occurred in Gwanda District, Matabeleland South Province. The report detailed: Of the reported cases, 102 (16.9%) were bitten by vaccinated dogs, 124 (20.6%) by unvaccinated dogs and 376 (62.5%) by dogs of unknown status.\n\nThe provinces with the highest incidence of dog bites were Midlands Province with 90 cases and Mashonaland West Province with 89 cases. Cumulatively, the Ministry has recorded 22,953 dog bite cases and three deaths nationwide.\n\nThe Ministry of Health and Child Care urged the public to remain vigilant and ensure that pets are properly vaccinated, while also seeking immediate medical attention in the event of a dog bite. The report emphasizes the ongoing need for public awareness campaigns to reduce the risk of bites and prevent fatalities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – The Ministry of Health and Child Care has reported an alarming 602 dog bite cases across Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/health-ministry-records-alarming-600-dog-bites-countrywide/\">Continue reading<span class=\"screen-reader-text\"> \"Health Ministry Records Alarming 600 Dog Bites Countrywide\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Calls for Recognition of Sekuru Banda’s Philanthropy",
            "url": "https://www.zimeye.net/2025/11/12/calls-for-recognition-of-sekuru-bandas-philanthropy/",
            "content": "By A Correspondent| What began as a routine charity event by Sekuru Banda for residents of Maronderas Cherima and Dombotombo suburbs took an unexpected turn when beneficiaries appealed to business people, including Wicknell Chivhayo, Kudakwashe Tagwirei, and Paul Tungwarara among others to recognise the popular traditional healers humanitarian work.\n\nSekuru Banda, a well-known traditional healer and philanthropist, had donated food hampers worth US$10,000 to underprivileged residents when community members voiced their appreciation and called for national recognition of his efforts.\n\nDespite being a Muslim, Sekuru Banda has a big heart for giving. He gives freely to people in need regardless of their political, social, religious, and ethnic persuasions. To Sekuru Banda, we are all equal before God. He is ready to help everyone in need, said James Maposa, one of the recipients of food hampers donated by Sekuru Banda.\n\nAnother beneficiary, Tawanda Moyo, explained that the hampers contained rice, sugar, beans, maize meal, cooking oil, salt, and soap, among other essentials.\n\nThis is not the first time Sekuru Banda has come to the aid of those in need. During the COVID-19 lockdowns, he supported struggling artists and sports figures whose livelihoods had been disrupted by restrictions.\n\nAmong those who benefited from his generosity were the late comedian Marabha, musician Paradzai Mesi, boxer Mosquito, football legend George Shaya, and Lady Squander. Sekuru Banda built a six-roomed house for Marabha in Epworth, provided groceries and medical support to Shaya, and distributed sanitary wear to underprivileged schoolgirls in remote areas.\n\nWith such a consistent record of philanthropy, calls are growing from communities across the country for figures like Sir Wicknell, ZANU PF Central Committee member Kuda Tagwirei, President Emmerson Mnangagwa, and Presidential Investment Advisor Dr. Paul Tungwarara to acknowledge Sekuru Bandas contribution to social welfare and community empowerment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| What began as a routine charity event by Sekuru Banda for residents of Marondera’s Cherima and Dombotombo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/calls-for-recognition-of-sekuru-bandas-philanthropy/\">Continue reading<span class=\"screen-reader-text\"> \"Calls for Recognition of Sekuru Banda’s Philanthropy\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Cash and Handouts: Tagwirei’s US$200,000 “Buy-In” Raises Eyebrows in Zanu PF Harare Province",
            "url": "https://www.zimeye.net/2025/11/12/cash-and-handouts-tagwireis-us200000-buy-in-raises-eyebrows-in-zanu-pf-harare-province/",
            "content": "Tinashe Sambiri  Controversy is brewing in Harare Province as reports emerge of billionaire businessman Kuda Tagwirei using vast sums of cash to influence party structures within Zanu PF.\n\nDuring the Zanu PF Harare Province Inter-District meeting on Tuesday in Chitungwiza, the ruling party celebrated what it described as an electrifying turnout at the Aquatic Complex. But critics say the real story lies in the massive financial handouts presented by Tagwirei.\n\nAccording to the party statement, Tagwirei reported on the State of Economic affairs and he closed by injecting US$200,000 into Zone 1 as an empowerment fund. In addition, the statement said he contributed 80 boreholes and, together with his wife, donated 12,500 family food hampers.\n\nOpposition figures and watchdogs have questioned whether such largesse is genuine empowerment or a strategic effort to capture political loyalty. One local analyst commented, When money flows this freely, its hard not to see it as buying influence rather than supporting communities.\n\nWhile Zanu PF praised the masses for their enthusiasm, critics warn that the celebration of cash injections undermines party integrity and raises concerns about the role of wealthy individuals in shaping political outcomes.\n\nAs Zimbabwe faces mounting economic challenges, the optics of US$200,000 handouts, thousands of food hampers, and borehole projects in a single constituency have sparked a heated debate on the ethics of political patronage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Controversy is brewing in Harare Province as reports emerge of billionaire businessman Kuda Tagwirei using vast sums … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/cash-and-handouts-tagwireis-us200000-buy-in-raises-eyebrows-in-zanu-pf-harare-province/\">Continue reading<span class=\"screen-reader-text\"> \"Cash and Handouts: Tagwirei’s US$200,000 “Buy-In” Raises Eyebrows in Zanu PF Harare Province\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Prophet Magaya in Fresh Scandal",
            "url": "https://www.zimeye.net/2025/11/12/prophet-magaya-in-fresh-scandal/",
            "content": "By A Correspondent  Harare | ZimEye\n\nControversial preacher and businessman Prophet Walter Magaya, founder of the Prophetic Healing and Deliverance (PHD) Ministries, has once again found himself at the centre of a widening criminal investigation, with prosecutors alleging that he fathered a child with one of his alleged rape victims.\n\nAccording to the National Prosecuting Authority (NPA), Magaya faces five counts of rape and 78 counts of fraud involving millions of dollars collected from congregants under false pretences. The NPA says one of the rape cases resulted in the birth of a child, while several others were allegedly covered up through intimidation, coercion, and forced retractions. Prosecutors allege that Magaya attempted to conceal the crimes by offering cash settlements to his victims and compelling them to record videos denying the abuse.\n\nMagaya appeared in the Harare Magistrates Court on Tuesday, 11 November 2025, where he was granted US$3,000 bail. As part of his bail conditions, he was ordered to surrender his passport, reside at his given address, and not interfere with witnesses.\n\nBefore his release, the Zimbabwe Republic Police (ZRP) had intensified investigations, urging victims and witnesses both locally and abroad to report cases of rape, fraud, and assault linked to the PHD leader. In an official statement, police confirmed receiving several calls from people all over the world seeking clarification on how to report cases involving Magaya. The ZRP provided official contact numbers  0776 830 226, (0242) 703 631, and WhatsApp 0712 800 197  for confidential reporting. Victims based in South Africa, the United Kingdom, Namibia, Botswana, Mozambique, Malawi, and Zambia were encouraged to file notarised statements through their local police stations and forward them to Zimbabwean embassies for transmission to Harare.\n\nPolice warned that any attempt to intimidate witnesses or obstruct justice would lead to immediate arrest under Section 184 of the Criminal Law (Codification and Reform) Act [Chapter 9:23]. The Zimbabwe Republic Police warns individuals and syndicates trying to interfere with investigations or threaten witnesses that they risk arrest for defeating or obstructing the course of justice, the statement read.\n\nThis latest development caps a decade-long pattern of allegations against Magaya, spanning sexual exploitation, psychological manipulation, and fraudulent investment schemes disguised as religious ventures. ZimEyes ongoing investigation, which began in 2014, has published a series of exclusive exposs, leaked audios, and witness testimonies revealing how Magaya allegedly used his position as a spiritual leader to manipulate followers emotionally and financially. One leaked recording featured Magayas late mentor, Nigerian televangelist TB Joshua, warning him of the fall of the anointed should he continue to avoid accountability.\n\nIn 2018, ZimEye exposed Magayas widely condemned false claim of discovering a cure for HIV and cancer, which he later retracted under government pressure following international outrage. Further investigations uncovered how Magaya falsely claimed ownership of several properties, including former Reserve Bank Governor Gideon Gonos New Donnington Farm, to lure congregants into bogus land and agricultural investment projects.\n\nCourt documents show that between 2016 and 2018, Magaya and his team allegedly defrauded church members of over US$40,000 through fake land deals in Norton, Mutare, Bulawayo, Kwekwe, and Chishawasha. Promotional pamphlets quotingGenesis 13:9 A vast land is out there and available to you  were used to legitimise the fraudulent projects. Two of Magayas aides were later arrested for obstructing justice during a police raid at his Prospect prayer mountain in Harare.\n\nOver the past decade, ZimEyes investigations have consistently revealed a pattern of systemic abuse, deception, and evasion within Magayas ministry. Victims describe being spiritually coerced, sexually exploited, and financially defrauded, often under threats of divine retribution. Despite multiple investigations and arrests over the years, Magaya has frequently managed to evade long-term prosecution, aided by his political connections and the cult-like loyalty of followers.\n\nThis renewed prosecutionnow under international scrutinycould determine whether one of Zimbabwes most influential religious figures finally faces full accountability for a decade of allegations.\n\nOFFICIAL ZRP CONTACTS: Cell: 0776 830 226 National Complaints: (0242) 703 631 WhatsApp: 0712 800 197\n\nZimEye  Investigating Without Fear or Favour\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Harare | ZimEye Controversial preacher and businessman Prophet Walter Magaya, founder of the Prophetic Healing and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/prophet-magaya-in-fresh-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Magaya in Fresh Scandal\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Humanitarian Efforts: Chivaura Assists Family Amid Tragic Murder Case",
            "url": "https://www.zimeye.net/2025/11/12/humanitarian-efforts-chivaura-assists-family-amid-tragic-murder-case/",
            "content": "By A Correspondent  Community leader and philanthropist Vengai Chivaura has stepped in to support a grieving family in Mashanda Village, Ward 18, Mhondoro, following the tragic death of a young man who was allegedly murdered under disturbing circumstances.\n\nSpeaking on Tuesday, Chivaura expressed sadness over the incident and detailed the help he provided to the bereaved family.\n\nThere was a death of a young man who was murdered in Ward 18, at Mashanda Village, an area known as Masvosve, he said. I bought a coffin and arranged for the transportation of the body from Harare Hospital. After that, the father and mother of the deceased, along with the uncle who is the fathers elder brother, were all arrested and accused of murdering their son.\n\nThe deceased, identified as Alfred White, was 25 years old at the time of his death and was buried on November 4, 2025. Chivaura confirmed that the father of the deceased has since been released on bail as investigations continue.\n\nChivaura, who is well-known in Mhondoro-Mubaira for his humanitarian work and commitment to uplifting local communities, said his actions are guided by compassion and a desire to promote peace and unity.\n\nWe stand for community development, public safety, and empowerment, he said.\n\nResidents have since commended Chivaura for his continued efforts to support families in need and for showing leadership during times of tragedy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Community leader and philanthropist Vengai Chivaura has stepped in to support a grieving family in Mashanda … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/humanitarian-efforts-chivaura-assists-family-amid-tragic-murder-case/\">Continue reading<span class=\"screen-reader-text\"> \"Humanitarian Efforts: Chivaura Assists Family Amid Tragic Murder Case\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Amnesty International Condemns Abduction, Torture Of Chinhoyi University Students",
            "url": "https://www.zimeye.net/2025/11/12/amnesty-international-condemns-abduction-torture-of-chinhoyi-university-students/",
            "content": "Tinashe Sambiri  Amnesty International has strongly condemned the reported abduction and torture of two Chinhoyi University students, describing the attacks as a serious violation of fundamental human rights.\n\nIn a statement released on Tuesday, the rights watchdog said: Amnesty International strongly condemns the attacks on Zimbabwe National Students Union-Zinasu students from Chinhoyi University, who were allegedly abducted and tortured after conducting student election campaigns on campus.\n\nThe two students, 23-year-old Marlvin Madanda and 21-year-old Lindon Zanga, were reportedly abducted on Monday and later found the following day, dumped and beaten. Amnesty International warned that these attacks threaten not just freedoms of assembly, expression and association, but also the rights to education, non-discrimination, academic freedom, and participation in university public life.\n\nThe statement called on Zimbabwean authorities to act decisively: We urge the authorities to thoroughly investigate these attacks and ensure that students are able to exercise their freedom of expression and peaceful assembly, and organize without fear of reprisals, intimidation, or torture.\n\nLocal reports indicate that the students were abducted and tortured by suspected government agents, raising concerns over the increasing targeting of student activists. Amnesty Internationals intervention highlights the urgent need for accountability and protection of human rights within Zimbabwes higher education institutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Amnesty International has strongly condemned the reported abduction and torture of two Chinhoyi University students, describing the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/amnesty-international-condemns-abduction-torture-of-chinhoyi-university-students/\">Continue reading<span class=\"screen-reader-text\"> \"Amnesty International Condemns Abduction, Torture Of Chinhoyi University Students\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Tagwirei Bribes Chitungwiza Residents With Borehole Drilling Gimmick Amid Deepening Social Unrest",
            "url": "https://www.zimeye.net/2025/11/12/tagwirei-bribes-chitungwiza-residents-with-borehole-drilling-gimmick-amid-deepening-social-unrest/",
            "content": "Tinashe Sambiri  In a controversial display of party politics, Zanu PFs newly co-opted Central Committee member Kudakwashe Tagwirei announced a US$200 000 revolving empowerment fund for party wings in Zone 1, Chitungwiza, raising questions about whether the money is meant for genuine community support or political patronage.\n\nThe Empowerment Fund will be managed by the province, said Dr Tagwirei, insisting the initiative would empower the party locally. Critics argue that the fund primarily serves to strengthen Zanu PF structures rather than address the communitys urgent needs.\n\nTagwirei also pledged to drill 80 boreholes in Chitungwiza, claiming, We are going to drill 16 boreholes per constituency in the five constituencies in Chitungwiza. However, observers have slammed the promise as superficial, noting that previous borehole projects often fail to materialize or remain non-functional, leaving residents frustrated.\n\nIn addition to the boreholes, Tagwirei announced plans to distribute 12 500 hampers as Christmas gifts. While the crowd of 20 000 party members and affiliates cheered, critics said the gesture is a thinly veiled attempt to curry political favour ahead of elections, rather than a meaningful solution to ongoing hardships in the area.\n\nAt the same meeting, Dr Tagwirei presented a feedback report on the 22nd Annual National Peoples Conference, while party secretary Charles Tavengwa revealed a controversial resolution: Resolution Number One, which aims to extend President Mnangagwas term of office beyond 2028, was endorsed by all conference delegates. No objections were raised concerning the resolution. Critics argue this underscores Zanu PFs increasing disregard for democratic norms under the guise of development projects.\n\nProminent figures at the inter-district meeting included Zanu PF Politburo members Omega Hungwe, Secretary for War Veterans Douglas Mahiya, Deputy Secretary for Security Tendai Chirau, and Deputy Secretary for Economic Affairs Andy Mhlanga. Observers noted that the gathering appeared more like a political rally than a genuine community engagement initiative.\n\nWith promises of boreholes and hampers overshadowed by political maneuvering, many residents remain skeptical about whether these pledges will translate into tangible improvements in their daily lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – In a controversial display of party politics, Zanu PF’s newly co-opted Central Committee member Kudakwashe Tagwirei announced … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/tagwirei-bribes-chitungwiza-residents-with-borehole-drilling-gimmick-amid-deepening-social-unrest/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Bribes Chitungwiza Residents With Borehole Drilling Gimmick Amid Deepening Social Unrest\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Nelson Chamisa Confronts Mnangagwa Over Abduction, Torture Of Chinhoyi University Students By Government Agents",
            "url": "https://www.zimeye.net/2025/11/12/nelson-chamisa-confronts-mnangagwa-over-abduction-torture-of-chinhoyi-university-students-by-government-agents/",
            "content": "Tinashe Sambiri  Citizens leader Advocate Nelson Chamisa has sharply condemned President Emmerson Mnangagwa over the reported abduction and torture of students from Chinhoyi University of Technology (CUT), describing the attacks as pure evil.\n\nIn a forceful statement on Tuesday, Chamisa addressed both the authorities and the president, saying: Dear @PoliceZimbabwe Why should this terrorism and primitive brutality on harmless students and simple innocent citizens be allowed to continue like this? Mr Mnangagwa, why should this not worry or concern you ?? Mugabe was bad. This is worse. So barbaric. This is pure evil!!\n\nThe two CUT students were reportedly abducted on Monday by suspected government agents and were later found badly beaten. Chamisas statement framed the attack as a wider assault on the rights of students and citizens, emphasizing the need for accountability.\n\nThis incident comes amid growing concerns over human rights abuses in Zimbabwe, particularly targeting students and activists who engage in political or public life. Chamisas public denunciation directly challenges the government to take responsibility and protect the freedoms of assembly, expression, and safety of young people on campuses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Citizens leader Advocate Nelson Chamisa has sharply condemned President Emmerson Mnangagwa over the reported abduction and torture … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/nelson-chamisa-confronts-mnangagwa-over-abduction-torture-of-chinhoyi-university-students-by-government-agents/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Confronts Mnangagwa Over Abduction, Torture Of Chinhoyi University Students By Government Agents\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Mthuli Ncube Admits Treasury Can’t Cope With Ministries’ Overspending",
            "url": "https://www.zimeye.net/2025/11/12/mthuli-ncube-admits-treasury-cant-cope-with-ministries-overspending/",
            "content": "Tinashe Sambiri  Zimbabwes 2026 budget process has laid bare the governments worsening financial state, as Finance Minister Professor Mthuli Ncube admitted that Treasury cannot cope with ministries excessive spending demands and reckless contracting.\n\nSpeaking at the 2026 Pre-Budget Seminar in Bulawayo, Prof Ncube revealed that portfolio committees submitted budget requests amounting to a staggering ZiG783 billion  more than triple the Treasurys proposed allocation of ZiG231 billion.\n\nTreasury has set a ceiling of ZiG231 billion. This is what the economy, given our systems of revenue collection, can reasonably quantify, Ncube said. If we try to get to ZiG783 billion, it is beyond the capacity of our collection mechanisms or economy to deliver.\n\nHis remarks exposed the extent of fiscal indiscipline within government departments, with ministries routinely ignoring Treasury guidelines and over-contracting without regard to available funds. What we really face over the years is what we call over-contracting, where ministries, departments and agencies have gone ahead to contract without taking a second look at their budgets and we find that they have over-contracted beyond their budgets, he said.\n\nNcube further admitted that the instability of the domestic currency has worsened the crisis, with some contractors charging up to three times the actual value of goods and services. Because of the instability of the domestic currency, some contractors were overpricing, adding as much as double or three times the cost of goods and services to their bills, he revealed.\n\nThe Minister also conceded that government revenue is being collected at the official exchange rate, while expenses are priced using the parallel rate  a major factor contributing to the widening fiscal gap. Our expenditures are being priced at the parallel rate while we are receiving revenues at the official rate, he said, adding that this mismatch has created a huge gap over the last two years.\n\nEconomic analysts say Ncubes admissions confirm what has long been suspected  that Zimbabwes Treasury is broke and struggling to manage rampant overspending. The situation, they warn, could derail the governments Vision 2030 goals and deepen the countrys economic instability.\n\nAs one economist in Bulawayo noted after the seminar, The government has lost control of its own budget. This is not just poor planning  its fiscal negligence on a national scale.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Zimbabwe’s 2026 budget process has laid bare the government’s worsening financial state, as Finance Minister Professor Mthuli … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/mthuli-ncube-admits-treasury-cant-cope-with-ministries-overspending/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Ncube Admits Treasury Can’t Cope With Ministries’ Overspending\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Mystery Woman Captured On Camera With Aliko Dangote EveryTime In Zim",
            "url": "https://www.zimeye.net/2025/11/12/mystery-woman-caught-in-camera-with-aliko-dangote/",
            "content": "By ZimEye Investigations Team | Analysis | 10 years ago, the top TB Joshua activist, Josey Mahachi demanded a facilitation fee from Finance Minister, Patrick Chinamasa she said was for flying in the Nigerian businessman, Aliko Dangote to Zimbabwe. But Chinamasa complained saying why should we pay you and what for? This was because Dangote did not invest any money. He flew back to his country without making any commitment.\n\nHer career nosedived when she later contested for a ZANU MP post in the bloody 2018 election period, and lost.\n\nSoon after that, Mahachi left Zimbabwe for Germany to claim asylum in 2019 announcing that she was under persecution over the very same failed Dangote deal, she demanded a payment for.\n\nShe used the same @AlikoDangote story to convince the German broadcaster @dwnews staff to support her asylum case. She also used the same story to get a job at the media company, where she continued to campaign for the controversial Nigerian preacher, TB Joshua. She used her media status to accuse whistleblowers in a groundbreaking BBC investigation saying one of them is mentally unwell.\n\nHer asylum status commenced in 2019.\n\nToday 6 years later she has flown back to Zimbabwe to welcome the same businessman on his second visit.\n\nNow that hes returned, what is the asylum seekers new story to the German and the Zimbabwean people? What has changed now for her to return to the same people she claimed that they were persecuting her?\n\n10 years ago, the top TB Joshua activist, Josey Mahachi@MahachieJoseydemanded a facilitation fee from Finance Minister, Patrick Chinamasa she said was for flying in the Nigerian businessman, Aliko Dangote to Zimbabwe. But Chinamasa complained saying why should we pay you andpic.twitter.com/WORZqSXrXF\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By ZimEye Investigations Team | Analysis | 10 years ago, the top TB Joshua activist, Josey Mahachi demanded a facilitation … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/12/mystery-woman-caught-in-camera-with-aliko-dangote/\">Continue reading<span class=\"screen-reader-text\"> \"Mystery Woman Captured On Camera With Aliko Dangote EveryTime In Zim\"</span></a></p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        }
    ]
}