{
    "news": [
        {
            "title": "Amini Soma-Phiri Bounces Back at Highlanders …",
            "url": "https://www.zimeye.net/2025/08/15/amini-soma-phiri-bounces-back-at-highlanders/",
            "content": "Sports Correspondent\n\nHighlanders FC have welcomed back former club stalwart Amini Soma-Phiri, who has been appointed as the teams new Welfare Manager.\n\nSoma-Phiri is no stranger to the Bulawayo giants, having previously served as assistant coach under then-head coach Erol Akbay. Before moving into coaching, he was a key player for Highlanders, earning a reputation for his commitment and passion for the club.\n\nHis return is seen as a boost for Bosso, with his deep understanding of the teams culture and history expected to help strengthen the players support systems both on and off the pitch.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Highlanders FC have welcomed back former club stalwart Amini Soma-Phiri, who has been appointed as the team’s new … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/amini-soma-phiri-bounces-back-at-highlanders/\">Continue reading<span class=\"screen-reader-text\"> \"Amini Soma-Phiri Bounces Back at Highlanders …\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "Thembinkosi Lorch Leaves Sundowns",
            "url": "https://www.zimeye.net/2025/08/15/thembinkosi-lorch-leaves-sundowns/",
            "content": "Sports Correspondent\n\nMamelodi Sundowns have officially confirmed the departure of star attacking midfielder Thembinkosi Lorch, bringing an end to his stint with the Pretoria-based giants.\n\nLorch, who joined Sundowns from Orlando Pirates in a high-profile transfer, made an impact during his time at the club with his creativity, skill, and ability to change games in an instant. However, his stay was relatively short-lived, with his exit now paving the way for a return to familiar territory.\n\nReports indicate that the 31-year-old is set to rejoin Moroccan powerhouse Wydad Casablanca on a permanent deal. Lorch previously featured for the North African side earlier in his career, and the move is expected to reignite his career on the continental stage.\n\nWhile Sundowns have yet to reveal the finer details of the transfer, the club thanked Lorch for his contributions and wished him success in his next chapter. For Wydad fans, his homecoming will be seen as a major boost ahead of the new season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Mamelodi Sundowns have officially confirmed the departure of star attacking midfielder Thembinkosi Lorch, bringing an end to his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/thembinkosi-lorch-leaves-sundowns/\">Continue reading<span class=\"screen-reader-text\"> \"Thembinkosi Lorch Leaves Sundowns\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "Facts About Cannibalism",
            "url": "https://www.zimeye.net/2025/08/15/facts-about-cannibalism/",
            "content": "By Dr Trywell Muzerengi\n\nCannibalism in chickens is a serious behavioral issue that can lead to injury, disease, and reduced productivity in a flock. Understanding its causes and implementing effective management strategies is essential for healthy poultry farming.\n\nCauses of Cannibalism in Chickens\n\nConsequences of Cannibalism\n\nPrevention and Management Strategies\n\nAdditional Considerations\n\nBy addressing these factors, poultry farmers can reduce cannibalism, protect flock health, enhance welfare, and improve overall productivity.\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Cannibalism in chickens is a serious behavioral issue that can lead to injury, disease, and reduced … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/facts-about-cannibalism/\">Continue reading<span class=\"screen-reader-text\"> \"Facts About Cannibalism\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "No Elections In 2028, Declares Garwe",
            "url": "https://www.zimeye.net/2025/08/15/no-elections-in-2028-declares-garwe/",
            "content": "By A Correspondent\n\nZANU PF Mashonaland East provincial chairman, Daniel Garwe, has sparked controversy by suggesting that President Emmerson Mnangagwas tenure could continue past the scheduled 2028 elections. Speaking to a ZANU PF district coordinating committee on 11 August, Garwe hailed the Presidents Vision 2030 economic blueprint as unstoppable, claiming that no force could derail it.\n\nThere will be no election in 2028, Garwe told party officials, emphasizing that the country would continue to focus on development regardless of political opposition. Were moving towards 2030, building the nation, whether anyone approves or not. Nothing can stop this agenda.\n\nGarwe appeared to take a subtle swipe at Vice-PresidentConstantino Chiwenga, widely seen as Mnangagwas potential successor. Mocking unnamed rivals, he referenced a bizarre traditional ritual, saying: Some think plucking a live black chicken can change the outcomebut the one in charge remains Mnangagwa. Dont waste effort on empty gestures.\n\nExtending Mnangagwas term beyond constitutional limits would require a formal amendment, a move that is expected to face strong opposition from rival political parties and dissenting members within ZANU PF itself.\n\nPublicly, Mnangagwa has maintained that he will step down when his current term concludes in 2028. Behind the scenes, however, party insiders suggest that loyalists are exploring strategies to block Chiwengas rise and promote businessmanKudakwashe Tagwireias party leader during the 2027 congress. Under this plan, Mnangagwa would officially resign, but Tagwirei, installed as vice president, could effectively extend the ruling factions influence until 2030.\n\nThe comments from Garwe have intensified debate about ZANU PFs internal succession dynamics and the potential constitutional and political battles that lie ahead as the country approaches the next election cycle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Mashonaland East provincial chairman, Daniel Garwe, has sparked controversy by suggesting that President Emmerson Mnangagwa’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/no-elections-in-2028-declares-garwe/\">Continue reading<span class=\"screen-reader-text\"> \"No Elections In 2028, Declares Garwe\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "🚨 U.S. ENTRY OF CONVICTED PREACHER WALTER MAGAYA, AIRPORT ALERT RAISED",
            "url": "https://www.zimeye.net/2025/08/15/%f0%9f%9a%a8-u-s-entry-of-convicted-preacher-walter-magaya-airport-alert-raised/",
            "content": "DALLAS, TEXAS  By Investigative Reporter | ZimEye| U.S. federal and local security agencies have been urged to investigate the imminent arrival of convicted Zimbabwean preacher Walter Magaya, who is scheduled to land in Dallas, Texas within a few hours from now.\n\nMagaya, who has a criminal conviction in Harare for selling unregulated chemical substances that resulted in the deaths of at least four individuals in Zimbabwe, is reportedly entering the United States without disclosing to airport and border authorities that he intends to engage in unlicensed medical practice during his stay.\n\nKey Security Concerns:1. Unlicensed Medical Practice: Magaya has a documented history of administering unregulated chemicals and performing medical treatments without a license. His conviction in Zimbabwe followed fatal incidents involving toxic substances given to at least 4 members of his congregation.2. Ongoing Money Laundering Schemes: Since 2016, Magaya has operated alleged investment and property share schemes which investigative reports and victim testimonies confirm are fraudulent. Victims have sold property or invested life savings only to find no legitimate shares or assets existed, resulting in widespread financial ruin.\n\nThere are police cases in UK, South Africa and Zimbabwe.3. Sexual Exploitation Allegations: Police statements and Magayas own admissions during prior detentions in Zimbabwe reveal a pattern of grooming women for sexual purposes, followed by out-of-court payoffs to suppress complaints. Complainants have been pressured into signing non-disclosure agreements prepared by his legal team, in exchange for fake compensation promises.4. Outstanding Zimbabwe Revenue Authority (ZIMRA) Investigation: Magaya remains a suspect in money laundering and tax evasion cases linked to undeclared foreign transactions dating back to 2017.5. Documented Pattern of Concealment: Multiple international media outlets have reported on Magayas use of deception to mask his true purpose of travel, including nondisclosure of planned commercial or medical activities to immigration and customs officials.\n\nThe continued alleging. His luggage must be searched including that of other travellers on the plane, cause he uses decoys.\n\nMagayas lawyer Emerson Chatambudza was reached for comment.\n\nThis is a developing security situation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "DALLAS, TEXAS — —By Investigative Reporter | ZimEye| U.S. federal and local security agencies have been urged to investigate the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/%f0%9f%9a%a8-u-s-entry-of-convicted-preacher-walter-magaya-airport-alert-raised/\">Continue reading<span class=\"screen-reader-text\"> \"🚨 U.S. ENTRY OF CONVICTED PREACHER WALTER MAGAYA, AIRPORT ALERT RAISED\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "Tshabangu Fails To Field Candidate For Masvingo By-Election",
            "url": "https://www.zimeye.net/2025/08/15/tshabangu-fails-to-field-candidate-for-masvingo-by-election/",
            "content": "By Tinashe Sambiri\n\nMASVINGO  The controversial Citizens Coalition for Change (CCC) Secretary General, Senator Sengezo Tshabangu, has failed to field a candidate for the upcoming Masvingo Urban Ward 7 by-election, raising questions about the partys internal leadership struggles.\n\nThe by-election, scheduled for 13 September 2025, follows the death of CCC Councillor Tafara Masimba in July. The nomination court convened on Thursday at the Civic Centre, where five candidates successfully completed the submission of their nomination papers, none representing the CCC under Tshabangus leadership.\n\nThe five candidates in the race are:\n\nStruggle Desire Nyahunda (Independent)\n\nProsper Tiringindi (Independent)\n\nTsungai Mandati (Independent, widow of the late Tafara Masimba)\n\nSimbarashe Shonhiwa (Zanu PF)\n\nProsper Mataruse (MDC-T)\n\nThe failure to field a candidate comes after Tshabangu seized control of the CCC, prompting the partys founder, Advocate Nelson Chamisa, to quit, citing heavy infiltration and interference within the party.\n\nZimbabwe Electoral Commission (ZEC) officials stressed the need for a peaceful electoral process, saying:\n\nShun violence we want a peaceful election, adding that all candidates and supporters must conduct themselves responsibly throughout the campaign period.\n\nZEC further reminded voters to adhere to electoral guidelines and to report any suspicious activities to ensure a free, fair, and safe by-election.\n\nCampaigning is expected to intensify in the coming weeks as the remaining candidates seek to secure the support of Masvingo Urban Ward 7 residents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri MASVINGO – The controversial Citizens Coalition for Change (CCC) Secretary General, Senator Sengezo Tshabangu, has failed to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/tshabangu-fails-to-field-candidate-for-masvingo-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Fails To Field Candidate For Masvingo By-Election\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "Stop Kungwavha Ngwavha Declares Mnangagwa  as Citizens Face Daily Struggles",
            "url": "https://www.zimeye.net/2025/08/15/stop-kungwavha-ngwavha-declares-mnangagwa-as-citizens-face-daily-struggles/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has urged Zimbabwes youth to reject dishonesty, corruption, and the lure of quick money, even as the nation grapples with deepening economic hardship and persistent corruption allegations.\n\nSpeaking at the Zanu PF Youth League National Executive meeting in Harare on Thursday, Mnangagwa called on young people to abandon what he described as the dependency syndrome and instead become creators, not mere consumers; builders, not beggars.\n\nShun quick money be disciplined, he told the gathering, warning against the temptation to make easy money and the dangers of a quick-fix mentality.\n\nCritics, however, say such calls ring hollow in a country where corruption scandals among political elites are widespread, and economic opportunities for ordinary citizens  especially the youth  remain extremely limited.\n\nMany observers argue that Mnangagwas lectures on discipline are increasingly out of touch with the daily struggles faced by ordinary Zimbabweans. Calls for self-reliance are meaningless when citizens are left to navigate unemployment, inflation, and systemic corruption with no support, they say.\n\nWhile the Presidents message emphasizes self-reliance, many young Zimbabweans contend that without addressing entrenched corruption at the highest levels, such appeals remain largely rhetorical, offering little practical guidance on how citizens can survive and thrive amid the ongoing crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has urged Zimbabwe’s youth to reject dishonesty, corruption, and the lure of “quick money,” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/stop-kungwavha-ngwavha-declares-mnangagwa-as-citizens-face-daily-struggles/\">Continue reading<span class=\"screen-reader-text\"> \"Stop Kungwavha Ngwavha Declares Mnangagwa  as Citizens Face Daily Struggles\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "Five Candidates Set to Contest In Masvingo Urban Ward 7 By-Election",
            "url": "https://www.zimeye.net/2025/08/15/five-candidates-set-to-contest-in-masvingo-urban-ward-7-by-election/",
            "content": "By Tinashe Sambiri\n\nMASVINGO  Five candidates have completed the submission of their nomination papers for the Masvingo Urban Ward 7 by-election scheduled for 13 September 2025, according to the Zimbabwe Electoral Commission (ZEC).\n\nThe nomination court convened on Thursday at the Civic Centre to receive papers from interested contestants.\n\nThe by-election comes after the death of CCC Councillor Tafara Masimba in July, leaving the seat vacant.\n\nNotably, the Citizens Coalition for Change (CCC) has opted not to field a candidate for this poll.\n\nThe five candidates vying for the seat are:\n\nStruggle Desire Nyahunda (Independent)\n\nProsper Tiringindi (Independent)\n\nTsungai Mandati (Independent, widow of the late Tafara Masimba)\n\nSimbarashe Shonhiwa (Zanu PF)\n\nProsper Mataruse (MDC-T)\n\nZEC officials emphasized the importance of a peaceful electoral process, stating:\n\nShun violence we want a peaceful election, they urged, adding that all candidates and supporters must conduct themselves responsibly throughout the campaign period.\n\nThe Commission further reminded voters to adhere to electoral guidelines and to report any suspicious activities to the authorities to ensure a free, fair, and safe by-election.\n\nCampaigning is expected to intensify in the coming weeks as candidates seek to secure the support of Masvingo City Ward 7 residents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri MASVINGO – Five candidates have completed the submission of their nomination papers for the Masvingo Urban Ward … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/five-candidates-set-to-contest-in-masvingo-urban-ward-7-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Five Candidates Set to Contest In Masvingo Urban Ward 7 By-Election\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "Auxillia Mnangagwa Bombs Women Investment Conference With 2030 Agenda",
            "url": "https://www.zimeye.net/2025/08/15/auxillia-mnangagwa-bombs-women-investment-conference-with-2030-agenda/",
            "content": "By A Correspondent\n\nIn yet another heavily scripted government event dressed up as empowerment, First Lady Dr Auxillia Mnangagwa will headline the inaugural three-day Bulawayo Women Investment Conference next month  a gathering critics say risks being more about political branding and Vision 2030 sloganeering than addressing the real economic struggles women face.\n\nThe conference, set for September 3 to 5, is being organised by the Office of the Minister of State for Bulawayo Provincial Affairs and Devolution in partnership with the Bulawayo City Council. Organisers claim it will promote economic independence and leadership among women, despite many questioning whether such platforms translate into tangible change on the ground.\n\nSpeaking at a press briefing yesterday, Bulawayo Provincial Affairs and Devolution Minister Judith Ncube said: I am excited to advise you that the Office of the Minister of State for Provincial Affairs and Devolution, Bulawayo Metropolitan Province, in collaboration with the City of Bulawayo, will host the inaugural three-day Bulawayo Women Investment Conference 2025. Through this conference, we aspire to empower women by providing them with the tools, knowledge, and connections necessary to navigate the investment landscape, thereby contributing to the overall economic development of Bulawayo and beyond.\n\nMinister Ncube linked the initiative directly to the governments 2030 targets, saying: As we work towards achieving upper-middle-class income status by 2030, investing in womens economic potential is essential. This conference marks a critical step in building a future where women are equal drivers of our nations prosperity.\n\nThe event will feature sessions on investment strategies, financial literacy, leadership, mentorship, and access to funding. According to Ncube, We also engaged with different women who are into different businesses and in different levels. We strongly believe we can do it as Bulawayo and as people from Zimbabwe, hence we are going to gather from the 3rd to the 5th of September to discuss all those issues.\n\nOrganisers say the conference is informed by international engagements such as the Egyptian Programme and the 27th Arab-African Investment and International Cooperation Summit in Aswan, Egypt. It is also aligned with global frameworks including the Convention on the Elimination of All Forms of Discrimination against Women (CEDAW), the African Unions Agenda 2063, and the UN Sustainable Development Goals.\n\nDespite the lofty rhetoric, many women in Bulawayo continue to face systemic barriers  from lack of access to capital to the collapse of local industries  with little evidence that high-profile conferences alone will resolve these entrenched challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In yet another heavily scripted government event dressed up as empowerment, First Lady Dr Auxillia Mnangagwa will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/auxillia-mnangagwa-bombs-women-investment-conference-with-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa Bombs Women Investment Conference With 2030 Agenda\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        },
        {
            "title": "Zanu PF Chairman Declares ‘No Elections in 2028’ as Mnangagwa Allies Plot Term Extension",
            "url": "https://www.zimeye.net/2025/08/15/zanu-pf-chairman-declares-no-elections-in-2028-as-mnangagwa-allies-plot-term-extension/",
            "content": "President Emmerson Mnangagwas Mashonaland East provincial chairman, Daniel Garwe, has told party structures there will be no elections in 2028  a statement likely to fuel speculation that the presidents allies are pushing to extend his rule beyond the constitutional limit.\n\nSpeaking at a Zanu PF district coordinating committee meeting on August 11, Garwe declared that Vision 2030  Mnangagwas economic plan  was unstoppable and that no-one born of a woman could derail it.\n\nThere is no election. DCC, do you hear? There are no elections. Were going to 2030 building the country, whether they like it or not, shame or no shame, were unstoppable, Garwe said, in what appeared to be a swipe at Vice President Constantino Chiwenga, widely seen as Mnangagwas most likely successor.\n\nGarwe also ridiculed unnamed rivals, alleging that one plucked a live black chicken in a failed bid to gain power, before adding: The one ruling is Mnangagwa Dont kill chickens in vain.\n\nAny extension of Mnangagwas presidency would require constitutional amendments  a move certain to draw fierce opposition both outside and within Zanu PF.\n\nParty insiders told ZimLive that while Mnangagwa has publicly insisted he will leave office when his term ends in 2028, some of his allies are quietly working on a plan to block Chiwengas rise. The reported strategy involves positioning sanctioned business magnate Kudakwashe Tagwirei to take over the party leadership at the Zanu PF congress in 2027.\n\nUnder the proposal, Mnangagwa would step down as scheduled, Tagwirei  by then installed as vice president  would serve out an extended presidential term until 2030. If successful, it would be the first time in Zimbabwes history that a businessman, rather than a career politician or military figure, ascends to the presidency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "President Emmerson Mnangagwa’s Mashonaland East provincial chairman, Daniel Garwe, has told party structures there will be “no elections in 2028” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/15/zanu-pf-chairman-declares-no-elections-in-2028-as-mnangagwa-allies-plot-term-extension/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Chairman Declares ‘No Elections in 2028’ as Mnangagwa Allies Plot Term Extension\"</span></a></p>",
            "time": "18:37",
            "date": "16 Aug 2025"
        }
    ]
}