{
    "news": [
        {
            "title": "Trio cleared in mining extortion case",
            "url": "https://www.zimeye.net/2025/02/25/trio-cleared-in-mining-extortion-case/",
            "content": "A BULAWAYO magistrate has acquitted five accused persons who were facing charges of extortion in mining related disputes for lack of evidence.\n\nMunyaradzi Charakupa, Tawanda Mangi, Percy Pemba, Paul Chakaingesu and Victor Jaja were found not guilty of the allegations by Bulawayo magistrate Shepard Mjanji.\n\nThe court ruled that there was no evidence to support the extortion case in which the five was accused of demanding large sums of money under threats of canceling mining licenses and using their supposed influence with high-ranking government officials.\n\nOn the charge the five allegedly extorted US$40,000 from the complainant Dumisani Dube, the Corporate Rescuer of Fools Mine on July 23, 2024.\n\nOne of the accused Jaja was also alleged to have claimed he had killed four people to instill fear in Dube. As a result, the accused were acquitted of this particular charge.\n\nIn his ruling the magistrate said: The court has thoroughly examined the evidence presented in relation to this particular charge. Having considered the testimonies provided and the submissions made by both the prosecution and the defense, it is evident that there is no direct or corroborative evidence linking the accused to the specific allegation under count four.\n\nThe magistrate said the complainant is using the courts to fix their personal agendas and Jaja was not present on the day in question.\n\nThe court was not happy be used by the state and complainant.\n\nAllegations are that the accused persons impersonated members of the Presidents Office, the Presidential Police Protection Unit and the Military Intelligence Department to extort over US$57 000 from Dube.\n\nAccording to the State, sometime in February 2024, Mangi and Jaja approached Dube at his legal business office, introducing themselves as government operatives overseeing mining affairs. Charakupa and another accomplice, Pemba, allegedly posed as Military intelligence officers protecting the interests of the late permanent secretary in the ministry of War Veterans, Clive Mphambela.\n\nThe accused were alleged to have demanded large sums of money under threats of canceling mining licenses and using their supposed influence with high-ranking government officials.\n\nIt was prooved hat the Complainant is a pathetic lier.\n\nIt was proved that the Complainant and the one Mahamad Daka forged a general power of attorney and a board resolution which were used to place Complainant Dumisani Dube to be a coperate rescue practioner.\n\nIt was proved that the accused persons are the one who employed Complainant to be their company lawyer.\n\nIt was proved that Complainant is selling company assets using the coperate rescue practioner status.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A BULAWAYO magistrate has acquitted three men who were accused of extortion in mining related disputes for lack of evidence. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/trio-cleared-in-mining-extortion-case/\">Continue reading<span class=\"screen-reader-text\"> \"Trio cleared in mining extortion case\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Zim Hit By Serious ECD Teacher Shortages",
            "url": "https://www.zimeye.net/2025/02/25/zim-hit-by-serious-ecd-teacher-shortages/",
            "content": "By Munacho Gwamanda- Zimbabwe is grappling with a severe shortage of Early Childhood Development (ECD) teachers, as well as science and mathematics educators, exacerbating the ongoing crisis in the education sector.\n\nThe dire situation has forced the government to authorize parents, through School Development Committees (SDCs), to employ temporary relief teachers in an effort to fill the gap.\n\nThe Ministry of Primary and Secondary Education has set a target to recruit 8,000 teachers this year to mitigate the critical teacher deficit in schools.\n\nHowever, this measure alone is unlikely to resolve the crisis, given the worsening attrition of qualified educators due to poor salaries and deteriorating working conditions.\n\nFor years, Zimbabwean teachers have decried poor remuneration, with many earning salaries far below the poverty datum line.\n\nQualified educators, particularly those in specialized subjects such as science, mathematics, and ECD, have been leaving the profession in droves, either seeking better-paying opportunities abroad or transitioning to other industries.\n\nDespite periodic salary increments, teachers continue to face economic hardships, struggling to afford basic necessities, transport costs, and housing.\n\nIn some cases, teachers resort to informal side jobs, including vending and tutoring, just to make ends meet.\n\nThe mass exodus of trained professionals has left schoolsespecially those in rural areaswithout adequate teaching staff, leading to overcrowded classrooms and compromised education quality.\n\nResponding to questions from legislators during a recent Question and Answer session in Parliament, Deputy Minister of Primary and Secondary Education Angeline Gata acknowledged the crisis, particularly in ECD and STEM subjects.\n\nShe confirmed that SDCs have been permitted to engage temporary relief teachers where funding allows.\n\nAs a ministry, we have gone public on the shortage of teachers in ECD and other critical learning areas, she said. We have even extended that to other levels or grades experiencing similar shortages. We are grateful that our request for additional teachers is receiving attention from the employer, the Public Service Commission (PSC).\n\nGata explained that, in previous years, the ministry had relied on para-professional teachersunqualified or underqualified individuals engaged by SDCs to address the staffing gaps.\n\nWhile this arrangement is a temporary solution, it highlights the gravity of the crisis and the governments struggle to provide fully qualified educators.\n\nThese para-professionals were contracted by schools, with agreements made between parents and teachers. Their employment was conditional on the availability of funds to pay them, as the government does not interfere with these contracts, Gata said.\n\nThe reliance on temporary and unqualified relief teachers underscores the deepening crisis in Zimbabwes education sector.\n\nWithout urgent government interventionthrough competitive salaries, improved working conditions, and a comprehensive strategy to retain trained professionalsECD and other critical subjects will continue to suffer.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Zimbabwe is grappling with a severe shortage of Early Childhood Development (ECD) teachers, as well as science … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/zim-hit-by-serious-ecd-teacher-shortages/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Hit By Serious ECD Teacher Shortages\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Prince Dube Excels …",
            "url": "https://www.zimeye.net/2025/02/25/prince-dube-excels/",
            "content": "Sports Correspondent\n\nZimbabwe Warriors striker Prince Mgadaffi Dube continues to make waves in the Tanzanian Premier League, scoring yet another crucial goal for his team, Young Africans.\n\nIn a thrilling match played today, Young Africans thrashed Mashujaa 5-0, with Dube netting the teams second goal in the 49th minute. This impressive display of skill and goal-scoring prowess has cemented Dubes position as a key player for Young Africans.\n\nDubes consistent performances in the Tanzanian Premier League have not gone unnoticed, and his goal-scoring exploits have been a major factor in Young Africans success this season.\n\nThe Zimbabwe Warriors strikers impressive form will undoubtedly be a boost to the national team, as they prepare for upcoming international matches. Dubes experience and skill will be invaluable assets to the Warriors, and his continued success in Tanzania will only serve to strengthen his position in the team.\n\nAs Young Africans continue to dominate the Tanzanian Premier League, Dubes contributions will be crucial in their quest for glory. With his goal-scoring record speaking for itself, Dube is undoubtedly one of the most exciting Zimbabwean players to watch in international competition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe Warriors striker Prince ‘Mgadaffi’ Dube continues to make waves in the Tanzanian Premier League, scoring yet another … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/prince-dube-excels/\">Continue reading<span class=\"screen-reader-text\"> \"Prince Dube Excels …\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Caught In The Act Bribing",
            "url": "https://www.zimeye.net/2025/02/25/caught-in-the-act-bribing/",
            "content": "Mutare Magistrates Court Fines Two Taxi Boss Employees for Bribery\n\nBy Dorrothy Moyo : Mutare, Zimbabwe  The Mutare Magistrates Court has handed down fines to Emmanuel Pemba (47) and Josphat Taizivei Tavashe (38), both employees of Taxi Boss, after convicting them of bribery under Section 170(1)(b) of the Criminal Law (Codification and Reform) Act. The duo was each fined USD $120 for their unlawful actions.\n\nThe bribery incident occurred on December 11, 2024, at a roadblock near Mutare Teachers College. Pemba, who was driving a commuter omnibus, and Tavashe, serving as the conductor, were stopped by Zimbabwe Republic Police (ZRP) officer Peace Runyararo Muchenje.\n\nIn an attempt to avoid penalties for traffic violations, Tavashe handed Muchenje USD $3.00 as a bribe. However, the exchange did not go unnoticed. Officers from the Zimbabwe Anti-Corruption Commission (ZACC) were conducting surveillance in the area and witnessed the bribery.\n\nFollowing the incident, Officer Muchenje was arrested for accepting the bribe. A subsequent manhunt led to the capture of Pemba and Tavashe, culminating in their conviction and sentencing.\n\nThe case highlights the Zimbabwean governments ongoing crackdown on corruption, with authorities urging citizens to uphold integrity and transparency. The strong stance against bribery was reinforced by the Ministry of Justice, which emphasized the need for law enforcement and public cooperation in curbing corruption.\n\nThe conviction serves as a stern reminder that corruption, regardless of scale, will not be tolerated. The public is encouraged to report any instances of bribery and corruption to the relevant authorities as the nation pushes forward with its #NoToBribery campaign.\n\nStay tuned for more updates on this developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare Magistrates’ Court Fines Two Taxi Boss Employees for Bribery By Dorrothy Moyo : Mutare, Zimbabwe — The Mutare Magistrates’ … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/caught-in-the-act-bribing/\">Continue reading<span class=\"screen-reader-text\"> \"Caught In The Act Bribing\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Murder Suspect Caught Hiding",
            "url": "https://www.zimeye.net/2025/02/25/murder-suspect-caught-hiding/",
            "content": "Triple Murder Suspect Caught Hiding in Bush, Attempts Suicide as Police and Villagers Close In\n\nBy A Correspondent | Karoi, Zimbabwe  A dramatic end unfolded in Karoi as triple murder suspect Trymore Tore (37) was caught hiding in a bush after a two-day manhunt led by police and community members. Tore, who is accused of committing a brutal triple homicide, attempted to take his own life as he realized there was no escape.\n\nThe intense search began when police investigations led them to a house in Chikangwe Township, Karoi. However, Tore managed to slip through their grasp, retreating to his rural home. Determined to bring him to justice, villagers and law enforcement scoured the area relentlessly.\n\nOn February 23, at approximately 5:45 p.m., sharp-eyed villagers spotted Tore concealed in dense brush just a kilometer from his homestead. As the net closed in, Tore inflicted multiple wounds on himself using an okapi knife, stabbing his chest four times and his neck twice in a desperate suicide attempt.\n\nVillagers swiftly apprehended the suspect and handed him over to the authorities. Tore received initial medical attention at Chitindiva Clinic before being transferred to Karoi District Hospital, where he remains under armed police guard.\n\nThe shocking turn of events has left the Karoi community reeling, with residents lauding the collaboration between police and civilians that ultimately led to Tores capture. As investigations continue, authorities are working to ensure justice is served for the tragic triple murder that has shaken the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Triple Murder Suspect Caught Hiding in Bush, Attempts Suicide as Police and Villagers Close In By A Correspondent | Karoi, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/murder-suspect-caught-hiding/\">Continue reading<span class=\"screen-reader-text\"> \"Murder Suspect Caught Hiding\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Temporary Teachers Return",
            "url": "https://www.zimeye.net/2025/02/25/temporary-teachers-return/",
            "content": "Govt Allows Parents to Hire Temporary Teachers Amid Critical Shortage in ECD and Science Subjects\n\nHarare, Zimbabwe  In a significant move to address the acute shortage of teachers in critical subject areas, the Government of Zimbabwe has granted parents the green light to employ temporary teachers for Early Childhood Development (ECD) and science subjects. This interim measure aims to fill the gap while awaiting the recruitment of 8,000 permanent educators by the Public Service Commission (PSC) this year.\n\nThe Ministry of Primary and Secondary Education, which has been vocal about the teacher deficit in schools, has prioritized ECD, science, and mathematics as the most affected areas. According to Deputy Minister Angeline Gata, School Development Committees (SDCs) have been authorized to engage relief teachers where financial resources permit.\n\nAs a ministry, we have gone public on the shortage of teachers at ECD and other science learning areas. We have even extended that to other levels and grades experiencing critical shortages, Deputy Minister Gata stated during a parliamentary Question and Answer session.\n\nThe initiative allows SDCs to employ what are referred to as para-professional teachers on a temporary basis. These relief educators will serve until the PSC completes its deployment of qualified teachers to the affected schools. Deputy Minister Gata emphasized that the Government would not interfere with the contractual agreements between schools and the temporary educators.\n\nThe contracts of these para-professionals are between the schools and the individuals concerned, and they are only engaged subject to the availability of funds for their remuneration, she added.\n\nThis development is expected to bring much-needed relief to schools struggling with high student-to-teacher ratios, particularly in foundational and technical subjects. The move also highlights the Governments commitment to ensuring uninterrupted learning for students across the country.\n\nAs the Ministry of Primary and Secondary Education continues to push for long-term solutions, the temporary measure will empower communities to take proactive steps in maintaining educational standards.\n\nStay tuned for more updates on this developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Govt Allows Parents to Hire Temporary Teachers Amid Critical Shortage in ECD and Science Subjects Harare, Zimbabwe — In a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/temporary-teachers-return/\">Continue reading<span class=\"screen-reader-text\"> \"Temporary Teachers Return\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Pope Francis Condition Explained…",
            "url": "https://www.zimeye.net/2025/02/25/pope-francis-condition-explained/",
            "content": "By A Correspondent\n\nPope Francis remains in critical condition, the Vatican reported, with blood tests revealing mild signs of kidney failure, which are currently being managed. The 88-year-old pontiff continues to fight pneumonia in both lungs.\n\nThe Vatican confirmed that, although the pope was hospitalized over a week ago, he has not experienced further respiratory issues since the previous evening. Some of his blood tests show early, mild kidney failure, but the situation is under control. The pope is also said to be vigilant and well-oriented.\n\nFrancis is still receiving oxygen, but he participated in the Holy Mass on Sunday morning from a special apartment on the 10th floor of Gemelli Hospital, where he has been receiving care. The medical staff attending to him also joined in the Mass.\n\nDue to the complexity of his condition and the wait for the effects of ongoing treatments, the Vatican has stated that the prognosis remains uncertain.\n\nEarlier in the day, the Vatican revealed that the pope had received a high flow of oxygen after experiencing a respiratory crisis but had a restful night in the hospital. He was unable to lead the weekly Angelus prayer for the third time in his nearly 12-year papacy.\n\nIn his sermon, which was distributed to the press, Pope Francis expressed his gratitude to the medical team for their dedication as he continues his treatment.\n\nAdmitted to a Rome clinic on February 14 for tests related to a respiratory tract infection, the pope was later diagnosed with pneumonia in both lungs after a CT scan.\n\nDr. Jamin Brahmbhatt, a urologist from Orlando Health Medical Group, commented on the popes kidney condition, telling CNN that the update shouldnt cause alarm. Its not necessarily anything significant, but we can tell his condition remains critical, Brahmbhatt said. The kidneys are delicate but resilient organs.\n\nHe explained that infections, particularly in older adults, can quickly escalate, leading to sepsis, which may damage multiple organs, including the kidneys. In Pope Francis case, this has resulted in mild renal failure, which can either improve with treatment or potentially cause permanent damage, he added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Pope Francis remains in critical condition, the Vatican reported, with blood tests revealing mild signs of kidney … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/pope-francis-condition-explained/\">Continue reading<span class=\"screen-reader-text\"> \"Pope Francis Condition Explained…\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Chamisa Slams Mnangagwa For Manipulating Zimbabweans With False Narratives",
            "url": "https://www.zimeye.net/2025/02/25/chamisa-slams-mnangagwa-for-manipulating-zimbabweans-with-false-narratives/",
            "content": "By Tinashe Sambiri\n\nOpposition leader Advocate Nelson Chamisa has accused President Emmerson Mnangagwas government of manipulating Zimbabwean citizens through blue lies in a bid to maintain control.\n\nSpeaking out against what he described as desperate tactics by the current regime, Chamisa urged citizens to remain strong and resilient in the face of ongoing challenges.\n\nIn a statement issued on Sunday, Chamisa criticized the governments efforts to deceive the public, claiming that when those in power cannot manipulate or control the people, they resort to spreading lies.\n\nWhen they cant control or manipulate you they start to lie about you, Chamisa said, underscoring his belief that the Mnangagwa administration is willing to use deceit as a tool for maintaining its authority.\n\nChamisas comments come as Zimbabwe continues to face significant economic and political turmoil. With the country grappling with high inflation, unemployment, and widespread poverty, the opposition leader warned that the government is increasingly relying on false narratives to maintain its hold on power.\n\nDespite the governments rhetoric, Chamisa urged citizens to stay true to their values and not succumb to manipulation.\n\nKeep strong. Stay pure and incorruptible, he said, encouraging people to resist efforts to undermine their integrity. He ended his statement with a hopeful note, saying, Blessed Sunday, urging his supporters to find strength and optimism in difficult times.\n\nThe term blue lies implies a deliberate distortion of truth by those in power, often intended to serve the interests of the ruling regime.\n\nIt reflects his belief that Mnangagwas government is not only failing to address the countrys pressing issues but is also engaging in deceitful tactics to divert attention from its shortcomings.\n\nAs tensions continue to rise, Chamisas call for unity and resilience serves as a rallying cry for those dissatisfied with the current state of affairs in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Opposition leader Advocate Nelson Chamisa has accused President Emmerson Mnangagwa’s government of manipulating Zimbabwean citizens through “blue … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/chamisa-slams-mnangagwa-for-manipulating-zimbabweans-with-false-narratives/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Slams Mnangagwa For Manipulating Zimbabweans With False Narratives\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Mnangagwa’s 2030 Agenda Tears Apart Nation",
            "url": "https://www.zimeye.net/2025/02/25/mnangagwas-2030-agenda-tears-apart-nation/",
            "content": "By A Correspondent\n\nTensions have escalated within Zimbabwes political landscape as supporters of President Emmerson Mnangagwa, particularly the online movement Varakashi4ED, rally behind the Vision 2030 agenda while defending key figures within the government from criticism.\n\nOn Monday, the National Chairman of Varakashi4ED, Godwin Nkatha, addressed the growing controversy surrounding the partys National Legal Affairs Secretary, Patrick Chinamasa.\n\nNkatha took to social media to urge Zimbabweans to engage in respectful dialogue rather than disrespectful attacks on political figures, emphasizing the importance of unity in achieving the countrys long-term goals.\n\nI would like to address the recent discourse surrounding our National Legal Affairs Secretary Cde Patrick Chinamasa, Nkatha said. While it is important to express differing viewpoints, I believe it is equally crucial to engage in constructive dialogue rather than resorting to disrespectful insults.\n\nChinamasa, who has played a central role in Zimbabwean politics for decades, has been at the center of the criticism. As a former Finance Minister, his leadership during difficult economic periods has been both praised and criticized. Nkatha defended Chinamasas track record, noting that his contributions to Zimbabwes political and economic landscape should not be undermined by personal attacks.\n\nPatrick Chinamasa, with his decades of experience in Zimbabwean politics, has contributed significantly to our nations journey, Nkatha asserted. As a former Finance Minister, he played a pivotal role during challenging economic times, navigating complexities that required considerable expertise. His efforts to stabilize our economy, particularly during turbulent periods, should not be overshadowed by personal attacks or attempts to tarnish his reputation.\n\nNkatha emphasized that criticism aimed at leadership, especially from within, could have long-lasting and detrimental effects. Criticism aimed at leadership, especially from within, can have far-reaching consequences. It can undermine the very foundations of unity and progress we strive to build, he warned.\n\nThe tension stems from ongoing debates within the political sphere regarding the Vision 2030 initiative, which seeks to transform Zimbabwes economy and improve the quality of life for all citizens. Nkatha stressed that the Vision 2030 initiative represents hope for many Zimbabweans and that it should be supported with collaborative effort and constructive engagement.\n\nOur focus should be on fostering collaboration, respecting diverse opinions, and coming together to support the Vision 2030 agenda, Nkatha urged. Discrediting individuals, particularly those who have dedicated their lives to public service, detracts from the collective effort required to realize our goals.\n\nWith divisions becoming more apparent, Nkatha called for an approach rooted in respect and unity, highlighting the necessity for dialogue in resolving differences and working toward a common purpose.\n\nLet us remember that the strength of our leadership lies in its ability to embrace dialogue, listen to different perspectives, and work towards a common purpose, he concluded. I urge everyone to reflect on the impact of our words and actions, and to strive for a more respectful and unified approach as we move forward.\n\nAs Zimbabwe inches closer to 2030, the future of the Vision 2030 initiative appears to hinge not only on economic strategies but on the ability of leaders and citizens alike to engage in meaningful, respectful discussions for the betterment of the nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tensions have escalated within Zimbabwe’s political landscape as supporters of President Emmerson Mnangagwa, particularly the online movement … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/mnangagwas-2030-agenda-tears-apart-nation/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s 2030 Agenda Tears Apart Nation\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        },
        {
            "title": "Munetsi Impresses On Full EPL Debut",
            "url": "https://www.zimeye.net/2025/02/25/munetsi-impresses-on-full-epl-debut/",
            "content": "By A Correspondent\n\nWolverhampton Wanderers manager Vitor Pereira has lavished praise on Zimbabwean midfielder Marshall Munetsi following his impressive full English Premier League debut against Bournemouth on Saturday.\n\nMunetsi, who joined the Wolves a few weeks ago, started in the 1-0 victory and played a crucial role until his substitution in the 67th minute. The 28-year-old box-to-box midfielder provided the assist for the winning goal scored by Cunha.\n\nMunetsis performance was characterised by his tireless work rate, winning six out of nine ground duquets and completing five out of eight aerial duels.\n\nPereira was delighted with Munetsis display, saying: What Im asking him to do is help the team as a midfielder and make runs into the box. He had a chance to score, but what I like about him is that he can miss a scoring opportunity and then defend in our box 30 seconds later.\n\nThats exactly what we were looking for when we signed him  a physical midfielder who can support our other midfielders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Wolverhampton Wanderers manager Vitor Pereira has lavished praise on Zimbabwean midfielder Marshall Munetsi following his impressive full … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/25/munetsi-impresses-on-full-epl-debut/\">Continue reading<span class=\"screen-reader-text\"> \"Munetsi Impresses On Full EPL Debut\"</span></a></p>",
            "time": "18:32",
            "date": "25 Feb 2025"
        }
    ]
}