{
    "news": [
        {
            "title": "We Are No Pushovers, Benin Coach Warns Warriors",
            "url": "https://www.zimeye.net/2025/03/18/we-are-no-pushovers-benin-coach-warns-warriors/",
            "content": "Sports Correspondent\n\nBenin coach Gernot Rohr has outlined his objectives ahead of their upcoming match against Zimbabwe in the 2026 World Cup Qualifiers Group C fixture.\n\nThe Warriors will face the West Africans at Moses Mabhida Stadium in Durban on Thursday, with kick-off scheduled for 6 pm CAT.\n\nIn his pre-match comments, Rohr expressed his desire for his team to continue their strong performance in the campaign as they take on Zimbabwe.\n\nWith seven points from four matches, Benin are currently level on points with Group C leaders Rwanda.\n\nIts quite surprising that we (Benin), Rwanda, and South Africa are the leaders after the first four rounds in this competitive Group C, Rohr told Nation Sports.\n\nWe won our last two matches in Abidjan, and now were heading into an away match against Zimbabwe in Durban, followed by another away game against South Africa in Abidjan.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Benin coach Gernot Rohr has outlined his objectives ahead of their upcoming match against Zimbabwe in the 2026 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/we-are-no-pushovers-benin-coach-warns-warriors/\">Continue reading<span class=\"screen-reader-text\"> \"We Are No Pushovers, Benin Coach Warns Warriors\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "Court Postpones Trial Of Pro-Democracy Campaigners For Disorderly Conduct",
            "url": "https://www.zimeye.net/2025/03/18/court-postpones-trial-of-pro-democracy-campaigners-for-disorderly-conduct/",
            "content": "By A Correspondent| The trial of someprominent pro-democracy campaigners, who were seized from a plane in Harare last year and tortured before being prosecuted on charges of disorderly conduct in a public place, has been postponed to 27 March 2025 as one of the accused persons was not available.\n\nThe nine who include prominent pro-democracy campaigners namelyNamatai Kwekweza,Robson Chere,Samuel Gwenzi,Emmanuel Sitima,Phillies Pikitayi,Dephine Gutsa,Simbarashe Blackson,Last ChinodyaandVusumuzi Moyo, are on trial at Harare Magistrates Court answering to chargesofdisorderly conduct in a public place as defined in section 41(b) of the Criminal Law (Codification and Reform) Act.\n\nThe nine, who were arrested in July last year, are accused of allegedlyparticipating in an unsanctioned demonstration reportedly held at Harare Magistrates Court in June 2024, where they reportedly protested against the detention of Citizens Coalition for Change political party leaderJameson Timbaand some of the opposition party members and demanding their release from prison.\n\nOn Monday 17 March 2025, the trial of the nine persons could not proceed as Moyo was reportedly out of the country and could not make it on time to stand trial with his co-accused persons and hence proceedings were postponed to 27 March 2025.\n\nJeremiah Bamu,Tinashe ChinopfukutwaandKelvin KabayaofZimbabwe Lawyers for Human Rights, are representing the accused persons.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The trial of some prominent pro-democracy campaigners, who were seized from a plane in Harare last year and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/court-postpones-trial-of-pro-democracy-campaigners-for-disorderly-conduct/\">Continue reading<span class=\"screen-reader-text\"> \"Court Postpones Trial Of Pro-Democracy Campaigners For Disorderly Conduct\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "We Are No Pushovers, Benin Coach Warns Warriors",
            "url": "https://www.zimeye.net/2025/03/18/we-are-no-pushovers-benin-coach-warns-warriors-2/",
            "content": "Sports Correspondent\n\nBenin coach Gernot Rohr has outlined his objectives ahead of their upcoming match against Zimbabwe in the 2026 World Cup Qualifiers Group C fixture.\n\nThe Warriors will face the West Africans at Moses Mabhida Stadium in Durban on Thursday, with kick-off scheduled for 6 pm CAT.\n\nIn his pre-match comments, Rohr expressed his desire for his team to continue their strong performance in the campaign as they take on Zimbabwe.\n\nWith seven points from four matches, Benin are currently level on points with Group C leaders Rwanda.\n\nIts quite surprising that we (Benin), Rwanda, and South Africa are the leaders after the first four rounds in this competitive Group C, Rohr told Nation Sports.\n\nWe won our last two matches in Abidjan, and now were heading into an away match against Zimbabwe in Durban, followed by another away game against South Africa in Abidjan.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Benin coach Gernot Rohr has outlined his objectives ahead of their upcoming match against Zimbabwe in the 2026 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/we-are-no-pushovers-benin-coach-warns-warriors-2/\">Continue reading<span class=\"screen-reader-text\"> \"We Are No Pushovers, Benin Coach Warns Warriors\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "Warriors Ready To Face Benin",
            "url": "https://www.zimeye.net/2025/03/18/warriors-ready-to-face-benin/",
            "content": "Sports Correspondent\n\nKhama Billiat has shared his thoughts on Knowledge Musonas return to the Warriors squad ahead of their 2026 FIFA World Cup Qualifiers Group C matches against Benin and Nigeria this week.\n\nMusona made a return to the national team after ending his international retirement, having initially stepped down in May 2022 to focus on his club career and allow younger players a chance to shine. However, coach Michael Nees successfully persuaded him to come back, and the forward is now rejoining the team.\n\nBilliat believes Musonas wealth of experience will be a valuable asset to the squad.\n\nHaving Knowledge back, with all his experience, is a huge motivation, Billiat told ZBC News before the Warriors departure for Durban, South Africa on Sunday afternoon. Weve worked together in the past, and it feels amazing to have him back. Its been a long wait, and now hes finally here. We really need his experience, and it will add a lot to the team. Hes a great leader, and his presence will surely be a big motivation for all of us.\n\nDiscussing the Warriors chances in the upcoming games, Billiat said: Were taking each match one step at a time, focusing on doing our best. The first one is in South Africa against Benin, so thats where our focus is right now.\n\nThe Warriors will host Benin at Moses Mabhida Stadium in Durban on Thursday, before traveling to Uyo, Nigeria, to face the Super Eagles on Monday.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Khama Billiat has shared his thoughts on Knowledge Musona’s return to the Warriors squad ahead of their 2026 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/warriors-ready-to-face-benin/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Ready To Face Benin\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "R124 000 fraud trial resumes as more key witnesses testify",
            "url": "https://www.zimeye.net/2025/03/18/r124-000-fraud-trial-resumes-as-more-key-witnesses-testify/",
            "content": "By A Correspondent| The trial of a Harare man Michael Smith, accused of defrauding MA Auto Suppliers trading as Mr Cruiser of at least US$38 000 and R124 000 resumed.\n\nThe State prosecutor Mr Anesu Chirenje has led testimony from two key witnesses.\n\nSmith faces multiple charges, including two counts of theft of trust property, 12 counts of fraud, and 25 counts of corruptly concealing transactions from his principal, represented by Mr Michael Scott Asher, before Harare Magistrate Mrs Ethel Chichera.\n\nThe first witness, Sophia Mupariwa, a Customer Service Adviser at MA Auto Suppliers, testified about her former boss, Michael Gordon Smith.\n\nHer responsibilities include attending to customer inquiries, receiving and booking in customer vehicles and inspecting vehicles and generating quotations and job cards among other things.\n\nMupariwa stated that from 2020 to 2022, Smith was employed as a director, overseeing daily operations.\n\nDuring this time, several vehicles owned by Smith, his family, and friends were serviced at the company.\n\nShe alleged that Smith frequently ordered the release of these vehicles either without full payment or after partial payments, despite the company providing labor and parts for the services.\n\nFor instance in one case, a client with a Land Cruiser 100 Series was charged US$1 680 for seat covers but only paid US$850, leaving a loss of US$830 to the company.\n\nOn another occasion, Smith brought in his sons Prado J95 for repairs costing US$1 378.46 but paid only US$600, leaving a balance of US$778.46 unpaid.\n\nThe second witness, Christine Vellah, Finance and Administration Manager at MA Auto Suppliers, detailed her role in maintaining financial records and ensuring fiscal compliance.\n\nShe testified that Smith managed company cash and would provide her with payment schedules, making it difficult for her to reconcile accounts due to incomplete information.\n\nVellah revealed troubling practices involving a company called Mant Procurement, in which Smith held a 50% stake.\n\nThis company allegedly siphoned money from MA Auto Suppliers without providing legitimate services.\n\nFor example, she noted an independent runner charged only 15% for transportation, but Smith inflated costs, hiding invoices to justify higher charges, leading to a loss exceeding R100 000.\n\nVellah recounted several other instances of alleged fraud.\n\nOn 9 November 2020, Smith received a US$10,000 loan from Cruiser Bond (Pvt) Ltd without informing her, resulting in the company having to repay the full amount without any record of its use.\n\nIn a sale of a Toyota Land Cruiser 78 series for US$13 000, only US$5 000 was recorded in company accounts, with Smith pocketing the rest.\n\nAdditionally, Smith reportedly took company property, including chairs valued at R4 786 and a 95-liter fridge, without ever making payment.\n\nVellah highlighted another instance where Smith instructed her to pay ZW$295 200 for fees related to a jointly operated boat, despite the company only being liable for ZW$88 250.\n\nThe remainder was Smiths personal responsibility, which he never repaid.\n\nProsecutor Chirenje through Vellah tendered documentary evidence relating cash records , invoices, emails and bank statements that inscriminate the accused largely relating to count 1 to14.\n\nDefence counsel Mr Takudzwa Nyambira raised an objecting arguing that some of the schedules which the witness was testifying to were not in order.He also said he did not have some of the schedules thay were being refered to by witness but Mr Chirenje said it was not the duty of the State to put them in order since he served him with all the documents.\n\nMr Nyambira then consented to the admission of the said documents into the record.\n\nThe trial will continue on Monday, with Vellah testifying.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The trial of a Harare man Michael Smith, accused of defrauding MA Auto Suppliers trading as Mr … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/r124-000-fraud-trial-resumes-as-more-key-witnesses-testify/\">Continue reading<span class=\"screen-reader-text\"> \"R124 000 fraud trial resumes as more key witnesses testify\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "Effects Of Reckless Driving…",
            "url": "https://www.zimeye.net/2025/03/18/effects-of-reckless-driving/",
            "content": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in an instant. Each time you choose to drive above the speed limit, you are not only endangering yourself but also putting others at risk. Speeding kills, disables, and causes heartache, leaving behind broken families and shattered lives. Its essential to understand the profound impact of your actions on the road and the ripple effect they can have on others.\n\nOne of the most tragic consequences of speeding is the loss of life. Car accidents are a leading cause of death worldwide, and speed is often a contributing factor. When drivers exceed the speed limit, they decrease their ability to react to sudden changes in road conditions, such as pedestrians crossing, animals running into the road, or other vehicles making unexpected movements. At higher speeds, the impact of a collision is much more severe, increasing the chances of fatalities or life-altering injuries.\n\nThe consequences extend far beyond the driver. A fatal or serious crash caused by speeding can leave children without parents, spouses without partners, and entire families grieving. Imagine the pain and suffering that your loved ones would endure if you were taken from them because of your reckless decision behind the wheel. Your family loves you and wants you to come home safely at the end of each day. They depend on you, and speeding compromises that promise.\n\nMoreover, speeding can lead to long-term disabilities for both drivers and other road users. Survivors of high-speed crashes often face permanent injuries, which can affect their ability to work, care for their families, or live independently. These injuries are not just physical; they can also have a psychological toll, leading to trauma, depression, and a diminished quality of life. The emotional and financial burden of recovery falls not only on the individual but also on their family and community.\n\nRespecting road laws and driving responsibly isnt just about following rules; its about ensuring the safety of everyone on the road. There are countless other drivers, pedestrians, cyclists, and motorcyclists sharing the same roads as you, and their lives are just as important. Your behavior behind the wheel affects them directly. Driving carefully and within speed limits is a basic way of showing respect for the lives and safety of others. By choosing to drive responsibly, youre helping to create a safer, more considerate driving environment for everyone.\n\nWe all have a responsibility to ensure that our actions on the road do not harm others. Every life is precious, and the impact of speeding is far-reaching. It can change your life forever and leave scars on those around you. So, before you accelerate, take a moment to think about the consequences. Your loved ones, the people around you, and even strangers on the road depend on you making the right choice. Drive safely, follow the speed limits, and remember that speeding kills. Its not just a statistic  its a reality we can all prevent.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/effects-of-reckless-driving/\">Continue reading<span class=\"screen-reader-text\"> \"Effects Of Reckless Driving…\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "Police Confirm Armed Robbery Attack at Wicknell Chivayo’s In-Laws’ Farm",
            "url": "https://www.zimeye.net/2025/03/18/police-confirm-armed-robbery-attack-at-wicknell-chivayos-in-laws-farm/",
            "content": "Marondera, Zimbabwe  18 March 2025.\n\nhttps://x.com/zimeye/status/1902004643661565994?s=46\n\nBy A Correspondent | ZimEye | The Zimbabwe Republic Police (ZRP) have confirmed a brazen armed robbery at Alpha Omega Farm in Marondera, believed to belong to the in-laws of controversial businessman Wicknell Chivayo.\n\nAccording to a press statement released today by the police, the incident occurred in the early hours of the morning at around 1:00 AM, when a gang of approximately 20 armed suspects stormed the property. The suspects, who are still at large, were reportedly armed with rifles, pistols, bolt cutters, machetes, and iron bars.\n\nZRP revealed that the attackers overpowered security personnel at the farm before proceeding to assault family members, cutting burglar screens and forcing their way into the family home. The gang made off with USD 74,100 in cash, a firearm, and several high-end mobile devices, including Samsung S24 and S23 models, as well as a Samsung Galaxy A35.\n\nThe police have launched a full-scale investigation and are appealing to members of the public for any information that could lead to the identification and arrest of the suspects.\n\nIn a statement signed by Commissioner Nyathi P., Chief Staff Officer for Press and Public Relations, the ZRP urged anyone with relevant information to contact the National Complaints Desk at 0242 703631 or via WhatsApp at 0712 800 197.\n\nThe incident is likely to draw significant public attention due to its link to Chivayos family and the scale of the attack.\n\nFurther updates will follow as the situation develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Marondera, Zimbabwe – 18 March 2025. https://x.com/zimeye/status/1902004643661565994?s=46 By A Correspondent | ZimEye | The Zimbabwe Republic Police (ZRP) have confirmed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/police-confirm-armed-robbery-attack-at-wicknell-chivayos-in-laws-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Police Confirm Armed Robbery Attack at Wicknell Chivayo’s In-Laws’ Farm\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mystery Over Theft Of Chivayo Lobola Cash",
            "url": "https://www.zimeye.net/2025/03/18/mystery-over-theft-of-chivayo-lobola-cash/",
            "content": "By A Correspondent\n\nIn a dramatic turn of events, a significant sum of US$75,000, believed to be part of the lobola money paid by controversial tenderpreneur Wicknell Chivayo for his wife Lulu Muteke, was stolen in a daring raid on Tuesday morning.\n\nThe theft occurred at Alpha Omega Farm in Marondera, where up to 19 armed gunmen reportedly stormed the property in the dead of night, according to ZimLive.\n\nThe robbery comes just days after Chivayo made headlines by paying a hefty lobola amount for Lulu Muteke. It is believed that Chivayo paid over US$100,000 in total for the lobola, a traditional bride price, but a portion of the money, specifically US$75,000, was reportedly taken during the raid.\n\nThe amount was allegedly in cash and was meant to be part of the formal lobola agreement between Chivayo and Mutekes family.\n\nWitnesses claim the gunmen were heavily armed and managed to overpower those at the farm, making off with the substantial sum before fleeing the scene. Authorities were alerted shortly after the raid, and police have since launched an investigation into the theft.\n\nChivayo, known for his controversial business dealings, made headlines last week after he reportedly paid the large lobola sum to Lulus parents, which stirred public conversation about the lavish amount involved in a traditional custom. While the theft has raised questions, sources close to the family have not confirmed whether the stolen cash was solely part of the lobola payment or included other financial arrangements.\n\nThe police are actively pursuing leads, and it is expected that the robbery will add fuel to the ongoing debate surrounding Chivayos business dealings and personal life. However, at this stage, the focus remains on recovering the stolen money and bringing the perpetrators to justice.\n\nAs the investigation continues, the theft has left many questioning the audacity of the criminals involved and the high-profile nature of the incident, given Chivayos prominence in Zimbabwes business and social circles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a dramatic turn of events, a significant sum of US$75,000, believed to be part of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/mystery-over-theft-of-chivayo-lobola-cash/\">Continue reading<span class=\"screen-reader-text\"> \"Mystery Over Theft Of Chivayo Lobola Cash\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "Why Are All VP Chiwenga’s Ex Wives Always Violent To Him While He’s Sedated On The Bed?, Baba Jukwa Asks",
            "url": "https://www.zimeye.net/2025/03/18/why-are-all-vp-chiwengas-ex-wives-always-violent-to-him-while-hes-sedated-on-the-bed-baba-jukwa-asks/",
            "content": "FULL TEXT:\n\nCourt records 2012: Why are all VP Chiwengas ex-wives very violent to him and why do all of them like Jocelyn, always try to kill him while hes sedated on the bed?; And how does the VP always witness them doing this while hes sadated? How many people will he see trying to kill him when he starts sleeping on the biggest bed inside State House?\n\nAsijiki!NdatendaBaba Jukwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "FULL TEXT: Court records 2012: Why are all VP Chiwenga’s ex-wives very violent to him and why do all of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/why-are-all-vp-chiwengas-ex-wives-always-violent-to-him-while-hes-sedated-on-the-bed-baba-jukwa-asks/\">Continue reading<span class=\"screen-reader-text\"> \"Why Are All VP Chiwenga’s Ex Wives Always Violent To Him While He’s Sedated On The Bed?, Baba Jukwa Asks\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mnangagwa’s Independent Complaints Commission Blows State Cash While Doing Nothing",
            "url": "https://www.zimeye.net/2025/03/18/mnangagwas-independent-complaints-commission-blows-state-cash-while-doing-nothing/",
            "content": "By A Correspondent\n\nThe Zimbabwe Independent Complaints Commission (ZICC), established to address human rights violations by security services, is set to expand its operations to the provincial level in an effort to fulfill its mandate nationwide. However, critics argue that despite its establishment under the 2013 Constitution, the commission has yet to make a meaningful impact, leading to concerns over its continued misuse of state resources.\n\nZICCs Chairperson, Justice Nicholas Chinamora, spoke to state media during the commissions inaugural strategic review meeting in Darwendale on Monday. He emphasized the commissions goal of tackling human rights abuses, particularly those carried out by members of the security services, which have long been ignored.\n\nZICC was established by the 2013 Constitution of Zimbabwe, specifically Section 210. Its key mandate is to address human rights violations perpetrated by members of the security services, which had been swept under the carpet, said Justice Chinamora. The commission aims to provide an effective and independent mechanism for receiving and investigating complaints from the public. We are therefore meeting with some of the key stakeholders to deliberate on a strategy that enables us to effectively carry out this obligation in line with the National Development Strategy 1.\n\nWhile the commission talks about broad plans and strategies, such statements are starting to sound hollow as there has been no concrete action or results to show for the millions of dollars allocated to it. Justice Chinamora further disclosed that efforts are underway to recruit staff for the commission, including a substantive executive secretary, investigators, and provincial and district officers.\n\nYet, the question remains: why has this commission, along with others like the Zimbabwe Anti-Corruption Commission (ZACC), Zimbabwe Gender Commission, and Zimbabwe Human Rights Commission, failed to make a significant difference in the lives of ordinary citizens?\n\nDespite their constitutional mandate to ensure good governance, these commissions continue to face criticism for their lack of effectiveness and, in the case of ZICC, their apparent failure to meet the expectations of Zimbabweans. The lack of tangible outcomes has led many to question whether these commissions are simply draining state resources without delivering any real benefit to the public.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Independent Complaints Commission (ZICC), established to address human rights violations by security services, is set … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/18/mnangagwas-independent-complaints-commission-blows-state-cash-while-doing-nothing/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Independent Complaints Commission Blows State Cash While Doing Nothing\"</span></a></p>",
            "time": "20:28",
            "date": "18 Mar 2025"
        }
    ]
}