{
    "news": [
        {
            "title": "ZIFA Suspends U17 Selection Activities Countrywide",
            "url": "https://www.zimeye.net/2025/08/02/zifa-suspends-u17-selection-activities-countrywide/",
            "content": "By Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has suspended all ongoing Under-17 player selection activities across the country with immediate effect, citing the need to realign its technical and development processes.\n\nIn a statement issued on 1 August 2025, ZIFA said the decision affects all provincial structures and will remain in effect until further notice.\n\nThis directive is intended to ensure full procedural alignment ahead of the next phase of national planning and preparation, the association said. The suspension will allow the Association to consolidate efforts and streamline its technical development pathways in the interest of long-term youth football progression.\n\nThe announcement comes as ZIFA seeks to reform its youth structures amid longstanding criticism over inconsistency, poor coordination, and lack of transparency in player development and selection processes.\n\nWhile the decision halts grassroots selection events, ZIFA has instructed provincial structures to submit their current lists of selected players. The lists must be sent to the ZIFA Technical Department via email at[emailprotected], with a copy to[emailprotected].\n\nZIFA thanked provincial football leaders for their continued cooperation and reaffirmed its commitment to developing youth football in Zimbabwe.\n\nFor any further clarification, stakeholders have been urged to contact the Technical Department directly.\n\nThe suspension raises fresh questions about the future of Zimbabwes junior national teams and whether the restructuring efforts will bring long-overdue reforms  or lead to further delays in nurturing future football talent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent The Zimbabwe Football Association (ZIFA) has suspended all ongoing Under-17 player selection activities across the country with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/zifa-suspends-u17-selection-activities-countrywide/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Suspends U17 Selection Activities Countrywide\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "Will Voters Trust a New Party to Protect Their Children’s Future?",
            "url": "https://www.zimeye.net/2025/08/02/will-voters-trust-a-new-party-to-protect-their-childrens-future/",
            "content": "By A Correspondent\n\nA political party calling itself Freedom Fighters for Change has declared its intention to bring an end to Zanu PFs decades-long dominance, pledging to lead Zimbabwe toward transparency, sustainability, and accountability.\n\nIn a statement released last week, the party expressed alarm over the countrys economic decline, rampant resource exploitation, and failure in governance  warning that future generations stand to inherit nothing if action is not taken now.\n\nFellow Zimbabweans, the statement begins, as we stand here today, I am filled with concern about the future of our children and grandchildren. Our economy is struggling, and our resources are being looted. Were not leaving anything for future generations.\n\nThe party, whose message has been widely shared on social media, outlined a four-point roadmap to national recovery:\n\nRevitalize the economy through sustainable practices\n\nProtect natural resources for future generations\n\nInvest in education and skills development\n\nPromote transparency and accountability in governance\n\nWe must act now to ensure our children inherit a prosperous, sustainable Zimbabwe, the statement added. We owe it to our children and grandchildren to get it right. Lets work together to build a better future.\n\nUsing the hashtag #WeMove, Freedom Fighters for Change is targeting disillusioned citizens  particularly young people  who are searching for a viable political alternative.\n\nAlthough the party has not yet revealed its leadership structure or election strategy, its bold message has already stirred conversation around Zimbabwes political future.\n\nWith the 2028 general elections on the horizon and renewed debate around succession within Zanu PF, Freedom Fighters for Change is positioning itself as a serious contender for change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A political party calling itself Freedom Fighters for Change has declared its intention to bring an end … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/will-voters-trust-a-new-party-to-protect-their-childrens-future/\">Continue reading<span class=\"screen-reader-text\"> \"Will Voters Trust a New Party to Protect Their Children’s Future?\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "June O & A-level Results Out",
            "url": "https://www.zimeye.net/2025/08/02/june-o-a-level-results-out/",
            "content": "By A Correspondent-The Zimbabwe Schools Examination Council, ZIMSEC, has announced the release of June 2025 Advanced and Ordinary Level examination results.\n\nThe exam body made the announcement in a brief statement shared on its social media platforms on Saturday morning.\n\nZIMSEC said students can access their results via its online portal.\n\nVisit ZIMSECs Results Portal with the linkhere:https://dcmv4.zimsec.co.zw/\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Zimbabwe Schools Examination Council, ZIMSEC, has announced the release of  June 2025 Advanced and Ordinary Level examination … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/june-o-a-level-results-out/\">Continue reading<span class=\"screen-reader-text\"> \"June O & A-level Results Out\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "Car Crashes Into House in Zvishavane Midnight Accident — Occupants Escape Death by a Whisker",
            "url": "https://www.zimeye.net/2025/08/02/car-crashes-into-house-in-zvishavane-midnight-accident-occupants-escape-death-by-a-whisker/",
            "content": "By A Correspondent\n\nThere was a near-tragic incident in Zvishavanes Runde Constituency, Maglas R Section, after a car veered off the road and rammed into a house around midnight, Zvishavane 24/7 reported on Thursday.\n\nAccording to Zvishavane 24/7, the driver lost control of the vehicle, which then crashed into the residential property while the occupants were inside. Miraculously, no one was killed in the crash.\n\nThe occupants missed death by a whisker, the platform reported, highlighting just how close the situation came to turning fatal.\n\nResidents in the area are calling for greater caution from motorists, especially during the night.\n\nWe urge drivers to drive with caution, especially during the night. Reckless driving always causes unnecessary loss of life and property, read part of the public appeal.\n\nThe Zimbabwe Republic Police is yet to release an official statement on the accident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent There was a near-tragic incident in Zvishavane’s Runde Constituency, Maglas R Section, after a car veered off … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/car-crashes-into-house-in-zvishavane-midnight-accident-occupants-escape-death-by-a-whisker/\">Continue reading<span class=\"screen-reader-text\"> \"Car Crashes Into House in Zvishavane Midnight Accident — Occupants Escape Death by a Whisker\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "Zanu PF Activist Claims Mnangagwa is “The Only Leader in the World” Developing Own Country Without Foreign Aid",
            "url": "https://www.zimeye.net/2025/08/02/zanu-pf-activist-claims-mnangagwa-is-the-only-leader-in-the-world-developing-own-country-without-foreign-aid/",
            "content": "By A Correspondent\n\nZanu PF supporter and vocal Murakashi, Tanaka Gumbo, has sparked a wave of criticism online after posting a bold and highly exaggerated praise of President Emmerson Mnangagwa, claiming he is the only leader in the world developing a country without external assistance.\n\nTaking to his official Facebook page on Friday, Gumbo wrote:President Emmerson Dambudzo Mnangagwa: The Only Leader in the World to Develop a Nation Using Its Own Resources. Since 2018, the Second Republic has successfully implemented 9,706 projects across Zimbabwemaking President Emmerson Dambudzo Mnangagwa the only President globally to achieve such extensive national development without relying on external aid. His remarkable leadership has led many to rally for his tenure to be extended until 2030.\n\nThe post, widely circulated across social media platforms, has been met with ridicule by critics who say it reflects the dangerous levels of sycophancy within Zanu PFs support base.\n\nGumbos claims come at a time when Zimbabwe continues to face deep economic challenges, including a weakening local currency, high unemployment, and a reliance on donor support in key sectors such as health and food security.\n\nPolitical analysts say such statements are part of a broader strategy within Zanu PF to portray President Mnangagwa as a visionary leader ahead of potential 2028 or extended 2030 leadership ambitions.\n\nHowever, critics argue that far from being self-sufficient, Zimbabwe has continued to depend on international partners, including the World Bank, African Development Bank, the EU, and NGOs, for various development programmes.\n\nThis type of bootlicking insults the intelligence of Zimbabweans who live with daily power cuts, rising prices, and poor public services, said a Harare-based political commentator. Claiming that Zimbabwe has developed without aid is a distortion of facts and a misrepresentation of reality.\n\nDespite the backlash, Gumbos post remains online, reflecting what many see as the growing cult-like glorification of the presidency within ruling party circles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF supporter and vocal Murakashi, Tanaka Gumbo, has sparked a wave of criticism online after posting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/zanu-pf-activist-claims-mnangagwa-is-the-only-leader-in-the-world-developing-own-country-without-foreign-aid/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Activist Claims Mnangagwa is “The Only Leader in the World” Developing Own Country Without Foreign Aid\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "ED Displaces 17,000 People",
            "url": "https://www.zimeye.net/2025/08/02/ed-displaces-17000-people/",
            "content": "By A Correspondent-The Zimbabwean government is preparing to forcibly displace over17,000 peopleabout3,652 householdsfrom communities near Tugwi-Mukosi Dam to make way for the implementation of the Tugwi-Mukosi Development Masterplan.\n\nThis new round of evictions comes just11 years after another 18,000 people weredisplacedwhen the dam filled up, an episode widely condemned by local and international human rights organisations for itscruelty and chaos. Most of those families were dumped in theinhospitable Nuanetsi Ranch, where they enduredinhuman conditionsin makeshift transit campswithout food, water, healthcare, or proper shelter.\n\nAccording to the masterplandeveloped by the University of Zimbabwe, Midlands State University, National University of Science and Technology, and Great Zimbabwe Universitythe displacement is necessary to facilitate state-led development projects. The document was released in May this year.\n\nYet, for the affected residents ofChivi and Masvingo Rural, the promises ring hollow. After the previous displacements, government pledged compensation for lost property and infrastructure.Only a small fraction$3.5 millionwas paid, and many of the victims died waiting in vain for what was rightfully theirs.\n\nDespite claims in the new masterplan that funding for compensation is available, many locals remain deeply sceptical.\n\nWeve heard this before, said a resident who asked not to be named. They talk about compensation and services, but what happened last time? We were left to die.\n\nTugwi-Mukosi Community Development Association president Tafirei Mashavakuresaid that while the community supports development, the rights of the displaced must not be trampled.\n\nWe are pro-development, he said, but we expect the affected households to receive fair compensation and to be part and parcel of the development process. They must be resettled where they can access healthcare, schools, water, and other basic services.\n\nThe looming displacement will affect families inwards 22, 24, 28, and 31 in Chivi, as well aswards 22, 30, and 34 in Masvingo Rural.\n\nWhen contacted for comment,Ministry of Local Government and Public Works spokesperson Gabriel Masvorasaid the masterplan was yet to be formally adopted.\n\nIt has not yet been adopted and I would not want to pre-empt what will come out. We will be able to comment when they are done and implementing, said Masvora.\n\nAs history threatens to repeat itself, families living in the shadows of Tugwi-Mukosi Dam fear they are once again being treated as collateral damage in the name of developmentdisplaced, forgotten, and forced to start over without the support they deserve.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Zimbabwean government is preparing to forcibly displace over 17,000 people—about 3,652 households—from communities near Tugwi-Mukosi Dam to make way … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/ed-displaces-17000-people/\">Continue reading<span class=\"screen-reader-text\"> \"ED Displaces 17,000 People\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "Mnangagwa Regime in Embarrassing Climbdown on Radio, Television Licence Fees",
            "url": "https://www.zimeye.net/2025/08/02/mnangagwa-regime-in-embarrassing-climbdown-on-radio-television-licence-fees/",
            "content": "By A Correspondent\n\nThe Mnangagwa administration has backtracked on its controversial vehicle radio licence fees following an avalanche of public outrage, marking yet another U-turn in policy under pressure from citizens and political stakeholders.\n\nInformation Minister Jenfan Muswere revealed in Parliament on Wednesday that the US$30 per term licence fee charged by the Zimbabwe Broadcasting Corporation (ZBC) is under immediate review.\n\nHe said proposals are now being considered to reduce the fee to a range between US$5 and US$15.\n\nOn Tuesday, Cabinet resolved that all government levies and licence fees be reviewed. This includes the Broadcasting Services Act, under which ZBCtogether with the Ministrymust reconsider the existing fee structures, Muswere admitted.\n\nThe development follows years of criticism from citizens who have long questioned the legitimacy and fairness of ZBCs compulsory licence charges, particularly in the face of poor programming quality and persistent complaints about lack of value for money.\n\nMuswere told Parliament that the move comes after President Emmerson Mnangagwa issued a directive pushing for the urgent reassessment of the unpopular fee regime.\n\nGovernment and ZBC Left Red-Faced\n\nThe ZBC has come under sustained fire for enforcing the radio licence fee on motoristsoften using police roadblocksdespite offering programming that many view as irrelevant and politically biased. The broadcasters aggressive revenue collection tactics have led to widespread resentment.\n\nCritics have labelled the radio fee as an unjustified burden, especially on low-income earners. Now, with growing backlash and political embarrassment, the government has conceded that the charges are excessive and in need of urgent revision.\n\nMuswere confirmed that following consultations with ZBC, a Statutory Instrument will soon be gazetted to legalise the new, lower fees. He also indicated that the upcoming policy framework will include exemptions for senior citizens and vulnerable groups.\n\nThe decision has already been made, and I expect the process to be completed without delay, Muswere said. The goal is to make sure all licence fees are affordable and aligned with the ease-of-doing-business agenda.\n\nPart of Wider Fee Overhaul\n\nThe ZBC licence climbdown forms part of a wider Cabinet directive to overhaul state-imposed levies across 12 sectors, including:\n\nHealth\n\nTourism\n\nAgriculture\n\nRetail\n\nTransport\n\nEnergy\n\nManufacturing\n\nTelecommunications\n\nBroadcasting\n\nFinancial services\n\nConstruction\n\nThe liquor industry\n\nThe review is being led by the Ministry of Finance, Economic Development and Investment Promotion, with changes expected within the next six months.\n\nPeople Power Forces Policy Reversal\n\nObservers say the policy reversal is a direct response to public pressure, after weeks of criticism on social media platforms, sharp parliamentary debates, and condemnation from civil society.\n\nThis is a victory for ordinary Zimbabweans who refused to be silent while being milked by a broadcaster that offers no value in return, said a Harare-based media rights advocate.\n\nDespite this rare concession, critics argue that without real reform in public broadcasting, any feehigh or lowwill remain unjustifiable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Mnangagwa administration has backtracked on its controversial vehicle radio licence fees following an avalanche of public … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/mnangagwa-regime-in-embarrassing-climbdown-on-radio-television-licence-fees/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime in Embarrassing Climbdown on Radio, Television Licence Fees\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "🔴 Boy Mauled to Death by Dogs — Cover-Up Alleged",
            "url": "https://www.zimeye.net/2025/08/02/%f0%9f%94%b4-boy-mauled-to-death-by-dogs-cover-up-alleged/",
            "content": "Darwendale, Zimbabwe  2 August 2025\n\nBy Farai D Hove | ZimEye | A tragic and horrifying incident has rocked the Bornvally farming community near Darwendale, where a young boy identified as Shelton Panganai was mauled to death by a pack of dogs on July 21, 2025. The five vicious dogs, believed to belong to a war veteran named Takawira Magede, reportedly attacked the child under unknown circumstances.\n\nAccording to sources on the ground, the boys body was discovered severely mutilated, bearing clear signs of an animal mauling. A death certificate from Parirenyatwa Police Hospital has confirmed that Shelton died due to unnatural causes, despite earlier suggestions that the death was natural. The case was originally attended by multiple officers including Constable Fatsamba, who eventually took over the investigation after initial leads were allegedly suppressed.\n\n Allegations of a Political Cover-Up\n\nInsiders allege that Takawira Magede, a prominent war veteran and influential figure in the area, contacted a top-level politician shortly after the attack in an attempt to cover up the incident. Following that call, the initial investigating officer was reportedly ordered to stand down, raising serious concerns about interference and obstruction of justice.\n\nNo arrests have been made to date, despite the clear involvement of the dogs and the owners potential liability. Residents have expressed fears of intimidation, and some claim they have been warned not to speak about the matter publicly.\n\n Call for Justice\n\nCommunity members and human rights advocates are now calling for an independent investigation into Sheltons death, citing the suspicious handling of the case and a growing trend of impunity for politically connected individuals.\n\nThe pathologist report, signed and stamped at Parirenyatwa on 21 July 2025, explicitly states the cause of death as unnatural, contradicting earlier police claims. The report confirms that a full post-mortem was not conducted, further fuelling public outrage.\n\nKEY FACTS:\n\nDeveloping Story: This case is likely to draw national attention amid increasing scrutiny over the role of political interference in Zimbabwes justice system. Family members of the deceased are reportedly preparing to take legal action, and pressure is mounting on the Zimbabwe Republic Police to reopen the investigation and ensure accountability.\n\nMore updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Darwendale, Zimbabwe — 2 August 2025 By Farai D Hove | ZimEye | A tragic and horrifying incident has rocked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/%f0%9f%94%b4-boy-mauled-to-death-by-dogs-cover-up-alleged/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 Boy Mauled to Death by Dogs — Cover-Up Alleged\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "Armed Robbery at Blue Waters Medical Centre, Kuwadzana — Victims Brutalised, CCTV Footage Surfaces",
            "url": "https://www.zimeye.net/2025/08/02/armed-robbery-at-blue-waters-medical-centre-kuwadzana-victims-brutalised-cctv-footage-surfaces/",
            "content": "By Dorrothy Moyo | ZimEye | 2 August 2025 |\n\nImagine the horror of being mugged inside a clinic  a place where youre supposed to feel safe, cared for, and protected. Where the hum of medical machines, the soft footsteps of nurses, and the quiet assurance of healing should be the only things you encounter. Instead, youre thrown to the floor, threatened, assaulted, and robbed by masked criminals while waiting for treatment. This is not a scene from a crime thriller  its the terrifying reality that unfolded at Blue Waters Medical Centre in Kuwadzana.\n\nhttps://x.com/zimeye/status/1951604684377956665?s=46\n\nKUWADZANA  In a shocking and violent turn of events, Blue Waters Medical Centre in Kuwadzana was attacked by a gang of armed robbers on the evening of Saturday, 27 July 2025, in what is being described as one of the most brazen assaults on a private health facility in recent months.\n\nThe incident, captured in high-definition CCTV footage from the main reception area, unfolded at precisely 19:52PM, when at least two masked men, both armed with long sticks and possibly other weapons, stormed into the clinic. The attackers, dressed in dark hooded jackets and beige trousers, immediately ordered patients and staff to the ground.\n\n SEQUENCE OF EVENTS:\n\n Initial Entry: The two robbers entered the reception where several patients  men and women  were seated, including elderly individuals. Without hesitation, one of the robbers pointed what appeared to be a weapon while the other wielded a baton-like stick, demanding compliance.\n\n Forced Submission: In a matter of seconds, terror spread across the room as the attackers aggressively forced everyone to the ground. Some victims were struck with sticks while others, including the receptionist, were threatened into silence and submission.\n\n Physical Assault: The CCTV reveals one attacker striking a man on the back, forcing him down. A woman in a long dress can be seen trembling as she lays motionless beside other victims. One robber even kicks a handbag aside before rifling through belongings scattered across the floor.\n\n Reinforcement Arrives: A third accomplice, dressed in blue medical scrubs or overalls, entered moments later  suggesting an inside job or someone posing as a clinic worker. Together, the trio intensified the assault, further brutalising already subdued victims.\n\n The Looting: The robbers then began ransacking personal belongings. Purses, wallets, and possibly mobile phones were collected from the terrified patients. One attacker is seen kneeling to rummage through a handbag.\n\n Escape: After nearly five minutes of terror, the gang fled, leaving behind a scene of trauma, debris, and bruised patients. The footage ends with victims still lying on the tiled floor, some too afraid to get up.\n\n COMMUNITY REACTION & POLICE RESPONSE\n\nLocal residents have been left stunned, with many calling for increased police patrols and protection of medical institutions. The incident occurred during a time when patients were seeking urgent medical help, adding to the psychological and physical trauma.\n\nPolice in Harare are yet to officially confirm arrests, but investigations are ongoing. Sources close to the scene say the attackers may have known the clinic layout well, further fuelling suspicions of an inside link.\n\n APPEAL FOR INFORMATION\n\nAuthorities are appealing to anyone who may recognise the attackers from the footage or has knowledge of their whereabouts to come forward. Anonymous tips can be shared via ZRPs toll-free line or nearest police station.\n\nIf you were present at Blue Waters Medical Centre during the incident or have any eyewitness accounts, kindly contact our newsroom confidentially at[emailprotected].\n\nThis is a developing story. Stay tuned for updates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | 2 August 2025 | Imagine the horror of being mugged inside a clinic — … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/armed-robbery-at-blue-waters-medical-centre-kuwadzana-victims-brutalised-cctv-footage-surfaces/\">Continue reading<span class=\"screen-reader-text\"> \"Armed Robbery at Blue Waters Medical Centre, Kuwadzana — Victims Brutalised, CCTV Footage Surfaces\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        },
        {
            "title": "New Political Party Vows to End Zanu PF Dominance",
            "url": "https://www.zimeye.net/2025/08/02/new-political-party-vows-to-end-zanu-pf-dominance/",
            "content": "By A Correspondent\n\nA newly formed political party, Freedom Fighters for Change, has claimed it is ready to bring an end to Zanu PFs decades-long dominance and steer Zimbabwe towards a more transparent, sustainable, and accountable future.\n\nIn a statement released last week, the party expressed alarm over the countrys deteriorating economy, natural resource exploitation, and poor governance  warning that future generations would inherit nothing if urgent action is not taken.\n\nFellow Zimbabweans, the statement begins, as we stand here today, I am filled with concern about the future of our children and grandchildren. Our economy is struggling, and our resources are being looted. Were not leaving anything for future generations.\n\nThe party, whose message has quickly gained traction on social media, outlined a four-point plan to restore national prosperity.\n\nWe must act now to ensure our children inherit a prosperous, sustainable Zimbabwe, the statement continues. We need to:\n\nRevitalize our economy through sustainable practices\n\nProtect our natural resources for future generations\n\nInvest in education and skills development\n\nPromote transparency and accountability in governance\n\nFraming their campaign as a duty to the next generation, the party added: We owe it to our children and grandchildren to get it right. Lets work together to build a better future.\n\nUsing the hashtag #WeMove, Freedom Fighters for Change is appealing to disillusioned youth and citizens eager for a political alternative.\n\nAlthough the party has yet to release details about its leadership or structures, its bold positioning has stirred discussion among those calling for democratic renewal and a break from the status quo.\n\nWith the 2028 general elections on the horizon and speculation growing over Zanu PFs succession plans, Freedom Fighters for Change presents itself as a rising force aiming to challenge the entrenched political order.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A newly formed political party, Freedom Fighters for Change, has claimed it is ready to bring an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/02/new-political-party-vows-to-end-zanu-pf-dominance/\">Continue reading<span class=\"screen-reader-text\"> \"New Political Party Vows to End Zanu PF Dominance\"</span></a></p>",
            "time": "18:46",
            "date": "03 Aug 2025"
        }
    ]
}