{
    "news": [
        {
            "title": "Sabhuku Mliswa Sparks New Scandal",
            "url": "https://www.zimeye.net/2025/03/03/sabhuku-mliswa-sparks-new-scandal/",
            "content": "By Sports Reporter- Former Norton MP Temba Mliswa has once again found himself at the center of controversy, this time within Zimbabwean rugby.\n\nMliswa, a former fitness trainer turned politician, has caused the arrest of top Zimbabwe Rugby Union (ZRU) executives following his dismissal for allegedly breaching the sports constitution.\n\nThe outspoken politician argues that the rugby bosses were engaged in corruption and financial mismanagement, leading to a legal battle that has escalated into a criminal investigation.\n\nZRU Vice President Losson Mtongwiza and CEO Sifiso Made have since been arrested and appeared in court over corruption-related allegations.\n\nIn response to the unfolding saga, the ZRU issued a statement outlining the basis of Mliswas suspension.Specifically, the Union wishes to clarify that Mr. Mliswas conduct has been in direct violation of Section 19.1 of the ZRU Constitution. This section explicitly prohibits taking internal disputes to external courts outside of the structures outlined in the ZRU statutes, Rugby Africa, and World Rugby regulations.The ZRUs established disciplinary processes are designed to address such matters fairly and efficiently within the rugby framework. As a result of this constitutional violation, the ZRU Board resolved unanimously, in accordance with due process, to suspend Mr. Mliswa with immediate effect.His case has been referred to a disciplinary committee, where he will be given the opportunity to present his case in a fair and transparent manner, adhering to the established rules of the Union. The Zimbabwe Rugby Union remains committed to fostering a thriving rugby ecosystem built on respect, discipline, and unity.\n\nMliswa, however, has not taken the suspension lightly.\n\nUsing his X (formerly Twitter) account, he has publicly accused the ZRU leadership of corruption.\n\nHe claims his only offence was demanding transparency regarding the unions financial records.\n\nMy only crime has been the continued insistence for bank statements and breakdowns relating to money they used, Mliswa stated. However, I dont tire of such issues; they have only made it worse as they cant sustain me, and I will reveal more. No amount of name-dropping will work with some of us.\n\nThis latest scandal is not Mliswas first brush with controversy. Over the years, he has cultivated a reputation for being a firebrand politician unafraid of confrontation.\n\nMliswa was once a prominent member of the ruling Zanu PF party before being expelled in 2015 following allegations of factionalism.\n\nHis fallout with the party saw him become an independent MP for Norton, where he remained a vocal critic of government corruption and mismanagement.\n\nMliswa has had public spats with various political figures, including President Emmerson Mnangagwas allies. His combative nature has seen him engage in heated exchanges in Parliament and on social media, often exposing internal party rivalries.\n\nHe has also been accused of using his political influence and relationship with the former powerful CIO minister, Didymus Mutasa, to grab land and demand bribes from business figures, allegations he has consistently denied.\n\nHis aggressive approach to business and politics has made him a divisive figure.\n\nBefore venturing into politics, Mliswa was a fitness trainer, working with high-profile individuals, including former West Indies cricketer Brian Lara.\n\nBold moves and unfiltered commentary on governance issues marked his transition into politics.\n\nOver the years, he has been arrested multiple times on charges ranging from public disorder to alleged extortion.\n\nDespite this, he has remained a significant force in Zimbabwean politics and activism.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter- Former Norton MP Temba Mliswa has once again found himself at the center of controversy, this time … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/sabhuku-mliswa-sparks-new-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Sabhuku Mliswa Sparks New Scandal\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Court Blocks Mwonzora’s Presidency",
            "url": "https://www.zimeye.net/2025/03/03/court-blocks-mwonzoras-presidency/",
            "content": "By Munacho Gwamanda High Court judge Justice Zhou has nullified the congress that elected Douglas Mwonzora, the leader of the MDC-T, in December 2022.\n\nIn the judgement passed last week Friday, Justice Zhou found that the congress violated the partys constitution, rendering its outcomes null and void.\n\nThe court ruling comes after a challenge by former MDC-T vice president Elias Mudzuri and several senior party members, including Edward Kakora, Gift Kanjana, Den Moyo, and John Nyika.\n\nThe applicants argued that Mwonzora had orchestrated an illegitimate congress that failed to meet the constitutional requirements for such a gathering.\n\nThe purported National Congress held in December 2022 by the second respondent (Mwonzora) as the National Congress of the first respondent (MDC-T) is declared null and void for non-compliance with the first respondents constitution, ruled Justice Zhou.\n\nAccording to the judgment, the congress lacked a quorum, as key party structures such as the Womens Congress and Youth Congress were excluded.\n\nArticle 6.2.2 and 6.2.7 of the MDC-T constitution stipulate that at least two-thirds of entitled members must be present for a congress to be valid.\n\nThe congress convened by the second respondent did not meet such quorum as the Womens Congress and the Youth Congress were not held, the judgment read. The congress lasted for less than a few hours since there were not enough members to reach the quorum.\n\nAdditionally, the court found that Mwonzora had handpicked members of the National Executive Council instead of allowing democratic elections as required by the partys constitution.\n\nThe ruling also noted that notices for the congress were not properly published in national newspapers, violating Articles 6.2.4.1 and 6.2.4.2 of the MDC-T constitution.The ruling orders the party to convene a fresh congress within six months under an independent electoral commission.\n\nThe court battle is the latest in a series of internal conflicts that have plagued the MDC since the Supreme Courts 2020 ruling, which reinstated the partys 2014 structures and set the stage for Mwonzoras rise to power.\n\nInitially aligned with Mwonzora, Mudzuri fell out with him over leadership disputes and internal democratic processes.\n\nMwonzoras leadership has been marred by controversy, including allegations of expelling political rivals and sidelining key party organs.\n\nCritics argue that his tactics have contributed to the destruction of the MDC, which was once Zimbabwes strongest opposition force under its late founding leader, Morgan Tsvangirai.\n\nMudzuri and his allies contend that the 2022 congress was part of Mwonzoras broader strategy to consolidate power illegitimately.\n\nThe attempt to nullify the congress still leaves [Mwonzora] as the President by virtue of his election at the December 2022 congress, he argued in court.\n\nHowever, the High Court rejected this claim, ruling that his leadership position remains disputed.\n\nThe ruling adds further instability to the MDC, which has already suffered major electoral losses and defections.\n\nThe party, which once posed a formidable challenge to Zanu PF, has fractured into multiple factions, with Nelson Chamisas Citizens Coalition for Change (CCC) emerging as the dominant opposition force.\n\nWith the court ordering a new congress, it remains to be seen whether the MDC-T can recover or if this marks the final chapter in its decline.\n\nThe decision could also have broader political ramifications, potentially influencing future opposition alliances ahead of Zimbabwes next elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda– High Court judge Justice Zhou has nullified the congress that elected Douglas Mwonzora, the leader of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/court-blocks-mwonzoras-presidency/\">Continue reading<span class=\"screen-reader-text\"> \"Court Blocks Mwonzora’s Presidency\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Temba Mliswa Confirms He’s Been Suspended",
            "url": "https://www.zimeye.net/2025/03/03/temba-mliswa-confirms-hes-been-suspended/",
            "content": "Harare, Zimbabwe  Prominent rugby administrator Temba Mliswa has confirmed that he has been suspended from all rugby activities by the Zimbabwe Rugby Union (ZRU), following allegations that he violated the sports constitution by publicly accusing its leadership of financial mismanagement.\n\nThe ZRUs decision comes after Mliswa, who serves as the chairperson of the Mashonaland West provincial rugby board, took the unions executives to court, which led to the arrests of ZRU vice president Losson Mtongwiza and secretary-general Sifiso Made on corruption-related charges.\n\nhttps://x.com/hmetro_/status/1894772978753179921?s=46\n\nIn an official statement, the ZRU defended the suspension, stating that Mliswa had breached Section 19.1 of the ZRU Constitution, which prohibits taking internal disputes to external courts instead of utilizing rugbys internal governance structures, including Rugby Africa and World Rugby regulations.\n\nAs a result of this constitutional violation, the ZRU Board resolved unanimously, in accordance with due process, to suspend Mr Mliswa with immediate effect. His case has been referred to a disciplinary committee, where he will be given the opportunity to present his case in a fair and transparent manner, the ZRU statement read.\n\nThe union further emphasized its commitment to respect, discipline, and unity, maintaining that its internal disciplinary mechanisms are designed to handle such disputes efficiently.\n\nMliswa Speaks Out\n\nResponding to his suspension, Mliswa took to his X (formerly Twitter) account, reiterating his claims that the ZRU leadership has been involved in financial misconduct.\n\nMy only crime has been the continued insistence for bank statements and breakdowns relating to money they used, Mliswa wrote.\n\nHe also suggested that more revelations about alleged corruption in the union were forthcoming.\n\nHowever, I dont tire of such issues; they have only made it worse as they cant sustain me and I will reveal more. No amount of name-dropping will work.\n\nArrests of ZRU Executives\n\nMliswas legal challenge against the ZRU resulted in the arrest of Mtongwiza and Made, who have since appeared in court to face corruption-related allegations. The nature of the charges against them has not been fully disclosed, but sources indicate they relate to mismanagement of rugby funds and lack of financial transparency.\n\nThe unfolding saga has put the spotlight on governance issues within Zimbabwean rugby, with growing concerns about accountability at the highest levels of the sports administration.\n\nWhats Next?\n\nWith Mliswas case now before a disciplinary committee, the coming weeks will be crucial in determining his future in Zimbabwean rugby. Meanwhile, the arrests of senior ZRU officials raise serious questions about financial oversight in the sport.\n\nAs the battle between Mliswa and the rugby union escalates, all eyes will be on how ZRU handles this crisisand whether it can restore credibility to its leadership.\n\nThis is a developing story. More updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, Zimbabwe – Prominent rugby administrator Temba Mliswa has confirmed that he has been suspended from all rugby activities by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/temba-mliswa-confirms-hes-been-suspended/\">Continue reading<span class=\"screen-reader-text\"> \"Temba Mliswa Confirms He’s Been Suspended\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Caps United Snatch Vital Point",
            "url": "https://www.zimeye.net/2025/03/03/caps-united-snatch-vital-point/",
            "content": "Sports Correspondent\n\nThe 2025 Castle Lager Premier Soccer League kicked off on a tense note for defending champions Simba Bhora, as they battled to a goalless draw against FC Platinum at Wadzanayi Stadium in Shamva on Saturday.\n\nUnder the guidance of new coach Joel Luphahla, who took the reins from title-winning coach Tonderai Ndiraya, Simba Bhora were expected to make a statement. However, they were unable to break down a resilient FC Platinum side.\n\nMeanwhile, in Chisumbanje, Greenfuel and CAPS United shared the spoils in a thrilling 1-1 draw.\n\nPerfect Chikwende put the hosts ahead in the 18th minute, but Jayden Bakaris 56th-minute equalizer ensured Makepekepe left with a valuable point.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The 2025 Castle Lager Premier Soccer League kicked off on a tense note for defending champions Simba Bhora, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/caps-united-snatch-vital-point/\">Continue reading<span class=\"screen-reader-text\"> \"Caps United Snatch Vital Point\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Government Fails To Handle Armyworm Crisis In Chiredzi…",
            "url": "https://www.zimeye.net/2025/03/03/government-fails-to-handle-armyworm-crisis-in-chiredzi/",
            "content": "By A Correspondent\n\nChiredzis communal farmers are at the mercy of the devastating African armyworm, which is ravaging crops across the region.\n\nDespite recent good rains in Masvingo Province, the prospects of a successful harvest are dwindling rapidly.\n\nThe African armyworm is notorious for its ability to destroy entire fields within days, leaving farmers on edge.\n\nAgritex has promised to intervene with insecticides for affected farmers.\n\nHowever, frustrated farmers in Chiredzi have accused the government of failing to control the spread of the African armyworm.\n\nThe government has failed us, said one angry farmer. They are not doing enough to help us. We are losing our crops, and our livelihoods are at stake.\n\nAnother farmer echoed similar sentiments, stating, We have been reporting the outbreak to the authorities, but nothing has been done. The armyworm is spreading fast, and we are running out of time. The government needs to take immediate action to save our crops.\n\nThe community is gripped by fear and uncertainty as the situation continues to worsen. While Agritex has promised support, farmers are skeptical about the governments ability to address the crisis effectively.\n\nAs the battle to save their crops intensifies, Chiredzis farmers are determined to protect their livelihoods against the relentless African armyworm.\n\nHowever, they urge the government to take immediate action to support their efforts and prevent further devastation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chiredzi’s communal farmers are at the mercy of the devastating African armyworm, which is ravaging crops across … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/government-fails-to-handle-armyworm-crisis-in-chiredzi/\">Continue reading<span class=\"screen-reader-text\"> \"Government Fails To Handle Armyworm Crisis In Chiredzi…\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Armyworm Outbreak Causes Mayhem In Chiredzi",
            "url": "https://www.zimeye.net/2025/03/03/armyworm-outbreak-causes-mayhem-in-chiredzi/",
            "content": "By A Correspondent\n\nThe African armyworm is wreaking havoc on crops in Chiredzi, leaving communal farmers desperate for solutions. Despite promising rains in Masvingo Province, the prospects of a successful harvest are rapidly dwindling due to the armyworms destructive power.\n\nAgritex has stepped in with promises of insecticides, but frustrated farmers accuse the government of inaction. The government has failed us, one angry farmer exclaimed. Theyre not doing enough to help. Our crops and livelihoods are at stake.\n\nAnother farmer echoed these sentiments, stating, Weve reported the outbreak, but nothings been done. The armyworm is spreading fast, and times running out. The government must act now to save our crops.\n\nThe community is gripped by fear and uncertainty as the situation worsens. While Agritex has offered support, farmers doubt the governments ability to effectively address the crisis.\n\nAs farmers fight to save their crops, they urge the government to take immediate action and provide necessary support to prevent further devastation.\n\nEffective management of the fall armyworm threat requires swift action, and farmers are counting on the government to deliver .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The African armyworm is wreaking havoc on crops in Chiredzi, leaving communal farmers desperate for solutions. Despite … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/armyworm-outbreak-causes-mayhem-in-chiredzi/\">Continue reading<span class=\"screen-reader-text\"> \"Armyworm Outbreak Causes Mayhem In Chiredzi\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Man In Court For Insulting Mnangagwa",
            "url": "https://www.zimeye.net/2025/03/03/man-in-court-for-insulting-mnangagwa-2/",
            "content": "By A Correspondent\n\nA Shurugwi man, Tinashe Chigiya, has been remanded in custody by Magistrate Sithabile Zungula after allegedly insulting President Mnangagwa by calling him a dog.\n\nThe case is set to continue at a later date.\n\nThe incident reportedly occurred on January 27, 2025, near Musavezi River, following the drowning of a minor.\n\nChigiya, aged 26 and from Makandire Village in Chief Nhemas area, is accused of directing his anger at the President.\n\nHe allegedly blamed Mnangagwa and Zanu PF supporters for permitting Chinese nationals to extract sand from the river, which he claimed was causing environmental damage.\n\nChigiya further expressed concern that the river had become unsafe for children, citing contamination caused by the activities of the Chinese nationals working in the area.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Shurugwi man, Tinashe Chigiya, has been remanded in custody by Magistrate Sithabile Zungula after allegedly insulting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/man-in-court-for-insulting-mnangagwa-2/\">Continue reading<span class=\"screen-reader-text\"> \"Man In Court For Insulting Mnangagwa\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Looking For A Lasting Solution To Congo Crisis",
            "url": "https://www.zimeye.net/2025/03/03/looking-for-a-lasting-solution-to-congo-crisis/",
            "content": "OPEN LETTER:\n\nREIMAGINING PEACE:A FEDERAL OR CONFEDERATE CONSTRUCT AS THE KEY TO STABILITY IN THE DRC\n\nTo:\n\nH.E. variste Ndayishimiye,President of Burundi & Chairperson, COMESA,Ben Bella Road,Lusaka,ZambiaEmail:[emailprotected]. Phone: +260-211-229725\n\nCc:\n\nH.E. Mahmoud Ali YoussoufChairperson, African Union Commission (AUC),P.O. Box 3243,Roosevelt Street (Old Airport Area),Addis Ababa,EthiopiaEmail:[emailprotected].Phone: +251 11 551 77 00\n\nDr. Nkosazana Dlamini ZumaFormer Chairperson, African Union Commission,Africa Union Foundation, 1258 Lever Road, Midrand,South AfricaEmail:[emailprotected].Phone: +27 (0)11 313 5105\n\nH.E. John Dramani Mahama,President of Ghana &Chairperson, Tana Forum Board,FLAGSTAFF HOUSE,Accra,GhanaEmail:[emailprotected].Phone: +233 30 290 4419\n\nHon. Fortune Z. Charumbira,President, Pan-African Parliament (PAP),Private Bag X16,Halfway House,Midrand, Johannesburg, South AfricaEmail:[emailprotected]. Phone: +27 11 545 5000\n\nRt Hon. Kingsford Sumana Bagbin,The Speaker of Parliament,Parliament House,Accra.\n\nBackground-\n\nA Century of Instability and Exploitation in the DRC.The Democratic Republic of Congo (DRC) has endured over a century of conflict and exploitation.\n\nThe arbitrary borders imposed during the 188485 Berlin Conference fractured indigenous societies and disrupted traditional governance as expounded in the study of Teperek (2025).\n\nAlthough the nation gained independence in 1960, it has been trapped in cycles of violence, corruption, and foreign interference which is driven largely by the struggle over its vast mineral wealth.\n\nInternational and regional bodies (AU, EAC, SADC) and UN peacekeeping missions have made efforts, including the 2020 Silencing the Guns initiative, yet lasting peace remains elusive (Yeboah & Okoro, 2024).\n\nNeighboring states like Rwanda, Uganda, and Burundi have been drawn into these conflicts, worsening regional tensions and fueling further instability.\n\nChallenges-\n\nThe Limits of Conventional Interventions\n\nTraditional external interventions and elite-driven governance models have repeatedly failed to secure peace in the DRC.\n\nKey Challenges include-\n\nWhat New Model Can Break the Cycle of Conflict and Foster Transformation?\n\nGiven the shortcomings of past interventions and centralized governance, how can the DRC achieve lasting peace, stability, and economic transformation?\n\nWhat model can empower local communities and leverage indigenous wisdom to counter external exploitation and internal divisions?\n\nThe way forward-\n\nA Federal or Confederate State Anchored in African-Led Solutions\n\nWe propose establishing a federal or confederate state between the DRC and Rwanda with potential inclusion of Burundi that prioritizes regional integration, grassroots participation, and economic self-reliance.\n\nThis approach includes-\n\nPrioritizing intra-African trade would harness the DRCs resources for the benefit of local populations, creating jobs, improving food security, and expanding access to vital services.\n\nA secure DRC could serve as a cornerstone for a united African governance model, echoing the visions of leaders like Dr. Kwame Nkrumah.\n\nIn a nutshell-\n\nA Radical Yet Practical Shift:This proposal represents a transformative shift from ineffective international interventions to African-led, bottom-up solutions.\n\nBy integrating traditional governance, unifying security, and fostering economic interdependence, a federal or confederate state between the DRC, Rwanda, and potentially Burundi provides a clear pathway to lasting peace and development.\n\nThe time for Africa to reclaim its destiny is now only through self-reliant, indigenous models can Agenda 2063 be truly realized.\n\nWe urge the SADC, EAC, COMESA, and the AU to consider this innovative proposal for a united, stable, and prosperous Central Africa.\n\nOn behalf of the Pan African Solidarity Group,\n\nBenjamin Anyagre Aziginaateeg\n\nCEO, AfriKan Continental Union Consult (ACUC)\n\nReferences:\n\nTeperek, A. A. (2025). Historical Conditions of the Worlds Smallest Economies and Modern Times. InLong-Term Economic Growth in the Worlds Smallest Economies: Historical, Political, and Economical Aspects(pp. 39-79). Cham: Springer Nature Switzerland.\n\nYeboah, P. A., & Okoro, J. P. (2024). From the Sustainable Development Goal 16 to the African Union Silencing the Guns Agenda: Why It Is So Difficult to Achieve Sustainable Peace and Stability in Africa?. InAfricas Engagement with the Responsibility to Protect in the 21st Century(pp. 339-356). Singapore: Springer Nature Singapore.\n\nConflict Statistics (2025). Data on recent clashes in Eastern DRC, including 700 deaths and 2,800 injuries. https://edition.cnn.com/2025/02/24/africa/7000-killed-in-fighting-in-drc-intl/index.html\n\nEndorsing Organizations:\n\nPan African Solidarity Group and its partners\n\n Congoles Renaissance Movement (CRM)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "OPEN LETTER:  REIMAGINING PEACE:A FEDERAL OR CONFEDERATE CONSTRUCT AS THE KEY TO STABILITY IN THE DRC To: H.E. Évariste Ndayishimiye,President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/looking-for-a-lasting-solution-to-congo-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Looking For A Lasting Solution To Congo Crisis\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "Simba Bhora Title Defence Off to a Shaky Start",
            "url": "https://www.zimeye.net/2025/03/02/simba-bhora-title-defence-off-to-a-shaky-start/",
            "content": "Sports Correspondent\n\nThe 2025 Castle Lager Premier Soccer League kicked off on a tense note for defending champions Simba Bhora, as they battled to a goalless draw against FC Platinum at Wadzanayi Stadium in Shamva on Saturday.\n\nUnder the guidance of new coach Joel Luphahla, who took the reins from title-winning coach Tonderai Ndiraya, Simba Bhora were expected to make a statement. However, they were unable to break down a resilient FC Platinum side.\n\nMeanwhile, in Chisumbanje, Greenfuel and CAPS United shared the spoils in a thrilling 1-1 draw.\n\nPerfect Chikwende put the hosts ahead in the 18th minute, but Jayden Bakaris 56th-minute equalizer ensured Makepekepe left with a valuable point.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The 2025 Castle Lager Premier Soccer League kicked off on a tense note for defending champions Simba Bhora, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/simba-bhora-title-defence-off-to-a-shaky-start/\">Continue reading<span class=\"screen-reader-text\"> \"Simba Bhora Title Defence Off to a Shaky Start\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        },
        {
            "title": "JUST IN…Mwonzora Falls",
            "url": "https://www.zimeye.net/2025/03/02/just-in-mwonzora-falls/",
            "content": "By Munacho Gwamanda The High Court has nullified MDC-T President Douglas Mwonzoras December 2022 elective congress and delegitimised his leadership of the once-powerful opposition party.\n\nThe ruling, delivered by Justice Zhou on Friday, found that the congress was conducted in violation of the partys constitution, rendering its outcomes null and void.\n\nThe court ruling comes after a challenge by former MDC-T vice president Elias Mudzuri and several senior party members, including Edward Kakora, Gift Kanjana, Den Moyo, and John Nyika.\n\nThe applicants argued that Mwonzora had orchestrated an illegitimate congress that failed to meet the constitutional requirements for such a gathering.\n\nThe purported National Congress held in December 2022 by the second respondent (Mwonzora) as the National Congress of the first respondent (MDC-T) is declared null and void for non-compliance with the first respondents constitution, ruled Justice Zhou.\n\nAccording to the judgment, the congress lacked a quorum, as key party structures such as the Womens Congress and Youth Congress were excluded.\n\nArticle 6.2.2 and 6.2.7 of the MDC-T constitution stipulate that at least two-thirds of entitled members must be present for a congress to be valid.\n\nThe congress convened by the second respondent did not meet such quorum as the Womens Congress and the Youth Congress were not held, the judgment read. The congress lasted for less than a few hours since there were not enough members to reach the quorum.\n\nAdditionally, the court found that Mwonzora had handpicked members of the National Executive Council instead of allowing democratic elections as required by the partys constitution.\n\nThe ruling also noted that notices for the congress were not properly published in national newspapers, violating Articles 6.2.4.1 and 6.2.4.2 of the MDC-T constitution.The ruling orders the party to convene a fresh congress within six months under an independent electoral commission.\n\nThe court battle is the latest in a series of internal conflicts that have plagued the MDC since the Supreme Courts 2020 ruling, which reinstated the partys 2014 structures and set the stage for Mwonzoras rise to power.\n\nInitially aligned with Mwonzora, Mudzuri fell out with him over leadership disputes and internal democratic processes.\n\nMwonzoras leadership has been marred by controversy, including allegations of expelling political rivals and sidelining key party organs.\n\nCritics argue that his tactics have contributed to the destruction of the MDC, which was once Zimbabwes strongest opposition force under its late founding leader, Morgan Tsvangirai.\n\nMudzuri and his allies contend that the 2022 congress was part of Mwonzoras broader strategy to consolidate power illegitimately.\n\nThe attempt to nullify the congress still leaves [Mwonzora] as the President by virtue of his election at the December 2022 congress, he argued in court.\n\nHowever, the High Court rejected this claim, ruling that his leadership position remains disputed.\n\nThe ruling adds further instability to the MDC, which has already suffered major electoral losses and defections.\n\nThe party, which once posed a formidable challenge to Zanu PF, has fractured into multiple factions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda– The High Court has nullified MDC-T President Douglas Mwonzora’s December 2022 elective congress and delegitimised his leadership … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/just-in-mwonzora-falls/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN…Mwonzora Falls\"</span></a></p>",
            "time": "09:46",
            "date": "03 Mar 2025"
        }
    ]
}