{
    "news": [
        {
            "title": "Tungwarara Slams Zanu PF Heavyweights As Infighting Rises…",
            "url": "https://www.zimeye.net/2025/12/14/tungwarara-slams-zanu-pf-heavyweights-as-infighting-rises/",
            "content": "Tinashe Sambiri ZANU PFs deepening internal cracks were laid bare on Saturday after Presidential Adviser Paul Tungwarara publicly lashed out at senior party figures, accusing them of deliberately blocking his political advancement and fueling factionalism within the ruling party.\n\nSpeaking at the Chipinge district empowerment programme, Tungwarara did not hold back as he took aim at ZANU PF heavyweights Munyaradzi Machacha and Patrick Chinamasa amid tensions surrounding his controversial co-option into the partys Central Committee.\n\nIn a video that has since circulated widely, Tungwarara framed the standoff as a matter of loyalty and discipline, warning that resistance from within the party would no longer be tolerated. I will not be stopped by individuals who think they are bigger than the party, he said. If you cannot support the leadership and the direction we are taking, then you must step aside.\n\nPolitical analysts quickly interpreted the remarks as a thinly veiled ultimatum to senior figures perceived to be standing in his way. This was a clear support or resign message, said one pundit. It reflects how badly fractured the party has become.\n\nTungwarara openly vented his frustration with what he described as internal sabotage, insisting that his critics were undermining party unity. ZANU PF must move forward, he said. We cannot allow personal interests to derail progress and empowerment of our people.\n\nHis remarks have sent shockwaves through party structures, with many viewing them as an unprecedented public attack on established power brokers by a figure closely aligned with the presidency.\n\nBy the time of publication, ZANU PF had not issued an official response, and neither Machacha nor Chinamasa had commented on Tungwararas explosive claims.\n\nPaul Tungwarara\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– ZANU PF’s deepening internal cracks were laid bare on Saturday after Presidential Adviser Paul Tungwarara publicly lashed out … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/tungwarara-slams-zanu-pf-heavyweights-as-infighting-rises/\">Continue reading<span class=\"screen-reader-text\"> \"Tungwarara Slams Zanu PF Heavyweights As Infighting Rises…\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Nelson Chamisa Speaks On Special Charity Dinner",
            "url": "https://www.zimeye.net/2025/12/14/nelson-chamisa-speaks-on-special-charity-dinner/",
            "content": "Tinashe Sambiri Citizens for Change leader Nelson Chamisa on Saturday night hosted a special annual charity dinner in Harare, describing the event as a celebration of compassion, unity and service to the less privileged.\n\nThe charity dinner brought together supporters, faith leaders and invited guests for an evening that blended fundraising, worship and social interaction, with proceeds set to support various community causes.\n\nSpeaking after the event, Chamisa emphasised the importance of giving and collective responsibility in addressing social challenges.\n\nCaring heart, sharing hope what a wonderful night of giving, dancing, and worship, said Chamisa. Thank you all for the heart you bring to all our humble efforts to make a difference.\n\nHe praised attendees for their commitment to service, saying their participation reflected a shared desire to uplift communities. Your love is always truly amazing, Chamisa added.\n\nChamisa also underscored the role of faith and solidarity in driving social change, noting that compassion must translate into action.\n\nThe event, which he described as both joyful and purposeful, forms part of his annual initiatives aimed at supporting vulnerable groups.\n\nThe dinner was widely shared on social media under the themes of care, service and hope, with Chamisa reiterating his message of unity and generosity. Share care, serve  God is in it, he said.\n\nNelson Chamisa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Citizens for Change leader Nelson Chamisa on Saturday night hosted a special annual charity dinner in Harare, describing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/nelson-chamisa-speaks-on-special-charity-dinner/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Speaks On Special Charity Dinner\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Watch: Tungwarara Declares He Is Unstoppable",
            "url": "https://www.zimeye.net/2025/12/14/watch-tungwarara-declares-he-is-unstoppable/",
            "content": "By A Correspondent  President Emmerson Mnangagwas special advisor Paul Tungwarara, says he is not going back on empowerment.\n\nTungwarara attacked those in Zanu PF attempting to disrupt empowerment projects.\n\nHe made the remarks in Chipinge on Saturday\n\nMANICALAND PROVINCE WILL NEVER BE THE SAME AGAIN !!pic.twitter.com/MYXANOjADs\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa’s special advisor Paul Tungwarara, says he is not going back on empowerment. Tungwarara … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/watch-tungwarara-declares-he-is-unstoppable/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Tungwarara Declares He Is Unstoppable\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Zanu PF Mocked Over ‘437,000 Defections’ Claim as Credibility Wanes",
            "url": "https://www.zimeye.net/2025/12/14/zanu-pf-mocked-over-437000-defections-claim-as-credibility-wanes/",
            "content": "Tinashe Sambiri Zanu PFs latest claims of a massive opposition exodus have been met with widespread skepticism, with many Zimbabweans accusing the ruling party of inflating figures to project an image of unstoppable dominance.\n\nSpeaking on Thursday, Zanu PF Secretary for the Commissariat Munyaradzi Machacha boasted that the party had allegedly absorbed 437,000 opposition members through its Huyai Kumusha uyanini Ekhaya/Come Home campaign, a claim critics say stretches credibility.\n\nJust this year alone, we have received not less than 187,000 people returning to the party, in addition to the 250,000 we had previously received, Machacha said, adding that Zanu PF had created a special structure to manage the alleged influx.\n\nMachacha framed the supposed defections as a decisive rejection of the opposition. We can see that this is a massive mass movement away from bankrupt opposition politics to empowering, development-oriented Zanu PF politics, he said.\n\nHowever, political observers argue the figures appear politically convenient, especially as Zimbabwe continues to grapple with economic decline, rising prices and growing public frustration. Critics say there is little visible evidence to support claims of such large-scale defections.\n\nDespite the backlash, Machacha went on to heap praise on President Emmerson Mnangagwa, attributing the alleged surge in support to his leadership. It is something that we are really proud of  all because of President Mnangagwas wise leadership and his skilful handling of both governance and economic issues, he said.\n\nMachacha further stirred controversy by suggesting Zanu PF ultimately seeks total political dominance. Naturally, Zanu PF will continue to grow and eventually become an unlegislated one-party state again as we wait for the emergence of opposition politics, he said.\n\nThe remarks have heightened fears of democratic backsliding, with critics warning that the ruling party appears more focused on consolidating power and controlling the narrative than addressing Zimbabwes worsening socioeconomic crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF’s latest claims of a massive opposition exodus have been met with widespread skepticism, with many Zimbabweans … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/zanu-pf-mocked-over-437000-defections-claim-as-credibility-wanes/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Mocked Over ‘437,000 Defections’ Claim as Credibility Wanes\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Chamisa Silences Naysayers With Special Charity Dinner",
            "url": "https://www.zimeye.net/2025/12/14/chamisa-silences-naysayers-with-special-charity-dinner/",
            "content": "Tinashe Sambiri Against a backdrop of persistent criticism and political skepticism, citizens leader Nelson Chamisa used a high-profile charity dinner in Harare on Saturday night to shift attention away from politics and toward philanthropy, reinforcing his message of service and compassion.\n\nThe special annual charity dinner brought together supporters, faith leaders and invited guests for an evening that blended fundraising, worship and social interaction, with proceeds set to support various community causes.\n\nSpeaking after the event, Chamisa emphasised the importance of giving and collective responsibility in addressing social challenges. Caring heart, sharing hope what a wonderful night of giving, dancing, and worship, said Chamisa. Thank you all for the heart you bring to all our humble efforts to make a difference.\n\nHe praised attendees for their commitment to service, saying their participation reflected a shared desire to uplift communities. Your love is always truly amazing, Chamisa added.\n\nChamisa also underscored the role of faith and solidarity in driving social change, noting that compassion must translate into action. The event, which he described as both joyful and purposeful, forms part of his annual initiatives aimed at supporting vulnerable groups.\n\nThe dinner was widely shared on social media under the themes of care, service and hope, with Chamisa reiterating his message of unity and generosity. Share care, serve  God is in it, he said.\n\nNelson Chamisa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Against a backdrop of persistent criticism and political skepticism, citizens leader Nelson Chamisa used a high-profile charity dinner … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/chamisa-silences-naysayers-with-special-charity-dinner/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Silences Naysayers With Special Charity Dinner\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Top Military Brass Flock SB Moyo’s Wedding",
            "url": "https://www.zimeye.net/2025/12/14/top-military-brass-flock-sb-moyos-wedding/",
            "content": "By a Correspondent-Zimbabwes top military and political leadership converged in Harare on Saturday for the wedding of Sibusiso Brendon Moyo, son of the late former Minister of Foreign Affairs and International Trade, Lieutenant-General (Retired) Sibusiso SB Moyo, in a gathering that carried both personal and political symbolism.\n\nAmong those in attendance were Vice President and retired General Constantino Chiwenga, Defence Minister Oppah Muchinguri-Kashiri, Energy and Power Development Minister July Moyo, Deputy President of the Senate Lieutenant-General (Retired) Mike Nyambuya, Zimbabwe Defence Forces Commander General Emmanuel Matatu, and several serving and retired senior military officers.\n\nChiwenga, who was the guest of honour, used the occasion to publicly reflect for the first timeon the deaths of SB Moyo and Air Chief Marshal (Retired) Perrance Shiri, two senior military figures whose passing reshaped Zimbabwes post-2017 political and security landscape.\n\nThe Vice President was speaking at the wedding of Sibusiso Brendon Moyo and his bride, Tawana Mercy Gawaza, in what was both a family celebration and a moment laden with historical significance.\n\nChiwenga, Moyo and Shiri formed the core military leadership behind the November 2017 intervention that ended Robert Mugabes 37-year rule. At the time, Chiwenga was Commander of the Zimbabwe Defence Forces, SB Moyo became the public face of the operation when he announced the intervention on national television, and Shirithen Commander of the Air Force of Zimbabweprovided critical operational backing.\n\nTogether, the trio facilitated the return of Emmerson Mnangagwa, who had fled the country days earlier after being dismissed as vice president, and oversaw the political process that culminated in Mugabes resignation and Mnangagwas ascent to the presidency.\n\nPolitical and military insiders have long argued that the 2017 transition was underpinned by an informal elite understanding that Mnangagwa would serve a limited term before handing over power to Chiwenga around 2023. That transition never occurred.\n\nInstead, following his consolidation of power, Mnangagwa began reconfiguring the security establishment, retiring or sidelining several senior commanders associated with the 2017 military intervention and with Chiwengas faction.\n\nAir Chief Marshal Perrance Shiri, later appointed Minister of Agriculture, died in July 2020, with authorities attributing his death to COVID-19related complications. SB Moyo followed in January 2021, with government also citing COVID-19 complicationsan explanation that drew scepticism in some quarters given reports that he had been recovering days earlier.\n\nThe deaths and removals of several senior figures effectively weakened Chiwengas influence within the military establishment, leaving Mnangagwa firmly in control of both the ruling party and the security apparatus. Since then, the President has presided over growing internal debate within Zanu PF around the so-called 2030 agenda, a controversial push by his allies to extend his rule beyond constitutionally mandated term limitsan agenda widely opposed by factions aligned to Chiwenga.\n\nAgainst this backdrop, Chiwengas remarks at the wedding were closely watched.\n\nI want to reflect a little on my relationship with the late former Minister of Foreign Affairs and International Trade, Lieutenant-General Sibusiso SB Moyo, he said.\n\nWe enjoyed a cordial relationship from our military service into public service. It was founded on mutual trust, respect and integrity. It transcended our professional lives into brotherhoodwe became family.\n\nChiwenga said he attended the ceremony not only as guest of honour but also as a father figure to the newlyweds.\n\nAvoiding overt political references, the Vice President instead offered personal and faith-based counsel to the couple.\n\nBe each others strength in times of weakness. Celebrate together in joy, comfort one another in sorrow, and stand united through thick and thin, he said.\n\nMarriage, like life, has seasons of sunshine and storms. With Christ at the centre, no challenge is insurmountable.\n\nQuoting Philippians 4:13, Chiwenga urged the couple to anchor their union in faith, forgiveness, open communication and mutual respect.\n\nA happy family is built through daily acts of kindness, sacrifice and unwavering commitment, he said. Marriage is a journey, not a destination.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent-Zimbabwe’s top military and political leadership converged in Harare on Saturday for the wedding of Sibusiso Brendon Moyo, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/top-military-brass-flock-sb-moyos-wedding/\">Continue reading<span class=\"screen-reader-text\"> \"Top Military Brass Flock SB Moyo’s Wedding\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Our World Cup Heroes Deserve More Than Applause",
            "url": "https://www.zimeye.net/2025/12/14/our-world-cup-heroes-deserve-more-than-applause/",
            "content": "By Jacob Mutisi | Zimbabwe has done something extraordinary. Against the odds, our national rugby team has qualified for the Rugby World Cup a global stage watched by millions, a platform that places our flag, our anthem and our national pride before the entire world.\n\nYet as a nation, our response exposes a painful contradiction in our value system, Ubuthu.\n\nIn a country where luxury vehicles are routinely handed to socialites, party leaders and womens league officials many of whom have never carried the nations burden on their shoulders, the men who bled, trained, sacrificed and delivered a World Cup ticket for Zimbabwe are still expected to survive on handshakes, promises and fading praise.\n\nThis is not just unfair, it is morally wrong.\n\nSacrifice Versus EntitlementRugby is not a soft sport. These young men endure years of brutal training, injuries, long periods away from family and uncertain futures. Some juggle full-time jobs, others study, all while representing Zimbabwe with honour. They do so not for luxury, but for love of country.\n\nContrast this with the culture of entitlement we have normalised, vehicles issued as political rewards, perks granted for loyalty rather than performance and public resources diverted to people whose only achievement is proximity to power.\n\nIf service to the nation is the benchmark, then our rugby players rank far above most beneficiaries of state generosity.\n\nCars as Tools, Not GiftsA vehicle for a national athlete is not a luxury, it is a tool. It enables training, recovery, outreach, community engagement and sponsorship visibility. It is also a statement: that Zimbabwe rewards excellence, discipline and international achievement.\n\nWhen a rugby player drives through a township or rural growth point, young boys and girls see what is possible through hard work. When a socialite drives past in a top-of-the-range vehicle, the message is different and deeply damaging.\n\nNational Branding and Economic SenseLet us also be practical. The Rugby World Cup is not just sport, it is diplomacy, tourism marketing and national branding. Countries invest heavily in athletes because they understand the return respect, visibility and economic opportunity.\n\nFailing to meaningfully reward our World Cup heroes tells sponsors, investors and the international community that Zimbabwe does not know how to celebrate success or worse, does not value it.\n\nThis is not an attack on our women, political structures or civic organisations. It is a call for fairness and common sense.\n\nIf we can afford convoys, luxury vehicles and lifetime perks for political operatives, then we can certainly afford to recognise the men who have carried our nation onto the world stage.\n\nOur rugby players deserve cars more than our socialites.They deserve respect more than our slogans.They deserve support more than our empty praise.\n\nZimbabwe must decide do we reward excellence, or do we continue to celebrate entitlement?\n\nHistory and our children are watching.\n\nYour Most Obedient Son\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Jacob Mutisi | Zimbabwe has done something extraordinary. Against the odds, our national rugby team has qualified for the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/our-world-cup-heroes-deserve-more-than-applause/\">Continue reading<span class=\"screen-reader-text\"> \"Our World Cup Heroes Deserve More Than Applause\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Chiwenga Breaks Silence on SB Moyo’s Mysterious Death",
            "url": "https://www.zimeye.net/2025/12/14/chiwenga-breaks-silence-on-sb-moyos-mysterious-death/",
            "content": "By a Correspondent-Vice President Constantino Chiwenga Saturday, for the first time, publicly reflected on the deaths of former Foreign Affairs Minister Lieutenant-General (Retd) Sibusiso SB Moyo and Air Chief Marshal (Retd) Perrance Shiritwo key military figures whose sudden departures marked a dramatic turning point in Zimbabwes post-2017 power struggles.\n\nChiwenga was speaking in Harare yesterday at the wedding ceremony of SB Moyos son, Sibusiso Brendon Moyo, and his wife Tawana Mercy Gawaza, in what was both a personal and politically symbolic moment.\n\nChiwenga, Moyo and Shiri formed the core military triumvirate behind the November 2017 coup that ended Robert Mugabes 37-year rule. At the time, Chiwenga was Commander of the Zimbabwe Defence Forces, SB Moyo was the militarys public face who announced the intervention on national television, and Shiri commanded the Air Force, providing crucial operational support.\n\nTogether, they facilitated the return of Emmerson Mnangagwa, who had fled the country days earlier after being dismissed as vice president, and installed him as president following Mugabes forced resignation.\n\nMultiple political and military insiders have long maintained that the 2017 transition was underpinned by an elite power-sharing understanding, in which Mnangagwa would serve a single term before handing over to Chiwenga around 2023. That arrangement never materialised.\n\nSoon after consolidating power, Mnangagwa began systematically dismantling the military faction aligned to Chiwenga. Several senior commanders linked to the coup-era alliance were assassinated, retired, sidelined, or stripped of influence.\n\nAir Chief Marshal Perrance Shiri, once one of Mnangagwas most feared enforcers and later Agriculture Minister, died in July 2020 under opaque circumstances officially attributed to COVID illness. SB Moyo followed in January 2021, with government citing COVID-19 complicationsclaims that were met with widespread scepticism given his reported recovery days earlier.\n\nTheir deaths effectively collapsed Chiwengas military power base, leaving Mnangagwa firmly in control of both the state and security apparatus. Since then, Mnangagwa has openly pursued his controversial 2030 agenda, aimed at extending his rule beyond constitutional term limitsa move Chiwengas allies strongly opposed.\n\nAgainst this backdrop, Chiwengas remarks at the wedding carried heavy symbolic weight.\n\nI want to reflect a little on my relationship with the late former Minister of Foreign Affairs and International Trade, Lieutenant-General Sibusiso SB Moyo, Chiwenga said.\n\nWe enjoyed a cordial relationship from our military service into public service. It was founded on mutual trust, respect and integrity. It transcended professional life into brotherhoodwe became family.\n\nHe described himself as both a guest of honour and a father figure to the newlyweds.\n\nChiwenga avoided overt political references, instead offering faith-based and personal counsel to the couple.\n\nBe each others strength in times of weakness. Celebrate together in joy, comfort one another in sorrow, and stand united through thick and thin, he said.\n\nMarriage, like life, has seasons of sunshine and storms. With Christ at the centre, no challenge is insurmountable.\n\nQuoting Philippians 4:13, he urged them to anchor their union in faith, forgiveness, open communication and mutual respect.\n\nA happy family is built through daily acts of kindness, sacrifice and unwavering commitment. Marriage is a journey, not a destination, Chiwenga added.\n\nThe ceremony was attended by several senior political and military figures, including Defence Minister Oppah Muchinguri-Kashiri, Energy Minister July Moyo, Deputy President of the Senate Lieutenant-General (Retd) Mike Nyambuya, and Zimbabwe Defence Forces Commander General Emmanuel Matatu, alongside other service.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent-Vice President Constantino Chiwenga Saturday, for the first time, publicly reflected on the deaths of former Foreign Affairs … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/chiwenga-breaks-silence-on-sb-moyos-mysterious-death/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Breaks Silence on SB Moyo’s Mysterious Death\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "Chaos at Beitbridge Border Post Ahead of Christmas Holiday",
            "url": "https://www.zimeye.net/2025/12/14/chaos-at-beitbridge-border-post-ahead-of-christmas-holiday/",
            "content": "By A Correspondent Authorities at Beitbridge Border Post say they are currently clearing an average of about 13 000 travellers a day entering from South Africa as traffic volumes steadily rise ahead of the Christmas and New Year holidays.\n\nOfficials from Zimbabwe and South Africa have activated a coordinated festive-season traffic management plan, running from Wednesday until January 15 next year, aimed at easing congestion, improving efficiency and ensuring the safety of travellers during the peak holiday period.\n\nBeitbridge, the regions busiest inland port of entry, links South Africa to the north-bound corridor serving Zimbabwe, Zambia, Malawi, Tanzania, Angola, Mozambique and Botswana. The border post traditionally experiences sharp increases in both human and vehicular traffic during major holidays as millions of travellers transit the route.\n\nAssistant Regional Immigration Officer at Beitbridge, Mr Lucky Matyora, said the border post cleared an average of about 8 000 arriving travellers and 5 000 departing travellers daily between December 6 and December 12, a trend that points to a steady build-up towards the festive-season peak.\n\nTraffic volumes are rising gradually, but we are equal to the task, Mr Matyora said. We have adequate manpower deployed across all terminals, including buses, light vehicles, pedestrians and freight, to enhance efficiency and ensure compliance.\n\nHe said Zimbabwe and South Africa were operating harmonised systems that include the permanent separation of traffic streams and close operational coordination between border authorities on both sides, significantly improving the flow of travellers.\n\nMr Matyora urged travellers to report directly to immigration counters and avoid using third parties such as touts and con artists, who often cause delays and expose travellers to unnecessary inconveniences and fraud.\n\nThe modernised Beitbridge Border Post, which features permanently separated traffic lanes, has markedly improved service delivery, with travellers now accessing customised services through three automated terminals.\n\nThe introduction of the Online Border Management System and electronic gates (eGates) has further enhanced efficiency, allowing for faster clearance compared to previous festive seasons.\n\nWe encourage visitors to Zimbabwe, particularly those who require visas, to make use of the Online Border Management System so that they are cleared before arrival, Mr Matyora said.\n\nThey can lodge their applications via our website, which reduces processing time at the port of entry as only a few compliance checks are required upon arrival.\n\nHe also encouraged holders of the new Zimbabwean e-passports to use the eGates, noting that they significantly reduce waiting times.\n\nParents and guardians were advised to ensure that children are accompanied by reliable relatives and that all required supporting documents, in addition to valid passports, are carried when crossing the border.\n\nDuring off-peak periods, Beitbridge processes an average of 15 000 travellers, 1 000 commercial trucks, 120 buses and 2 000 light vehicles daily. These figures typically double during the festive season.\n\nOn the South African side, Border Management Authority spokesperson Assistant Commissioner Mmemme Mogotsi said the countrys 2025/2026 festive season operational plan was launched in Pretoria on Sunday.\n\nShe said major corridors leading to South Africas land ports would be closely monitored, with support from the Road Traffic Management Corporation, the Cross-Border Road Transport Agency and provincial traffic authorities to ensure effective traffic management.\n\nAdditional personnel and resources are being deployed to border posts, with some operating for between 16 and 24 hours daily to cope with the expected surge in festive-season traffic, Asst-Comm Mogotsi said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Authorities at Beitbridge Border Post say they are currently clearing an average of about 13 000 travellers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/chaos-at-beitbridge-border-post-ahead-of-christmas-holiday/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos at Beitbridge Border Post Ahead of Christmas Holiday\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        },
        {
            "title": "VP Chiwenga Named in Minister Chitando’s Dismissal from Cabinet",
            "url": "https://www.zimeye.net/2025/12/14/vp-chiwenga-named-in-minister-chitandos-dismissal-from-cabinet/",
            "content": "By A Correspondent  Vice President Constantino Chiwenga and President Emmerson Mnangagwas twin sons, Sean and Collins Mnangagwa, have been named as central figures in the dismissal of former Mines and Mining Development Minister Winston Chitando, amid escalating disputes over mining interests involving politically connected elites.\n\nChitando was fired on Monday while attending a strategic planning workshop for his ministry in Masvingo. Sources say he was informed of his dismissal while still on duty, a development that reportedly came as a shock to him and senior officials present at the meeting. President Mnangagwa immediately replaced him with his deputy, Polite Kambamura, with the reshuffle taking effect at once.\n\nIn a brief statement, Chief Secretary to the President and Cabinet Dr Martin Rushwaya said Chitandos removal was effected in terms of Section 340, read together with Section 108 of the Constitution. No reasons were publicly provided.\n\nHowever, multiple sources within the Ministry of Mines say Chitandos removal followed prolonged and intensifying tensions over mining licences and concessions linked to powerful political figures. According to these sources, Chitando had repeatedly refused to authorise several mining deals associated with the Presidents twin sons, Collins and Sean Mnangagwa.\n\nThe minister was under sustained pressure to approve a number of mining interests brought to him by the Presidents sons, a senior ministry official said. These included foreign-linked lithium ventures in Mashonaland Central, particularly around Mbire, as well as gold concessions in Mazowe. On several occasions, the twins sought meetings with him, but he declined to give them an audience.\n\nIn recent years, Collins and Sean Mnangagwa have assumed increasingly influential roles within their fathers political and economic networks. Senior government and Zanu PF sources allege that the twins often act as gatekeepers to the President, demanding large sums of money  reportedly up to US$50,000  from businesspeople seeking access to Mnangagwa for investment discussions. These claims, while widely circulated within political and business circles, have never been tested in court.\n\nMajor Sean Mnangagwa, who recently joined his fathers close security entourage, has become a regular presence on both domestic and international trips, frequently alongside his twin brother Collins. Sources allege that some of these trips have doubled as platforms for advancing private business interests under the cover of official government delegations. Analysts say this growing influence reflects a broader pattern of family-based state capture, with the Mnangagwa network now linked to interests in gold, chrome, lithium, fuel procurement and major infrastructure projects.\n\nSources further allege that Vice President Constantino Chiwenga also played a role in Chitandos downfall. Chitando is said to have clashed with Chiwenga over the cancellation of gold mining permits held by individuals aligned to the Vice President. Those permits were allegedly withdrawn and reassigned to other interests, prompting complaints that eventually reached the highest levels of government.\n\nThis is not the first time Chitandos position has been destabilised by disputes involving powerful elites. ZimLive previously reported that he had been removed from the mines portfolio following allegations that he attempted to interfere in a mining claim linked to Chiwengas interests. Although he later returned to the ministry, sources say tensions between the two never fully subsided.\n\nVP Chiwenga and Mnangagwa twins have not commented.\n\nChitando, a former managing director of Mimosa Mining Company, was first appointed Mines Minister in 2017 as part of Mnangagwas inaugural post-Mugabe cabinet, which was initially marketed as a technocratic team. He survived multiple cabinet reshuffles and was moved to the Local Government Ministry in 2023, before being reappointed to Mines a year later. In recent months, however, he was increasingly viewed as politically exposed as Mnangagwa tightened his grip on strategic ministries amid intensifying factional manoeuvres within Zanu PF.\n\nHis replacement, Polite Kambamura, a 48-year-old mining engineer, is  a close ally of Collins and Sean Mnangagwa. His elevation comes at a time when the Mines Ministry remains under intense public scrutiny over corruption, opaque licensing processes and the dominance of politically connected cartels over Zimbabwes vast mineral wealth.\n\nKambamuras public profile is not without controversy. He previously attracted attention following allegations by Australia-based activist Susan Mutami, who claimed he was her former lover. Mutami further alleged that Kambamura maintained relationships with several high-profile media personalities, including Samantha Musa, popularly known asMiss Red, and broadcaster Rumbi Takawira. She described the women as part of what she termed a network of slay queens linked to influential politicians and businessmen.\n\nNone of the individuals named have publicly confirmed the allegations, and Kambamura has never formally responded. Government officials have previously dismissed the claims as private matters unrelated to public office. Nonetheless, the allegations circulated widely on social media, fuelling broader debates about patronage, power and gendered exploitation within Zimbabwes political elite.\n\nKambamuras appointment to one of the countrys most politically and economically sensitive portfolios is therefore expected to reignite questions about the role of personal networks in state appointments and the deepening struggle within Zanu PF over control of the lucrative mining sector.\n\nThe dismissal of Winston Chitando marks one of President Mnangagwas most consequential cabinet changes in recent months, signalling a recalibration of power at the heart of Zimbabwes minerals economy. Whether Kambamura will reform a ministry long viewed as a battleground for elite interests  or preside over a further consolidation of control by politically connected actors  remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Vice President Constantino Chiwenga and President Emmerson Mnangagwa’s twin sons, Sean and Collins Mnangagwa, have been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/14/vp-chiwenga-named-in-minister-chitandos-dismissal-from-cabinet/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Named in Minister Chitando’s Dismissal from Cabinet\"</span></a></p>",
            "time": "08:50",
            "date": "15 Dec 2025"
        }
    ]
}