{
    "news": [
        {
            "title": "Police Silent On Mutangadura Murder Investigations",
            "url": "https://www.zimeye.net/2025/09/13/no-leads-in-mutangadura-murder/",
            "content": "By Crime and Courts Reporter A month after the shocking murder of Ruwa businessmanJoseph Mutangaz Mutangadura, police are yet to provide any concrete leads, leaving family, friends, and the wider community demanding answers.\n\nPolice maintain that investigations are ongoing, despite reports that leaked soon after Mutangaduras death suggested he may have been killed by his wifes alleged lover, according to a local online news portal.\n\nMutangaduras marriage toPatience Dambudzowas marked by turbulence, with longstanding allegations of infidelity and mistrust. The tensions became public last year when Mutangadura reportedly launched a failed manhunt for his wifes suspected lover. At one point, he moved out of their home in protest, though he later returned under uneasy circumstances.\n\nBy the time of his death, the couple had seemingly reconciled, but close associates suggest unresolved tensions may have lingered.\n\nOn the night ofSunday, 17 August, seven masked men stormed Mutangaduras Lisheen Estate farmhouse in Ruwa. They overpowered a security guard, tied him up, and demanded a description of Mutangadura before heading straight to the couples bedroom.\n\nDespite his reported offer to take them to cash at his abattoir, the intruders shot the 67-year-old businessman multiple times in the chest and stomach. Strikingly, they left behind valuables and took only a cellphone worth aboutUS$10, intensifying suspicions that the attack was atargeted assassinationrather than a robbery.\n\nPatience was rendered unconscious during the ordeal and remains hospitalised under police protection. Investigators have seized her cellphone for forensic analysis, a move that has fuelled speculation of possible insider involvement.\n\nLeaked messages circulating on social media point to potential insider communication, though police have not confirmed these claims. Relatives of the slain businessman are convinced the killing was deliberate.\n\nWhat is disturbing is that the gang was not after money but the life of Joseph, one family member told reporters.\n\nMutangadura was a well-known entrepreneur in Ruwa and beyond, owningbutcheries, Lisheen Estate, and the popular entertainment venueMutangadura Hideout. He was laid to rest in Goromonzi last Saturday, with mourners describing him as a hardworking businessman whose violent death has left a gaping wound in the community.\n\nFor now, the motive behind his murder remains shrouded in mystery, as detectives from theCID Homicide Unitcontinue their hunt for the seven suspects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – A month after the shocking murder of Ruwa businessman Joseph “Mutangaz” Mutangadura, police are yet to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/no-leads-in-mutangadura-murder/\">Continue reading<span class=\"screen-reader-text\"> \"Police Silent On Mutangadura Murder Investigations\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "Man Kills Wife Over Mjolo",
            "url": "https://www.zimeye.net/2025/09/13/popular-mutare-man-stabs-wife-to-death-over-mjolo/",
            "content": "By A Correspondent- A well-known Mutare man, Lawrence Marecha, has murdered his wife after catching her with a boyfriend having nice  time in her boyfriends car .\n\nHe stabbed her with a kitchen knife.\n\nMore to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- A well-known Mutare man, Lawrence Marecha, has murdered his wife after catching her with a boyfriend having … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/popular-mutare-man-stabs-wife-to-death-over-mjolo/\">Continue reading<span class=\"screen-reader-text\"> \"Man Kills Wife Over Mjolo\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "Martin Rushwaya implicated In Anti-Chiwenga Agenda",
            "url": "https://www.zimeye.net/2025/09/13/martin-rushwaya-implicated-in-anti-chiwenga-agenda/",
            "content": "By A Correspondent Chief Secretary to the President and Cabinet Martin Rushwaya has emerged at the centre of Zanu PFs Manicaland ED 2030 push  a controversial agenda to extend President Emmerson Mnangagwas rule beyond current constitutional limits, in a move some insiders view as part of a broader strategy to contain Vice President Constantino Chiwengas succession ambitions.\n\nThe revival of the ED 2030 agenda comes as factional battles once again dominate the ruling party, with Mnangagwas loyalists rallying behind constitutional amendments to secure his long-term hold on power, while Chiwengas allies quietly manoeuvre for a leadership transition.\n\nOver the last two weeks, Zanu PF structures in Manicaland have been convening meetings, producing two headline resolutions: support for extending Mnangagwas tenure beyond 2030 and adopting a hardline stance on drug and substance abuse.\n\nProvincial chairman Tawanda Mukodza described the resolutions as grassroots-driven. The people desire that President Mnangagwa remains in office beyond 2030, and are calling for the necessary constitutional amendments to facilitate this. As a party, we must respect the will of the people, he said.\n\nTo consolidate these resolutions, an inter-district conference is scheduled for next week. Rushwaya, alongside Zanu PF Secretary for Legal Affairs Patrick Chinamasa, will supervise the process. While Chinamasa is tasked with shaping the legal framework for possible constitutional amendments, Rushwayas involvement is seen as politically sensitive, given his close proximity to Mnangagwa and his growing influence in party-state structures.\n\nZanu PF insiders argue that Manicalands ED 2030 resolutions serve not only as expressions of loyalty to Mnangagwa but also as a pre-emptive strike against Chiwengas camp ahead of the 22nd National Peoples Conference in October. By placing Rushwaya at the centre of this process, Mnangagwa is tightening control over provinces and signalling that succession debates are off the table, one source observed.\n\nThe factional overtones echo the 2017 crisis that ended Robert Mugabes rule, a reminder of how unresolved succession disputes can destabilise Zanu PF. Critics warn that extending Mnangagwas term risks deepening internal rifts and alienating ambitious factions that see 2030 as the natural horizon for leadership change.\n\nIn addition to succession, Manicaland leaders emphasised a crackdown on drug abuse, calling for tougher penalties and investigations into alleged complicity by security and political elites.\n\nPreparations for the 22nd National Peoples Conference, set for October 1318 at Mutare Polytechnic, are reportedly near completion. The gathering is expected to attract 4,000 delegates and raise US$5 million in funding, with accommodation, catering, and venue upgrades already in place.\n\nBut beyond the logistics, the political stakes remain high: Rushwayas direct involvement in Manicalands ED 2030 resolutions has intensified speculation that Mnangagwa is deploying trusted lieutenants to weaken Chiwengas path to succession. Whether other provinces fall in line or fracture along factional lines will be revealed in Mutare next month.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Chief Secretary to the President and Cabinet Martin Rushwaya has emerged at the centre of Zanu PF’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/martin-rushwaya-implicated-in-anti-chiwenga-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Martin Rushwaya implicated In Anti-Chiwenga Agenda\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "66 Councils Fail to Submit 2024 Financial Reports",
            "url": "https://www.zimeye.net/2025/09/13/66-councils-fail-to-submit-2024-financial-reports/",
            "content": " 66 Local Authorities Have Not Submitted Their 2024 Financial Reports\n\n Includes Bulawayo, Harare, Masvingo and dozens of rural councils\n\n Residents Forced to Pay Rates While Councils Delay Transparency\n\n Widespread frustration at double standards and lack of accountability\n\n Public Outrage on X (Twitter)\n\n What if the whole country refused to pay rates?\n\n They need time to falsify details and hide their crimes.\n\n Its painful seeing Masvingo City on the list.\n\n Mutare City Council Wins Praise for Transparency\n\n Not on the list; cited as a model for accountability\n\n Commendable standards of governance and transparency, wrote one user\n\n Calls for Action Intensify\n\n Civil society groups demand withholding of rates\n\n Ministry of Local Government urged to intervene\n\n Auditor-General may investigate\n\n Bigger Picture: Systemic Weaknesses\n\n Urban & Rural Councils Acts require timely submissions\n\n Delays signal chronic mismanagement\n\nBy ZimEye News Desk | 13 September 2025\n\nA storm of criticism erupted online yesterday after it emerged that 66 councils across Zimbabwe have yet to submit their 2024 financial reports  despite residents being forced to pay rates and service charges on time.\n\nThe list, which includes Bulawayo City Council, Harare City Council, Masvingo City Council and scores of rural district councils, sparked accusations of mismanagement, corruption, and double standards in local government.\n\n The Numbers\n\nA leaked document shared by former Harare East MP Rusty Markham shows 66 local authorities still outstanding with their reports. The councils range from major metropolitan bodies such as Bulawayo and Harare to rural councils including Chimanimani, Hwange, Makonde, and Nyanga.\n\nMutare City Council is notably absent from the list, prompting some observers to commend it for maintaining transparency and good governance.\n\n Public Backlash\n\nThe revelation triggered an online firestorm: What if the whole country refused to pay rates till they show us what they spent our money on, posted one X user, echoing widespread frustration. They need time to falsify some details and hide their crimes, wrote another. It is so painful seeing Masvingo City Council on the list, lamented another commenter. Others pointed out the glaring absence of Mutare City Council, with one user stating: I dont see Mutare City Council on there, prompting praise from another who said Mutare stands out for commendable standards of governance, transparency, and accountability.\n\n Key Councils on the List1. Bulawayo City Council2. Harare City Council3. Masvingo City Council4. Beitbridge Municipality and dozens more rural district councils, including Hwange, Gutu, Chipinge, and Makonde.\n\n Residents Cry Foul\n\nMany Zimbabweans online have questioned why councils demand prompt payment of rates while failing to release audited accounts of how public funds are used. Some users went further to accuse councils of systematic looting and politicisation of local authority operations.\n\nFundamentally this shows local government and the government are not working well. The victims are people they claim to represent, wrote one user.\n\n Mutare Wins Praise\n\nMutare City Council, absent from the list, drew widespread praise for its relatively stronger record of accountability. Despite systemic shortcomings at national level, the city continues to uphold commendable standards of governance, wrote Samuel Jack Matikiti on X.\n\n Whats Next?\n\nThe Ministry of Local Government and Public Works is yet to comment on the delays. According to the Urban Councils Act and Rural District Councils Act, local authorities are obliged to submit annual financial statements within specified timeframes. The Auditor-General may also initiate investigations if councils repeatedly fail to comply.\n\nCivil society groups are now calling for withholding of rates and service fees until councils present their financial reports, while residents push for greater transparency on how public funds are being used.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "🔴 66 Local Authorities Have Not Submitted Their 2024 Financial Reports     – Includes Bulawayo, Harare, Masvingo and dozens of rural … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/66-councils-fail-to-submit-2024-financial-reports/\">Continue reading<span class=\"screen-reader-text\"> \"66 Councils Fail to Submit 2024 Financial Reports\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "DNA Evidence Demanded Woman Accused Of Fornication",
            "url": "https://www.zimeye.net/2025/09/13/dna-evidence-demanded-woman-accused-of-fornication/",
            "content": "Mutare Affair Sparks DNA Roll Call at Chief Mutasas Court\n\nBy A Correspondent | A dramatic adultery scandal in Mutare has escalated into a forensic showdown after Chief Mutasa ordered a DNA roll call on clothes allegedly left behind by the man accused of sleeping with a married woman.\n\nAbigail Button allegedly attempted to take her own life by ingesting poison after being caught in a compromising position with another man by her husband, Edmund Mhlanga of Muchena Village. She survived after being rushed to Victoria Chitepo Provincial Hospital, where doctors saved her life.\n\nThe case took centre stage at Chief Mutasas community court last Saturday. The Chief ruled that the matter would not proceed on accusations alone and ordered deoxyribonucleic acid (DNA) tests on the jacket, T-shirt and shoe allegedly dropped by the suspected lover, Tendai Dzanza. The Chief warned that the DNA roll call would expose the truth and guide his next move.\n\nMhlanga told the court he had returned home unannounced and hid outside, only to see a man entering his house. When the lights went off, he crept to the bedroom window, heard suspicious noises, and burst into the room  finding his wife and the man naked under the blankets. The man allegedly fled, leaving his clothes behind.\n\nButton denied infidelity, saying she had called Dzanza to help mediate marital misunderstandings, not for an affair. She said she drank poison out of frustration and abuse, not because she had been caught cheating. Dzanza also denied the allegations, insisting the clothes were not his and calling Mhlangas version an exaggeration.\n\nChief Mutasa, noting the conflicting accounts, issued a stern warning to all parties: Since Dzanza denies ownership of the clothes, this matter is far from over. We will conduct DNA tests on the clothes to uncover the truth. If the tests prove Dzanza owns the clothes, there will be severe consequences. We do not tolerate individuals wasting this courts time.\n\nVillagers say the unusual DNA roll call has gripped the community, as the results will determine who is telling the truth and what penalties, if any, will follow.\n\nBy A Correspondent | Mukadzi wemuguta reMutare akabatwa ari mumamiriro asingakodzeri pamwe nemumwe murume, izvo zvakakonzera kukakavadzana kukuru uye zvinonzi zvakamutsa pfungwa dzekuedza kuzviuraya nekumwa chepfu.\n\nNerombo rakanaka, kuyedza kuzviuraya kwaAbigail Button kwakakundikana; akakurumidza kuendeswa kuVictoria Chitepo Provincial Hospital, uko vashandi vehutano vakamuponesa upenyu hwake.\n\nZviitiko izvi zvakaitika pamberi pedare renharaunda raChief Mutasa musi weMugovera wapfuura, apo pakarairwa kuti kuitwe bvunzo dze deoxyribonucleic acid (DNA) pazvipfeko zvinonzi zvakasiirwa naTendai Dzanza, murume anopomerwa kupinda muhukama naButton nemurume wake Edmund Mhlanga.\n\nMhlanga, anogara kuMuchena Village, akapupura kudare achiti akadzoka kumba asingatarisirwi uye akawana zvaaifungidzira kuti kwaive upombwe hwemudzimai wake. Iye zvino mhedzisiro yebvunzo dzeDNA dziri kutarisirwa kujekesa chokwadi chezviri kupomerwa izvi.\n\nNdinoshanda ndichigara muMutare asi kazhinji ndinopedza maweekend kuMuchena nemudzimai wangu. Asi musi wa27 Chivabvu ndakadzokera kuMutare ndokuzodzokera zvakare kuMuchena ndisina kumuzivisa.\n\nPakusvika kumba ndakaenda kufarm apo mudzimai wangu aive panzvimbo yake yekutengesera. Ndakanzwa achitaura pafoni achiti kune mumwe munhu anouya husiku. Aiti achazodaidza hama yandinogara nayo kuMutare kuti izive kuti ndadzokera. Nerombo rakanaka handina kumuzivisa, akadaro Mhlanga.\n\nAkatsanangura kuti akatanga kufungira kusavimbika kwemudzimai wake.Ndakavanda ndokudzoka kumba manheru nenguva dzinenge dza7. Ndakaona murume achiuya kumba kwangu ndiri pakuvanda. Paakapinda mumba chiedza chakabva chadzimwa.\n\nNdakananga kuhwindo reimba yekurara ndichinzwa ruzha ndokuziva kuti mudzimai wangu ane mumwe murume, akadaro kudare.\n\nNdakapinda mumba nepahwindo rakanga rakatyoka ndikavabata vari mubhedha. Vaive pasi pemablanket vakafukidza misoro yavo. Ndakabvisa mablanket ndikaziva murume wandagara ndichimuona. Vaviri vacho vaive vasina kupfeka. Ndakavabvunza zvinyoronyoro ndisina kushandisa mhirizhonga. Murume akabva atorera bhurugwa rake achitiza, ini ndikabuda kunotsvaka rubatsiro kuvavakidzani, akadaro Mhlanga.\n\nZvisingazivikanwi kwaari, mudzimai wake akabva akumwa chepfu achitya.Mwana wedu akandidaidza achiti amai vake vakanwa chepfu uye vanga vaendeswa kuVictoria Chitepo Provincial Hospital.\n\nVakagara muchipatara mazuva mana. Ndakaendesa nyaya iyi kumapurisa asi pavakapora vakabva vaenda kunogara nemwanasikana wedu kuMutare. Pane kuratidza kupfidza vakazonyorera gwaro rekudzivirirwa kundipikisa.\n\nMutongi akatitumira kudare iri, akadaro Mhlanga achiratidza zvipfeko zvaanoti zvakasiirwa nemurume akapomerwa.\n\nNdauya nejaketi, T-shirt neshangu zvaakasiyira achitiza. Aya ndiwo ake, akadaro Mhlanga achiratidza zvinhu izvi pamberi pedare.\n\nAsi Dzanza akaramba zvine simba mhosva idzi achiti zvipfeko hazvisi zvake uye achiti Mhlanga ari kunyanyisa nyaya iyi.\n\nAya haasi angu. Handina kubatwa mumba make. Pazuva iroro Button akandifonera achiti vanga vari mukusawirirana semurume nemukadzi achida kuti ndibatsire kugadzirisa.\n\nNdakasvika panguva dza5 masikati uye hapana zvakadai zvakaitika, akadaro Dzanza.\n\nButton, achipa mashoko ake kudare, akabvuma kuti akadaidza Dzanza asi akaramba upombwe hunopomerwa.Ndakamufonera nekuti murume wangu anogara achindipomera upombwe naye. Ndakati auye kuti nyaya iyi ipere zvachose.\n\nZvaive nemwedzi mitatu kubva pandakapedzisira kurara naye, akadaro, achiti kutora kwake chepfu kwakakonzerwa nekushungurudzwa kwenguva refu nemurume wake.\n\nNdakanwa chepfu nekuti ndanga ndisisakwanisi kutsungirira. Murume wangu anondishungurudza uye anogara achinditi pfambi asi ini ndakavimbika kwaari. Ini ndini ndinototengera murume uyu hembe. Ndakanwa chepfu nekuda kwekusagutsikana, kwete nekuti andibata red-handed, akadaro kudare.\n\nChief Mutasa akaratidza kunetseka nezvemashoko akasiyana-siyana echitatu ichi.Zvamuri kutaura hazviwirirane. Hatisi pano kuti timanikidze munhu abvume mhosva yaasina kuita.\n\nSezvo Dzanza achiramba kuti ndezvake, nyaya iyi haisati yapera. Tichaita bvunzo dzeDNA pazvipfeko izvi kuti tiburitse chokwadi, akadaro Chief Mutasa achitaura kuna Dzanza naButton.\n\nAkayambira zvakasimba achiti zvichabuda kubva muDNA ndizvo zvicharaira nhanho inotevera.Kana bvunzo dzakaratidza kuti Dzanza ndiye ane zvipfeko izvi pane zvichatevera zvakakomba. Hatisi kugamuchira kushandiswa kwenguva yedare zvisina basa, akadaro Chief Mutasa.\n\nNyaya iyi yakakwezva pfungwa dzevagari vemunharaunda uye ichiri kuenderera mberi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare Affair Sparks DNA “Roll Call” at Chief Mutasa’s Court By A Correspondent | A dramatic adultery scandal in Mutare … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/dna-evidence-demanded-woman-accused-of-fornication/\">Continue reading<span class=\"screen-reader-text\"> \"DNA Evidence Demanded Woman Accused Of Fornication\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "Geza Emerges The Only War Vets Chairperson, Genuinely Fighting to Reform Govt",
            "url": "https://www.zimeye.net/2025/09/13/geza-emerges-the-only-war-vets-chairperson-genuinely-fighting-to-reform-govt/",
            "content": "Blessed Geza Issues Blistering Nation Address Ahead of ZANU PF Conference\n\nBy A Correspondent | ZimEye | Harare  12 September 2025 | War veteran and political activist Blessed Geza last night delivered a hard-hitting address accusing senior ZANU PF provincial leaders of corruption, intimidation and betraying the liberation struggle ahead of the partys upcoming conference.\n\nIn a speech widely circulated on social media on Thursday evening, Geza castigated provincial chairpersons and senior officials for taking bribes and forcing the masses to accept resolutions they do not want. He vowed that war veterans and citizens will meet them head-on to defend democracy.\n\nComrades, if you were not sell-outs, you would respect the land for which so many shed their blood, Geza said, opening his address.\n\nNow I turn to the provincial chairpersons: your behaviour of taking bribes and forcing the masses to accept resolutions they do not want must stop. This time we will meet you head-on. We went to war so that Zimbabwe would have democracy  yet you provincial chairpersons are forcing people to follow your wishes and those of the gluttons.\n\nGeza also revisited the Boulevard Conference, accusing ZANU PF of misrepresenting the outcome of its resolutions. He singled out former finance minister Patrick Chinamasa for reading out the controversial Vision 2030 endorsements, and claimed President Emmerson Mnangagwa himself refused to break the Constitution during the proceedings:\n\nWhen President Mnangagwa was mentioned, he himself said: I participated in shaping the Constitution of Zimbabwe; I cannot break the law that I helped to write. He refused to violate the Constitution.\n\nHe rejected the notion that the party had legitimately endorsed Vision 2030, calling it a lie and forced, and reminded listeners that the Constitution does not belong to ZANU PF but to the whole country.\n\nThe war veteran also focused heavily on Manicaland Province, which he described as short-changed for too long despite its central role in the liberation struggle. He reminded his audience that at Nyadzonia and Chimoio 50% of those buried came from Manicaland, and rebuked current leaders for falsely claiming historic credentials such as membership of the Crocodile Gang.\n\nGeza further criticised the sidelining of senior military figures from the province, including General Sigauke, and called for respect for Vice President Constantino Chiwenga, Chris Mutsvangwa, and other liberation stalwarts like the latter xwho opened Honde Valley.\n\nDuring this conference, the people of Manicaland and all provinces must ensure that the voices of those who fought the war are heard, Geza declared. We, the war veterans together with the masses, will stop this corruption.\n\nHis remarks signal mounting noises within ZANU PF ranks ahead of the partys annual conference, which is expected to set the tone for succession debates and policy direction heading into the 2028 election cycle.\n\nPublic Reacts Online\n\nThe livestream drew an avalanche of comments  some applauding Geza for speaking out, others questioning his timing or motives: Soko Mrehwa: At least mukuru uyu akuzama but ma youth apera nekuda mota nekupemha nyika ichiparadzwa (At least the elder is trying but the youth have been lost to bribes and cars while the country is being destroyed). Lea Nyengerah: Taura hako (Speak on). Rock Offense: Ko haasati abatwa nanhasi? (Why hasnt he been arrested yet?). Dj Mafyt Newsonline: Enda ku university uno lecture history kwete kurwa na ED (Go teach history instead of fighting with ED). Munyaraadzi Shara: Munokuvadzisa vanhu imi nemusipo  lets go and work for our family guys izvi unokuvarira mahara (Youre harming people with your noise; go work for your families, youre suffering for nothing). Givemore Mposi: Team reDombo ririkuwanda nhai (The stone team is growing). MaiChichi Mamoyo: He is right but he was part of destroyers  its good to reflect and try to effect change.\n\nWell done baba for wanting change now. Clinical Howard Mtenhwah: Varikuti Action ndimi vanhu ve Action imi not that old guy (Theyre saying you, the youth, should take action  not that old guy). Ivy Denga: Im ready kurwira Zimbabwe  Youth is ready. Pfuti kuvanhu. (Im ready to fight for Zimbabwe  Youth is ready. Give the people the guns). Shyne Shyne: Tapinda tapinda  tikuda action pabasa mudhara kkkk (Were in  we want action at work, old man). Kudakwashe Nyamanhindi: Chimirai muone Action manje (Wait and see the action now). Tafadzwa Macooks: Haa vanhu vamukushingirira are unmoved (People have endured too much, they are unmoved).\n\nMilitary Petitioners Speak Out\n\nAdding to the debate, Gifford Gomwe, one of the heroic petitioners to the military, told ZimEye that change was imminent and would come suddenly:\n\nThe change is going to happen without a weather warning report  there will not be a weather report, Gomwe said.\n\nYou do not pre-empt your enemy, he added.\n\nHis comments echoed the militant tone of many online responses urging immediate action rather than debate  but also injected a sense of inevitability and momentum.\n\nAnalysis and a Note of Hope\n\nGezas speech and the online reactions show that while frustration runs deep, there is also a strong undercurrent of determination. Even critics who accused him of speaking too late acknowledged the need for reform. Many comments called for real action but also praised the courage of speaking out.\n\nAs Zimbabwe heads toward the ZANU PF Bulawayo Conference, Gezas intervention and Gomwes remarks are a reminder that citizens, veterans and youth alike are beginning to assert their voices more forcefully. For supporters, this represents a sign that change  however defined  may be closer than before.\n\nIn the words of one commenter: Well done baba for wanting change now.\n\nWhats Next: The Road to the upcoming Conference Conference Dates: The ZANU PF annual Conference is expected later this year (exact dates to be announced), where party structures will finalise key resolutions and policy directions. Policy Debates: Hot-button issues such as Vision 2030 endorsements, provincial chairperson powers, and the role of war veterans are likely to dominate the agenda. Public Pressure: Online reactions to Gezas speech suggest mounting public scrutiny and pressure on party leaders to address corruption, patronage and tender inflation. Potential Outcomes: Analysts say the conference could either reaffirm the status quo or open a path for new leadership alignments  making it a crucial barometer of Zimbabwes political future heading into the 2028 elections.\n\nFor many Zimbabweans commenting online, the hope is that this years conference may mark the first real turning point in decades  a moment when veterans, citizens and youth reclaim a voice in the countrys direction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Blessed Geza Issues Blistering Nation Address Ahead of ZANU PF Conference By A Correspondent | ZimEye | Harare – 12 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/geza-emerges-the-only-war-vets-chairperson-genuinely-fighting-to-reform-govt/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Emerges The Only War Vets Chairperson, Genuinely Fighting to Reform Govt\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "Devastating Bulawayo Crash Kills Three",
            "url": "https://www.zimeye.net/2025/09/13/devastating-bulawayo-crash-kills-three/",
            "content": "By A Correspondent- The Zimbabwe Republic Police (ZRP) has confirmed a tragic road traffic accident that claimed three lives along the HarareBulawayo Road on Thursday.\n\nAccording to police, the crash occurred at the 342-kilometre peg when a blue Honda Fit travelling towards Harare was struck by a white Isuzu that veered into its lane.\n\nThree passengers in the Honda Fit died instantly, while two others sustained injuries and were rushed to Mpilo Hospital for treatment. The deceased were taken to Gweru Hospital mortuary for post-mortem examinations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- The Zimbabwe Republic Police (ZRP) has confirmed a tragic road traffic accident that claimed three lives along … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/devastating-bulawayo-crash-kills-three/\">Continue reading<span class=\"screen-reader-text\"> \"Devastating Bulawayo Crash Kills Three\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "Hwange Shutdown Adds to Nation’s Electricity Nightmare…",
            "url": "https://www.zimeye.net/2025/09/13/hwange-shutdown-adds-to-nations-electricity-nightmare/",
            "content": "By A Correspondent\n\nZimbabweans are bracing for another long spell of electricity shortages after ZESA Holdings announced that Hwange Power Stations Unit 3 will be shut down for 44 days of statutory maintenance, from 10 September to 24 October 2025.\n\nIn a statement, ZESA confirmed: Hwange Unit 3 will undergo statutory maintenance from 10 September to 24 October 2025, a planned outage of 44 days.\n\nThis exercise is essential to enhance the units availability and reliability.\n\nThe utility added: During this period, Hwange Power Station will maintain four units in operation to support generation. We sincerely apologise for any inconvenience this may cause and greatly appreciate your understanding and continued support.\n\nBut for many long-suffering citizens, those assurances ring hollow. Harare resident Tendai Moyo said the announcement only means more suffering. We are already facing daily load-shedding. Taking another unit offline for more than a month is just another way of saying we must get used to living in the dark, she said.\n\nEnergy analysts also expressed concern that the worst may be yet to come. The new and more reliable Units 7 and 8 are also expected to undergo similar maintenance in the coming months, a development that could deepen the power crisis.\n\nCritics argue that the shutdown exposes ZESAs long-standing weaknesses. Maintenance is necessary, but when you have no backup and no alternative supply, people pay the price, said an independent energy consultant.\n\nFor businesses and households alike, the Hwange shutdown feels less like progress and more like another reminder of Zimbabwes ongoing energy crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabweans are bracing for another long spell of electricity shortages after ZESA Holdings announced that Hwange Power … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/13/hwange-shutdown-adds-to-nations-electricity-nightmare/\">Continue reading<span class=\"screen-reader-text\"> \"Hwange Shutdown Adds to Nation’s Electricity Nightmare…\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "Apostle Chiwenga Reunites with Same Woman He Once Accused of Poisoning Him – Leaked Messages Rock Church",
            "url": "https://www.zimeye.net/2025/09/12/apostle-chiwenga-reunites-with-same-woman-he-once-accused-of-poisoning-him-leaked-messages-rock-church/",
            "content": "By Dorrothy Moyo | Harare | In a dramatic turnaround, Apostle Talent Chiwenga has apparently reconciled with the same woman he previously accused of being a spy and attempting to poison him. Screenshots of leaked WhatsApp conversations, confirmed by senior church officials, show Chiwenga professing his love and promising to marry the woman a second time despite having publicly cast her out.\n\nLeaked Messages Reveal Change of Heart\n\nThe leaked exchanges, dated 17 August, show the Apostle writing:\n\nCome to see me, I still love you I will marry you the second time if I have to You are my wife and nothing will change that. We will fix this. I promise you.\n\nIn another message, the woman mentions her medication makes her vomit after eating; Chiwenga responds sympathetically. The thread continues into the next morning with greetings in Shona, suggesting an ongoing conversation.\n\nThe messages are coincide with a statement that the woman has since released as of yesterday revealing that they truly have amended their relationship problem as proposed.\n\nFrom Alleged Poisoning to Public Plea\n\nThis new development sharply contrasts with Chiwengas public confession in August 2025, when he accused his former wife  Nyasha Vanessa Werenga  of secretly recording him, sending files to unknown people, and attempting to poison him. He branded her a spy and warned his congregation not to stone David as rumours of their separation swirled.\n\nChurch insiders say Chiwenga had told leadership the woman posed a threat to his safety. Yet, less than three months later, leaked chats show him calling her my wife and pledging to marry her again.\n\nWho Leaked the Messages\n\nThe screenshots were published on Facebook by Tawanda Taka Pfekeche, a renowned former church official and one-time campaigner for the ministry. Pfekeches post included a warning in Shona urging Chiwenga not to intimidate critics and to own his decisions.\n\nTarendi shamwari vhundutsira vamwe not ini wakaramba mukadzi wega ukamudzosa wega so zvekuti unondiuraya ratove drama (loosely translated: My friend, threaten others not me you left your wife yourself and took her back yourself, so saying you will kill me is now just drama).\n\nChurch Members React Publicly\n\nComments under Pfekeches post show rank-and-file church members reacting with disbelief, humour and criticism: Compare these messages, guys, this man is cunning  Mai Noku Bhora mberi, manudes wayaa  Tendai Martin Musora Snr But why are they sharing chats with you nhayi, I think someone is off in this union  Maxwell Zivumbwa Manje ungaite basa rekutswaka life yeumwe munhu unowaneiko  Admire Manhede, with Pfekeche replying, ngaasatinyepe kuti akatumirwa mukadzi neZanu Bt newe wakunyanaya wena akakuiterei Talent  Reggis Muyambo, with Pfekeche responding arikuti anoda kundiuya But madzi mangosiyana ne life dzevanhu  Reuben Dube\n\nThe comment threads reveal shock, sarcasm and concern at how quickly Chiwenga appears to have reversed himself.\n\nChurch Officials Confirm Authenticity\n\nTwo senior church officials told this publication the messages were genuine and said the leadership was stunned by the apparent reunion.\n\nOne official stated, We were all briefed that she was a spy who wanted to harm him, but now it seems they are talking about remarrying.\n\nPattern of Instability\n\nChiwengas confession earlier this year revealed his marriage lasted only 96 hours as husband and wife. Since then, his threats against critics, accusations of poisoning, and repeated contradictions have placed him under intense public scrutiny.\n\nThis latest reversal  from alleging espionage to declaring undying love  underscores a pattern of instability that may further erode his credibility both inside and outside the pulpit.\n\nImplications for the Ministry\n\nThe reconciliation raises questions not only about Chiwengas private life but also about the safety and credibility of the ministry itself. Analysts point out that after publicly alleging poisoning and espionage, reconciling without addressing those claims could expose both parties to risk and weaken the churchs public standing.\n\nWhat Happens Next\n\nWith the leaked messages and the Facebook firestorm now circulating widely, Chiwenga faces renewed pressure to explain the contradictions between his public accusations and private affection. As one Facebook commenter put it, But madzi mangosiyana ne life dzevanhu  Why not just leave peoples lives alone.\n\nWhether the reunion is genuine, temporary, or strategic remains to be seen. But for now, the leaks have reignited debate about the Apostles credibility, his handling of personal relationships, and the future of his ministry.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Harare –| In a dramatic turnaround, Apostle Talent Chiwenga has apparently reconciled with the same woman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/apostle-chiwenga-reunites-with-same-woman-he-once-accused-of-poisoning-him-leaked-messages-rock-church/\">Continue reading<span class=\"screen-reader-text\"> \"Apostle Chiwenga Reunites with Same Woman He Once Accused of Poisoning Him – Leaked Messages Rock Church\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        },
        {
            "title": "Sibanda Confident Young Warriors Will Bounce Back At COSAFA U17…",
            "url": "https://www.zimeye.net/2025/09/12/sibanda-confident-young-warriors-will-bounce-back-at-cosafa-u17/",
            "content": "Sports Correspondent\n\nZimbabwe Under-17 coach Thulani Sibanda says his team still has every chance to finish top of Group A at the ongoing COSAFA U17 tournament in Norton, despite starting their campaign with a narrow defeat.\n\nThe Young Warriors went down 1-0 to Mozambique on Thursday after conceding in the 6th minute. Although they created several opportunities, they failed to find the equaliser.\n\nWith only group winners advancing to the semifinals, Zimbabwe must now secure victories in their remaining fixtures against Comoros and Eswatini to remain in the race.\n\nWe are not out yet. We still believe, Sibanda said after the opening loss. We urge the fans to keep supporting us. They have to believe, because we are still in the competition.\n\nAssessing the performance, the coach admitted the early goal unsettled his charges but praised their response:We didnt start well, which is why we conceded early. But we gradually came back into the game, especially in the second half, where we created several meaningful chances that we could have scored from. Overall, we played well, though with this age group, conceding early makes it difficult to manage nerves.\n\nThe Young Warriors will now turn their attention to Eswatini, whom they face on Saturday at Ngoni Stadium in Norton. Kick-off is scheduled for 3 pm CAT.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe Under-17 coach Thulani Sibanda says his team still has every chance to finish top of Group A … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/sibanda-confident-young-warriors-will-bounce-back-at-cosafa-u17/\">Continue reading<span class=\"screen-reader-text\"> \"Sibanda Confident Young Warriors Will Bounce Back At COSAFA U17…\"</span></a></p>",
            "time": "06:00",
            "date": "14 Sep 2025"
        }
    ]
}