{
    "news": [
        {
            "title": "Chivhayo In Fresh Looting Spree",
            "url": "https://www.zimeye.net/2025/02/24/chivhayo-in-fresh-looting-spree/",
            "content": "By Munacho Gwamanda-Convicted fraudster and controversial businessman WicknellChivhayohas once again landed in the spotlight amid allegations of engaging in clandestine dealings on behalf of the Zimbabwean leader.\n\nThis weekend, Chivayo reportedly traveled to Kenya, allegedlyto deliver another tranche of illicit funds linked to his murky business operations.\n\nSources familiar withChivayosclose ties to President Emmerson Mnangagwa revealed that thebusinessmansrecent trip to Nairobi was part of a broader network of questionable financial activities.\n\nWicknell Chivayo traveled to Kenya this afternoon with his fiance to deliver yet anotherloot.Based on the flight history of his private jet,itsclear that he has been quite busy, frequently flying in and out of Zimbabwe, conducting his usualrunnerbusiness,a source disclosed.\n\nChivayosrelationship with Mnangagwa has long been asubject ofpublic controversy, with the businessman benefiting from lucrative government contracts under questionable circumstances.\n\nHis extravagant lifestyle, flaunted on social media, has fueled speculation about his role as a financial conduit for the ruling elite.\n\nRecently, Chivayo made headlines when hewas photographedwith Kenyan President William Ruto,a move that raisedfurther questions about the nature of his dealings in Kenya.\n\nThe meeting sparked concerns that Chivayo couldbe leveraginghigh-profile political connections beyond Zimbabwe to secure and facilitate illicit financial transactions.\n\nCritics argue that his ability to gain access to influential figures such as Ruto underscores the extent of his influence and the reach ofMnangagwaspatronage network.\n\nHowever, not everyone withinZimbabwesruling party hasbeen supportive ofChivayosactivities.\n\nVice President Constantino Chiwenga recently denounced him for exploiting his links with the First Family to engage in corruption.\n\nWithout mentioning Chivayo by name, Chiwenga warnedMnangagwasinner circle, whom he disparagingly referred to asZvigananda(bootlickers), that their time was running out.\n\nHe further hinted that some of them could face jail time if he assumes the presidency in 2028,signalingintensifyingfactional tensions within ZANU-PF.\n\nDespite mounting criticism, Mnangagwa has continued to defend Chivayo.\n\nWhen pressed by journalists about his association with the businessman, Mnangagwa dismissed concerns, stating,If there is anyone who has lost money to Chivayo, they should report him to the police.\n\nHis remarks did little to quell suspicions, with many interpreting them as a tacit endorsement ofChivayosdealings.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Convicted fraudster and controversial businessman Wicknell Chivhayo has once again landed in the spotlight amid allegations of engaging in clandestine … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/chivhayo-in-fresh-looting-spree/\">Continue reading<span class=\"screen-reader-text\"> \"Chivhayo In Fresh Looting Spree\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "Uebert Angel Threatens Malawians Saying No One Wins Elections After Dis-Respecting Maynard’s Boss, Shepherd Bushiri",
            "url": "https://www.zimeye.net/2025/02/24/uebert-angel-threatens-malawians-saying-no-one-wins-elections-after-dis-respecting-maynards-boss-shepherd-bushiri/",
            "content": "Lilongwe, Malawi  February 24, 2025\n\nBy A Correspondent | The GoldMafia implicated preacher and so called presidential envoy, Uebert Angel has issued threatening statements directed at Malawian political leaders during a birthday celebration for his spiritual son, Prophet Shepherd Bushiri, who is currently a fugitive from fraud charges.\n\nSpeaking to a gathering that included prominent political figures, Angel, who has previously faced criticism for holding a fake degree, declared that only candidates who honor Bushiri would emerge victorious in the upcoming elections.\n\nHis prophecy comes at a time he is still to identify the Al Jazeera journalists who filmed him in the explosive GoldMafia investigation 4 years ago.\n\nThe prediction also comes at a time when Angel cannot return to his home in the UnitedKingdom ever since the Gold Mafia documentary was broadcast in 2023 just as he says he will be killed upon entering the United Kingdom.\n\nBold Claims and Election Meddling\n\nAngels statements raised serious concerns about election integrity and undue religious influence in politics. I think its elections. When? When is elections? September? So Im here to tell you who will win so that we dont have any problems, he said. And how many know I dont miss, yeah, so I know for sureThe one who honors Shepherd Bushiri is going to win.\n\nThese remarks were made in the presence of Malawis Vice President and other dignitaries, adding a layer of complexity to an already tense political climate. Angel suggested that those who ate from our plate at the event had a case to answer, implying that loyalty to Bushiri would be a determining factor in electoral success.\n\nEducation Claims and Questionable Credentials\n\nDuring his speech, Angel emphasized his supposed academic achievements, stating, I know this because Im learned. I went to school, I read a few things. However, his educational credentials have been widely questioned at a time they are chamioned by the twos spokesman Maynard Manyowa. Angel continues to hold a fake degree.\n\nhttps://t.co/C0Jy6Wkmye\n\nAngel went on to assert that Prophet Shepherd Bushiri was Malawis greatest export, surpassing even the countrys agricultural products. Everywhere we go, you come from where? Malawi. Do you know Malawi? Yeah. Do you know Africa? Yeah, yeah. You know Bushiri, he claimed.\n\nCoercion and Manipulation?\n\nThe speech, filled with religious overtones and prophetic declarations, included a not-so-subtle warning to political leaders. Angel criticized the lack of honor given to Bushiri within Malawi, contrasting it with his recognition abroad.\n\nI implore that we create an atmosphere where we honor the Son of the soil, Prophet Bushiri, even as we from around the world have already honored him. So whosoever is winning the next election here is who is winning? The one who honors Shepherd Bushiri is going to win, he stated.\n\nPublic and Political Reactions\n\nThe speech has elicited strong reactions from both the public and political analysts. Many have called Angels comments a blatant attempt to influence the electoral process through spiritual manipulation.\n\nPolitical analyst Thoko Banda commented, This is not just an overstep; its a dangerous precedent. Using religious influence to dictate political outcomes undermines democratic principles and could lead to unrest.\n\nWhats Next for Malawi?\n\nAs the nation approaches its elections in September, concerns over external and spiritual influences on political processes are mounting. The Malawian Electoral Commission has yet to comment on Angels remarks, but civil society groups are calling for transparency and accountability.\n\nWith Angels bold proclamation that only those who honor Bushiri will win, Malawis political landscape has entered uncharted waters, raising questions about the role of religious figures in democratic governance.\n\nMore updates will follow as this story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Lilongwe, Malawi – February 24, 2025 By A Correspondent | The GoldMafia implicated preacher and so called “presidential envoy,” Uebert … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/uebert-angel-threatens-malawians-saying-no-one-wins-elections-after-dis-respecting-maynards-boss-shepherd-bushiri/\">Continue reading<span class=\"screen-reader-text\"> \"Uebert Angel Threatens Malawians Saying No One Wins Elections After Dis-Respecting Maynard’s Boss, Shepherd Bushiri\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "Poor Drainage System Puts Residents’ Lives In Danger",
            "url": "https://www.zimeye.net/2025/02/24/poor-drainage-system-puts-residents-lives-in-danger/",
            "content": "By A Correspondent\n\nA sudden and unexpected surge of water from Ran Mine in Bindura sent shockwaves through the Chipadze community on Friday morning, sparking concerns about potential contamination and health risks.\n\nThe chaos unfolded after heavy rains pounded Bindura on Thursday night, causing floodwaters to overflow into homes and churches in Chipadze. Residents were caught off guard, and many expressed fears about contamination, given the waters origin from the nearby mine.\n\nEyewitnesses described the terrifying scene, recounting how the water suddenly gushed from the mines dam, flooding the church and nearby homes. This happened around 3 am, and we were shocked to see water flowing from the mine, a concerned resident said. Weve lived here for years and never seen anything like this. Where will we get drinking water? How will we bathe?\n\nThe incident has exposed the governments incompetence in addressing the countrys poor drainage systems. The lack of proper infrastructure has left residents vulnerable to flooding and potential health risks.\n\nIn response to concerns about chemical contamination, Ran Mines Corporate Affairs Manager, Jack Murehwa, reassured residents that the mines location on a hill means the water is primarily run-off. He added that tests have been conducted, and no contamination has been detected.\n\nThe Environmental Management Agency (EMA) has intervened, with its spokesperson telling state media that the agency is working with stakeholders to address safety concerns. Were working together to neutralize the affected area, the spokesperson said.\n\nHowever, the incident has raised questions about the governments ability to provide basic services, including proper drainage systems. The poor state of infrastructure has left many communities vulnerable to flooding and other disasters.\n\nAs the community struggles to come to terms with the sudden flooding, concerns about the poor drainage system and potential health risks linger. Residents are calling for urgent action to prevent similar incidents in the future and for the government to take responsibility for its incompetence in addressing the countrys infrastructure challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A sudden and unexpected surge of water from Ran Mine in Bindura sent shockwaves through the Chipadze … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/poor-drainage-system-puts-residents-lives-in-danger/\">Continue reading<span class=\"screen-reader-text\"> \"Poor Drainage System Puts Residents’ Lives In Danger\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "SA Load Shedding Now At Stage 6",
            "url": "https://www.zimeye.net/2025/02/24/sa-load-shedding-now-at-stage-6/",
            "content": "Minister of Energy Apologizes as South Africa Faces\n\nPretoria, Gauteng  February 24, 2025\n\nSouth Africas Minister of Energy and Electricity, Dr. Kgosientsho Ramokgopa, has issued a public apology to South Africans as the nation faces intensified power cuts under Stage 6 load shedding. Addressing the media on Sunday morning in Pretoria, Ramokgopa expressed deep regret over the setbacks that have led to the current energy crisis.\n\nPlease accept our sincerest apologies. With the greatest level of humility, I want to say to the country that we regret that there is a setback, Ramokgopa stated, emphasizing the ministrys awareness of the publics frustration and hardship.\n\nThe apology follows Eskoms announcement that Stage 6 load shedding would continue due to multiple trips at Camden Power Station. The national power utility has not yet provided a timeline for when the situation will improve.\n\nTechnical Issues at Power Stations\n\nRamokgopa explained that the Energy Ministry remains guided by the Energy Action Plan unveiled by President Cyril Ramaphosa in July 2022. He acknowledged the severity of the current crisis, noting a significant setback on February 1, 2025, following over 300 days of uninterrupted electricity supply.\n\nThe minister revealed that five generation units were lost at Majuba Power Station, Eskoms second-largest power plant. This resulted in us initiating Stage 3 load shedding to allow us to replenish the reserves, to allow the team to understand what the root cause was at Majuba, and have an appreciation of how long it will take for us to return those units.\n\nThe situation worsened early Sunday morning when four units were lost at Camden Power Station, prompting the escalation to Stage 6. The constellation of that resulted in us upping the levels of load shedding to Stage 6. We have been able to record some successes in return of the units, Ramokgopa added.\n\nNo Sabotage Involved\n\nAmid swirling rumors, Ramokgopa dismissed allegations of sabotage at the power stations. I have heard several queries regarding some underhand activities. I want to say to the rest of the country; that this is a technical issue. We must not find any reason to manufacture explanations of why we are at Stage 6. There is no sabotage.\n\nFinancial Impact and the Way Forward\n\nThe minister acknowledged the broader impact of load shedding on South Africas economy and promised that the ministry would work tirelessly to resolve the crisis. He stressed the financial strain load shedding imposes on the country and reiterated the governments commitment to finding a lasting solution.\n\nOn the agitation, anger, disappointment that the country is registering, we should not accept load shedding at any StageWe have made decisions that are in the interest of the greatWe understand the anger; we feel your pain; we can hear your cries. We will resolve this problem, Ramokgopa vowed.\n\nEskom has advised citizens to monitor load shedding schedules and conserve electricity where possible. More updates are expected as the situation unfolds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Minister of Energy Apologizes as South Africa Faces Pretoria, Gauteng – February 24, 2025 South Africa’s Minister of Energy and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/sa-load-shedding-now-at-stage-6/\">Continue reading<span class=\"screen-reader-text\"> \"SA Load Shedding Now At Stage 6\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "Mnangagwa Praises Self For Rebuilding Collapsing Economy",
            "url": "https://www.zimeye.net/2025/02/24/mnangagwa-praises-self-for-rebuilding-collapsing-economy/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa, the leader of Zimbabwes ruling Zanu PF party, took the opportunity on Friday to highlight what he described as his governments remarkable achievements in nation-building. Speaking at the National Youth Day Commemoration event in Bulawayo, Mnangagwa delivered a powerful address, urging Zimbabwes youth to contribute positively to the countrys growth and unity.\n\nWe are walking the talk, Mnangagwa declared, stressing that the government was not just making promises but delivering tangible progress. He emphasized that the governments vision was clear and centered on inclusion and development for all citizens. We are leaving no one behind, he added, signaling his administrations commitment to national unity and progress.\n\nDuring his speech, Mnangagwa urged the youth to safeguard the values that have shaped Zimbabwes society. I urge you to guard jealously the long-standing tradition of unity, solidarity, and co-existence, he said, calling on young people to cherish the bonds that hold the nation together. The president also pointed out the critical role that youth play in shaping the future of Zimbabwe, as well as the broader African continent. The prosperity and future of our region and continent is in your hands, he remarked, reinforcing the idea that the youth are the key to both Zimbabwes and Africas success.\n\nMnangagwa placed significant importance on the Day itself, which was dedicated to recognizing the potential of the youth. He appealed directly to them: I expect you to deliver, as he emphasized the need for young people to channel their energy and enthusiasm into national development. Continue to ensure that your zeal and energy are harnessed for national development, Mnangagwa urged.\n\nIn his speech, the president highlighted the importance of unity within Zimbabwes diverse society, declaring, In our diversity, we are one people, tiri vanhu vamwe, which translates to we are one people. This message resonated with the audience as he called for national cohesion amid the countrys ethnic and cultural differences.\n\nMnangagwa also commended the youth for their growing awareness of the nations rich history and the vision for the future. I commend you for the consciousness you have for our rich history and the future we are marching towards, he said, acknowledging the younger generations sense of purpose.\n\nHowever, Mnangagwa also warned against external and internal forces seeking to undermine the countrys unity and progress. Resist and reject the machinations of those who want to divide you and divide our nation, he cautioned, stressing that the unity of the nation must be preserved at all costs.\n\nWhile the presidents speech was met with applause from his supporters, critics have accused Mnangagwa of grandstanding, claiming that his statements are often more about rhetoric than substance. Detractors argue that, despite the lofty promises, many of the issues facing Zimbabweans, particularly the youth, remain unresolved. Nevertheless, Mnangagwas remarks at the National Youth Day Commemoration signal a continued focus on his administrations efforts to promote national unity and development, even as political challenges and divisions persist.\n\nAs the nation moves forward, Mnangagwas call for the youth to embrace their potential and work toward national progress remains a central theme in his governments narrative.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa, the leader of Zimbabwe’s ruling Zanu PF party, took the opportunity on Friday to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/mnangagwa-praises-self-for-rebuilding-collapsing-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Praises Self For Rebuilding Collapsing Economy\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "Mutsvangwa and Geza Prepare The Signal | Cartoon",
            "url": "https://www.zimeye.net/2025/02/24/mutsvangwa-and-geza-prepare-the-signal-cartoon/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "Transparency International Exposes Zim Corruption Crisis",
            "url": "https://www.zimeye.net/2025/02/24/transparency-international-exposes-zim-corruption-crisis/",
            "content": "By A Correspondent\n\nZimbabwe has been designated the most corrupt nation in the Southern African Development Community (SADC) for 2024, according to the latest findings from Transparency Internationals Corruption Perceptions Index (CPI).\n\nThe countrys ranking has worsened, reaching its lowest point since 2015, when it made headlines for the infamous missing US$15 billion in diamond revenues.\n\nThe CPI, which assesses the perceived level of corruption in the public sector, gives Zimbabwe a score of 21, a decline of 3 points from the previous year.\n\nThis puts Zimbabwe at 158th out of 180 countries globally. The scale of the CPI ranges from 0, indicating highly corrupt, to 100, which signifies a very clean and transparent public sector.\n\nZimbabwes low score reflects an ongoing struggle with corruption, as the country continues to grapple with issues such as bribery, embezzlement of public funds, and a lack of accountability among government officials.\n\nThese elements, which the CPI measures, include the misuse of public office for personal gain, excessive bureaucracy, nepotism, and the diversion of public resources for private benefit.\n\nIn addition to the internal factors, Zimbabwes ranking has been influenced by a lack of stringent anti-corruption mechanisms.\n\nThe country continues to face challenges in enforcing laws that require public officials to disclose financial information, provide protection for whistleblowers, and ensure access to government data.\n\nAs a result, Zimbabwes public sector remains opaque, hindering efforts to combat systemic corruption.\n\nDespite slight improvements in the years following 2015, Zimbabwes performance has once again declined, reversing the gains it made in previous years. The highest score in recent years was recorded in 2023, with a score of 24, but the country has since slipped back into the bottom ranks.\n\nIn a broader African context, Zimbabwe now ranks among the top 10 most corrupt countries on the continent, alongside war-torn nations such as Sudan, Somalia, and Libya. Africa continues to dominate the lower end of the global CPI, with the continent accounting for the majority of the worlds most corrupt nations. In particular, countries affected by conflict, authoritarianism, and weak governance institutions consistently receive low scores.\n\nGlobally, Denmark has maintained its position as the least corrupt country, holding the top spot on the CPI for the seventh year in a row with a score of 90. Finland and Singapore follow closely behind with scores of 88 and 84, respectively. On the other end of the spectrum, war-torn and politically unstable nations occupy the bottom ranks, with South Sudan, Somalia, and Venezuela at the very bottom. Other countries in the bottom 10 include Syria, Equatorial Guinea, Eritrea, Libya, Yemen, Nicaragua, Sudan, and North Korea.\n\nThe latest data from Transparency International underscores the continued struggles many countries face in addressing corruption. For Zimbabwe, the countrys corruption problem remains a significant barrier to political and economic stability, with widespread consequences for governance, development, and the lives of ordinary citizens.\n\nAs the 2024 CPI highlights, tackling corruption in Zimbabwe will require a concerted effort to strengthen governance structures, enforce anti-corruption laws, and ensure greater transparency in both the public and private sectors. Until such reforms are put in place, the nations ranking is unlikely to improve.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe has been designated the most corrupt nation in the Southern African Development Community (SADC) for 2024, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/transparency-international-exposes-zim-corruption-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Transparency International Exposes Zim Corruption Crisis\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "CIO Agent Jailed For Fraud",
            "url": "https://www.zimeye.net/2025/02/24/cio-agent-jailed-for-fraud/",
            "content": "By A Correspondent\n\nWalter Makwalo, a 34-year-old Senior State Security Aide, has been convicted of 17 counts of fraud by the Harare Magistrates Court.\n\nHe was found guilty of impersonating the Officer Commanding Operations for the CIO Southern Region.\n\nBetween early 2023 and September 2023, Makwalo deceived Simon George Lee, a 40-year-old Harare-based farmer, by claiming he could facilitate the arrest, detention, and prosecution of Maurizio Arezio and Gabriel Arezio, who were allegedly involved in defrauding Lee of $170,600.\n\nMakwalo falsely stated that bribes were necessary for police officers, National Prosecuting Authority officials, magistrates, and judges to ensure the case progressed in Lees favor. Believing this claim, Lee paid Makwalo a total of $21,300.\n\nThe Harare Magistrates Court sentenced Makwalo to 24 months in prison.\n\nHowever, 18 months of the sentence were suspended for five years on the condition of good behavior, and the remaining six months were suspended on the condition that he performs 210 hours of community service.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Walter Makwalo, a 34-year-old Senior State Security Aide, has been convicted of 17 counts of fraud by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/cio-agent-jailed-for-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Agent Jailed For Fraud\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "Uebert Angel Paying Me Thousands, Says Maynard Manyowa, In Shock Confession",
            "url": "https://www.zimeye.net/2025/02/24/uebert-angel-paying-me-thousands-says-maynard-manyowa-in-shock-confession/",
            "content": "Shepherd Bushiris spokesman and journalist Maynard Manyowa admits in a lengthy Facebook post that he has been getting thousands of pounds from the GoldMafia implicated preacher Uebert Angel.\n\nThe worlds biggest fake degree that Maynard Manyowa will never publish is his funder, the GoldMafia fugitive, Uebert Angels and Manyowa is the Official Spokesman for the worlds most notorious fraudcase-fugitive Shepherd Bushiri whos the most notorious CIO mafia busy strangulating the state security institutions of African countries (Mohadi, DIS of Botswana, and MHS of Malawi), for covering up fake prophesies and money laundering.\n\nMaynard Manyowa writes in a Facebook post in June 2024 saying in full: For the most part, every person I have written about so far has been angelic in a sense. They have been heaven-like characters who showed up at various stages in my life and helped me become what and who I am today.\n\nYet, if the men and a woman I have thanked so far have been angelic in a sense, the subject of this chapter is angelic in name. Really, his name is Uebert Angel Snr.\n\nI first encountered Uebert Angel in 2012, at his Spirit Embassy church, then holding services at HICC in Harare. I wore spectacles at the time due to persistent and brutal headaches. I routinely missed work at Vantage Holdings because of ill-timed and merciless bouts of Asthma often inflamed by hay fever.\n\nHe prayed for me. It must have been on a hot December afternoon. He declared I should stop wearing specs and that my hay fever wouldnt be an issue again.\n\nLife happened after that day. I had a son. I moved to South Africa. I became Shepherd Bushiris media and tech guy (itself a story for another day) and so forth.\n\nFor the purposes of this story, my paths would not cross with Prophet Angel again, until maybe 2017, when we had a brief encounter at SBM Holdings in Sandton  we exchanged handshakes and pleasantries and I went about my business at the office.\n\nIn 2018, following repeated challenges online, a line of communication was opened between Angel and myself, facilitated by my father, Prophet Bushiri  in theory, Angel, a mentor and father to my own father became my Grandfather or Grandad, as you may catch me describing him in this piece and elsewhere in my life.\n\nI was quite star struck at the beginning of the relationship. Angel was polite, chatty, endearing and very fatherly. He would be interested in simple and rather small details about my life  like my diet, my relationships, my goals, and even my friends.\n\nIt was the first time I also encountered his immense generosity. Angel took care of several people in need in South Africa, and would often send me large sums of money to distribute to men, women, children and disabled people.\n\nThe first time he gave me this task, he must have sent about R200,000. The list of recipients and corresponding amounts only tallied to about R165,000. When I pointed this out, he said to me, and I can vividly remember, take R5k for yourself, the rest give your like madam.\n\nBut that wasnt the generosity alone. You see, the task had given him access to my bank details. And from there, every other fortnight or so, I would wake up with a notification for a deposit. Sometimes it was R10,000, at times it was ten times that. Unsolicited.\n\nOn WhatsApp, he would often follow these gifts with advice about investments, savings and responsibilities. If I asked, he always told me money is one thing I have in abundance and you are my grandson, use it wisely and improve your life and that of those you care about.\n\nWe will return to 2018-19 later. Let me take you back to 2017, where something significant had happened. Nottingham Trent University had offered me a scholarship to study an MA in News Journalism. A very important person in my life, who has chosen not to be mentioned in this series paid 3,000 for me to get the unconditional offer.\n\nHowever, events in Zimbabwe around that time presented an incredible once in a lifetime opportunity for me as a journalist. Succession was heating up. Mugabe wanted Mnangagwa dead. I had strong military contacts and my publication Khuluma Afrika was the go to for solid Lacoste news, as it was called then.\n\nSo school took a back seat. I deferred to 2018 and NTU moved me to a Broadcast Journalism course. But, come August, elections happened, so did post-election violence. I was subpoenaed to appear at the commission of enquiry that followed sloted for November meaning I would miss the September start.\n\nSo I deferred, amidst more difficulties, like a 2018 church stampede leading to three deaths and protests, a chapter 9 institution summoning PSB leadership and Bushiri himself being arrested in 2019. NTU were clear I could not change my start date anymore and would lose out on the 3,000 deposit and having had two offers withdrawn, my prospects of ever getting a visa would be affected.\n\nHowever, the same events had been fundamentally life changing in other ways too. My coverage of the military intervention, which went as far as CNBC and Washing Post in the US had increased my stock. I had become a bit of a star. So NTU gave me a very rare 7,500 scholarship.\n\nTo attend study I was required to raise about 12,500 in savings. As well as the remainder of my fees (4,500). The whole visa process including health surcharges cost another 2000. Prophet Angel paid for these.\n\nI also needed a place to stay, as the plan was for one half of my family (at the time) to move with me. Angel paid my rentals for a two bedroom house for a full year in advance. When I landed he gave me 2,000 to buy furniture and another 1500 for bus travel, food and lunch.\n\nI had anticipated that I would have to work for him like I had for my father. I was wrong. Angel wanted me to study first. So while every odd week or so he would drive to Nottingam in his Bentley Mulsanne or Ferrari Portofino to see me, he largely stayed out of my way.\n\nA month into my studies, disaster hit. My wifes grandmother Georgina, an amazing woman who had loved me so deeply and passionately passed away. It was unexpected and painful. My wife was 9 months pregnant, and had now lost the most important person in her life.\n\nAngel swiftly booked the first available ticket for me so I could attend the funeral. He also prepared a large envelope for me to contribute towards the funeral. My son Kaiyron was also due to be born two weeks after and Angel helped with the final touch ups.\n\nCome December, when we were on semester break, he called me on afternoon and said to me, You have not met your new born son you.\n\nKai had been born on November 29. He was referring to that.\n\nWe should surprise your wife with a Christmas gift. How do you feel about flying back to SA in time for Christmas? And have you ever flown first class?\n\nBy now you have figured what happened next. I spent Christmas and New Year in SA with my family.\n\nUnfortunately covid hit that very period, borders were closed, our learning moved online and life became lonely. My family were holed up in SA, I was stuck in the UK. But I went about my school work diligently, scoring up distinctions and high commendations.\n\nEvery other week Angel invited me to his 4m mansion in Lincoln, where we spent several evenings sitting in his jaccuzzi and talking. I believe I am the only person till today who was ever given that much private time and access by the prophet  especially in his home.\n\nI even had my own personal room in his mansion. I had biometric access at the gates. And I was allowed to drive his high end cars. It was during that time I drove a Lambo for the first time, the Ferrari, the Bentley and the Rolls.\n\nWhen I passed my exams and became a Master of the art of Documentaries, Angel bought me 12,000 Mercedes. At that time, legal problems were also besieging my father, so salaries were sometimes late. Angel took over mine.\n\nWhen the iPhone 12s were released, he bought me three. One for my wife Mutsa at the time, one for my wife Boipelo, at the time, and one for me. He also bought me a Canon EOS R, some lenses and a MacBook Pro M1.\n\nHe was the first to suggest I enroll for a PhD. I chose Bournemouth Uni and he paid 5,000 deposit for it. When lockdown rules were relaxed in December, Angel facilitated my travel to Harare to see the other half of my family.\n\nIt was there in 2020 that I contracted covid and ended up in ICU. This was a tough time. Covid was new. Hospitals didnt know how to handle it. So, my mother and Mutsa were turned away from one hospital after another. Until Dr Mataka took me in. I have written about it before here \n\nI needed urgent special care, costing upwards of $5,000. Angel stepped in. He paid for everything. I didnt die.\n\nAlthough I have spoken mostly about the financial contributions, Angel was more than that to me. We often went on long drives where he asked me about my plans and dreams.\n\nIt is why when my documentary about Elliot Mujaji was released on the BBC I dedicated it to him. It is an idea we had spoken about at length. I often pitched my ideas and he gave me his insights.\n\nUnbeknown to many, Angel is actually a very media and tech savy person. He is very good with cameras and scripting. I always joked with him that he could have been a world beating reporter.\n\nAngel was like a mentor. He always picked my calls. He always listened. And he always gave advice. The period between 2019 and 2022 was also quite chaotic in my life.\n\nMy father, often in prison or dealing with other matters was not always available as he had been before. Without guidance I often drifted towards my usual propensities of destroying self or others. Angel was my rock.\n\nAs is the cycle of life, my relationship with my grandad suffered over personal differences on matters involving others. I was wrong for the most part in how I handled these. I think deep down Angel also knows that having taught me to be a free thinking and independent person, there are times when he failed me too.\n\nBut, where we are now cannot take away from what Angel did for me. As a grandson, I did my best to serve him, though I accept I fell shot of his expectations  largely cause he believed in me so much. And dare I say, he actually loved me, plainly and deeply.\n\nIt is impossible to ever say I paid him back for what he did for me. Certainly not in a financial sense and moreso in the kind of man I became.\n\nI was a stranger to Angel. A total stranger. What he did for me, changed my life. His investment towards me touches a quarter of a million pounds.\n\nHe also really was the only person I had for several years and through very dark times. He opened so many doors for me. He stood as my blood. In his home, I was treated like blood. He loved me like no other.\n\nIt can be difficult writing about Angel, let alone reading him being described in glowing terms. I understand this. Uebert Angel is a contrasting and polarising figure. Several people dislike him, and some for valid reasons. It is not my place to go into this.\n\nHe is also a man of many shades. He is a televangelist come businessman come political appointee. People describe him as arrogant and abrupt. My experiences are different.\n\nAngel is a straight talker and a sharp shooter. But he is predominantly kind. He really is a nice person. Believe it or not he is humble and caring. Many people that he helped during my time close to him are strangers. Some are even mortal enemies but he helped them anyways.\n\nThe purpose of this chapter isnt to change your opinions on Angel. Your interactions will determine how you view him  although, I must begrudgingly say, he probably doesnt mind.\n\nI can only speak of his role in my life and the impact he had in it. Angel did incredible things for me and never asked for anything in return. Without him, my life would very, and I mean very much different.\n\nFor that, I am eternally grateful. My flowers may not mean much, but here they are, anyway, Grandad!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Shepherd Bushiri’s spokesman and journalist Maynard Manyowa admits in a lengthy Facebook post that he has been getting thousands of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/uebert-angel-paying-me-thousands-says-maynard-manyowa-in-shock-confession/\">Continue reading<span class=\"screen-reader-text\"> \"Uebert Angel Paying Me Thousands, Says Maynard Manyowa, In Shock Confession\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        },
        {
            "title": "Mrs Mnangagwa Is An Angel: Zanu PF Masvingo",
            "url": "https://www.zimeye.net/2025/02/24/mrs-mnangagwa-is-an-angel-zanu-pf-masvingo/",
            "content": "By A Correspondent\n\nThe Zanu PF Masvingo Youths have lavished praise on First Lady Auxillia Mnangagwa, hailing her as a philanthropic icon after she facilitated a donation of medical equipment to Zimbabwe. The donation, courtesy of EverX in Sydney, Australia, aims to bolster healthcare for women and children through the Angel of Hope Foundation.\n\nThe shipment includes a range of vital medical equipment, such as ultrasound machines, blood collection materials, and mobility aids. According to the Zanu PF Masvingo Youths Facebook post, this donation will enhance hospitals in Harare and rural areas, ensuring better care .\n\nWhile the donation is undoubtedly a welcome boost to Zimbabwes healthcare system, some critics argue that it is also a savvy political move by Auxillia Mnangagwa.\n\nThe First Lady has been accused of using her philanthropic work to score political points and bolster her husbands administration.\n\nAs one source noted, Her behaviour is far worse than that of Grace Mugabe in the twilight of her late husbands reign. Its unsettling that history seems to be repeating itself\n\n. These criticisms raise important questions about the motivations behind Auxillia Mnangagwas philanthropic efforts.\n\nDespite these concerns, the donation has been widely welcomed, and the Zanu PF Masvingo Youths tribute to Auxillia Mnangagwa reflects the widespread admiration for her philanthropic work. As the First Lady continues to make headlines for her charitable endeavors, it remains to be seen whether her efforts will be remembered as genuine philanthropy or clever political maneuvering.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zanu PF Masvingo Youths have lavished praise on First Lady Auxillia Mnangagwa, hailing her as a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/24/mrs-mnangagwa-is-an-angel-zanu-pf-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Mrs Mnangagwa Is An Angel: Zanu PF Masvingo\"</span></a></p>",
            "time": "20:27",
            "date": "24 Feb 2025"
        }
    ]
}