{
    "news": [
        {
            "title": "Effects Of Fatigue On The Road",
            "url": "https://www.zimeye.net/2025/04/09/effects-of-fatigue-on-the-road/",
            "content": "Feeling tired behind the wheel? Its more than just uncomfortableits dangerous. Drowsy driving is a serious risk that can lead to accidents and harm, not only to you but also to others on the road.\n\nIf youre feeling fatigued, dont push through it. Take a break for a safer journey, is the crucial reminder from road safety experts. Whether youre on a long drive or simply feeling weary after a busy day, pulling over to rest can make all the difference.\n\nRemember, Every life matters. Fatigue impairs your reaction time, judgment, and focus, increasing the chances of making a critical mistake. Dont risk ittake a short break, stretch your legs, and recharge before continuing your journey.\n\nPrioritize safety, and let your well-being guide you to safer travels. If youre tired, stop, rest, and return to the road refreshed. It could save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Feeling tired behind the wheel? It’s more than just uncomfortable—it’s dangerous. Drowsy driving is a serious risk that can lead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/effects-of-fatigue-on-the-road/\">Continue reading<span class=\"screen-reader-text\"> \"Effects Of Fatigue On The Road\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "Respect Democratic Principles, Valerio Tells Mnangagwa",
            "url": "https://www.zimeye.net/2025/04/09/respect-democratic-principles-valerio-tells-mnangagwa/",
            "content": "By A Correspondent\n\nOpposition leader Elisabeth Valerio has launched a scathing attack on President Emmerson Mnangagwas government, accusing it of widespread corruption and failing to deliver essential services to Zimbabweans.\n\nAs the only female presidential candidate in the 2023 harmonized elections, Valerio expressed her concerns about the governments priorities, stating that they are more focused on maintaining power than fulfilling their election promises.\n\nValerio criticized Mnangagwas administration for relying on empty slogans while neglecting the countrys pressing issues.\n\nShe noted that the national discourse is being hijacked by those seeking to prolong their political dominance, rather than addressing the needs of the citizenry. Valerio stated, We are merely two years into this term, but already the national discourse is being hijacked by the self-serving agenda of prolonging political dominance rather than addressing the immediate and pressing needs of the citizenry.\n\nValerio also expressed concerns about the push for an extended term, suggesting that it may be driven by the ruling partys fear of losing power in a true democracy.\n\nShe said, This push for an extended term may in part have been intensified because many of the current political players now know that their likelihood of reelection (in a true democracy) is slim!\n\nAs the leader of the United Zimbabwe Alliance (UZA), Valerio urged ZANU PF to adhere to the Constitution of Zimbabwe and respect democratic principles, rather than focusing solely on political survival.\n\nShe expressed concern that the country is being held hostage by internal divisions within the ruling party and made it clear that her party has no interest in their internal power struggles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Elisabeth Valerio has launched a scathing attack on President Emmerson Mnangagwa’s government, accusing it of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/respect-democratic-principles-valerio-tells-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Respect Democratic Principles, Valerio Tells Mnangagwa\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "‘Let’s Shut Down Country for A Full-Blast-Month-Long-Chimurenga-Stay-Away’",
            "url": "https://www.zimeye.net/2025/04/09/lets-shut-down-country-for-a-full-blast-month-long-chimurenga-stay-away/",
            "content": "By A Correspondent | ZimEye | In a turn of events signalling a seismic shift in Zimbabwes political terrain, the Geza Movement has sparked tremors so deep that the regime appears to be crumbling under the weight of its own corruption. As anti-corruption activist and war veteran Blessed Geza rallies the nation with an unflinching call for the impeachment of President Emmerson Mnangagwa, the establishment has responded not with transparency, but with panic. In what bears the hallmarks of a desperate bribe to stave off accountability, Harare City Councils Mabelreign District Office has confirmed the quiet but coordinated arrival of nearly 80 Members of Parliament  each allegedly poised to receive free residential stands.\n\nNation now needs a full-blast-month-Chimurenga of a mass stay away to restore the rule of law\n\nThis covert scheme, which unfolds in the shadow of Gezas explosive March 31st protest, points to a broader pattern of illicit enrichment and state capture. Sources on the ground describe a parade of official vehicles entering Mabelreign, with the silence of implicated institutions  from the City Council to the Department of Housing  amplifying the stench of corruption. It is widely believed that this mass handout of land is a backdoor maneuver engineered by Speaker of Parliament Jacob Mudenda, who himself faces allegations of war crimes following a ZimEye expos in Serbia.\n\nWith no comment from key offices and mounting evidence of institutional decay, the implications are profound: the Geza Movement is not only shaking the system  it is exposing the rot beneath it. If impeachment efforts succeed, Geza has vowed to escalate the campaign for justice, sending a clear message that no one, not even the head of state, is above the law. The legal and political reckoning has begun.\n\nHarare City Councils Mabelreign District office has confirmed the presence of close to 80 members of Parliament enlisted to obtain free stands.\n\nHarare City Councils Mabelreign District office has confirmed the presence of close to 80 members of Parliament enlisted to obtain free stands.The development is part of a parliamentary program that comes shortly after anti corruption activist Blessed Geza called for a motionpic.twitter.com/dhfknaIEbT\n\nThe development is part of a parliamentary program that comes shortly after anti corruption activist Blessed Geza called for a motion to impeach President Emmerson Mnangagwa.\n\nVarious legislators cars arrived in the surbub, impeccable sources told ZimEye, in what is likely speaker of Parliament Jacob Mudendas effort to avoid both an impeachment and an international prosecution over war crimes against him registered following a ZimEye interview in Serbia 6 years ago.\n\nMercy Makuvatsine at the Harare City Council did not provide comment.\n\nZimEye reached out to the Department of Housing at Mbare from where stands are allocated which did not provide comment at the time of writing.\n\nRecently, the war veteran Blessed Geza called for the impeachment of President Mnangagwa, after executing a protest on 31 March.\n\nIf the move sails through, the Geza movement will pursue other means of Mnangagwa removal.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | In a turn of events signalling a seismic shift in Zimbabwe’s political terrain, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/lets-shut-down-country-for-a-full-blast-month-long-chimurenga-stay-away/\">Continue reading<span class=\"screen-reader-text\"> \"‘Let’s Shut Down Country for A Full-Blast-Month-Long-Chimurenga-Stay-Away’\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "New Era For Informal Traders As Mbare Musika Smart Market  Opens",
            "url": "https://www.zimeye.net/2025/04/09/new-era-for-informal-traders-as-mbare-musika-smart-market-opens/",
            "content": "By A Correspondent| A state-of-the-art smart market is set to be officially opened to the public in Mbare on Friday in a move that is set to transform the citys commercial landcape.\n\nThe smart and modern trading facility is designed to improve hygiene, security and convenience for vendors and customers alike.\n\nThe new Mbare Musika market boasts of advanced amenities aimed at addressing long-standing challenges faced by informal traders in the area.\n\nThis redevelopment signals not only a facelift of the countrys busiest market but a broader shift in Zimbabwes approach to urban infrastructure and informal trade.\n\nHistorically, Mbare Musika has served as a vital economic artery for Zimbabwe, functioning as a distribution hub for fresh produce and goods from across the country. Despite its centrality to livelihoods, the market had become notorious for its chaotic environment, poor sanitation, overcrowding, and security challenges. The markets infrastructure was dilapidated, and its thousands of vendors operated in unsafe, unhygienic conditions.\n\nThese longstanding issues came to a head in April 2023, when a devastating fire reduced large parts of the bustling market to ashes. The blaze destroyed vendor stalls and goods worth millions of dollars, affecting nearly 4,700 traders and prompting President Mnangagwa to declare a state of disaster. At the time, the President described the tragedy as a severe setback for our hardworking vendors and pledged swift government intervention to restore the critical trading center.\n\nIn response, a comprehensive reconstruction project commenced in November 2024, resulting in a three-story, state-of-the-art Smart Market facility. Local Government Minister Daniel Garwe hailed the development as a milestone in urban development, emphasizing its role in formalizing informal trade.\n\nThis Smart Market is proof of the governments commitment to improving the working conditions of our people, Garwe said. With proper sanitation, security, and financial support systems, we are empowering vendors to operate in a dignified and sustainable environment.\n\nContrary to social media reports, rentals have been set at an affordable $120 per month, making the space accessible to local entrepreneurs. The facility is designed to accommodate at least 10,000 vendorsmore than double its previous capacityhighlighting the governments intent to accommodate the growing informal sector.\n\nHarare Mayor Jacob Mafume said the revamped facility would bring much-needed order and efficiency to Mbare Musika, which has historically struggled with mismanagement and neglect.\n\nFor years, vendors have struggled with inadequate facilities, but this Smart Market changes that. With reliable water supply, clean toilets, waste management, and CCTV surveillance, we are setting a new standard for markets in Zimbabwe, Mafume said.\n\nThe new market comes equipped with several transformative features including boreholes providing 120,000 liters of water daily, CCTV cameras, a modern waste management system, secure parking and washing bay for all products among others.\n\nThe Smart Market has drawn praise beyond Zimbabwes borders, with South African opposition leader Julius Malema, known for his pan-Africanist ideology, commending the initiative.\n\nThis is the kind of progressive urban development Africa needs, Malema said. When governments invest in proper infrastructure for informal traders, theyre not just building marketstheyre building dignity, economic stability, and true economic freedom for the people.\n\nAs Zimbabwe continues to grapple with urbanization, economic instability, and the vast influence of informal trade, the transformation of Mbare Musika stands as a powerful example of what is possible when infrastructure meets intention.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A state-of-the-art smart market is set to be officially opened to the public in Mbare on Friday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/new-era-for-informal-traders-as-mbare-musika-smart-market-opens/\">Continue reading<span class=\"screen-reader-text\"> \"New Era For Informal Traders As Mbare Musika Smart Market  Opens\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "Those Plotting To Remove Mnangagwa Are Dreaming: Lovemore Matuke",
            "url": "https://www.zimeye.net/2025/04/09/those-plotting-to-remove-mnangagwa-are-dreaming-lovemore-matuke/",
            "content": "By A Correspondent\n\nZANU PF Politburo Secretary for National Security and Minister of State Security, Cde Lovemore Matuke, has dismissed any efforts to remove President Emmerson Mnangagwa from office, calling those involved dreamers.\n\nMatuke made these remarks during a ZANU PF Masvingo Provincial Coordinating Committee (PCC) meeting over the weekend. He addressed the ongoing political tensions and insisted that any attempts to oust President Mnangagwa are futile.\n\nED akachibata kuti dzvii talk of removing the President from office emanates from wishful thinking, Matuke declared. Keep on dreaming, President Mnangagwa is here to stay.\n\nHe further emphasized that the individuals behind these anti-ED plots are known and doomed, asserting that Mnangagwa remains the right leader for Zimbabwe.\n\nED is the right man for the job, Matuke concluded, reinforcing the ZANU PF leaderships stance on the presidents position.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Politburo Secretary for National Security and Minister of State Security, Cde Lovemore Matuke, has dismissed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/those-plotting-to-remove-mnangagwa-are-dreaming-lovemore-matuke/\">Continue reading<span class=\"screen-reader-text\"> \"Those Plotting To Remove Mnangagwa Are Dreaming: Lovemore Matuke\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "Matuke Threatens To Expose Ant- Mnangagwa Elements In Zanu PF",
            "url": "https://www.zimeye.net/2025/04/09/matuke-threatens-to-expose-ant-mnangagwa-elements-in-zanu-pf/",
            "content": "By A Correspondent\n\nZANU PF Politburo Secretary for National Security and Minister of State Security, Cde Lovemore Matuke, has dismissed any efforts to remove President Emmerson Mnangagwa from office, calling those involved dreamers.\n\nMatuke made these remarks during a ZANU PF Masvingo Provincial Coordinating Committee (PCC) meeting over the weekend. He addressed the ongoing political tensions and insisted that any attempts to oust President Mnangagwa are futile.\n\nED akachibata kuti dzvii talk of removing the President from office emanates from wishful thinking, Matuke declared. Keep on dreaming, President Mnangagwa is here to stay.\n\nHe further emphasized that the individuals behind these anti-ED plots are known and doomed, asserting that Mnangagwa remains the right leader for Zimbabwe.\n\nED is the right man for the job, Matuke concluded, reinforcing the ZANU PF leaderships stance on the presidents position.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Politburo Secretary for National Security and Minister of State Security, Cde Lovemore Matuke, has dismissed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/matuke-threatens-to-expose-ant-mnangagwa-elements-in-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Matuke Threatens To Expose Ant- Mnangagwa Elements In Zanu PF\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "Journalist Blessed Mhlanga Complains Of Flu, Sleepless Nights In Prison",
            "url": "https://www.zimeye.net/2025/04/09/journalist-blessed-mhlanga-complains-of-flu-sleepless-nights-in-prison/",
            "content": "By Tinashe Sambiri\n\nJailed Alpha Media Holdings (AMH) journalist Blessed Mhlanga is struggling to cope with life behind bars, citing severe health issues and emotional distress.\n\nMhlanga, host of the Free Talk interview programme at Heart and Soul Television, has been denied bail three times since his arrest on February 24.\n\nMhlanga revealed in a letter that he is suffering from a serious bout of flu, which is exacerbating his sleepless nights.\n\nThe overcrowded conditions in the prisons D-class section, where he is being held alongside dangerous criminals, are taking a toll on his health.\n\nHe wrote, As I write from this discomfort of my overcrowded cell, I am suffering from a serious bout of flu which has drained my strength and now threatens my inner peace.\n\nMhlanga admitted that the experience has been overwhelming, causing him emotional pain and frustration. He stated, My friends, the journey has not been easy and it remains extremely difficult as we nudge forward; it is a marathon, not a sprint. It is very uncomfortable but unavoidable I am in pain, lost and sadly broken.\n\nDespite the challenges, Mhlanga expressed gratitude to his supporters, including fellow journalists, his legal team, family, and friends, who have provided emotional support and financial assistance. He said, I have fought with everyone around me Honestly, I cannot imagine how I would have survived without your voices of solidarity and love.\n\nMhlanga was arrested and charged under Section 164 of the Criminal Law (Codification and Reform) Act, Chapter 9:23, for allegedly inciting public violence through his coverage of a press conference held by Blessed Geza, a former ZANU PF Central Committee member.\n\nGeza had called for President Emmerson Mnangagwas resignation, citing issues such as corruption and nepotism.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Jailed Alpha Media Holdings (AMH) journalist Blessed Mhlanga is struggling to cope with life behind bars, citing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/journalist-blessed-mhlanga-complains-of-flu-sleepless-nights-in-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Journalist Blessed Mhlanga Complains Of Flu, Sleepless Nights In Prison\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "Valerio Rejects Mnangagwa",
            "url": "https://www.zimeye.net/2025/04/09/valerio-rejects-mnangagwa/",
            "content": "By A Correspondent\n\nOpposition politician Elisabeth Valerio has criticized President Emmerson Mnangagwas government, blaming it for widespread corruption and deteriorating public services, which she claims have eroded Zimbabweans trust in their leadership.\n\nAs the only female presidential candidate in the 2023 harmonised elections, Valerio said the current government is more concerned with clinging to power than fulfilling its election promises. In her view, Mnangagwas administration has relied on empty slogans while failing to address the countrys urgent issues. She stated:\n\nWe are merely two years into this term, but already the national discourse is being hijacked by the self-serving agenda of prolonging political dominance rather than addressing the immediate and pressing needs of the citizenry.\n\nShe further added, This push for an extended term may in part have been intensified because many of the current political players now know that their likelihood of reelection (in a true democracy) is slim!\n\nValerio, who leads the United Zimbabwe Alliance (UZA), expressed concern that the country is being held hostage by the internal divisions within the ruling ZANU PF party. She made it clear that her party has no interest in their internal power struggles.\n\nThe opposition leader called on ZANU PF to adhere to the Constitution of Zimbabwe and honor democratic principles, rather than focusing solely on political survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition politician Elisabeth Valerio has criticized President Emmerson Mnangagwa’s government, blaming it for widespread corruption and deteriorating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/valerio-rejects-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Valerio Rejects Mnangagwa\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "BRIBERY TO CHEAT IMPEACHMENT: 80 MPs Caught On Camera To Receive Illegal Property DishOuts",
            "url": "https://www.zimeye.net/2025/04/09/bribery-to-cheat-impeachment-80-mps-caught-on-camera-to-receive-illegal-property-dishouts/",
            "content": "By A Correspondent | ZimEye | In a turn of events signalling a seismic shift in Zimbabwes political terrain, the Geza Movement has sparked tremors so deep that the regime appears to be crumbling under the weight of its own corruption. As anti-corruption activist and war veteran Blessed Geza rallies the nation with an unflinching call for the impeachment of President Emmerson Mnangagwa, the establishment has responded not with transparency, but with panic. In what bears the hallmarks of a desperate bribe to stave off accountability, Harare City Councils Mabelreign District Office has confirmed the quiet but coordinated arrival of nearly 80 Members of Parliament  each allegedly poised to receive free residential stands.\n\nNation now needs a full-blast-month-Chimurenga of a mass stay away to restore the rule of law\n\nThis covert scheme, which unfolds in the shadow of Gezas explosive March 31st protest, points to a broader pattern of illicit enrichment and state capture. Sources on the ground describe a parade of official vehicles entering Mabelreign, with the silence of implicated institutions  from the City Council to the Department of Housing  amplifying the stench of corruption. It is widely believed that this mass handout of land is a backdoor maneuver engineered by Speaker of Parliament Jacob Mudenda, who himself faces allegations of war crimes following a ZimEye expos in Serbia.\n\nWith no comment from key offices and mounting evidence of institutional decay, the implications are profound: the Geza Movement is not only shaking the system  it is exposing the rot beneath it. If impeachment efforts succeed, Geza has vowed to escalate the campaign for justice, sending a clear message that no one, not even the head of state, is above the law. The legal and political reckoning has begun.\n\nHarare City Councils Mabelreign District office has confirmed the presence of close to 80 members of Parliament enlisted to obtain free stands.\n\nHarare City Councils Mabelreign District office has confirmed the presence of close to 80 members of Parliament enlisted to obtain free stands.The development is part of a parliamentary program that comes shortly after anti corruption activist Blessed Geza called for a motionpic.twitter.com/dhfknaIEbT\n\nThe development is part of a parliamentary program that comes shortly after anti corruption activist Blessed Geza called for a motion to impeach President Emmerson Mnangagwa.\n\nVarious legislators cars arrived in the surbub, impeccable sources told ZimEye, in what is likely speaker of Parliament Jacob Mudendas effort to avoid both an impeachment and an international prosecution over war crimes against him registered following a ZimEye interview in Serbia 6 years ago.\n\nMercy Makuvatsine at the Harare City Council did not provide comment.\n\nZimEye reached out to the Department of Housing at Mbare from where stands are allocated which did not provide comment at the time of writing.\n\nRecently, the war veteran Blessed Geza called for the impeachment of President Mnangagwa, after executing a protest on 31 March.\n\nIf the move sails through, the Geza movement will pursue other means of Mnangagwa removal.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | In a turn of events signalling a seismic shift in Zimbabwe’s political terrain, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/bribery-to-cheat-impeachment-80-mps-caught-on-camera-to-receive-illegal-property-dishouts/\">Continue reading<span class=\"screen-reader-text\"> \"BRIBERY TO CHEAT IMPEACHMENT: 80 MPs Caught On Camera To Receive Illegal Property DishOuts\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        },
        {
            "title": "New Details In Mutsvangwa–Muswere Weekend Clash",
            "url": "https://www.zimeye.net/2025/04/09/new-details-in-mutsvangwa-muswere-weekend-clash/",
            "content": "By Munacho GwamandaFresh details have emerged in the growing rift between Zanu PF spokesperson Christopher Mutsvangwa and Information Minister Jenfan Muswere, revealing a toxic blend of factional battles, personal interests, and raw political power.\n\nAt thecentreof the storm is a scathing letter Mutsvangwa wrote on7 April, threatening to fire Muswere for allegedly bypassing internal party procedures.\n\nThe Zanu PF spokesperson accused the minister of prematurely authorizing the state broadcaster, ZBC, andThe Heraldto announcethe resultsof the partys internal womens league elections in Manicaland before the party leadership had officially ratified them.\n\nMutsvangwa branded the announcement irregular and an attempt to upend standard internal consultations, asserting that any official position would come only from his office as the partys designated mouthpiece.\n\nIn tone and content, the letter was not just a reprimandit was a direct challenge to Musweres ministerial authority and a bold assertion of control over the state media apparatus.\n\nYet behind the bureaucratic outrage lies a more calculated motive: Mutsvangwa was fightingindefenceofhis wife, Monica Mutsvangwa, a senior party official whose preferred candidate had lost the controversial womens league election in Manicaland.\n\nThe womens league elections, held onApril 6, were to choose a new provincial chairperson to replace Happiness Nyakuedzwa,whowasfiredlast year.\n\nThe contest pitted acting chairperson Mercy SaccoMonica Mutsvangwas allyagainst Dorothy Mabika, backed by womens league boss Mabel Chinomona.\n\nWhen the resultswere announced, Mabika had won decisively, reportedly securing 29 votes to Saccos solitary ballot. But soon after, chaos erupted.\n\nOne faction disputed the results, claiming the elections hadbeen postponedandthat thevoteswere countedat an unsanctioned venue.\n\nAllegations of forged signatures and procedural violationsswirled,as rival camps accused each other of manipulation.\n\nThe meeting wascancelled, said a party insider, but the other faction went ahead at an unknown location. Later, it returned to the Manicaland party offices in Mutare. There is real fighting in the womens league. Chinomona supports Mabika, while Monica Mutsvangwa supports Sacco. Now Chris [Mutsvangwa] is fighting in his wifes corner.\n\nThe fallout escalated when Muswere, reportedly following routinegovernment mediapractice, authorized the coverage of the results.\n\nThis,in Mutsvangwas eyes, was a betrayalnot ofprotocol,but of his familys political interests.\n\nMutsvangwas letter to Muswere was heavy-handed, and observers say it exposed the Zanu PF spokespersons bully-boy tactics.\n\nRather than resolve the issue through internal dialogue, Mutsvangwa publicly humiliated Muswere and wielded his role as spokesperson like a weapon.\n\nHes trying to reassert himself, not just as a communications head but as a powercentrein the party, a senior Zanu PF official confided. The letter was a warning shotnot just to Muswere but to anyone seen as Mnangagwas rising star.\n\nIndeed, Jenfan Muswere, the youthful Information Minister and Zanu PF MP forMakoni,is widely seen as a protg of President Emmerson Mnangagwa.\n\nMany perceive his growing influence, especially in managing state media narratives, as part of Mnangagwas broader strategy to groom loyalists who can eventually replace the old guard.\n\nAnd this, more than anything else, seems to have irked Mutsvangwa.\n\nOnce a close ally of Mnangagwa, Mutsvangwa played a pivotal role in the 2017 military coup that ousted Robert Mugabe and elevated Mnangagwa to the presidency.\n\nBut that alliance has soured.\n\nAs Mnangagwa begins to edge out aging war veterans and consolidate power around a younger cohortincludingthe likes ofMuswereMutsvangwa has grown more aggressive and erratic.\n\nSome insiders believe heharboursambitions of his own and is using his party post to build a base, especially among disgruntled war veterans andsections of the elitefrustrated with Mnangagwas increasingly authoritarian rule.\n\nMutsvangwa sees himself as a natural successor, said another source. He thinks he has the liberation credentials, the charisma, and the networks. But Mnangagwa is not about to hand over the reins.\n\nAdding fuel to the fire arelongstanding personalrumoursthat continue to dog both camps.\n\nWhispers within party corridors suggest that Monica Mutsvangwa once had a romantic relationship with Mnangagwa, a liaisonthat allegedlyproduceda child.\n\nThough unsubstantiated and widely dismissed as political gossip, therumourhas persistedrevived every time the two camps clash.\n\nThisrumour, while salacious, underscores thedeeplypersonal nature of the political battles within Zanu PF.\n\nIn a party where family ties, factional alliances, and state power often overlap, such scandals are not mere distractionsthey areweapons.\n\nAt its heart, the Mutsvangwa-Muswere clash is about control: control of the media, control of party processes, and control of the post-Mnangagwa succession narrative.\n\nAsthe party gears up for a potentially explosive elective congress, the battle lines are becoming clearer.\n\nMutsvangwa,longand loudest voice in the room,is flexinghis muscles to reassert dominance.\n\nBut Muswere, backed by the full weight of the presidency, is no pushover.\n\nThis is no longer about protocol or press statements, the senior Zanu PF official added. Its about who controls the future of the partyand who gets left behind.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda–Fresh details have emerged in the growing rift between Zanu PF spokesperson Christopher Mutsvangwa and Information Minister Jenfan … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/09/new-details-in-mutsvangwa-muswere-weekend-clash/\">Continue reading<span class=\"screen-reader-text\"> \"New Details In Mutsvangwa–Muswere Weekend Clash\"</span></a></p>",
            "time": "18:34",
            "date": "09 Apr 2025"
        }
    ]
}