{
    "news": [
        {
            "title": "Welshman, Biti Lose Party Control To Tshabangu",
            "url": "https://www.zimeye.net/2024/12/13/welshman-biti-lose-party-control-to-tshabangu/",
            "content": "Political Reporter- Welshman Ncube and Tendai Biti have lost control of the divided CCC after the Parliament approved parliament purges by the CCCs controversial secretary-general Sengezo Tshabangu.\n\nThishas raised tensions within the CCC, led by Welshman Ncube, promptingthem to approach the High Court in Bulawayo to contest the reshuffle, arguing that Tshabangu lacks the authority to make such changes without party approval.\n\nHowever, despite the legal challenge, Parliament announced the changes, appointing Maureen Kademaunga as the new Leader of the Opposition, replacing Lynnette Karenyi Kore, whileNonhlahla Mlotshwawas appointedas the overall Chief Whip of the opposition.\n\nCCC spokesperson Willias Madzimure condemned Parliaments decision to implement the changes.\n\nHe said :\n\nThe matter is before the courtandaccording to theCourtsthe matter willbe heardon Fridayandit is alarming.\n\nIt is shocking that afterthe speaker had been servedwith the court papers, hewent on to makethe arrangement.\n\nAs a party, weare operatingina normaldemocracy where the rule of law is respected when we have such a situation, we approach the courts.\n\nTshabangu assumed control of the party in October 2023 and began recalling dozens of elected representatives, leveraging support from both Parliament and the Judiciary.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Political Reporter- Welshman Ncube and Tendai Biti have lost control of the divided CCC after the Parliament approved parliament purges … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/welshman-biti-lose-party-control-to-tshabangu/\">Continue reading<span class=\"screen-reader-text\"> \"Welshman, Biti Lose Party Control To Tshabangu \"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "Tshabangu Wins Another Coup",
            "url": "https://www.zimeye.net/2024/12/13/tshabangu-wins-another-coup/",
            "content": "Political Reporter- The speaker of Parliament, Jacob Mudenda, has approved CCCs controversial secretary-general Sengezo Tshabangus parliament purges.\n\nThishas raised tensions within the CCC, led by Welshman Ncube, promptingthem to approach the High Court in Bulawayo to contest the reshuffle, arguing that Tshabangu lacks the authority to make such changes without party approval.\n\nHowever, despite the legal challenge, Parliament announced the changes, appointing Maureen Kademaunga as the new Leader of the Opposition, replacing Lynnette Karenyi Kore, whileNonhlahla Mlotshwawas appointedas the overall Chief Whip of the opposition.\n\nCCC spokesperson Willias Madzimure condemned Parliaments decision to implement the changes.\n\nHe said :\n\nThe matter is before the courtandaccording to theCourtsthe matter willbe heardon Fridayandit is alarming.\n\nIt is shocking that afterthe speaker had been servedwith the court papers, hewent on to makethe arrangement.\n\nAs a party, weare operatingina normaldemocracy where the rule of law is respected when we have such a situation, we approach the courts.\n\nTshabangu assumed control of the party in October 2023 and began recalling dozens of elected representatives, leveraging support from both Parliament and the Judiciary.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Political Reporter- The speaker of Parliament, Jacob Mudenda, has approved CCC’s controversial secretary-general Sengezo Tshabangu’s parliament purges. This has raised tensions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/tshabangu-wins-another-coup/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Wins Another Coup\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "Mheuka Makes Chelsea Debut",
            "url": "https://www.zimeye.net/2024/12/13/mheuka-makes-chelsea-debut/",
            "content": "Sports Correspondent\n\nZimbabwean talent Shim Mheuka has made his senior debut for Chelsea in a 3-1 victory over Astana in the Europa Conference League on Thursday evening.\n\nThe 17-year-old forward was brought on in the 78th minute, replacing Marc Guiu, and played the remainder of the match.\n\nMheuka, who joined Chelseas academy in 2022, has been playing for the U21 team. Born to Zimbabwean parents, he is eligible to represent both England and Zimbabwe at international level.\n\nHis father, Malcolm Mheuka, previously played in Zimbabwes top-flight for teams such as Zimbabwe Saints and Circle Cement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean talent Shim Mheuka has made his senior debut for Chelsea in a 3-1 victory over Astana in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/mheuka-makes-chelsea-debut/\">Continue reading<span class=\"screen-reader-text\"> \"Mheuka Makes Chelsea Debut\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "The Importance of Bicycle Tail Lights and Reflectors for Road Safety",
            "url": "https://www.zimeye.net/2024/12/13/the-importance-of-bicycle-tail-lights-and-reflectors-for-road-safety/",
            "content": "When it comes to cycling, safety should always be a top priority. One often overlooked yet crucial element of a cyclists safety gear is the tail light or reflector. Just as vehicle tail lights play an essential role in helping drivers see each other, bicycle tail lights and reflectors are vital for ensuring cyclists are visible to other road users, especially from behind.\n\nEnhanced Visibility in Low Light Conditions\n\nCyclists often ride during dawn, dusk, or at night, when visibility is reduced. Tail lights and reflectors are designed to make a cyclist visible to others, reducing the risk of accidents. Tail lights are particularly effective in low-light conditions or when there is limited visibility, such as on poorly lit roads or in foggy weather. The bright light emitted by tail lights ensures that cyclists can be easily spotted by motorists, fellow cyclists, and pedestrians, even from a distance.\n\nReflectors, on the other hand, work by bouncing back light from other vehicles. Even without a battery-powered light source, these small, reflective devices can help you stand out in the dark, as they are designed to catch headlights from other vehicles and send that light back in the direction it came from.\n\nReducing Accidents and Enhancing Road Safety\n\nBicycle accidents, particularly rear-end collisions, are a significant concern for cyclists. Since they often ride in areas where traffic is moving faster or on roads without dedicated bike lanes, the risk of being overlooked by a driver is high. Bicycle tail lights and reflectors act as a clear signal that a cyclist is present on the road, alerting drivers to slow down, pass safely, and keep a safe distance. This can make a huge difference in preventing accidents and ensuring the cyclists safety.\n\nIn addition to rear visibility, these lights and reflectors also help to highlight the cyclists position on the road, making it easier for vehicles to predict their movement and avoid close encounters. For cyclists who ride in groups, having properly working tail lights can prevent dangerous situations where riders are missed by other road users.\n\nLegal Requirements and Best Practices\n\nIn many places, having a tail light or reflector on a bicycle is not just a safety measure but a legal requirement. Laws often mandate that cyclists use lights and reflectors when riding at night or in low-light conditions to ensure visibility. In some regions, the law stipulates that the rear light should be red, and the reflector must be positioned in a specific area to maximize visibility. Its important for cyclists to familiarize themselves with local regulations and ensure they are complying with safety standards.\n\nChoosing the Right Tail Light or Reflector\n\nWhen selecting a tail light, cyclists should consider factors such as brightness, battery life, and mounting options. LED lights are often the best choice, as they are energy-efficient and can emit a bright beam visible from far away. USB rechargeable models are also a popular option for those who want to reduce battery waste.\n\nFor reflectors, its crucial to ensure they are correctly positioned on the back of the bicycle and are made from high-quality reflective materials. Some cyclists opt for both a tail light and additional reflectors to provide maximum visibility from different angles.\n\nConclusion\n\nTail lights and reflectors are not just accessories but essential components of cycling safety. By increasing visibility to other road users, they play a vital role in preventing accidents and ensuring cyclists can ride with greater confidence and security. Whether youre cycling through city streets or on quiet rural roads, make sure your bike is equipped with these critical safety features.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When it comes to cycling, safety should always be a top priority. One often overlooked yet crucial element of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/the-importance-of-bicycle-tail-lights-and-reflectors-for-road-safety/\">Continue reading<span class=\"screen-reader-text\"> \"The Importance of Bicycle Tail Lights and Reflectors for Road Safety\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "Amnesty International Exerts Pressure On Mnangagwa to Abolish Death Penalty",
            "url": "https://www.zimeye.net/2024/12/13/amnesty-international-exerts-pressure-on-mnangagwa-to-abolish-death-penalty/",
            "content": "By A Correspondent\n\nAmnesty International Zimbabwe has intensified its call for the abolition of the death penalty in Zimbabwe, urging President Emmerson Mnangagwa to swiftly sign the Death Penalty Abolition Bill into law.\n\nThe bill, which passed through Zimbabwes Senate on December 11, 2024, is now awaiting the Presidents assent.\n\nIf signed into law, it would mark a significant step toward ending the practice of capital punishment in the country.\n\nAmnesty International Zimbabwes Executive Director, Lucia Masuka, expressed the organizations strong support for the bills passage.\n\nIn a statement released on Thursday, Masuka described the Senates vote as a major step by Zimbabwe towards the abolition of the death penalty.\n\nShe further emphasized that the decision was a victory for those who have fought relentlessly for the protection of human life.\n\nIt is also a victory for all those who have tirelessly campaigned to consign this cruel punishment to history and strengthen the protection of the right to life and other human rights, Masuka said.\n\nThe bills passage follows years of advocacy by human rights organizations, including Amnesty International, which has been campaigning for the global abolition of the death penalty since 1977.\n\nWhile Zimbabwe has made progress in limiting its use  including an unofficial moratorium on executions  courts continue to impose death sentences. Zimbabwe last carried out an execution in 2005, and President Mnangagwa has periodically commuted death sentences to life imprisonment.\n\nAmnesty International commended Zimbabwes legislative efforts to end the death penalty, calling them progressive.\n\nMasuka added, We urge the President to take heed of this historic landmark decision by signing this draft act without delay and commuting all death sentences to prison terms. She further emphasized that The death penalty is the ultimate cruel, inhuman and degrading punishment and has no place in our world.\n\nDespite the countrys progress, the use of the death penalty remains a contentious issue.\n\nAmnestys continued advocacy highlights the importance of fully removing it from Zimbabwes legal framework and securing human rights protections for all.\n\nAs the bill now awaits Mnangagwas signature, Amnesty International and other human rights organizations are closely watching the Presidents next move, hoping that Zimbabwe will join the growing list of countries that have abolished capital punishment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Amnesty International Zimbabwe has intensified its call for the abolition of the death penalty in Zimbabwe, urging … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/amnesty-international-exerts-pressure-on-mnangagwa-to-abolish-death-penalty/\">Continue reading<span class=\"screen-reader-text\"> \"Amnesty International Exerts Pressure On Mnangagwa to Abolish Death Penalty\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "Tropical Cyclone Chido Expected to Hit Zimbabwe on December 17",
            "url": "https://www.zimeye.net/2024/12/13/tropical-cyclone-chido-expected-to-hit-zimbabwe-on-december-17/",
            "content": "By A Correspondent\n\nZimbabwe is bracing for the potential impact of Tropical Cyclone Chido, which is currently causing disruptions in the northeastern part of Madagascar. According to the Meteorological Services Department, the cyclone is predicted to reach Zimbabwe on December 17, bringing with it strong winds and heavy rainfall.\n\nThe Met Department warned that certain areas in Zimbabwe could experience rainfall exceeding 70 millimeters within 24 hours.\n\nTropical Cyclone Chido is expected to cross into Zimbabwe on the 17th of December, bringing heavy rains and strong winds, the department stated.\n\nThe areas most likely to be affected include Manicaland, Masvingo, Mashonaland East, Mashonaland West, Mashonaland Central, Harare Metropolitan, and some parts of the Midlands Province.\n\nIn light of the expected storm, the authorities are urging citizens to take precautions.\n\nResidents are encouraged to secure their homes from the anticipated strong winds and avoid open spaces during the storm, said a spokesperson from the Meteorological Services Department.\n\nAdditionally, citizens are advised to prepare evacuation plans and stay informed by following updates from the Meteorological Services Department and the Department of Civil Protection.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe is bracing for the potential impact of Tropical Cyclone Chido, which is currently causing disruptions in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/tropical-cyclone-chido-expected-to-hit-zimbabwe-on-december-17/\">Continue reading<span class=\"screen-reader-text\"> \"Tropical Cyclone Chido Expected to Hit Zimbabwe on December 17\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "Broke Mnangagwa Regime Targets Churches for Tax Revenue",
            "url": "https://www.zimeye.net/2024/12/13/broke-mnangagwa-regime-targets-churches-for-tax-revenue/",
            "content": "By A Correspondent\n\nIn a surprising move, President Emmerson Mnangagwas administration, grappling with financial strain, is now targeting churches to bolster its dwindling revenues.\n\nThis decision has been viewed as a desperate attempt by the government to shore up its ailing coffers.\n\nOn Thursday, the Zimbabwe Revenue Authority (ZIMRA) issued a public notice addressing churches across the country, outlining tax guidelines and inviting them to an upcoming stakeholder engagement. The statement read:\n\nPUBLIC NOTICE:NOTICE TO ALL CHURCHES\n\nThe Zimbabwe Revenue Authority (ZIMRA) wishes to inform all churches about an upcoming Stakeholder Engagement. This forum aims to address tax compliance across all applicable tax categories, as part of ZIMRAs commitment to transparency and compliance support. The date and venue for the engagement will be communicated in due course.\n\nThe notice also provided important tax guidelines for churches, detailing both exempt and taxable income. According to ZIMRA:\n\nExempt IncomeThe following types of income are exempt from income tax:  Donations, Tithes, Offerings, and Contributions: Income received or accrued from donations, tithes, offerings, or contributions made by members or benefactors of the church or its institutions.\n\nHowever, the notice clarified that income generated from trading activities would be subject to taxation. Examples include (but are not limited to):\n\nThis move has raised concerns about the potential financial strain it could place on churches, already grappling with economic challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a surprising move, President Emmerson Mnangagwa’s administration, grappling with financial strain, is now targeting churches to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/broke-mnangagwa-regime-targets-churches-for-tax-revenue/\">Continue reading<span class=\"screen-reader-text\"> \"Broke Mnangagwa Regime Targets Churches for Tax Revenue\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "Peter Ndlovu Slammed for Accepting Chivayo’s “Cursed” Vehicle",
            "url": "https://www.zimeye.net/2024/12/13/peter-ndlovu-slammed-for-accepting-chivayos-cursed-vehicle/",
            "content": "By A Correspondent\n\nThe legendary South African publication Kick-Off has strongly criticized former Warriors captain and ex-Highlanders forward Peter Ndlovu for accepting a luxurious vehicle from the controversial Zanu PF businessman Wicknell Chivayo.\n\nNdlovu, who once played for Coventry City, was gifted a brand-new 2024 BMW X6 valued at R2.6 million by Chivayo, known for his involvement in various scandals.\n\nThis act has sparked backlash, with several political figures condemning the former Mamelodi Sundowns star for tarnishing his illustrious reputation.\n\nBulawayo Mayor David Coltart was particularly vocal in his disapproval. He described Ndlovus decision to accept the car as a mockery of his otherwise stellar reputation.\n\nIts sad to note that Peter accepted Chivayos gift.\n\nThe question is, where did the money come from? Coltart questioned, implying that Chivayos financial dealings might not be above board.\n\nThe controversy has cast a shadow over Ndlovus legacy, as critics argue that associating with such a figure could damage his public image.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The legendary South African publication Kick-Off has strongly criticized former Warriors captain and ex-Highlanders forward Peter Ndlovu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/peter-ndlovu-slammed-for-accepting-chivayos-cursed-vehicle/\">Continue reading<span class=\"screen-reader-text\"> \"Peter Ndlovu Slammed for Accepting Chivayo’s “Cursed” Vehicle\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "S A Buys More Buses Deport Border Jumper",
            "url": "https://www.zimeye.net/2024/12/13/s-a-buys-more-buses-deport-border-jumper/",
            "content": "South Africa The Home Affairs and the Border Management Authority (BMA) have bought more buses and dronesto be usedto deport illegal border crossings ahead of the festive season.\n\nThese measures, described by critics as xenophobic, primarily target Zimbabweans and other regional migrants seeking refuge in Pretoria amid economic hardships back home.\n\nAt the same time, Botswana has adopted a more inclusive approach, expediting documentation processes for skilled Zimbabweans to fill labour gaps in its booming economy, particularly in the diamond sector.\n\nThe use of drones, hailed as a first-of-its-kind initiative, was launched by Democratic Alliance (DA) Home Affairs Minister Leon Schreiber.\n\nAt the launch event, Schreiber emphasised the governments commitment to rigorously monitoring South Africas borders.\n\nNo longer will it be the case that people can move around without us having eyes on them, Schreiber said. We want to send a very clear message to people who want to violate South Africas immigration laws: for the very first time, you wont even know that we are seeing you. We are above you, we are around you, and we are watching for infringements along the borderline.\n\nThe drones willbe supplementedby body cameras for border guards to prevent corruption and ensure safety.\n\nTo further bolster enforcement, the government has introduced buses tasked with deporting undocumented migrants back to their home countries.\n\nSchreiber stressed the importance of distinguishing between those who follow the law and contribute to the South African economy and those who do not.\n\nWe welcome any traveler, investor, tourist, or skilled person who will follow our laws and help us build South Africa. But that is different from people who violate our law and dont want to comply with our rules.\n\nIn a symbolic demonstration of the new measures, the first wave of deportations saw 290 illegal miners sent back to Mozambique.\n\nWhile South Africa tightens its grip, Botswana has taken a markedly different stance.\n\nThe country announced plans to expedite work permits and documentation for skilled Zimbabweansalreadycontributing to its economic growth.\n\nThe move, celebrated by many Zimbabwean professionals, is part of Botswanas broader strategy to harness regional talent in key industries.\n\nThe contrasting approaches highlight divergent regional strategies toward migration.\n\nWhile South Africas methods are increasingly focused on border militarisation and mass deportations, Botswanas policies appear to underscore the potential of skilled migrants to foster economic development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa – The Home Affairs and the Border Management Authority (BMA) have bought more buses and drones to be used to deport … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/s-a-buys-more-buses-deport-border-jumper/\">Continue reading<span class=\"screen-reader-text\"> \"S A Buys More Buses Deport Border Jumper\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        },
        {
            "title": "S A Employs Drones To Deport Foreigners",
            "url": "https://www.zimeye.net/2024/12/13/s-a-employs-drones-to-deport-foreigners/",
            "content": "South Africa The Department of Home Affairs and the Border Management Authority (BMA) have  unveiled  drones and deportation busesin a bidto curb illegal border crossings ahead of the festive season.\n\nThese measures, described by critics as xenophobic, primarily target Zimbabweans and other regional migrants seeking refuge in Pretoria amid economic hardships back home.\n\nAt the same time, Botswana has adopted a more inclusive approach, expediting documentation processes for skilled Zimbabweans to fill labour gaps in its booming economy, particularly in the diamond sector.\n\nThe use of drones, hailed as a first-of-its-kind initiative, was launched by Democratic Alliance (DA) Home Affairs Minister Leon Schreiber.\n\nAt the launch event, Schreiber emphasised the governments commitment to monitoring South Africas bordersmore rigorously.\n\nNo longer will it be the case that people can move around without us having eyes on them, Schreiber said. We want to send a very clear message to people who want to violate South Africas immigration laws: for the very first time, you wont even know that we are seeing you. We are above you, we are around you, and we are watching for infringements along the borderline.\n\nThe drones willbe supplementedby body cameras for border guards to prevent corruption and ensure safety.\n\nTo further bolster enforcement, the government has introduced buses tasked with deporting undocumented migrants back to their home countries.\n\nSchreiber stressed the importance of distinguishing between those who follow the law and contribute to the South African economy and those who do not.\n\nWe welcome any traveler, investor, tourist, or skilled person who will follow our laws and help us build South Africa. But that is different from people who violate our law and dont want to comply with our rules.\n\nIn a symbolic demonstration of the new measures, the first wave of deportations saw 290 illegal miners sent back to Mozambique.\n\nWhile South Africa tightens its grip, Botswana has taken a markedly different stance.\n\nThe country announced plans to expedite work permits and documentation for skilled Zimbabweansalreadycontributing to its economic growth.\n\nThe move, celebrated by many Zimbabwean professionals, is part of Botswanas broader strategy to harness regional talent in key industries.\n\nThe contrasting approaches highlight divergent regional strategies toward migration.\n\nWhile South Africas methods are increasingly focused on border militarisation and mass deportations, Botswanas policies appear to underscore the potential of skilled migrants to foster economic development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa – The Department of Home Affairs and the Border Management Authority (BMA) have unveiled drones and “deportation buses” in a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/s-a-employs-drones-to-deport-foreigners/\">Continue reading<span class=\"screen-reader-text\"> \"S A Employs Drones To Deport Foreigners\"</span></a></p>",
            "time": "2024-12-13 20:28:02"
        }
    ]
}