{
    "news": [
        {
            "title": "Zanu PF Bigwigs Exchange Blows",
            "url": "https://www.zimeye.net/2025/06/27/zanu-pf-bigwigs-exchange-blows/",
            "content": "By A Correspondent-Top Zanu PF Womens League officials nearly came to blows at a tense Provincial Coordinating Committee (PCC) meeting in Mutare, as deepening factional battles for control of the partys Manicaland structures spilled into the open.\n\nThe dramatic altercation  witnessed by senior party officials and delegates  saw rival factions aligned to Zanu PF secretary for legal affairs Patrick Chinamasa and Senate president Mabel Chinomona clash over who should lead the provincial womens league.\n\nThe main protagonists in the showdown were acting provincial chairperson Mercy Sacco, widely regarded as Chinamasas ally, and Dorothy Mabika, a political heavyweight allegedly backed by Chinomona. Both women attempted to assert dominance at the high table during the meeting, each claiming to be the legitimate leader of the womens league in the province.\n\nChinamasa was forced to intervene publicly, urging the two rivals to avoid further embarrassment and await a final determination from the politburo.\n\nI am the secretary for legal affairs and I must ensure that the party constitution is upheld, Chinamasa said. The election of Mabika as chairperson was not sanctioned by the party. It was overruled, and Sacco remains the acting chairperson until the politburo makes a final decision.\n\nThe position became vacant last year following the suspension of then-chairperson Happiness Nyakuedzwa. Mabika claims to have been legitimately elected earlier this year, but Chinamasa insists the process was irregular.\n\nI raised this matter in the politburo, and it is now on the agenda for the next meeting on July 4. Until then, we will not embarrass anyone. That is why both women are here today, he added, in an attempt to restore order.\n\nHowever, the spectacle in Mutare laid bare the extent of infighting gripping the ruling party, particularly as rival camps within the womens league openly jockey for power and influence in the post-Mugabe era.\n\nSome party members at the meeting supported Mabikas claims, saying she was duly elected through a democratic process. Yet the open confrontation  and the need for high-level arbitration  underscores the widening cracks in Zanu PFs internal cohesion, especially in key provinces like Manicaland.\n\nWhen contacted for comment, Zanu PFs director of information, Farai Marapira, sought to downplay the incident, dismissing the reports of factionalism as opposition propaganda.\n\nThere are no factions in Zanu PF, Marapira claimed. What people are witnessing is vibrant internal engagement, which is being mischaracterized by opposition elements who wish to destabilize the party.\n\nDespite these denials, the heated scenes in Mutare suggest that factionalism  long a feature of Zanu PFs internal politics  remains alive and well, with competing power blocs now openly challenging each other even at grassroots levels.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Top Zanu PF Women’s League officials nearly came to blows at a tense Provincial Coordinating Committee (PCC) meeting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/zanu-pf-bigwigs-exchange-blows/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Bigwigs Exchange Blows\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Chitungwiza Aquatic Complex Collapses",
            "url": "https://www.zimeye.net/2025/06/27/chitungwiza-aquatic-complex-collapses/",
            "content": "By Parliamentary Reporter-Parliament has expressed deep concern and dismay over the dilapidated state of the Chitungwiza Aquatic Complex, a once-iconic sports facility that proudly hosted the 1995 All Africa Games and numerous other international events.\n\nOnce a symbol of sporting excellence in Zimbabwe, the Olympic-standard complex is now a shadow of its former self. Its main swimming pool, practice pool, and childrens pool have fallen into disrepair, while key infrastructure such as the electronic timing system and boiler house has long been abandoned and remains non-functional.\n\nThe collapse of the complex has not only affected its aesthetics but also severely impacted local and national swimming development, with athletes and recreational swimmers now forced to seek alternative facilities. Safety concerns and a lack of basic maintenance have rendered the complex unusable.\n\nThe extent of the neglect was brought to light during a recent inspection by the Parliamentary Portfolio Committee on Sport, Recreation, Arts and Culture, chaired by legislator Farai Jere. Following the visit, Jere expressed outrage at the state of the facility:\n\nWe are appalled by the state of the Chitungwiza Aquatic Complex. We will take this matter to Parliament to push for the restoration of this facility to its former glory so that it can once again host international swimming events, Jere said.\n\nIt is unacceptable that we are spending millions of dollars to send athletes abroad when we have a world-class Olympic facility right here at home that has been left to rot.\n\nThe committees visit was part of a broader oversight mission to assess the implementation of government policies on sports infrastructure and to identify urgent interventions needed to revitalize the sector.\n\nThe current state of the Chitungwiza Aquatic Complex stands as a stark reminder of the countrys failure to preserve legacy infrastructure, and Parliament is now under pressure to act decisively to rescue what was once one of Zimbabwes proudest sporting landmarks.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Parliamentary Reporter-Parliament has expressed deep concern and dismay over the dilapidated state of the Chitungwiza Aquatic Complex, a once-iconic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/chitungwiza-aquatic-complex-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"Chitungwiza Aquatic Complex Collapses\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Bosso Boss Resigns",
            "url": "https://www.zimeye.net/2025/06/27/bosso-boss-resigns-2/",
            "content": "Sports Correspondent\n\nBULAWAYO  Highlanders Football Clubs Acting Chief Executive Officer Kindman Ndlovu has stepped down from his position, marking yet another leadership shake-up at the Bulawayo-based giants.\n\nNdlovus resignation comes less than three months into his tenure and makes him the fourth CEO to exit the club in the past 12 months  a clear sign of instability at the executive level of one of Zimbabwes biggest football institutions.\n\nThe reasons for Ndlovus sudden departure have not yet been officially disclosed by the club. His brief stint adds to growing concerns among supporters and stakeholders over Highlanders ability to maintain consistent leadership at the helm.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent BULAWAYO – Highlanders Football Club’s Acting Chief Executive Officer Kindman Ndlovu has stepped down from his position, marking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/bosso-boss-resigns-2/\">Continue reading<span class=\"screen-reader-text\"> \"Bosso Boss Resigns\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Yaya Toure Eyes Coaching Post",
            "url": "https://www.zimeye.net/2025/06/27/yaya-toure-eyes-coaching-post/",
            "content": "Sports Correspondent\n\nFormer Manchester City and Ivory Coast star Yaya Toure is reportedly on the verge of landing his first head coaching role with Belgian second-tier club Daring Brussels.\n\nAccording to Belgian outlet La DH Les Sports+, Daring Brussels have identified Toure as their top candidate for the vacant head coach position and have already initiated contact with the former midfielder.\n\nToure, who enjoyed a decorated playing career, has been steadily building his coaching credentials. He recently served as assistant coach to Roberto Mancini with the Saudi Arabia national team, and previously worked alongside Carl Hoefkens at Standard Lige in Belgium.\n\nIf the deal is finalized, this will mark Toures first official role as a head coach, a significant milestone in his post-playing career.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Manchester City and Ivory Coast star Yaya Toure is reportedly on the verge of landing his first … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/yaya-toure-eyes-coaching-post/\">Continue reading<span class=\"screen-reader-text\"> \"Yaya Toure Eyes Coaching Post\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Going Beyond Music, Rising Zim Dancehall Star Dhidza Doctor Blends Beat with Purpose",
            "url": "https://www.zimeye.net/2025/06/27/going-beyond-music-rising-zim-dancehall-star-dhidza-doctor-blends-beat-with-purpose/",
            "content": "By A Correspondent\n\nJOHANNESBURG  Zimbabwean dancehall artist Dhidza Doctor, real name I Do Mhondiwa, is redefining the boundaries of music with a unique blend of entertainment, education, and activismand hes not slowing down anytime soon.\n\nCurrently based in South Africa, the youthful artist has been making waves with his conscious dancehall style, fusing infectious rhythms with powerful messages on health, social justice, and community safety.\n\nWe are going beyond music, said Dhidza Doctor in an interview. I want people to dance, yes, but also to think, to learn, to act.\n\nKnown for his lyrical storytelling and commitment to info-tainment and edu-tainment, Dhidza Doctor has built a growing fanbase drawn to his authenticity and passion for issues often ignored in mainstream music. Whether addressing the dangers of drug abuse, promoting mental health awareness, or urging youth to stay in school, his songs speak directly to real-life struggles facing Zimbabweans and the wider African diaspora.\n\nMusic is a powerful tool, he said. But we must use it to build, to heal, to educate. Think beyond the microphonethats the mentality Im pushing.\n\nThough currently in South Africa, Dhidza Doctor revealed plans to return to Zimbabwe soon for a series of collaborations with local artists, producers, and community organisations.\n\nIm coming back home because I believe in unity and growth. Collaboration is the heartbeat of our industry and our culture.\n\nWith a fresh voice and fearless vision, Dhidza Doctor is part of a new generation of Zimbabwean artists proving that music can move more than just bodiesit can move minds and communities too.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent JOHANNESBURG – Zimbabwean dancehall artist Dhidza Doctor, real name I Do Mhondiwa, is redefining the boundaries of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/going-beyond-music-rising-zim-dancehall-star-dhidza-doctor-blends-beat-with-purpose/\">Continue reading<span class=\"screen-reader-text\"> \"Going Beyond Music, Rising Zim Dancehall Star Dhidza Doctor Blends Beat with Purpose\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Nelson Chamisa Mourns Citizens Hero…",
            "url": "https://www.zimeye.net/2025/06/27/nelson-chamisa-mourns-citizens-hero/",
            "content": "By Tinashe Sambiri\n\nCitizens Coalition for Change (CCC) leader Advocate Nelson Chamisa has paid heartfelt tribute to the late Mafosi Mpofu, describing him as a true hero of the peoples struggle.\n\nSpeaking at Mpofus funeral on Thursday, Chamisa honoured the late activist as a dedicated leader who had committed his life to the cause of freedom and democracy.\n\nConsoling the Mpofu family and friends We lost a community leader and citizens hero, Mafosi Mpofu  a committed freedom fighter and dedicated democracy warrior. You fought a good fight! Sizafika kuphela. Rest in power, Khulu! Chamisa said.\n\nMpofu was known for his grassroots activism and unwavering commitment to democratic change, earning deep respect in both his community and the broader citizens movement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Citizens Coalition for Change (CCC) leader Advocate Nelson Chamisa has paid heartfelt tribute to the late Mafosi … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/nelson-chamisa-mourns-citizens-hero/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Mourns Citizens Hero…\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Mutare’s Christmas Pass to Get Two New US$99 Million Traffic Interchanges",
            "url": "https://www.zimeye.net/2025/06/27/mutares-christmas-pass-to-get-two-new-us99-million-traffic-interchanges/",
            "content": "Tinotenda Hove  Construction has commenced on two state-of-the-art traffic interchanges along the Christmas Pass route in Mutare, at a total cost of US$99 million. The project, undertaken by Leengate Private Limited, is expected to be completed within 15 months.\n\nThe 31.2-kilometre development is being implemented through a public-private partnership between the Government of Zimbabwe and Leengate (Pvt) Ltd. The contractor is already on site, signaling the start of what is set to be a transformative infrastructure upgrade for the region.\n\nOnce completed, the interchanges are anticipated to significantly reduce road accidents, particularly those involving heavy trucks navigating the sharp curves of the Christmas Pass.\n\nThis initiative follows the recent commissioning of the US$88 million Trabablas Interchange in Harare, highlighting the governments continued investment in modernising national road infrastructure.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinotenda Hove – Construction has commenced on two state-of-the-art traffic interchanges along the Christmas Pass route in Mutare, at a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/mutares-christmas-pass-to-get-two-new-us99-million-traffic-interchanges/\">Continue reading<span class=\"screen-reader-text\"> \"Mutare’s Christmas Pass to Get Two New US$99 Million Traffic Interchanges\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Mnangagwa Slams Councillors Over Nepotism While Elevating Own Allies To Key Positions…",
            "url": "https://www.zimeye.net/2025/06/27/mnangagwa-slams-councillors-over-nepotism-while-elevating-own-allies-to-key-positions/",
            "content": "By A Correspondent \n\nBULAWAYO  In a strikingly ironic address at the 4th All Councils Indaba held in Bulawayo on Thursday, President Emmerson Mnangagwa admonished local authorities to shun nepotismdespite persistent criticism over his own practice of promoting close allies and family members to influential positions in government.\n\nSpeaking before over2,000 delegatesfrom the countrys92 local councils, Mnangagwa emphasized the importance of putting citizens first in all council operations. He called on councillors to honour the mandate given to them by their constituents, stressing the need to focus on critical service areas such aswaste management, housing, and transparency in governance.\n\nYou came from the people, you were elected by the people Whatever you do must be guided by the best interests of those who put you there, he said.\n\nHe also challenged local authorities to monitor their performance rigorously and to act swiftly to prevent administrative collapse. We should be able to intervene before systems collapse. That is only achievable if there is constant monitoring by leadership, Mnangagwa said.\n\nBut it was his warning againstnepotismin council hiring practices that raised eyebrows.\n\nLet us avoid nepotism when employing and make sure competent people are employed, he statedcomments that stood in sharp contrast to his own record as President.\n\nCritics have long pointed toMnangagwas elevation of close relatives and loyalistsinto key government and parastatal positions as a hallmark of his leadership style. From family members appointed to diplomatic posts to trusted allies placed in powerful ministries and boards, Mnangagwas administration has often been accused ofconsolidating power through patronage, undermining the very meritocracy he now claims to champion.\n\nObservers say the presidents remarks may ring hollow for Zimbabweans who continue to witness a widening gap betweenrhetoric and realityespecially as transparency and accountability remain elusive at the highest levels of leadership.\n\nMeanwhile, the Indaba also featured the launch of the Minimum Service Delivery Standards and the Urban State Land Management Policy, aimed at improving transparency and standardising operations in urban councilsa move welcomed by many, but still overshadowed by the Presidents contradictory message.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent … BULAWAYO – In a strikingly ironic address at the 4th All Councils Indaba held in Bulawayo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/mnangagwa-slams-councillors-over-nepotism-while-elevating-own-allies-to-key-positions/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Slams Councillors Over Nepotism While Elevating Own Allies To Key Positions…\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Video: Nelson Chamisa Visits Zaka District…",
            "url": "https://www.zimeye.net/2025/06/27/video-nelson-chamisa-visits-zaka-district/",
            "content": "Citizens leader Advocate Nelson Chamisa on Friday shared a video of himself visiting Zaka District in Masvingo Province, where he received a warm welcome from locals.\n\nPosting on social media, Chamisa wrote:\n\nIm in Zaka Lots of amazing love from amazing people!\n\nThe visit is part of his ongoing grassroots engagements across the country.\n\nIm in Zaka..Lots of amazing love from amazing people!#OnePeoplepic.twitter.com/X7ZkN9xCOP\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Citizens leader Advocate Nelson Chamisa on Friday shared a video of himself visiting Zaka District in Masvingo Province, where he … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/video-nelson-chamisa-visits-zaka-district/\">Continue reading<span class=\"screen-reader-text\"> \"Video: Nelson Chamisa Visits Zaka District…\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        },
        {
            "title": "Zanu PF Masvingo Stalwart Hungwe Dies",
            "url": "https://www.zimeye.net/2025/06/27/zanu-pf-masvingo-stalwart-hungwe-dies/",
            "content": "By A Correspondent\n\nMASVINGO  Long-serving Zanu PF councillor Phillip Dunira Hungwe, a political stalwart from Vuranda, Ward 1 in Chivi District, has died. He passed away in Harare, where he had been hospitalized for some time.\n\nConfirming the news, Zanu PF Masvingo Provincial leadership said Hungwes death is a great loss to both the party and the Chivi community.\n\nHe was admitted in Harare for some time and unfortunately, his condition was not pleasing. We have lost a dedicated cadre who served the party and the people with unwavering commitment, said a senior party official in the province.\n\nHungwe was widely respected for his long-standing service, having been one of the longest-serving councillors in the country, and a constant figure in local governance throughout the post-independence era.\n\nDetails regarding funeral arrangements are yet to be announced.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO – Long-serving Zanu PF councillor Phillip Dunira Hungwe, a political stalwart from Vuranda, Ward 1 in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/27/zanu-pf-masvingo-stalwart-hungwe-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Masvingo Stalwart Hungwe Dies\"</span></a></p>",
            "time": "09:31",
            "date": "28 Jun 2025"
        }
    ]
}