{
    "news": [
        {
            "title": "PSG Crucify Reds",
            "url": "https://www.zimeye.net/2025/03/12/psg-crucify-reds/",
            "content": "Sports Correspondent\n\nThe Reds began the match with intense pressure, attempting to overwhelm their opponents early on.\n\nHowever, their efforts were thwarted in the 12th minute when Ousmane Dembele scored, leveling the aggregate score at 1-1.\n\nBoth teams created several opportunities throughout regular time and extra-time to break the deadlock, but neither could find the decisive goal, leading to a penalty shootout.\n\nIn the shootout, PSGs goalkeeper Gianluigi Donnarumma emerged as the hero, saving penalty attempts from both Darwin Nunez and Curtis Jones.\n\nPSG triumphed 4-1 in the shootout, securing their place in the next round.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Reds began the match with intense pressure, attempting to overwhelm their opponents early on. However, their efforts … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/psg-crucify-reds/\">Continue reading<span class=\"screen-reader-text\"> \"PSG Crucify Reds\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Musona Returns To Warriors Fold",
            "url": "https://www.zimeye.net/2025/03/12/musona-returns-to-warriors-fold/",
            "content": "Sports Correspondent\n\nKnowledge Musona has ended his international retirement, marking his return to the Zimbabwe Warriors. Musona had stepped away from national duty in May 2022 to focus on his club career and pave the way for younger players.\n\nFollowing convincing discussions with Warriors coach Michael Nees, Musona has rejoined the team. He is now part of the squad set to compete in the upcoming 2026 FIFA World Cup Qualifiers Group C matches against Benin and Nigeria.\n\nMusonas initial 12-year stint with the national team saw him earn 54 caps and score 24 goals. Currently, he plays for Al Okhdood in the Saudi Pro League.\n\nMusonas return follows that of experienced players Khama Billiat and Washington Arubi, who also rejoined the national team under Nees leadership. Billiat had retired from international football, while Arubi had fallen down the pecking order.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Knowledge Musona has ended his international retirement, marking his return to the Zimbabwe Warriors. Musona had stepped away … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/musona-returns-to-warriors-fold/\">Continue reading<span class=\"screen-reader-text\"> \"Musona Returns To Warriors Fold\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Prioritize Passengers’ Safety…",
            "url": "https://www.zimeye.net/2025/03/12/prioritize-passengers-safety/",
            "content": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a common practice, this situation poses serious risks to passengers and needs to be addressed by authorities.\n\nOne of the main dangers of overcrowded buses is the excessive weight that is placed on the vehicle.\n\nWhen a bus is overloaded, it becomes harder for the driver to maintain control, especially when navigating sharp turns or sudden stops. In the event the driver is forced to apply the emergency brake, passengers who are standing are at risk of falling and sustaining injuries due to the lack of support.\n\nMoreover, standing passengers are more vulnerable to accidents in the event of sudden maneuvers.\n\nThey lack the security of a seat belt or a steady handrail, making them more likely to be thrown off balance and potentially hurt in an accident. The possibility of injury only increases when buses are traveling at high speeds or during congested traffic conditions.\n\nThe safety of passengers should always be a priority, and overloading buses compromises this fundamental principle. Passengers deserve a safe and secure journey, and it is crucial for bus operators and regulatory authorities to enforce strict guidelines on vehicle capacity to prevent overloading.\n\nTo mitigate these risks, authorities should consider increasing inspections of public transportation systems and impose fines for overloading violations. Moreover, bus companies must adhere to regulated passenger limits and ensure that all safety protocols are followed to protect the well-being of those traveling.\n\nIn conclusion, the practice of overloading buses is not only illegal but extremely dangerous. It is essential for both passengers and authorities to recognize the risks involved and work together to prioritize safety in public transport.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/prioritize-passengers-safety/\">Continue reading<span class=\"screen-reader-text\"> \"Prioritize Passengers’ Safety…\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Politicians Threaten Residents Leaders For Exposing Illegal Gold Mining Activities In Masvingo",
            "url": "https://www.zimeye.net/2025/03/12/politicians-threaten-residents-leaders-for-exposing-illegal-gold-mining-activities-in-masvingo/",
            "content": "By A Correspondent\n\nMasvingo  For the past few months, residents leaders in Masvingo have been the target of escalating threats after exposing the illegal gold mining activities around the citys water reservoirs at Tagert Kopje hills. The situation has grown increasingly tense as powerful politicians, allegedly involved in the illegal mining, have reportedly targeted the leaders of the Masvingo United Residents and Rate Payers Alliance (MURRA) in a bid to silence their efforts.\n\nMURRA Director, Anoziva Muguti, recently revealed that he has been receiving anonymous threats from illegal gold panners who warned of harm to him and his staff. This follows MURRAs legal battle against the illegal mining operations, which has included reviving a High Court case seeking an interdict to stop the mining activities threatening both the citys water supply and the safety of its residents.\n\nWe will not be intimidated. We will continue to fight for justice and accountability, no matter the cost, Muguti stated firmly.\n\nMugutis resolve comes as a response to the ongoing illegal mining activities, which he insists pose a severe risk to the water tanks situated at Tagert Kopje hills. The tanks store over a million cubic liters of water for the city, and the illegal miners are operating dangerously close to these vital resources.\n\nWe will not back down. The people of Masvingo deserve nothing less than clean water and a safe environment, Muguti asserted.\n\nResidents have raised alarms about the illegal minings environmental impact. There are growing concerns that the hazardous chemicals used, such as cyanide, could leak into the water supply, jeopardizing public health. Additionally, fears have emerged that the mining activity beneath the tanks could lead to a catastrophic collapse of the reservoirs, threatening the lives of residents in nearby suburbs, including Majange, Hillside, and Tagert Kopje.\n\nDespite the threats against him, Muguti remains determined to continue MURRAs fight to stop the illegal mining. He stressed that they are not alone in their efforts.\n\nWe are not alone in this fight. There are countless others who have suffered at the hands of these illegal mining operations. Together, we demand justice and accountability, Muguti emphasized.\n\nResidents have also reported that the blasting of rocks in the area has caused significant cracks in their homes, heightening fears that the structures could eventually collapse as well.\n\nMURRA has yet to report the threats to the police, as they are still investigating the individuals behind the intimidation. However, Muguti revealed that they have gathered the names of several influential politicians and their families involved in the illegal mining activities. These names, however, will not be disclosed until confirmed through legal proceedings.\n\nWe are taking our time to ensure the right people are held accountable. We will reveal names only once the courts have positively identified them, Muguti concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo – For the past few months, residents’ leaders in Masvingo have been the target of escalating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/politicians-threaten-residents-leaders-for-exposing-illegal-gold-mining-activities-in-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Politicians Threaten Residents Leaders For Exposing Illegal Gold Mining Activities In Masvingo\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Mhlanga’s Bail Appeal Pulled Back Again",
            "url": "https://www.zimeye.net/2025/03/12/mhlangas-bail-appeal-pulled-back-again/",
            "content": "By A Correspondent | ZimEye | High Court judge Justice Gibson Mandaza has indefinitely adjourned AMH journalist Blessed Mhlangas bail appeal hearing.\n\nMhlanga is appealing for bail after being denied it by the lower court in a case where he is accused of publishing an interview with Zanu PF member and war veteran Blessed Geza, who is demanding that President Emmerson Mnangagwa step down for failing Zimbabweans.\n\nThe journalist has been behind bars for two weeks.\n\nHis bail appeal hearing was initially set for Monday but failed to proceed after the state requested that the matter be heard by the Anti-Corruption Court.\n\nHowever, the request was dismissed, and the hearing was rescheduled for Wednesday.\n\nOn Wednesday, Mhlangas lawyer requested an adjournment after applying for further particulars to strengthen his bail argument.\n\nMhike said the state has not been forthcoming.\n\nWe believe the importance of video evidence will support our arguments.\n\nWe are raising this issue for the second time, hoping the High Court will grant a fairer hearing, as the magistrates court refused to consider it, Mhike said, suggesting that the hearing could be adjourned to 12 midday.\n\nMandaza stated that he needed time to determine the application but did not specify when the court would reconvene.\n\nHe said the parties would be informed accordingly.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | High Court judge Justice Gibson Mandaza has indefinitely adjourned AMH journalist Blessed Mhlanga’s bail … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/mhlangas-bail-appeal-pulled-back-again/\">Continue reading<span class=\"screen-reader-text\"> \"Mhlanga’s Bail Appeal Pulled Back Again\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Chamisa Envisions A Prosperous Future for Zim, Despite Economic Turmoil",
            "url": "https://www.zimeye.net/2025/03/12/chamisa-envisions-a-prosperous-future-for-zim-despite-economic-turmoil/",
            "content": "By A Correspondent\n\nOpposition leader Advocate Nelson Chamisa has projected a brighter future for Zimbabwe, despite the current economic challenges the country faces.\n\nSpeaking on Monday, Chamisa outlined his vision for a transformed Zimbabwe that he believes will become a donor country in the near future.\n\nIn his statement, Chamisa expressed a firm belief that the countrys fortunes will soon change. This next Zimbabwe will be a New Great Zimbabwe. This next Zimbabwe will not beg but will give and donate. Zimbabwe will be a donor country, he said.\n\nA Zimbabwe of plenty will run a budget surplus and not a budget deficit.\n\nChamisas vision centers on economic self-sufficiency and prosperity, particularly through harnessing the nations vast resources. We will harness our resources to build and deliver on our PROSPERITY MODEL, he explained, emphasizing his commitment to transforming the countrys economic landscape.\n\nOne of the key components of Chamisas vision is improving the nations healthcare and education systems. He stressed that Zimbabwes future government would prioritize self-funded health budgets to provide first-class healthcare for all citizens.\n\nOur health budget will be self-funded to provide first class healthcare for all and for everyone, Chamisa affirmed. First class education will be accessible by all and by everyone.\n\nHe also described the potential for Zimbabwe to become a global leader in economic prosperity, with a focus on inclusivity, integrity, transparency, and value addition. A New Great Zimbabwe, rich in minerals, talent, and vision, will be the new testimony and global story, Chamisa said, stressing that his model would be built on these principles.\n\nChamisa continued by outlining his vision for Zimbabwes agricultural sector. We will have enough to feed ourselves and others. We will use our surplus to feed the world and help other nations, he declared. Ours will not just be a food sufficient nation but a food surplus nation. That is The Next Zimbabwe!\n\nHis bold vision also includes a strong sense of national pride and hope for the future, encapsulated in his hashtags: #ANewGreatZimbabwe, #ImaginationMonday, and #TotangiraIpapo, which reflect his forward-thinking attitude.\n\nChamisas statements come at a time when Zimbabwe is grappling with severe economic hardships. Despite these challenges, the opposition leader remains steadfast in his belief that change is possible and that a prosperous future for the nation is within reach.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Advocate Nelson Chamisa has projected a brighter future for Zimbabwe, despite the current economic challenges … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/chamisa-envisions-a-prosperous-future-for-zim-despite-economic-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Envisions A Prosperous Future for Zim, Despite Economic Turmoil\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Tragedy Deepens: Chipinge Dam Collapse Death Toll Rises",
            "url": "https://www.zimeye.net/2025/03/12/tragedy-deepens-chipinge-dam-collapse-death-toll-rises/",
            "content": "By A Correspondent\n\nA devastating dam collapse at Bandama Farm in Chivhunze Village, Chipinge, has left a community in mourning as the death toll has increased to five.\n\nThe tragic incident occurred on Sunday, when the dam at Bandama Farm collapsed, sweeping away villagers.\n\nTwo villagers remain missing, and rescue teams are working around the clock to locate them.\n\nThe search efforts continue, but the somber mood in the village is a poignant reminder of the tragedy that has unfolded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating dam collapse at Bandama Farm in Chivhunze Village, Chipinge, has left a community in mourning … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/tragedy-deepens-chipinge-dam-collapse-death-toll-rises/\">Continue reading<span class=\"screen-reader-text\"> \"Tragedy Deepens: Chipinge Dam Collapse Death Toll Rises\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Four Pupils Suffer Serious Water Burns at Kelvin Mufunde’s Firm Foundation Preparatory School",
            "url": "https://www.zimeye.net/2025/03/12/four-pupils-suffer-serious-water-burns-at-kelvin-mufundes-firm-foundation-preparatory-school/",
            "content": "Four pupils from Firm Foundation Preparatory School in Helensvale, Harare suffered severe water burns on Thursday last week.\n\nThe pupils, whose identities have been withheld for privacy reasons, were rushed to Gelfand Hospital and Parirenyatwa Hospital for emergency treatment.\n\nThe extent of their injuries has left families and residents grappling with anger and sorrow.\n\nAccording to eyewitnesses, the incident occurred when the matron known as Mai Tino accidentally spilled hot water onto the pupils, causing immediate and severe burns.\n\nThe children below the age of 12 are currently undergoing intensive medical care, with doctors describing their condition as critical but stable.\n\nWhen contacted for comment, Kelvin Chipfunde, the owner of the school displayed a shocking lack of remorse.\n\nIn a brief and dismissive statement, Chipfunde said, I wont comment. Do whatever.\n\nHis callous response has sparked outrage among parents who are demanding accountability and justice for the injured children.\n\nThe schools headmistress, Mrs. Mlambo, initially denied her presence at the school when questioned by reporters.\n\nHowever, when a news crew visited the premises, they found her on-site.\n\nDespite being confronted, Mrs. Mlambo refused to provide any comments or explanations regarding the incident.\n\nParents of the affected pupils expressed their anguish and frustration.\n\nOur children trusted this school to keep them safe, and now they are suffering unimaginable pain, said one distraught parent. We want answers, and we want those responsible to be held accountable.\n\nThe incident has raised serious concerns about safety standards at the school, with many calling for a thorough investigation into the schools operations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Four pupils from Firm Foundation Preparatory School in Helensvale, Harare suffered severe water burns on Thursday last week. The pupils, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/four-pupils-suffer-serious-water-burns-at-kelvin-mufundes-firm-foundation-preparatory-school/\">Continue reading<span class=\"screen-reader-text\"> \"Four Pupils Suffer Serious Water Burns at Kelvin Mufunde’s Firm Foundation Preparatory School\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Mnangagwa Rewards Own Loyalists With Solar Panels",
            "url": "https://www.zimeye.net/2025/03/12/mnangagwa-rewards-own-loyalists-with-solar-panels/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas announcement of the Presidential Solar Programme is being widely viewed as a calculated move to bolster Zanu PFs political base in rural areas, with critics arguing that the initiative is less about empowering villagers and more about reinforcing political loyalty ahead of upcoming elections.\n\nThe programme, which promises to provide solar power to 200,000 households across the countrys eight rural provinces, was unveiled by Information Minister Dr. Jenfan Muswere during a post-cabinet briefing this Tuesday.\n\nFollowing the approval of the Implementation Plan for the Presidential Solarisation Programme in December 2024, significant milestones have been made towards the provision of solar power to 200,000 households, Dr. Muswere said.\n\nHowever, the timing and execution of this programme have raised concerns about its real intent. Skeptics believe it is a deliberate attempt by Mnangagwa to ingratiate himself with rural voters, especially those in areas where Zanu PFs support has been under pressure.\n\nThe solar initiative is being touted as a solution to power shortages, but many see it as a tool for political grandstanding.\n\nThe guidelines for the programme have been established, with stakeholder mapping and identification of beneficiaries already completed, Dr. Muswere explained, pointing to the completion of community mobilization efforts across the rural provinces. But critics argue that the programmes implementation could be skewed, with those loyal to the ruling party likely to be the first to benefit.\n\nVillagers have already begun expressing doubts about the true motives behind the programme. Many suspect that this solar gift will be used as a form of political patronage, rewarding those who show unwavering support for Mnangagwa and his Zanu PF government.\n\nThe installation of the solar kits will reportedly be carried out by Youth Service graduates, with assistance from experts at the Harare Institute of Technology and the Rural Electrification Agency. But the question remains: will the solar power truly reach all households, or will it serve as a tool to further entrench political loyalty?\n\nWith Zanu PFs stronghold traditionally rooted in rural areas, Mnangagwas government may be hoping this gesture will solidify that base as elections approach. Its a pattern seen before: grand gestures aimed at securing votes in exchange for political allegiance.\n\nIn a country where the rural electorate is a key determinant in election outcomes, Mnangagwas solar programme risks being perceived not as an act of goodwill, but as a deliberate attempt to hoodwink villagers and consolidate his partys power in the most vulnerable regions.\n\nThis move, while touted as a step towards rural development, could also be seen as a calculated gimmickdesigned to distract from the countrys ongoing economic hardships while reinforcing Zanu PFs control over Zimbabwes rural population.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s announcement of the Presidential Solar Programme is being widely viewed as a calculated move … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/mnangagwa-rewards-own-loyalists-with-solar-panels/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Rewards Own Loyalists With Solar Panels\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        },
        {
            "title": "Reggae Icon Cocoa Tea Dies",
            "url": "https://www.zimeye.net/2025/03/12/reggae-icon-cocoa-tea-dies/",
            "content": "By A Correspondent\n\nReggae music has lost one of its most iconic voices. Colvin Cocoa Tea Scott, the legendary reggae singer, has passed away at the age of 65.\n\nHis wife, Malvia Scott, confirmed the news to The Gleaner, revealing that the singer passed away early this morning at 4:46 AM at a hospital in Broward, Ft Lauderdale, Florida, after suffering a cardiac arrest.\n\nIn an emotional conversation with The Gleaner, Malvia shared the tragic details of Cocoa Teas final moments. I received a call this morning saying that he had been transferred from the facility to the hospital, which was just five minutes away. He had been vomiting, she explained. He was first diagnosed with lymphoma back in 2019, and in the last six months, he had also been battling pneumonia.\n\nDespite his diagnosis, Cocoa Tea remained strong and positive throughout his struggles. Malvia recalled his courageous spirit even in the face of illness. He was definitely very brave, she said, adding, He kept a positive attitude through it all.\n\nMalvia also recalled a poignant moment from just a few weeks ago when Cocoa Tea was hospitalized. About three weeks ago, when he was admitted, he asked me if I was worried, she shared. I told him, Im always worried, and he reassured me, saying, Dont worry, everything is going to be all right. He was always hopeful.\n\nCocoa Tea, known for hits like Nah Give Up, was admired not only for his musical talent but for his unwavering optimism, which remained evident up until his final days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Reggae music has lost one of its most iconic voices. Colvin “Cocoa Tea” Scott, the legendary reggae … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/12/reggae-icon-cocoa-tea-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Reggae Icon Cocoa Tea Dies\"</span></a></p>",
            "time": "09:29",
            "date": "13 Mar 2025"
        }
    ]
}