{
    "news": [
        {
            "title": "Stallion Cruise Bus Company Owner Dies",
            "url": "https://www.zimeye.net/2025/06/20/stallion-cruise-bus-company-owner-dies/",
            "content": "By A Correspondent- Zvishavane-based entrepreneur and one of President Emmerson Mnangagwas business allies, Alice Pote, has died.\n\nShe was 33.\n\nPote, a financial director at the family-owned conglomerate Pote Holdings and founder of Stallion Cruise Bus Company, died on Monday from acute respiratory failure and pulmonary embolism, according to a post-mortem report.\n\nHer death has sent shockwaves through business and political circles, not only for her youth but also because of her familys reported close ties to President Mnangagwaties that have allegedly secured them lucrative government contracts across sectors.\n\nFamily sources told this publication that the Pote family shares a blood relationship with Mnangagwa, a connection thathas long raised eyebrows over how Pote Holdings has expanded rapidly under Zimbabwes current political dispensation.\n\nThe companyheaded by Alices brother, prominent businessman Anthony Clever Poteis a sprawling empirewith interestsin construction, transport, tourism, retail, agriculture, earthmoving, mining, micro-finance, and hospitality.\n\nIt enjoys a visible footprint in Zvishavane, Masvingo, and the broader Midlands Province.\n\nInsiders allege that the family has benefited from preferential treatment intheawardingofstate tenders, often out-competing other companies due to their political proximity to the president.\n\nSpeaking last night, Mr Pote confirmed the death and paid tribute to his sisters contribution to the business.\n\nAlice has left us without saying goodbye. I am devastated. She was one of the directors of Pote Holdings, a pillar of strength. She has been behind the success of our business empire. She just left us at 33, very young and promising, he said.\n\nAlice was the second-last born in the family and survived by three children.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- Zvishavane-based entrepreneur and one of President Emmerson Mnangagwa’s business allies, Alice Pote, has died. She was 33. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/stallion-cruise-bus-company-owner-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Stallion Cruise Bus Company Owner Dies\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "Makebi Zulu Picture Routes",
            "url": "https://www.zimeye.net/2025/06/20/makebi-zulu-picture-routes/",
            "content": "SATIRICAL FEATURE | By Our Correspondent\n\nIf You Hire Makebi Zulu, How Many Colours-of-Ideas Will He Announce Before You Get Home?\n\nA viral meme has catapulted Edgar Lungu family spokesperson Makebi Zulu into the internets courtroom of comedic judgmentwhere instead of arguing legal principles, the question is far more existential: If you were stranded in a foreign land and hired this man to bring you back home, how many colours-of-ideas would he announce along the way? And would you ever actually make it?\n\nIn the now-infamous photo, Zulu stands confidently dressed in a navy-blue suit, crisp (though partially rebellious) white shirt, and a silk scarf knotted at the neck like he just stepped off the runwayor perhaps out of a very complicated affidavit. Behind him, an African sunset painting glows warmly, perhaps foretelling how many times the story behind Edgar Lungus burial may still change colour.\n\nOnline analysts (read: amused citizens) have already identified at least three colour-coded themes:Colour Route 1: The scarf of layered intentions  equal parts style and a metaphor for the tangled narrative hes been spinning.Colour Route 2: The shirt of uncertainty  unbuttoned, unfiltered, and unbothered by the weight of clarity.Colour Route 3: The trousers of long journeys  seemingly pointing toward a route that may go nowhere, slowly.\n\nMakebi Zulu, a seasoned lawyer, has found himself not just defending the Lungu familys controversial decision to keep the former presidents remains in South Africa, but now defending himself against the court of public opinion armed with memes and satire. His long-winded explanations, evasive phrasing, and ever-shifting statements have become a national riddle with no final page.\n\nWhile the public waits for a definitive answer on where, when, or whether the late Edgar Lungu will be buried, one thing is certain: if youre relying on Makebi Zulu to guide you home, bring a tent, some snacks, and a few changes of metaphor. Youll need them.\n\nIn the end, its not just about the colours-of-routes. Its about whether this journey has a destinationor just a very stylish detour.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "SATIRICAL FEATURE | By Our Correspondent If You Hire Makebi Zulu, How Many Colours-of-Ideas Will He Announce Before You Get … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/makebi-zulu-picture-routes/\">Continue reading<span class=\"screen-reader-text\"> \"Makebi Zulu Picture Routes\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "Tagwirei Entering Presidential Race?",
            "url": "https://www.zimeye.net/2025/06/20/tagwirei-entering-presidential-race/",
            "content": "By A CorrespondentControversial businessman and Emmerson Mnangagwas close ally, Kudakwashe Tagwirei, has been co-opted into ZANU PFs Central Committee  a move that has fueled speculation he is being positioned as a potential successor to the president.\n\nThe development, confirmed by ZANU PF legal affairs secretary Patrick Chinamasa, marks Tagwireis formal entry into politics after years of wielding influence from the shadows through his sprawling business empire and strategic proximity to the presidency.\n\nTagwireis appointment comes as Mnangagwa enters the final stretch of his constitutionally mandated second term, with internal jockeying for the post-Mnangagwa era intensifying. Sources say the billionaire tycoon could emerge as a dark horse in the succession race, with growing support from party elites who view him as a loyal benefactor and stabilizing force.\n\nThough initially recommended by Masvingo, it was Harare Province that cleared space for Tagwirei in the powerful 300-member committee. Chinamasa described him as a dormant but committed cadre who is now erupting like a volcano, signaling his arrival on the national political stage.\n\nThis is a breath of fresh air, said Chinamasa. Cde Tagwirei is destined to add value to ZANU PFs political fortunes. His entry may change the game not only in Harare but nationally.\n\nTagwireis elevation is being viewed in political circles as more than symbolic. Insiders believe his Central Committee role could be a calculated first step toward a larger leadership bid  possibly even the presidency.\n\nThough critics accuse him of using his economic clout to buy influence, supporters say Tagwireis resilience and deep pockets make him a formidable contender in ZANU PFs future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent –Controversial businessman and Emmerson Mnangagwa’s close ally, Kudakwashe Tagwirei, has been co-opted into ZANU PF’s Central Committee — … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/tagwirei-entering-presidential-race/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Entering Presidential Race?\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "Zimbos Kicked Out Of Princess Cruiseship For Deserting",
            "url": "https://www.zimeye.net/2025/06/20/zimbos-kicked-out-of-princess-cruiseship-for-deserting/",
            "content": "By A Correspondent-Princess Cruises has suspended shore leave in Canadian ports for all Zimbabwean crew members following a spate of desertions since the start of the Alaska cruise season, highlighting the enduring desperation among Zimbabweans seeking economic refuge abroad.\n\nThe directive, issued in a company memo early this month, by Elio Autiero, Vice President of Maritime HR Strategy & Operations, cites multiple desertion cases by Zimbabwean seafarers in Canadian ports.\n\nThe company said the decision was necessary to safeguard its business operations and maintain the integrity of its global staffing protocols.\n\nAs a result, we made the difficult decision to suspend shore leave for all Zimbabwean teammates in Canadian ports, Autiero wrote. He urged captains, hotel general managers, and human resources officers to implement the measure with immediate effect.\n\nThe move comes amid a renewed wave of economic migration by Zimbabweans, many of whom have been fleeing deteriorating conditions at home since the early 2000s.\n\nZimbabwes once-thriving economy began to collapse around 2000 following a series of political missteps, including violent land seizures, disputed elections, hyperinflation, and the near-total collapse of essential public services.\n\nDespite changes in leadership, the country has continued to face chronic unemployment, currency instability, corruption, and human rights abusesdriving millions to seek better lives abroad.\n\nThe cruise ship industry has in recent years become a vital source of employment for young Zimbabweans, particularly those with hospitality and culinary training. However, Canada has increasingly become a popular destination for deserters, drawn by its relatively open asylum system and perceived better prospects for long-term settlement.\n\nPrincess Cruises acknowledged the potential hardship this restriction will cause to law-abiding Zimbabwean crew members. Nevertheless, the company emphasized that it must comply with immigration regulations and mitigate business risks posed by unauthorized absconding.\n\nThe memo clarified that Zimbabwean crew members will not be reassigned to other regions, and upon the completion of their contracts, they will be disembarked at ports outside Canada. Crew planners and third-party concession partners are reportedly adjusting rosters to avoid further complications involving Zimbabwean staff.\n\nThe company advised employees with concerns or questions to contact David Price, Senior Manager of GTP Management, who is liaising with the Canada Border Services Agency (CBSA) and U.S. Customs and Border Protection (CBP) to handle the matter.\n\nThe development underscores the increasingly precarious position of Zimbabwean economic migrantsespecially those in temporary or contract jobs abroadwhose dreams of escape are now colliding with tightened immigration controls and corporate crackdowns.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Princess Cruises has suspended shore leave in Canadian ports for all Zimbabwean crew members following a spate of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/zimbos-kicked-out-of-princess-cruiseship-for-deserting/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbos Kicked Out Of Princess Cruiseship For Deserting\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "MWOS Unstoppable",
            "url": "https://www.zimeye.net/2025/06/20/mwos-unstoppable/",
            "content": "By Sports Correspondent\n\nMWOS continued their fairytale debut Premiership season with a stunning 2-1 come-from-behind victory over CAPS United on Thursday at Nhingi Stadium.\n\nDespite the growing hype, MWOS coach Lloyd Mutasa remained modest after the match, praising his players for their resilience and focus.\n\nIm proud of the boys. We take it one game at a time and stay grounded, Mutasa said.\n\nThe Punters have now defeated Zimbabwes traditional giantsHighlanders, Dynamos, and CAPS Unitedmarking them as one of the most formidable newcomers the league has seen in years.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent MWOS continued their fairytale debut Premiership season with a stunning 2-1 come-from-behind victory over CAPS United on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/mwos-unstoppable/\">Continue reading<span class=\"screen-reader-text\"> \"MWOS Unstoppable\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "Botafogo Stun High Flying PSG",
            "url": "https://www.zimeye.net/2025/06/20/botafogo-stun-high-flying-psg/",
            "content": "By Sports Correspondent\n\nBrazilian giants Botafogo pulled off a major upset at the FIFA Club World Cup, defeating French champions Paris Saint-Germain 1-0 in a tightly contested match.\n\nPSG, widely regarded as one of the tournament favorites, struggled to break down a disciplined Botafogo side, who capitalized on their chances and defended resolutely to secure a historic win.\n\nIn other results, Atletico Madrid cruised past Seattle Sounders 3-1, Inter Miami edged Porto 2-1 in a dramatic encounter, while Palmeiras claimed a comfortable 2-0 victory over Egyptian side Al Ahly.\n\nThe shock win for Botafogo sends a clear message that the South American underdogs are not to be underestimated in this years tournament.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Brazilian giants Botafogo pulled off a major upset at the FIFA Club World Cup, defeating French champions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/botafogo-stun-high-flying-psg/\">Continue reading<span class=\"screen-reader-text\"> \"Botafogo Stun High Flying PSG\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "Donald Trump To Make Decision On Israel, Iran War In Two Weeks.",
            "url": "https://www.zimeye.net/2025/06/20/donald-trump-to-make-decision-on-israel-iran-war-in-two-weeks/",
            "content": ".\n\nBy A Correspondent\n\nU.S. President Donald Trump will make a final decision within the next two weeks on whether the United States will become directly involved in the ongoing conflict between Israel and Iran, the White House announced on Thursday.\n\nSpeaking at a press briefing, White House Press Secretary Karoline Leavitt conveyed a message directly from President Trump:\n\nBased on the fact that theres a substantial chance of negotiations that may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks.\n\nThe announcement comes amid escalating tensions in the Middle East, following Israeli strikes on Iranian targets and a retaliatory missile attack by Iran that struck near a hospital in southern Israel on Thursday morning. Iranian state media claimed the strike was aimed at a military installation next to the hospital.\n\nIn a firm warning to Washington, Irans Deputy Foreign Minister Saeed Khatibzadeh told the BBC:\n\nThis is not Americas war. If the U.S. gets involved, it will be hell for the whole region. It will turn into a quagmire, prolong the aggression, and delay any end to the brutal atrocities.\n\nPresident Trump, who addressed reporters earlier in the week, remained vague about his intentions:\n\nI may do it. I may not do it, he said on Wednesday, emphasizing his administrations strategic ambiguity on the matter.\n\nAsked what message the president had for ordinary Americans concerned about a potential new conflict, Leavitt responded:\n\nTrust in President Trump. His top priority is making sure Iran never gets a nuclear weapon.\n\nThe U.S. intelligence community remains divided. Trump has dismissed recent intelligence assessments from figures such as Director of National Intelligence Tulsi Gabbard, who indicated that Iran is not actively pursuing nuclear weapons. In contrast, the administration insists that Iran has never been closer to building one.\n\nMeanwhile, CBS and other media outlets reported that Trump had approved military plans targeting Irans Fordo nuclear facility  a heavily fortified uranium enrichment site buried deep in a mountain. However, no final order has been given, and the president later responded on Truth Social that the media has no idea what my thoughts are concerning Iran.\n\nDiplomatic channels remain open, with American negotiators reportedly maintaining communication with Iranian officials. Reuters revealed that U.S. special envoy Steve Witkoff and Irans Foreign Minister Abbas Araqchi have held several phone calls in recent days.\n\nDespite these efforts, Khatibzadeh maintained a cautious tone:\n\nDiplomacy is our first option, but while the bombs are falling, we cannot begin any negotiation.\n\nEuropean foreign ministers are scheduled to meet with Iranian officials in Switzerland on Friday in an attempt to cool tensions and prevent a wider regional conflict.\n\nAs the world watches closely, President Trumps looming decision could shape the future of U.S. involvement in the Middle East  with potentially historic consequences.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": ". By A Correspondent U.S. President Donald Trump will make a final decision within the next two weeks on whether … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/donald-trump-to-make-decision-on-israel-iran-war-in-two-weeks/\">Continue reading<span class=\"screen-reader-text\"> \"Donald Trump To Make Decision On Israel, Iran War In Two Weeks.\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "No Time For Sideshows, Nelson Chamisa Declares",
            "url": "https://www.zimeye.net/2025/06/20/no-time-for-sideshows-nelson-chamisa-declares/",
            "content": "By Tinashe Sambiri\n\nOpposition leader Advocate Nelson Chamisa has boldly declared that he remains unfazed by the growing wave of negative social media commentary, vowing to stay the course in his political journey despite intensified efforts to distract and discredit him.\n\nIn a statement released on Friday via his official platforms, the former Citizens Coalition for Change (CCC) leader underscored the importance of remaining principled and unshakable in the face of mounting criticism.\n\nLEADERSHIP TIPSA leader must be principled, unshakable, consistent and not buyable or purchasable, Chamisa wrote. Keep the promise. Refuse compromise. Never get neutralized. Never be diluted. Stick to your gut. Stick to your guns. Ignore their attacks, hate, sideshows, lies and propaganda. #Lead #Integrity\n\nChamisas remarks come at a time when Zanu PF hardliners and aligned social media voices appear to be intensifying efforts to discredit his leadership, often through orchestrated narratives and unfounded allegations. The sideshowsranging from smear campaigns to insinuations aimed at questioning his credibilityhave done little to shake the youthful opposition figure.\n\nClose allies to the opposition leader suggest that the attacks are part of a broader campaign to distract the public from the real issues facing the country, including economic decline, rising poverty levels, and growing public discontent.\n\nChamisa has been clearhe is focused on the bigger picture, said a source within his political circle. Zanu PF hardliners are trying to discredit him, but he is not taking the bait. He wont be derailed by propaganda and petty politics.\n\nObservers note that Chamisas continued message of integrity and consistency resonates with many Zimbabweans, particularly the youth, who see him as a symbol of hope and change.\n\nAs political tensions simmer, Chamisas unwavering stance sends a clear signal: he has no time for sideshows. His focus, as he has repeatedly stated, remains on building a just, democratic, and accountable Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Opposition leader Advocate Nelson Chamisa has boldly declared that he remains unfazed by the growing wave of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/no-time-for-sideshows-nelson-chamisa-declares/\">Continue reading<span class=\"screen-reader-text\"> \"No Time For Sideshows, Nelson Chamisa Declares\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "Fill Up Lungu’s Grave With Decorated Concrete",
            "url": "https://www.zimeye.net/2025/06/20/fill-up-lungus-grave-with-decorated-concrete/",
            "content": "Laura Miri Writes \n\nYou know how they say history is created while you are doing other stuff.\n\nI think this whole President Lungu burial matter is a historical fact that will be spoken about by posterity and should.\n\nWe probably should give our descendants something concrete to remember one of the craziest times in our history by.\n\nWhy not pour concrete into the grave where President Lungu was going to be buried? Put a glass over it, showing that its empty and put a plaque that says \n\nHere should have lain the 6th President of Zambia  Edgar Chagwa Lungu.\n\nPeople can visit it while visiting other presidential graves.\n\nWin win, the family keeps the body away like they want and we mark the death of the 6th President with a site.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Laura Miri Writes 👇🏽 You know how they say history is created while you are doing other stuff. I think … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/fill-up-lungus-grave-with-decorated-concrete/\">Continue reading<span class=\"screen-reader-text\"> \"Fill Up Lungu’s Grave With Decorated Concrete\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        },
        {
            "title": "Married Woman Paid Me For S*xual Pleasure, Claims “Conman”",
            "url": "https://www.zimeye.net/2025/06/20/married-woman-paid-me-for-sxual-pleasure-claims-conman/",
            "content": "By A Correspondent\n\nA Bulawayo courtroom was left stunned into silence before erupting in laughter last Thursday when a man accused of fraud sensationally claimed that one of his accusers was actually his sugar mama who paid him for sex as a thank-you for his bedroom performance.\n\nMelusi Sibanda, who is facing four counts of fraud, turned heads with his bold courtroom defense before magistrate Maxwell Ncube. Representing himself, Sibanda alleged that Phephela Tshuma, a married woman, was not a fraud victimbut a lover who voluntarily gave him money after their sexual encounters at various city lodges.\n\nShe treated me like her Ben 10, Melusi told the court. She would call me anytime for sex, and after every session, she would give me money as a token of appreciation.\n\nMelusi went further, claiming that Phephela had sent him nude pictures and even offered to submit them to the court as evidence. The gallery murmured in disbelief as he detailed their alleged affair.\n\nHowever, Phephela fiercely denied the allegations, dismissing Melusis claims as a desperate attempt to deflect from his fraudulent activities.\n\nHes lying to cover up his scams, she responded. I was in love with a businessman named Moyo from Esigodini. I sent him money to help me secure a shopnot Melusi.\n\nBehind the explosive personal claims lies a more serious case. Sibanda stands accused of defrauding not only Phephela but also her daughter, Mercy, and two other women.\n\nAccording to the prosecution, Melusi conned Mercy in March this year at the corner of Fife Street and Fifth Avenue in Bulawayo. He allegedly promised her a waitress job at a local hotel, claiming he needed US$35 for uniforms. After receiving the money, he disappeared and blocked her contact.\n\nThe trial continues, with the court expected to sift through the sensational claims and determine whether Sibanda is a charming conman or an innocent man entangled in a messy personal drama.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Bulawayo courtroom was left stunned into silence before erupting in laughter last Thursday when a man … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/20/married-woman-paid-me-for-sxual-pleasure-claims-conman/\">Continue reading<span class=\"screen-reader-text\"> \"Married Woman Paid Me For S*xual Pleasure, Claims “Conman”\"</span></a></p>",
            "time": "21:28",
            "date": "21 Jun 2025"
        }
    ]
}