{
    "news": [
        {
            "url": "https://www.zimeye.net/2024/12/11/chaos-in-harare-police-caught-on-camera/",
            "title": "Original Title",
            "description": "Original Description",
            "content": "Dear Editor\n\nThe bustling street was alive with activity, but the atmosphere suddenly shifted when council and police officers stormed in, their movements urgent and aggressive. They had been chasing someone through the crowded area, their eyes scanning every face, but their target slipped away into the sea of people. Frustrated and unwilling to leave empty-handed, they began grabbing random individuals, their actions fueled by anger and desperation.\n\nOnlookers watched in disbelief as innocent bystanders were accosted, their protests growing louder with each unjustified act of aggression. This is wrong! someone shouted, their voice echoing through the street. Others joined in, yelling at the officers to stop, to reconsider their actions.\n\nAmong the crowd was a man, just walking by, minding his own business. He wasnt part of the chase, nor had he raised his voice, but he caught their attention. Perhaps it was the way he moved, or perhaps he was simply an easy target in their line of sight. The officers turned their focus on him, their frustration redirected. The chaos intensified as people yelled in his defense, but the scene was already spiraling out of control.\n\nIt was a moment that laid bare the tension between authority and communitya confrontation sparked by misplaced actions and fueled by the crowds growing sense of injustice.\n\n",
            "image_url": "https://example.com/default-image.jpg"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/tshabangu-throws-heavy-stones-at-welsh/",
            "title": "Original Title",
            "description": "Original Description",
            "content": "By Political Reporter- The disputed Citizens Coalition for Change (CCC) Secretary General, Sengezo Tshabangu, has vowed that faction leader Welshman Ncube will not succeed in challenging his authority.\n\nTshabangus defiant response came after Welshman Ncube, along with deputy leader Lynette Karenyi Kore, Sesel Zwidzai, and Edwin Mushoriwa, filed an urgent High Court application seeking to block his decision to remove CCC Members of Parliament from key parliamentary committee positions.\n\nIn a bold statement posted on his X account, Tshabangu declared:I wish to make it clear that anyone from the opposition who doesnt tow the line of development will be removed from influential positions. Were a serious formation that is results-oriented. Those who think they can reverse it through courts are surely mistaken and wont win any case.\n\nTshabangu assumed control of the CCC following the contentious 2023 general elections and is accused of leveraging his position to orchestrate sweeping reshuffles of parliamentary portfolio committee leadership, allegedly cementing loyalty among his allies.\n\nThe High Court case filed by Ncube and his co-applicants lists Tshabangu, National Assembly Speaker Jacob Mudenda, and Senator Nonhlahla Mlotshwawhom Tshabangu controversially appointed as CCC Chief Whipas respondents.\n\nIn their application, the applicants challenge the constitutionality of Tshabangus actions, arguing that they exceed his mandate and contravene party rules and court orders.\n\nAmong the contested decisions are removing CCC representatives from the influential Standing Rules and Orders Committee (SROC) and the reshuffling of key parliamentary committees.\n\nNcubes affidavit highlights Tshabangus alleged defiance of a prior court order prohibiting him from recalling party members.\n\nHe contends that the reshuffles are tantamount to disguised recalls and do not reflect the partys collective will.\n\nHis actions are a frolic of his own, stated Ncube. He is a non-entity, and it is surprising that the Speaker continues to entertain him instead of respecting the partys collective stance.\n\nCritics within the CCC have also accused Tshabangu of undermining the partys unity, with his unilateral actions fueling a leadership crisis.\n\nWhile the matter awaits a court hearingno date has been setthe CCC remains mired in its most significant leadership dispute to date.\n\nThe party faces mounting challenges to maintain cohesion amid allegations of internal sabotage and power struggles.\n\nObservers argue that the outcome of the legal battle could redefine the CCCs internal governance and set a precedent for how authority is exercised within Zimbabwes opposition politics.\n\nI wish to make it clear that anyone from opposition who does'nt tow the line of development will be removed from influential positions,we're a serious formation that is results oriented,those who think will reverse it through courts are surely mistaken and won't win any case.pic.twitter.com/ND8jKSj3vi\n\n",
            "image_url": "https://example.com/default-image.jpg"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/mai-titi-issues-violence-threats-against-young-ritz/",
            "title": "Original Title",
            "description": "Original Description",
            "content": "By Showbiz Reporter | ZimEye | In a shocking tirade, socialite and controversial public figure Felistas Murata has unleashed a series of scathing remarks and threats directed at young actor Ritz, sparking widespread concern and heated debate online. The heated statement, laced with personal attacks and aggressive language, has left many questioning the limits of celebrity feuds in the public eye.\n\nMurata, known for her outspoken and often unfiltered demeanor, lashed out at Ritz, accusing her of incessantly discussing her personal life, including her marital affairs and past criminal record. In an unprovoked rant, Murata declared, Ive never stooped so low to ask for a pamper. How many times has she talked about me? She keeps talking about my criminal record and my marital affairs yet right now, I am sitting with my husband, Shumba.\n\nThe socialites threats escalated as she directly addressed Ritz, warning of a physical confrontation. One day, while you are getting interviewed, I will meet you at the doors, and then I will assault you, Murata threatened. She also went on to make disturbing comments, saying, I will feed you those same pampers You keep mentioning my name as if I am related to the people who impregnated you.\n\nThe feud appears to stem from Ritzs alleged comments about Muratas personal life, which the socialite claims have been ongoing for years. However, Ritz has not publicly responded to the accusations or the threats at this time.\n\nPublic Outrage and Concern\n\nMuratas statement has sparked outrage and concern among fans and the general public. Social media platforms have been flooded with calls for authorities to intervene, with many arguing that her comments constitute harassment and incitement to violence. Critics have also called for a more constructive approach to resolving celebrity disputes, especially in a public sphere where younger audiences are often exposed to such exchanges.\n\nSome have come to Ritzs defense, condemning Muratas comments as unnecessarily cruel and disproportionate. Others have pointed out the need for both parties to address their grievances privately to avoid escalating the feud further.\n\nAs the story unfolds, many are watching to see how Ritz will respond and whether Murata will face any legal or social consequences for her incendiary remarks seeing her long history over incidents such as this one.\n\nThe following is a 9 year historic account of Mai Titi (Felistas Murata) between 2015 and 2024 detailing how she has earned the title Rat Mother used tk interchange to Cat Mum.\n\nVery clear video footage shows the moments, Mai Titi threw punches at the so called love rival to the point of fil lighting equipment breaking as she charges towards her saying, You have nothing!, and\n\nStop fucking with me VIDEO-\n\nLIVE VIDEO OF CONFESSION-\n\nWARNING- STRONG LANGUAGE: Everybody wanted to f*ck Awilo and everybody was just acting up, Mai Titi's cast witness responds to her allegations that their producer, BJB Films sexually abused womenpic.twitter.com/5jF9roYyp6\n\nMost worrisome to security analysts has been the tenacity with which Felistas Murata has continued to abuse many citizens with little conscience, and a caller on a social mediadiscussion alleged she has even killed people- AUDIO: https://www.facebook.com/share/v/wyxYhpwoMF5VBXb5/\n\nA large documentary is underway in which Felistas Murata speaks to two undercover reporters from ZimEye posing as police officers assisting her delete police cases, and other notorieties.\n\nMeanwhile, Mai Titi known primarily for her social media presence, has exhibited a series of concerning behaviors from 2015 to 2021. These actions include criminal activities, allegations, and public altercations.\n\nDocumented Incidents:\n\nRisk to Public Safety:\n\nBased on the documented behavior, Mai Titi poses several risks to public safety:\n\n:\n\nMai Titis documented behaviour between 2015 and 2021 indicates a pattern of violence, manipulation, and public disturbance. Given the severity and frequency of her actions, she presents a significant risk to public safety. Continued monitoring and appropriate legal actions are necessary to mitigate these risks and ensure public safety. Her latest (June) instructions to her followers are all in all incitements, as she says:\n\nWhen I came out of prison, I was silent until I got provoked later on you then discover that it is better to focus on your husband who loves you now for some of you who come to my inbox sometimes I end up blocking you at least do a live video they say at least do a live so that people see you but how far would you go to try and prove everything? I will end up opening my underwear to show that I am around. Some of you say I was fired from TopSnash, But at least you can see that this did not happen. I dont have to comment trying to prove a point. This is there. This is not there. People talk because they want you to act you live a life to try and prove to people. Will you go? Let the dogs bark at that time I told you listen do not But its like cat family you are full of emotions your emotions too many and emotions for things that are unnecessary you know, now you are now talking saying that I lost my car but this is my gift from the company. It is a payment from the company so even if they want to take it away, it will not go anywhere. You dont know that even if the company Owner wakes up and says he wants to take the car from me that will not happen. You see what I mean so some of the things that you hear I just gossip leave all gossip, out of the car that is outside it is my car. It is my car. It is my car so the company owner says something that Car is my take-home. Do you understand? It is my take-home the day you discover that I remove the Brand that is when you can then say it is no longer my car but so far it is my employment job. It is my car that is why it was branded like that. So never think that The things that you hear are true. So there is nowhere the car will go, so I dont want to come here to prove to show if I am still married to my husband. That man still loves me there is nowhere where he can go he loves me with his, Tman loves me if there is anyone who loves me on Earth it is Gilbert he loves me. He can die and resurrect because of me and what I love about him. He doesnt listen to all this. I told him just block your ears. There is nowhere he will go he loves me with his intestines with everything that he has. I dont know what that man is under my witchcraft pot. If you find the day, he leaves me. You must know that maybe it is the war with Iran or something. I love him so much when he looks at me he knows that he is mine and I am his. This is the type of man that you can say till death do us part. I went to PRISON and He remains sticking to me he loves me so much. I am to the point of pain. If there is any time in my life when Ive been loved, it is with this man . Do not listen to gossip. Do not listen to people who dont have anything to do loves me with his intestines. Where could he go? That man is a soulmate that man is a buttock mate. That man is more than a soulmate so forget and smile when you hear that he has left me even on that day it was said that he has left me at the airport but you saw him with me later on that man is here with me. I am even giving him a child soon. One of these days called Gabrona right now. I am in the process. I dont want anything to do with gossip. We have good things to do with our lives. Weve got things to do. I cant be answering people on Facebook. Know your limits. Should I have a day off? The day you were fighting on Facebook I was showing off my cosmetic creams.\n\nYou cat family must just be destroying them over there; now listen to me, from now on what we do a sword for a sword a life for a life where you hurt something you must destroy them there me leave it here where I am am do you hear me? My children here? I am okay you must bomb there where they have bumped you bump the return the bumps simple like that an eye for an eye escort for a sword and gun for a gun. Just do that dont come to my phone. Just throw bombs throw explosive all over return, return the fire before I used to say that cat family do not say anything if a gun comes, an AK47, turn it back, simple; You do not need to go into the bed sheets; we are not weak; Cat family is not for the week its not for the emotional. Its not further. We are not fainthearted we are the bandits if you have a light heart get out of the cat family get out of the cat family because it is for bandits it is for warriors. It is not for people who are cowards. Do you understand what a cat is? We are no longer called cat, We are now lying we were promoted from being cat. We are now lion. Have you ever seen a lion? That is intimidated? Have you ever seen a lion? That cries everywhere? Do it over there? Dont come to my phone asking me Amai Titi are you okay? And flat forth, no, no no for what? Just bomb over there finish them over there dont come to my phone. Why do you look? What do you look for at my phone? Fix things over there finish them over there. We are the strongest. We are the most strongest ones. why should we be weak? Why should we be scared? Why should we worry? Why should we be scared with things that are nonsense? We abundance guys, we are banded. Why should we lie down? We abundance cat family why should we be stressed saying Mai Titi!? Please, aaah to do what? I dont want to be forced to do a live video. I will only do it when and where I want. No one tells me to do anything to prove if I am okay or not why should I be ill? My husband knows that Ive got HIV. Some of you were saying that I am in the blankets sleeping in bed. What did you achieve when I am busy making money? Just bomb there. Not to come here my way. Why are you so quick to think that it is the truth? Why dont you wait? Stand your ground. No, dont do that. You end up making them take advantage of you. The people now know that you are weak they now know that you are those who want to prove a point. Why do we allow people to use us? Let them talk what they want to talk whatever they want to say or speak. Let them speak. Yes if I have been chased. Why should I prove something? I only press live when it is time for work like this. Do you want me to press so that I prove that I am alive? They are saying that I need to post my husband For people to see that he is alive. Have you ever seen my husband? He is a private person he doesnt like Drama things. They are certain people who will be claiming this and that he doesnt have to prove a point. The day when I will want to prove a point with him is the day I will be dressed in that white dress. That is the day, otherwise you will only see him in the stories on Instagram. I dont want anyone to force me to press live. I only want to live when I am at work. I dont want to just press live. I dont press live in order to make money. Some of you are saying I should live. I am not a person who is for gossip. I am somebody who is at work. My page only works for work issues. When you find me answering people, I will only have gotten upset as someone who is made of flesh but later on I regret that why did I respond? And then later my husband you hear him asking? Why did you do that? But I dont want to respond I dont even want to respond. I just want to live my life the way I want it so dont come to me and tell me to press live at least post something when you find me in the morning. I havent posted anything I dont want to post anything. That is what things are Simple and clear. We have got other things to do, guys, family, a lot of things. I dont need to be up every time out there on social media. On some days, you want to tell yourself I want to take a day off. It is like on that day I wasnt even there the whole day that day when they were saying that I have been assaulted by CIOs, I was not even in the country, I had travelled to order some goods, but people were saying that Ive been assaulted. They were all lies. There was not even a video why do you believe things when you cannot see anything and you just conclude and say it is true?We are now afraid to come on Facebook every day do you have to come every morning to show your body; sides, for people to inspect your body? Am I swollen? Am I stressed? For people to treat me like children dont treat me like that. Now I am now going to be blocking you because you focus on things that really do not matter. Learn to stand for who you love; if you love me you will stand for me whether I am there or not you will stand just like that whether I have not come out, you need to come out yourselves and ask them yes, so what had you said? That is what you need to do with people. In a war people do not ask where the commander is.\n\nDo you know what happens in a war? People call others commanders but soldiers keep advancing. They do not ask themselves where the commander is.\n\nWhen I came out of prison, I was silent until I got provoked later on you then discover that it is better to focus on your husband who loves you now for some of you who come to my inbox sometimes I end up blocking you at least do a live video they say at least do a live so that people see you but how far would you go to try and prove everything? I will end up opening my underwear to show that I am around. Some of you say I was fired from TopSnash, But at least you can see that this did not happen. I dont have to comment trying to prove a point. This is there. This is not there. People talk because they want you to act you live a life to try and prove to people. Will you go? Let the dogs bark at that time I told you listen do not But its like cat family you are full of emotions your emotions too many and emotions for things that are unnecessary you know, now you are now talking saying that I lost my car but this is my gift from the company. It is a payment from the company so even if they want to take it away, it will not go anywhere. You dont know that even if the company Owner wakes up and says he wants to take the car from me that will not happen. You see what I mean so some of the things that you hear I just gossip leave all gossip, out of the car that is outside it is my car. It is my car. It is my car so the company owner says something that Car is my take-home. Do you understand? It is my take-home the day you discover that I remove the Brand that is when you can then say it is no longer my car but so far it is my employment job. It is my car that is why it was branded like that. So never think that The things that you hear are true. So there is nowhere the car will go, so I dont want to come here to prove to show if I am still married to my husband. That man still loves me there is nowhere where he can go he loves me with his, Tman loves me if there is anyone who loves me on Earth it is Gilbert he loves me. He can die and resurrect because of me and what I love about him. He doesnt listen to all this. I told him just block your ears. There is nowhere he will go he loves me with his intestines with everything that he has. I dont know what that man is under my witchcraft pot. If you find the day, he leaves me. You must know that maybe it is the war with Iran or something. I love him so much when he looks at me he knows that he is mine and I am his. This is the type of man that you can say till death do us part. I went to PRISON and He remains sticking to me he loves me so much. I am to the point of pain. If there is any time in my life when Ive been loved, it is with this man . Do not listen to gossip. Do not listen to people who dont have anything to do loves me with his intestines. Where could he go? That man is a soulmate that man is a buttock mate. That man is more than a soulmate so forget and smile when you hear that he has left me even on that day it was said that he has left me at the airport but you saw him with me later on that man is here with me. I am even giving him a child soon. One of these days called Gabrona right now. I am in the process. I dont want anything to do with gossip. We have good things to do with our lives. Weve got things to do. I cant be answering people on Facebook. Know your limits. Should I have a day off? The day you were fighting on Facebook I was showing off my cosmetic creams.\n\nYou cat family must just be destroying them over there; now listen to me, from now on what we do a sword for a sword a life for a life where you hurt something you must destroy them there me leave me here where I am am do you hear me? My children here? I am okay you must bomb there where they have bumped you bump the return the bumps simple like that an eye for an eye escort for a sword and gun for a gun. Just do that dont come to my phone. Just throw bombs throw explosive all over return, return the fire before I used to say that cat family do not say anything if a gun comes, an AK47, turn it back, simple; You do not need to go into the bed sheets; we are not weak; Cat family is not for the week its not for the emotional. Its not further. We are not fainthearted we are the bandits if you have a light heart get out of the cat family get out of the cat family because it is for bandits it is for warriors. It is not for people who are cowards. Do you understand what a cat is? We are no longer called cat, We are now lying we were promoted from being cat. We are now lion. Have you ever seen a lion? That is intimidated? Have you ever seen a lion? That cries everywhere? Do it over there? Dont come to my phone asking me Amai Titi are you okay? And flat forth, no, no no for what? Just bomb over there finish them over there dont come to my phone. Why do you look? What do you look for at my phone? Fix things over there finish them over there. We are the strongest. We are the most strongest ones. why should we be weak? Why should we be scared? Why should we worry? Why should we be scared with things that are nonsense? We abundance guys, we are banded. Why should we lie down? We abundance cat family why should we be stressed saying Mai Titi!? Please, aaah to do what? I dont want to be forced to do a live video. I will only do it when and where I want. No one tells me to do anything to prove if I am okay or not why should I be ill? My husband knows that Ive got HIV. Some of you were saying that I am in the blankets sleeping in bed. What did you achieve when I am busy making money? Just bomb there. Not to come here my way. Why are you so quick to think that it is the truth? Why dont you wait? Stand your ground. No, dont do that. You end up making them take advantage of you. The people now know that you are weak they now know that you are those who want to prove a point. Why do we allow people to use us? Let them talk what they want to talk whatever they want to say or speak. Let them speak. Yes if I have been chased. Why should I prove something? I only press live when it is time for work like this. Do you want me to press so that I prove that I am alive? They are saying that I need to post my husband For people to see that he is alive. Have you ever seen my husband? He is a private person he doesnt like Drama things. They are certain people who will be claiming this and that he doesnt have to prove a point. The day when I will want to prove a point with him is the day I will be dressed in that white dress. That is the day, otherwise you will only see him in the stories on Instagram. I dont want anyone to force me to press live. I only want to live when I am at work. I dont want to just press live. I dont press live in order to make money. Some of you are saying I should live. I am not a person who is for gossip. I am somebody who is at work. My page only works for work issues. When you find me answering people, I will only have gotten upset as someone who is made of flesh but later on I regret that why did I respond? And then later my husband you hear him asking? Why did you do that? But I dont want to respond I dont even want to respond. I just want to live my life the way I want it so dont come to me and tell me to press live at least post something when you find me in the morning. I havent posted anything I dont want to post anything. That is what things are Simple and clear. We have got other things to do, guys, family, a lot of things. I dont need to be up every time out there on social media. On some days, you want to tell yourself I want to take a day off. It is like on that day I wasnt even there the whole day that day when they were saying that I have been assaulted by CIOs, I was not even in the country, I had travelled to order some goods, but people were saying that Ive been assaulted. They were all lies. There was not even a video why do you believe things when you cannot see anything and you just conclude and say it is true?We are now afraid to come on Facebook every day do you have to come every morning to show your body; sides, for people to inspect your body? Am I swollen? Am I stressed? For people to treat me like children dont treat me like that. Now I am now going to be blocking you because you focus on things that really do not matter. Learn to stand for who you love; if you love me you will stand for me whether I am there or not you will stand just like that whether I have not come out, you need to come out yourselves and ask them yes, so what had you said? That is what you need to do with people. In a war people do not ask where the commander is.\n\nDo you know what happens in a war? People call others commanders but soldiers keep advancing. They do not ask themselves where the commander is.\n\n",
            "image_url": "https://example.com/default-image.jpg"
        }
    ]
}