{
    "news": [
        {
            "title": "Knives out for Deputy Minister Sibanda as ZANU PF factional wars rock Matabeleland North’",
            "url": "https://www.zimeye.net/2025/08/26/knives-out-for-deputy-minister-sibanda-as-zanu-pf-factional-wars-rock-matabeleland-north/",
            "content": "By A Correspondent| Factional fights have erupted in Matabeleland North with knives out for Deputy Minister of Higher and Tertiary Education, Innovation, Science and Technology Development, Simelisizwe Sibanda, who is also ZANU PF Member of Parliament for Bubi Constituency.\n\nSources within the party say senior figures are plotting to push Sibanda out of political office, driven by selfish ambitions disguised as disciplinary action.\n\nThe clashes reportedly began soon after ZANU PF primary elections in which Sibanda defeated his rivals. From that time, insiders allege, some senior party members have sought to frustrate him.\n\nThey allegedly skipped meetings he hosted, delayed programmes and attempted to undermine his initiatives, hoping to portray him as a failure.\n\nMatters escalated on Monday this week when a prohibition letter barring Sibanda from performing party duties was leaked, revealing the depth of the rift.\n\nThe prohibition order, dated 24 August 2025, barred him from exercising his duties as a District Coordinating Committee member, accessing ZANU PF offices or attending any party meetings.\n\nThis order prohibits you from exercising your duty as the DCC member, entering or accessing to ZANU PF offices, attending any ZANU PF meeting or gathering, reads the letter.\n\nThe letter accused him of creating parallel structures, refusing to cooperate with the DCC and making utterances that embarrassed party leadership on social media.\n\nIt said Sibandas conduct risked bringing the name of the party into disrepute.\n\nThe order declared that he was suspended until his case was fully determined by the relevant disciplinary structures.\n\nClose sources, however, allege that the move is being spearheaded by Provincial Secretary for Administration Douglas Khoza, Central Committee member Nyabayezwe Maphosa and Bubi DCC chairman Abednico Maphosa.\n\nThe Provincial Executive Committee had initially resolved to send a fact-finding team to gather views on the ground, but Khoza allegedly ignored the decision and pushed for an immediate disciplinary hearing.\n\nHe attempted to have the order signed by Provincial Disciplinary Committee chairman Silas Maligo, who refused. Undeterred, Khoza forwarded the order directly to the Bubi DCC on his own, a decision that has drawn accusations of abuse of office, the source said.\n\nThe dispute is also tied to wider power struggles within the province.\n\nAccording to sources, Khoza has allegedly been promised the position of Minister of State for Provincial Affairs and Devolution for Matabeleland North, contingent upon the removal of Sibanda, and should that happen, he is reportedly hoping to contest in the by-election.\n\nNotably, Khoza has previously contested and lost four consecutive primary elections in Bubi, and his ambitions now rest on the possibility of a by-election.\n\nThis move is also expected to displace the current Minister of State for Provincial Affairs and Devolution, Honorable Richard Moyo, who, aware of these developments, chose not to attend the PEC meeting concerning Sibandas situation and has opted not to involve himself in the ongoing events, the source said.\n\nSome District Coordinating Committee (DCC) members interviewed by this publication said the move is being imposed on them by some individuals with hidden agendas.\n\nSome individuals declined to offer a statement, expressing concerns about potential repercussions.\n\nThis is not coming from us as structures, it is being pushed down our throats by a few people who want to settle scores. There are people at the top who are trying to create divisions so that they can benefit politically, said one of the DCC members.\n\nMatabeleland North traditional leader, Chief Mtshane Khumalo said: I cant really comment on the matter as it is still under investigation. I do not want it to seem like Im taking sides on their problems with the party.\n\nEfforts to get a comment from Sibanda were fruitless as he declined to comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Factional fights have erupted in Matabeleland North with knives out for Deputy Minister of Higher and Tertiary … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/knives-out-for-deputy-minister-sibanda-as-zanu-pf-factional-wars-rock-matabeleland-north/\">Continue reading<span class=\"screen-reader-text\"> \"Knives out for Deputy Minister Sibanda as ZANU PF factional wars rock Matabeleland North’\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "Mai TT Misses Prison",
            "url": "https://www.zimeye.net/2025/08/26/mai-tt-misses-prison/",
            "content": "By Showbiz Reporter  Socialite and comedienne Felistas Murata, better known by her stage nameMai TT, has sparked fresh debate after claiming that she could have become a billionaire had she remained in prison longer.\n\nSpeaking during a visit to the Zimbabwe Prisons and Correctional Services (ZPCS) exhibition stand at the Zimbabwe Agricultural Show in Harare yesterday, the outspoken entertainer reflected on her six-month incarceration in 2023.\n\nMy incarceration opened my eyes for business avenues, and if I had served more years, I could have come out as a billionaire, Mai TT said.I saw the need to support inmates since I was with them for six months. They make use of waste that includes dried sadza, paper and plastics.\n\nHer appearance at the show drew crowds, particularly children, who lined up to greet her and pose for photographs.\n\nMai TTs comments come against the backdrop of her high-profile legal troubles that dominated headlines last year. In June 2023, she was convicted on theft of trust property charges after she allegedly borrowed US$10,000 from a Harare businesswoman and surrendered a hired car, a hired laptop, and hired speakers as collateral.\n\nThe scandal unraveled when the owners of the hired property demanded their goods back, sparking a messy fallout that led to her arrest. She was sentenced to nine months in prison, later reduced following a partial suspension and credit for time served in remand.\n\nThe case divided public opinion. While some saw her as a victim of financial desperation in Zimbabwes harsh economic climate, others accused her of arrogance and dishonesty.\n\nMai TTs brushes with the law are only part of her turbulent public life. The comedienne, who rose to fame through viral skits on social media, has long courted controversy:\n\nDespite the controversies, she has maintained a strong fan base, leveraging her outspoken persona to remain relevant in Zimbabwes entertainment scene.\n\nNow, Mai TT insists her stint in prison gave her a new perspective on business and life. She praised the entrepreneurial initiatives of inmates, who recycle waste into usable products, saying they showed her the potential of turning hardship into opportunity.\n\nHer remarks, though light-hearted, once again left audiences divided. For some, her humor and candor humanized the prison experience, while others saw her statement as trivializing incarceration.\n\nAs the Zimbabwe Agricultural Show continues this week, Mai TTs appearance ensured the ZPCS stand received unusual attention. Whether viewed as a troubled figure trying to rebuild her image or a socialite who thrives on controversy, Mai TT remains firmly in the spotlight  a testament to her enduring ability to keep Zimbabwe talking.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Socialite and comedienne Felistas Murata, better known by her stage name Mai TT, has sparked fresh debate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/mai-tt-misses-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Mai TT Misses Prison\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "Mnangagwa Ally In Hot Soup Over Brutality Against School Children",
            "url": "https://www.zimeye.net/2025/08/26/mnangagwa-ally-in-hot-soup-over-brutality-against-school-children/",
            "content": "11 school children, who were savagely assaulted by some overzealous security guards for allegedly stealing sugarcane from Green Fuel fields, are suing the ethanol producing company and its sentries for more than US$100 000 in damages.\n\nThe parents and guardians of 11 school children, who are aged between 13 years and 17 years, enlisted the services of human rights lawyers Tatenda Sigauke and Peggy Tavagadza of Zimbabwe Lawyers for Human Rights, who on Friday 22 August 2025 filed summons at Chipinge Magistrates Court against three security guards and Green Fuel, an ethanol producing company, which runs operations in Chisumbanje in Manicaland province, demanding payment of damages amounting to US$110 000 arising from the unlawful assault and ill-treatment perpetrated against them.\n\nThe school children were assaulted by Green Fuel security guards namely Makina Ngwenya, Benjamin Dube and Munorwei Gomondera, who were acting in the course and scope of their employment as security personnel with Green Fuel, sometime early this year, who accused them of stealing sugarcane from the ethanol producing companys fields, while on their way from Katanga Secondary School in Chipinge in Manicaland province.\n\nAccording to Sigauke and Tavagadza, the security guards ordered the school children to lie down on their bellies and used a switch to flog them several times on their backsides and all over their bodies.Gomondera reportedly recorded videos of the assault and the videos later went viral on various social media platforms.\n\nThe lawyers charged that the school children sustained injuries from the assault and experienced swollen backsides and were not able to walk properly for some time.\n\nAs a result of the savage assault, Sigauke and Tavagadza said the school children experienced shock, pain and suffering, both physical and psychological, emotional trauma and distress, contumelia and suffered public humiliation while their dignity and bodily integrity was violated.\n\nAccording to the lawyers, the assault was grievous and psychologically traumatising due to the students young ages and the viral effect of the videos, which circulated on online platforms.Sigauke and Tavagadza want the court to order Ngwenya, Dube, Gomondera and Green Fuel to pay a total of US$110 000, which entails payment of US$10 000 to each student, for damages for pain and suffering, shock, trauma, contumelia and violation of dignity.\n\nIn addition, the human rights lawyers want the court to order Green Fuel to issue a public apology to the students, their parents, their guardians and the community of Chisumbanje and to denounce the illegal conduct of its security guards as unacceptable, unjustified and contrary to the respect owed to members of the community and to commit to taking all necessary measures to ensure that such despicable acts do not recur.\n\nThe apology, the lawyers said, should be published in a newspaper circulating within Manicaland province and should also be broadcast on Vemuganga Community Radio once every day for five days and on Green Fuels social media platforms and company notice boards for a continuous period of 14 days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "11 school children, who were savagely assaulted by some overzealous security guards for allegedly stealing sugarcane from Green Fuel fields, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/mnangagwa-ally-in-hot-soup-over-brutality-against-school-children/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ally In Hot Soup Over Brutality Against School Children\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "ZiG Fanally Collapses, Joins Long List of Failed Currencies Since 2000",
            "url": "https://www.zimeye.net/2025/08/26/zig-fanally-collapses-joins-long-list-of-failed-currencies-since-2000/",
            "content": "By Business Reporter  The Reserve Bank of Zimbabwe (RBZ) has begun producing redesigned ZiG banknotes, which it says will soon be rolled out into circulation.\n\nWhile authorities insist this is merely a redesign and not the introduction of a new currency, the move has been widely interpreted as confirmation that the ZiG  launched with fanfare just over a year ago  has already collapsed.\n\nThe development has revived bitter memories of Zimbabwes long history of failed currency experiments stretching back to the early 2000s.\n\nWhen the economy began to unravel in 2000 following the chaotic land reform programme, capital flight, and sanctions, Zimbabwes currency woes became the most visible sign of economic collapse. By 2003, thenRBZ Governor Gideon Gono rolled out a series of tricks to prop up the local unit  from introducing bearer cheques and agro-cheques to redenominating the dollar multiple times. None of these efforts worked, as hyperinflation destroyed savings, pensions, and wages, eventually forcing the government to abandon the Zimbabwe dollar altogether in 2009.\n\nFor a decade, Zimbabweans used a basket of foreign currencies, primarily the US dollar and South African rand, which restored a measure of stability. But in 2016, facing cash shortages, the government introduced bond notes, initially pegged 1:1 with the US dollar. The public, however, quickly rejected them as inflation returned. In 2019, the government attempted to de-dollarise again by reintroducing the Zimbabwe dollar, but that too rapidly lost value.\n\nBy April 2024, the ZiG (Zimbabwe Gold) was launched, marketed as a gold-anchored currency backed by the countrys gold and foreign exchange reserves. Officials claimed it would restore confidence, but like its predecessors, the ZiG has failed to inspire trust in a population scarred by two decades of monetary collapse.\n\nNow, barely a year after its launch, the RBZ has confirmed it is redesigning ZiG notes, citing poor durability and counterfeiting risks.\n\nRBZ Governor Dr. John Mushayavanhu maintained that this was standard international practice rather than an admission of failure:\n\nThe Reserve Bank is not going to issue a new currency. We are merely redesigning the current banknotes to enhance quality in line with international standards, he said.\n\nBut critics argue the move signals the collapse of the experiment. The ZiGs purchasing power has steadily eroded, and its use in mobile money platforms remains problematic, with many retailers preferring the US dollar and ignoring official exchange rates.\n\nAt present, only ZiG10 and ZiG20 notes are circulating, while the rest of the denominations announced in April 2024 never fully entered the market.\n\nThe RBZ insists it is building up foreign currency reserves to support a transition towards a mono-currency regime within five years. Yet economists note that similar promises were made in 2003, 2006, 2008, 2016, and 2019  and each ended in collapse.\n\nEconomist and RBZ Monetary Policy Committee member, Mr. Persistence Gwanyanya, insisted the redesign showed seriousness on the part of authorities:\n\nAll this can be construed as measures to restore confidence in the countrys currency. It reflects seriousness towards the currencys stability and permanency.\n\nHowever, many Zimbabweans remain unconvinced. With inflation still eroding wages, and the US dollar remaining the preferred store of value, the ZiG is now seen as the latest chapter in a two-decade cycle of monetary failure.\n\nThe RBZ has also moved to compel mobile money platforms to allow seamless use of ZiG alongside foreign currency, in a bid to boost acceptance. Many Zimbabweans, however, complain about high transaction fees and a lack of confidence in the official exchange rate, further undermining trust in the local unit.\n\nStakeholders have urged the central bank to revise bank charges and make digital payments more affordable, warning that current costs discourage people from depositing money.\n\nFrom bearer cheques to bond notes, from the Zimbabwe dollar to the ZiG, the story of Zimbabwes economy since 2000 has been one of currency collapse and broken promises. The redesign of the ZiG is the latest reminder that until government addresses the structural causes of economic decline  corruption, low production, and lack of investor confidence  no amount of rebranding can restore lasting stability to Zimbabwes money.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – The Reserve Bank of Zimbabwe (RBZ) has begun producing redesigned ZiG banknotes, which it says will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/zig-fanally-collapses-joins-long-list-of-failed-currencies-since-2000/\">Continue reading<span class=\"screen-reader-text\"> \"ZiG Fanally Collapses, Joins Long List of Failed Currencies Since 2000\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "Woman Dumps Hubby To Perform ‘Wifely Duties’ On Late Sister’s Husband",
            "url": "https://www.zimeye.net/2025/08/26/woman-dumps-hubby-to-perform-wifely-duties-on-late-sisters-husband/",
            "content": "A Ruwa man has obtained a peace order against his late wifes sister, accusing her of forcing herself into his home and disrupting his personal life.\n\nAppearing before Harare Civil Court magistrate Johanna Mukwesha,Langton Nyamurovasaid the period that was supposed to help him mourn and rebuild after his wifes death had turned into a domestic battle because of his sister-in-law,Felistas Mutadza.\n\nNyamurova told the court that Mutadza initially came to assist with childcare following his wifes passing, but the arrangement soon turned into what he described as an unwanted takeover.\n\nShe was chosen to watch over my children after my wife died, he said.\n\nBut her mother influenced her to leave her own husband and children and move into my house, claiming she was fulfilling wifely duties. I cannot live with another mans wife in my home.\n\nThe widower alleged that Mutadza had become controlling and interfered with his personal relationships, leaving him emotionally distressed.\n\nHe also expressed fears that she might one day falsely accuse him of making advances towards her, which he said could damage his reputation.\n\nThis has brought me shame and discomfort. People may think I married my wifes sister, yet that is not true, he told the court.\n\nMutadza, however, denied forcing herself into Nyamurovas life, arguing that her actions were motivated by cultural expectations to safeguard her late sisters children.\n\nI am not forcing myself into his life. I was only helping. But if he wants me to leave, I will do so peacefully, she said.\n\nAfter hearing both sides, the magistrate ruled in Nyamurovas favour, granting the peace order and directing Mutadza to refrain from emotionally abusing him and to stay away from his house.\n\nSOURCE: State Media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Ruwa man has obtained a peace order against his late wife’s sister, accusing her of forcing herself into his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/woman-dumps-hubby-to-perform-wifely-duties-on-late-sisters-husband/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Dumps Hubby To Perform ‘Wifely Duties’ On Late Sister’s Husband\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "RBZ To Unveil Redesigned ZiG Notes",
            "url": "https://www.zimeye.net/2025/08/26/rbz-to-unveil-redesigned-zig-notes/",
            "content": "By A Correspondent\n\nThe Reserve Bank of Zimbabwe (RBZ) has begun producing redesigned ZiG banknotes, claiming the move is part of a broader de-dollarisation plan aimed at transitioning to a mono-currency system within the next five years. However, critics argue the exercise does little to address the deeper economic mismanagement that continues to plague the country.\n\nThe new notes are said to feature enhanced security features and improved durability, but many Zimbabweans remain sceptical. The current ZiG notes have long been criticised for quickly fraying, fading, and deteriorating, and the public doubts whether the redesign will resolve these problems.\n\nRBZ Governor Dr John Mushayavanhu defended the initiative, stating, The Reserve Bank is working on the modernisation of the ZiG banknote series as advised in the recent mid-term Monetary Policy Statement. The new ZiG banknotes will be re-designed including improved quality and durability for the convenience of the transacting public.\n\nDespite these assurances, users remain frustrated, pointing out that repeated redesigns do not solve the underlying issue: a local currency that continues to struggle for stability and public trust. The production process of the improved banknotes has progressed well and is at an advanced stage, Dr Mushayavanhu added, but critics note that currency redesigns are cosmetic and do not create real economic security.\n\nEconomist and RBZ Monetary Policy Committee member Mr Persistence Gwanyanya argued that the redesign reflects a commitment to confidence-building. All this can be construed as measures to restore confidence in the countrys currency and answering a call to introduce better quality notes, he said. It also reflects on the policy makers attitude towards the currency.\n\nYet, with ZiG still accounting for just over 35 percent of all transactions and ordinary Zimbabweans facing persistent inflationary pressures and a fragile economy, many see the note redesign as a superficial solution. One user commented, You can print all the shiny notes you want, but if people dont trust the currency, it wont change anything.\n\nThe RBZ maintains that the redesigned notes should not be seen as a new currency. Dr Mushayavanhu insisted, I must reiterate that the Reserve Bank is not going to issue a new currency, and in this regard, the public should not be apprehensive. Instead, the Reserve Bank is merely redesigning the current banknotes to enhance quality in line with international standards.\n\nCritics remain unconvinced, warning that without genuine economic reforms and stronger fiscal discipline, the redesigned ZiG notes may simply become another short-lived experiment in a long series of attempts to stabilize Zimbabwes troubled currency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Reserve Bank of Zimbabwe (RBZ) has begun producing redesigned ZiG banknotes, claiming the move is part … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/rbz-to-unveil-redesigned-zig-notes/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ To Unveil Redesigned ZiG Notes\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "Mnangagwa Calls For An Urgent Politburo Meeting",
            "url": "https://www.zimeye.net/2025/08/26/urgent-politburo-meeting/",
            "content": "By A Correspondent Fireworks are expected at Zanu PFs urgent politburo meeting this Wednesday, as the ruling party grapples with intensifying factional tensions following President Emmerson Mnangagwas controversial event in Mashonaland Central.\n\nThe official notice, signed by party spokesperson Christopher Mutsvangwa, directs members to convene at the Zanu PF headquarters on27 August 2025. While framed as routine, insiders say the timing is no coincidence  it comes just days after an uproar triggered by a promotional flier for Mnangagwas title deeds distribution programme in Mazowe West.\n\nThe poster placed businessman Kudakwashe Tagwireis portrait in a commanding position  larger than the Presidents  alongside a pledge that he would give out two Ford Ranger trucks. Mnangagwas image, by contrast, was diminished, fuelling speculation that the event doubled as a joint political showcase for the President and his billionaire ally.\n\nFor many in Zanu PF, the optics were telling. Tagwireis prominence was read as a calculated snub to Vice President Constantino Chiwenga, whose faction has long viewed him as Mnangagwas natural successor since the 2017 coup that ushered him into power.\n\nThe partys Zanu PF Patriots account condemned the flier as highly inappropriate and misleading, insisting:This is a Presidential event, and it is unacceptable to position Cde Tagwirei above the President.\n\nBut analysts say the issue goes beyond a publicity blunder. They point to Mnangagwas deliberate strategy of undermining Chiwengas military-aligned camp by elevating businessmen, technocrats, and loyalists. Tagwirei, a fuel magnate and key party financier, has become the most visible symbol of this shift.\n\nIn Zanu PF, symbols are power, one analyst noted. Tagwireis oversized image wasnt a mistake. It was a signal  Mnangagwa is leaning more on financiers than the generals who once backed Chiwenga.\n\nWednesdays politburo meeting is therefore expected to be heated, with succession battles once again in the spotlight. Though the agenda has not been disclosed, insiders predict that protocol breaches, image management, and the growing political influence of business elites will dominate deliberations.\n\nMeanwhile, the Mazowe programme itself  where Mnangagwa on Monday handed over1,000 title deedsand launched smallholder irrigation kits, largely benefiting war veterans  has been overshadowed by the factional storm. Instead of cementing Mnangagwas empowerment legacy, the event has amplified perceptions of a looming showdown between the President, his ambitious allies, and an increasingly restless Chiwenga camp.\n\nWith the politburo convening under intense scrutiny, the meeting could either patch over cracks  or dramatically expose just how fragile Mnangagwas grip on Zanu PF has become.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Fireworks are expected at Zanu PF’s urgent politburo meeting this Wednesday, as the ruling party grapples with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/urgent-politburo-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Calls For An Urgent Politburo Meeting\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "Mobile Money Platforms Reject ZiG",
            "url": "https://www.zimeye.net/2025/08/26/mobile-money-platforms-reject-zig/",
            "content": "By Business Reporter-The Reserve Bank of Zimbabwe (RBZ) is forcing mobile money platforms to accept local and foreign currencies under the multicurrency system and eliminate pricing discrepancies.\n\nThe move is meant to allow users to transact freely in either local or foreign currency with ease and efficiency.\n\nThis follows concerns over challenges in using the Zimbabwe Gold (ZiG) for mobile money payments, especially for essential services, compared to the US dollar. In many cases, local currency prices are significantly higher and often ignore the official exchange rate.\n\nWith most Zimbabweans relying on mobile money for daily transactions, including goods, services, bills, and school fees, the RBZ said it was critical to improve the usability of ZiG to build a more efficient and inclusive financial system.\n\nThe central bank outlined the measures in its 2025 Mid-Term Monetary Policy Statement Stakeholder Feedback Report. It said:\n\nThe Reserve Bank will engage mobile money operators to ensure that there is equal trading in both domestic and foreign currencies in line with the multicurrency system.\n\nThe central bank said addressing these issues could help increase the acceptance of the local currency across the economy, promote financial inclusivity, and support overall economic stability.\n\nIt also noted that stakeholders had raised concerns over high transaction fees, which are driving up the cost of using the formal banking system.\n\nThese charges, they said, place an additional financial burden on users and make it more expensive to manage accounts and conduct transactions.\n\nStakeholders suggested that the RBZ consider revising fee structures to make them more competitive and user-friendly.\n\nIn response, the RBZ stressed its commitment to tackling the matter through moral suasion, by engaging banks and other financial institutions via the Bankers Association of Zimbabwe (BAZ) to adopt more favourable pricing policies.\n\nHigh bank charges on both local and foreign currency accounts remain a source of frustration for depositors, with some indicating that the costs are discouraging them from banking their foreign currency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-The Reserve Bank of Zimbabwe (RBZ) is forcing mobile money platforms to accept  local and foreign currencies under … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/mobile-money-platforms-reject-zig/\">Continue reading<span class=\"screen-reader-text\"> \"Mobile Money Platforms Reject ZiG\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "Although Zim Is In Turmoil, Mnangagwa Insists Country Is A Secure Investment Hub",
            "url": "https://www.zimeye.net/2025/08/26/although-zim-is-in-turmoil-mnangagwa-insists-country-is-a-secure-investment-hub/",
            "content": "By A Correspondent\n\nDespite the daily hardships faced by ordinary Zimbabweans, President Mnangagwa continues to present a polished image of the country as a haven for investors.\n\nSpeaking after attending two international eventsthe SADC Summit in Madagascar and the TICAD9 conference in JapanMnangagwa insisted that Zimbabwe remains a secure destination for capital.\n\nThe conference ended last week.\n\nThose who have resources always want to make sure their money goes where it is safe, and Zimbabwe is one of those destinations where investments are secure, he told the media, seemingly undeterred by the economic struggles and political instability gripping the nation.\n\nThe President highlighted cordial relations with Madagascar and Japan, noting the warm receptions he received abroad. Well, first, we were warmly received in both places. They were very happy to welcome us. We have excellent relations with both countries, he said, contrasting international courtesy with the grim realities at home.\n\nMnangagwa also reflected on handing over the SADC chairpersonship to Madagascars President Andry Rajoelina, stressing that Zimbabwe commands respect at international forums. On the sidelines, he was invited to inaugurate a new highway near Antananarivoa ceremonial duty he described as a mark of international recognition.\n\nThis is not the first time we have been there, and I am always surprised by the level of attention we are given, Mnangagwa said, leaving critics to question why such attention does not translate into tangible improvements for Zimbabweans struggling with inflation, fuel shortages, and crumbling infrastructure.\n\nWhile the SADC summit focused on industrialisation, agricultural transformation, and energy transition, Mnangagwa used his platform to decry Western sanctions, blaming them for the countrys economic woes. Yet, critics argue that mismanagement and corruption within his administration are far more immediate obstacles to investment and development.\n\nIn Japan, Mnangagwa joined African and Japanese leaders at TICAD9, a forum for trade, infrastructure, and technology collaboration. The President said the conference aligned with Zimbabwes Vision 2030 goal of creating a modern and highly prosperous country, but for citizens, daily realities of unemployment, rising food prices, and failing public services tell a starkly different story.\n\nForeign Affairs Minister Professor Amon Murwira praised the two events as bolstering Zimbabwes economic diplomacy.\n\nHowever, the contrast between Mnangagwas international image and the hardships faced by ordinary Zimbabweans raises serious questions about the credibility of his claims that the country is a safe investment destination.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Despite the daily hardships faced by ordinary Zimbabweans, President Mnangagwa continues to present a polished image of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/although-zim-is-in-turmoil-mnangagwa-insists-country-is-a-secure-investment-hub/\">Continue reading<span class=\"screen-reader-text\"> \"Although Zim Is In Turmoil, Mnangagwa Insists Country Is A Secure Investment Hub\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        },
        {
            "title": "Legendary Gospel Musician Mechanic Manyeruke Turns 83…",
            "url": "https://www.zimeye.net/2025/08/26/legendary-gospel-musician-mechanic-manyeruke-turns-83/",
            "content": "By A Correspondent\n\nFor more than six decades, Mechanic Baba Manyeruke has been a defining voice of Zimbabwean gospel music. At 83, the iconic musician continues to defy age, commanding stages and captivating audiences with the same energy that launched his career in the 1960s.\n\nDespite earlier hints at retirement, Manyeruke says demand for his performances has made that nearly impossible. I am shocked at the number of bookings my manager is getting. People still want my services. I am just an ordinary elderly man who should be spending time in the village in Chiundura. I want to rest, but with all these bookings, I cannot call it retirement at all, he said in a recent press interview.\n\nManyerukes musical journey began in an era dominated by global pop icons like Elvis Presley, yet he carved out a unique sound rooted in faith and tradition. Today, with more than 60 recorded songs and countless live shows behind him, he remains a towering figure in Zimbabwes music scene. His love for the acoustic guitara companion for over 60 yearsremains as strong as ever.\n\nLast weekend, he marked his 83rd birthday surrounded by family and friends, shortly after dazzling fans at the Heroes and Defence Forces Gala in Hwedza, where he delivered a performance that outshone artists young enough to be his grandchildren.\n\nFollowing his stellar outing in Hwedza, Manyeruke admitted his retirement plans have been shelved. In life, they say a good dancer should know when to leave the stage, but my case is something else, he chuckled after a church performance in Ruwa. I cannot call it retirement at all.\n\nBookings continue to pour in for church conferences, year-end celebrations, and private functionsproof that his music still resonates deeply.\n\nWhile Manyeruke attributes his long life to Gods grace, he also credits disciplined living. I gave up meat and fatty foods like margarine. Too much fat clogs the system and leads to dangerous illnesses. I also take herbs when I visit my rural home, he explained.\n\nThese herbal remedies, passed down from his late father, are part of his wellness routine, alongside regular exercise. I have stayed fit through jogging, walking, and weightlifting. I have always loved keeping fit. I used to run marathons and still keep some of the medals in my house, he said.\n\nThough celebrated nationwide, Manyeruke prefers the quiet life in Chiundura. People wanted me to be a village head, but I refusedI do not want the pressure, he said with a laugh.\n\nHe beams with pride when speaking about his children, particularly Zimdancehall star Guspy Warrior (Emmanuel Manyeruke), who has embraced farming and rural living. My son has changed completely. He has built a home in the rural areas and is now a farmer with cattle and goats. He is doing things on his own, without my supervision, he said.\n\nMarried to Helena, Manyeruke is a proud father of seven. Only two of his children, Guspy and Alexander, followed in his musical footsteps.\n\nHaving toured countries such as the UK, Germany, Austria, and the US, Manyeruke considers his life a testimony of Gods favor. We laid the foundation for this genre, alongside pioneers like Jordan Chataika and Freedom Sengwayo, he reflected.\n\nAs he steps into his 84th year, his wish is simple: To create good memories and help otherseven as a centenarian.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent For more than six decades, Mechanic “Baba” Manyeruke has been a defining voice of Zimbabwean gospel music. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/legendary-gospel-musician-mechanic-manyeruke-turns-83/\">Continue reading<span class=\"screen-reader-text\"> \"Legendary Gospel Musician Mechanic Manyeruke Turns 83…\"</span></a></p>",
            "time": "06:40",
            "date": "27 Aug 2025"
        }
    ]
}