{
    "news": [
        {
            "title": "Three Candidates Set To Lock Horns In Gutu East By-election",
            "url": "https://www.zimeye.net/2025/05/15/three-candidates-set-to-lock-horns-in-gutu-east-by-election/",
            "content": "By A Correspondent\n\nThe political stage is set for a tightly contested by-election in Gutu East, as three candidates have been officially confirmed to vie for the vacant parliamentary seat on June 14, 2025.\n\nZanu PF will be represented by Zvarevashe Masvingise, while Gift Gonese will enter the race as an independent candidate. Rounding off the trio is Zivanai Nzvenga of the National Constitutional Assembly (NCA).\n\nThe Zimbabwe Electoral Commission (ZEC) confirmed the successful nomination of the three candidates during a session held at the Nomination Court in Masvingo on Thursday.\n\nZEC presiding officer, Mr. Taurai Gavi, announced the development, stating,A by-election is therefore scheduled for June 14 2025 in the said constituency.\n\nThe by-election is expected to draw significant attention as the contenders gear up for what promises to be a highly competitive and closely watched political battle in the heart of Masvingo province.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The political stage is set for a tightly contested by-election in Gutu East, as three candidates have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/15/three-candidates-set-to-lock-horns-in-gutu-east-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Three Candidates Set To Lock Horns In Gutu East By-election\"</span></a></p>",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "The Late VP, John Landa Nkomo’s Daughter is part of the Zim looters.",
            "url": "https://www.zimeye.net/2025/05/15/the-late-vp-john-landa-nkomos-daughter-is-part-of-the-zim-looters/",
            "content": "Smooth transition of minerals through the diplomatic bags. Zimbabweans are watching.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Smooth transition of minerals through the diplomatic bags. Zimbabweans are watching.",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "Dynamos Chief Bernard Marriot Calls For Meeting to Halt Looming Derby Boycott",
            "url": "https://www.zimeye.net/2025/05/15/dynamos-chief-bernard-marriot-calls-for-meeting-to-halt-looming-derby-boycott/",
            "content": "Sports Correspondent\n\nDynamos majority shareholder Bernard Marriot has invited the clubs supporters chapter leaders to crisis talks tomorrow, hoping to defuse mounting tensions and avert a planned boycott of the forthcoming Harare derby.\n\nSpeaking ahead of the meeting, Marriot acknowledged the legitimacy of fans frustrations over the teams poor start to the season.\n\nThe supporters have every right to complain; it hurts to watch Dynamos punching below its weight. This is no ordinary club, he said.\n\nMarriot, who also serves as board chairman, remains optimistic that the season can be salvaged if everyone works together.\n\nThere are 23 league games left. If we pull in the same direction, we can still win the title, he added. This is a dry spell, not a death sentenceprovided we stay together.\n\nThe meeting, set for tomorrow, will bring together chapter heads from across the country to discuss the ongoing crisis and explore ways to restore unity. A key objective will be to persuade supporter leaders to encourage their members to back the team and call off the planned boycott.\n\nClub sources say both parties view the meeting as a critical opportunity to repair the fractured relationship ahead of what is arguably the seasons biggest fixture.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos majority shareholder Bernard Marriot has invited the club’s supporters’ chapter leaders to crisis talks tomorrow, hoping to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/15/dynamos-chief-bernard-marriot-calls-for-meeting-to-halt-looming-derby-boycott/\">Continue reading<span class=\"screen-reader-text\"> \"Dynamos Chief Bernard Marriot Calls For Meeting to Halt Looming Derby Boycott\"</span></a></p>",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "MlSA Zimbabwe latest on Mhlanga",
            "url": "https://www.zimeye.net/2025/05/15/mlsa-zimbabwe-latest-on-mhlanga/",
            "content": "     \n\nAlpha Media Holdings senior journalist Blessed Mhlanga is now jointly charged with his employer Heart & Soul TV (HStv) following a ruling on 15 May 2025 by Harare Magistrate Learnmore Mapiye.\n\nMhlanga and HStv are facing charges of transmitting data messages allegedly inciting violence or damage to property after covering two press conferences by war veteran and former Zanu PF Central Committee member, Blessed Geza on 27 January and 11 February 2025.\n\nMagistrate Mapiye said both parties were present at the same press conference and that it was evident the accused are facing the same offence.\n\nThe trial is now expected to commence on 17 June 2025.\n\n :\n\n@followers @topfans MISA Regional MISA Malawi Heart and Soul ZIM Media Alliance Of Zimbabwe Blessed Mhlanga\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "𝐉𝐨𝐮𝐫𝐧𝐚𝐥𝐢𝐬𝐭 𝐌𝐡𝐥𝐚𝐧𝐠𝐚 𝐣𝐨𝐢𝐧𝐭𝐥𝐲 𝐜𝐡𝐚𝐫𝐠𝐞𝐝 𝐰𝐢𝐭𝐡 𝐇𝐒𝐓𝐕 Alpha Media Holdings senior journalist Blessed Mhlanga is now jointly charged with his employer … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/15/mlsa-zimbabwe-latest-on-mhlanga/\">Continue reading<span class=\"screen-reader-text\"> \"MlSA Zimbabwe latest on Mhlanga\"</span></a></p>",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "Mamelodi Sundowns Win 8th Title In A Row",
            "url": "https://www.zimeye.net/2025/05/15/mamelodi-sundowns-win-8th-title-in-a-row/",
            "content": "Sports Correspondent\n\nMamelodi Sundowns have cemented their dominance in South African football after clinching their eighth consecutive DStv Premiership title, setting yet another benchmark in the local game.\n\nThe Pretoria-based giants were officially crowned champions following a commanding season that saw them once again outpace all challengers. This latest triumph marks their 18th league title overall  a record in the South African top flight.\n\nKnown for their attacking flair and tactical consistency, Sundowns have turned the league into their personal playground over the past decade, with their latest success reinforcing their legacy as the team to beat in South African football.\n\nThe Brazilians, as they are affectionately known, continue to raise the bar, not just with domestic silverware but also with strong performances on the continental stage in the CAF Champions League.\n\nAs the dust settles on another dominant campaign, questions are already being asked: who can stop Sundowns, and when? For now, though, the crown firmly remains in Chloorkop.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Mamelodi Sundowns have cemented their dominance in South African football after clinching their eighth consecutive DStv Premiership title, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/15/mamelodi-sundowns-win-8th-title-in-a-row/\">Continue reading<span class=\"screen-reader-text\"> \"Mamelodi Sundowns Win 8th Title In A Row\"</span></a></p>",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "Killer Zivhu Kills Everything, Poetically",
            "url": "https://www.zimeye.net/2025/05/15/killer-zivhu-kills-everything-poetically/",
            "content": "NEWS ANALYSIS: BILLIONS SPENT, BUT WHERE ARE THE RESULTS?\n\nBig figures only, chiona zvima projects zvacho masaramusi. This blunt remark from former legislator Killer Zivhu, posted on X (formerly Twitter), cuts to the heart of Zimbabwes current infrastructure and public service crisis: astronomical budgets are announced, yet on the ground, the projects are either shoddy, unfinished, or outright invisible.\n\nZivhus comment is not just a jabit is a profound critique of Zimbabwes state machinery, particularly its public procurement and implementation systems. He lists amounts80 million, 1 billion, 15 billion, 187 million, 25 million, 300 millionfigures commonly attached to state projects and government announcements. These numbers are often touted with pomp in the state media, used to signal development and progress. However, Zivhu challenges this with biting realism: chiona zvima projects zvacho masaramusijust look at the pitiful state of the actual projects.\n\nBILLIONS IN THE AIR, MUD ON THE GROUND\n\nZimbabweans have grown accustomed to hearing about massive investments: US$90 million on the Mbudzi Interchange, billions for Command Agriculture, hundreds of millions for road rehabilitation, dam construction, and housing developments. But the actual output frequently resembles what Zivhu calls masaramusia Shona term suggesting something ridiculous, laughable, or utterly disappointing.\n\nThe discrepancy between publicized budget allocations and the final delivery is staggering. Many projects show signs of poor workmanship, misallocation of resources, or outright abandonment. For example, the Mbudzi Interchange projectdespite its multi-million-dollar price taghas been widely ridiculed for misaligned brickwork and unfinished structures.\n\nSYSTEMIC FAILURE: CORRUPTION OR INCOMPETENCE?\n\nZivhus rhetorical questionProblem ndeye vanopa basa here? kana kuti vanopiwa basa racho kuti vaite?asks whether the problem lies with those awarding the tenders or those executing them. This is the crux of Zimbabwes governance dilemma. Is it elite-level corruption and favoritism in contract allocation, or is it the sheer lack of capacity among those awarded the jobs?\n\nIn many cases, tenders are granted without transparent bidding processes. Companies linked to politically connected individuals are often handpicked, bypassing accountability mechanisms. Sometimes these entities exist only on paper. The result is a vicious cycle of inflated budgets, abandoned sites, and no service delivery.\n\nCALLING FOR ACCOUNTABILITY\n\nZivhus post reflects growing public frustration. Zimbabweans are not just tired of corruptionthey are tired of failure. People are asking: where is the money going? Who is auditing these projects? What happened to the roads that were meant to be paved? The clinics that were to be built? The schools and water systems that were supposedly funded?\n\nWhile Zivhu himself is a controversial figurehaving been expelled from ZANU PFhis remarks resonate widely. They capture the broader reality of a nation where headlines are filled with billions, but daily life remains mired in potholes, dry taps, and broken promises.\n\nWORDS VS. WORK\n\nZimbabwes developmental rhetoric is rich in billions and slogans, but desperately poor in results. Until there is a shift in how tenders are awarded, how projects are monitored, and how officials are held accountable, the country will continue to churn out big figures onlywith little to show for them.\n\nThe people deserve more than figures. They deserve function.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "NEWS ANALYSIS: BILLIONS SPENT, BUT WHERE ARE THE RESULTS? “Big figures only, chiona zvima projects zvacho masaramusi.” This blunt remark … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/15/killer-zivhu-kills-everything-poetically/\">Continue reading<span class=\"screen-reader-text\"> \"Killer Zivhu Kills Everything, Poetically\"</span></a></p>",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "Mnangagwa Turns to Belarus for Urgent Help Amid Zimbabwe’s Health Crisis",
            "url": "https://www.zimeye.net/2025/05/15/mnangagwa-turns-to-belarus-for-urgent-help-amid-zimbabwes-health-crisis/",
            "content": "By A Correspondent\n\nFacing a deepening healthcare crisis, Zimbabwean President Emmerson Mnangagwa is urgently seeking support from Belarus to revive the countrys failing medical infrastructure.\n\nDuring an official visit to Minsk, President Mnangagwa met with his Belarusian counterpart, Alexander Lukashenko, to discuss enhanced bilateral cooperation, with healthcare emerging as a top priority.\n\nGovernment spokesperson Nick Mangwana outlined the goals of the partnership, highlighting four key areas of assistance. According to Mangwana:\n\nZimbabwes health sector has long struggled with chronic underfunding, outdated equipment, drug shortages, and poor service delivery.\n\nThe outreach to Belarus underscores the urgency of the situation, as the Mnangagwa government seeks external support to avert a full-scale collapse of the public health system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Facing a deepening healthcare crisis, Zimbabwean President Emmerson Mnangagwa is urgently seeking support from Belarus to revive … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/15/mnangagwa-turns-to-belarus-for-urgent-help-amid-zimbabwes-health-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Turns to Belarus for Urgent Help Amid Zimbabwe’s Health Crisis\"</span></a></p>",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "Watch – We Will Bury Opposition In Gutu East By-election, Zanu PF Declares",
            "url": "https://www.zimeye.net/2025/05/15/watch-we-will-bury-opposition-in-gutu-east-by-election-zanu-pf-declares/",
            "content": "Watch: Zanu PF Candidate For Gutu East By-election Zvarevashe, Masvingise, Zanu PF provincial chairperson Robson Mavhenyengwa and commissar Brian Munyoro say they will thrash opposition in the June 14 plebiscitepic.twitter.com/F9PiYciK8a\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "BCC Fire Brigade quenches fire",
            "url": "https://www.zimeye.net/2025/05/15/bcc-fire-brigade-quenches-fire/",
            "content": "Old Mutual Building was in fire and the swift response from BCC Fire and Ambulance Services served the entire building.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Old Mutual Building was in fire and the swift response from BCC Fire and Ambulance Services served the entire building.",
            "time": "18:09",
            "date": "16 May 2025"
        },
        {
            "title": "Masvingo Police Crack Down on Stop Sign Violators in CBD",
            "url": "https://www.zimeye.net/2025/05/15/masvingo-police-crack-down-on-stop-sign-violators-in-cbd/",
            "content": "By A Correspondent\n\nPolice in Masvingo have launched a targeted operation against drivers who ignore stop signs in the city centre, in a move aimed at curbing traffic violations and reducing road accidents.\n\nA Zimbabwe Republic Police (ZRP) traffic officer in Masvingo confirmed the ongoing blitz on Wednesday, warning that motorists who flout road rules will face arrest.\n\nPolice are arresting drivers who disregard stop signs.\n\nThis is meant to deal with wayward drivers who cause accidents and inconvenience others, the officer said.\n\nThe operation comes amid rising concerns over reckless driving and traffic congestion in the city, especially during peak hours.\n\nStop signs in key intersections are often ignored, putting pedestrians and fellow motorists at risk.\n\nThe ZRP has urged drivers to exercise caution and respect road signage to ensure safety for all road users.\n\nMotorists in Masvingo have been advised to comply with traffic regulations or risk fines, arrest, or both as police tighten enforcement across the CBD.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Police in Masvingo have launched a targeted operation against drivers who ignore stop signs in the city … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/15/masvingo-police-crack-down-on-stop-sign-violators-in-cbd/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Police Crack Down on Stop Sign Violators in CBD\"</span></a></p>",
            "time": "18:09",
            "date": "16 May 2025"
        }
    ]
}