{
    "news": [
        {
            "title": "Zanu PF Hooligans Disrupt Job Sikhala Book Launch in Masvingo",
            "url": "https://www.zimeye.net/2025/07/11/zanu-pf-hooligans-disrupt-job-sikhala-book-launch-in-masvingo/",
            "content": "By A Correspondent\n\nThe third edition of the Footprints in the Chains book launchdetailing the life story of opposition politician Job Sikhalawas violently disrupted on Thursday by suspected Zanu PF activists at the Civic Centre in Masvingo.\n\nThe biography, written by Munyaradzi Angero Savanhu and edited by Rejoice Ngwenya, has been touring different cities as part of a national launch series.\n\nChaos broke out when a group of rowdy individuals believed to be Zanu PF supporters stormed the venue. They overturned tables, tore up printed materials, and physically attacked event facilitators.\n\nThe attackers accused organisers of using the book to push a political agenda.\n\nAn opposition activist who witnessed the incident condemned the violence, saying: This is exactly what Job Sikhala stood againststate-sponsored intimidation and political intolerance. Launching a book shouldnt be a crime.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The third edition of the Footprints in the Chains book launch—detailing the life story of opposition politician … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/zanu-pf-hooligans-disrupt-job-sikhala-book-launch-in-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hooligans Disrupt Job Sikhala Book Launch in Masvingo\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "Veteran ZBC Broadcaster Declared Liberation Hero",
            "url": "https://www.zimeye.net/2025/07/11/veteran-zbc-broadcaster-declared-liberation-hero/",
            "content": "By A Correspondent Veteran broadcaster and former Zimbabwe Broadcasting Corporation (ZBC) staffer,Stanley Goredema, has been declared aliberation heroand laid to rest at his Msengezi homestead in Zvimba.\n\nGoredema, who passed away on July 1 after a long illness, was honoured by President Emmerson Mnangagwa for his contributions to Zimbabwes liberation struggle and post-independence development. The announcement of his hero status was met with widespread praise from family, colleagues, and former collaborators, who gathered to pay their respects to a man hailed as a dedicated public servant and media professional.\n\nHis son,Mr Christmas Goredema, expressed the familys appreciation for the national recognition:\n\nWe want to thank the President for conferring our father with a liberation hero status. It gives us comfort as a family to know that our father played a pivotal role in the countrys history. He was a caring father who was also dedicated to his work.\n\nChegutu East MP and ZANU PF Deputy Political Commissar  Webster Shamudescribed Goredema as a patriot and urged the younger generation to carry forward the mission of economic emancipation.\n\nPeople like Cde Goredema and other departed heroes fought for the independence of this nation. The onus is now on the youth to be disciplined and take the nation forward. We worked with Cde Goredema at ZBC to push our own Zimbabwean agenda.\n\nGoredema is also remembered for his long service atRadio 3 (now Power FM), where he worked as a presenter and producer between 1979 and 1983, before moving to theNational Museums and Monuments of Zimbabwe (NMMZ)in 1984. There, he served asPrincipal Public Relations Officeruntil 2018, playing a key role in theNational Heroes Burial Process. He coordinated between NMMZ, the Ministry of Home Affairs and Cultural Heritage, and bereaved families, ensuring dignified ceremonies and the observance of cultural protocols.\n\nDoves Funeral Services Managing Director, Mr Nyasha Matsika, paid tribute to Goredemas professionalism and collaborative spirit:\n\nWe worked hand in glove with the National Museums and Monuments of Zimbabwe, especially during national heroes holidays. He was instrumental in coordinating these events, and our presence here is testimony to the role he played.\n\nChegutu District Development Coordinator Mr Mark Kadaira, representing the Minister of State for Mashonaland West Provincial Affairs and Devolution, Hon Marian Chombo, described Goredema as a pillar of support for families of national heroes:\n\nHe ensured families remained informed, supported, and engaged from the moment of declaration to the interment.\n\nGoredema also participated in the exhumation and dignified reburial of liberation war fighters, reinforcing his lifelong commitment to preserving the countrys historical memory.\n\nHe is survived by his wife,Josiline Mubaiwa, five children, and eight grandchildren.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Veteran broadcaster and former Zimbabwe Broadcasting Corporation (ZBC) staffer, Stanley Goredema, has been declared a liberation hero and laid to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/veteran-zbc-broadcaster-declared-liberation-hero/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran ZBC Broadcaster Declared Liberation Hero\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "Mthuli  Exposes US$114 Million ‘Trabablas’ Looting",
            "url": "https://www.zimeye.net/2025/07/11/mthuli-exposes-us114-million-trabablas-looting/",
            "content": "By A Correspondent Finance Minister Mthuli Ncube has inadvertently lifted the lid on the staggering scale of looting and financial opacity surrounding President Emmerson Mnangagwas government, revealing that the controversial Trabablas Interchange in Harare cost Zimbabweans a jaw-dropping US$114 millionfar beyond the originally stated US$88 million.\n\nUnder parliamentary pressure, Ncube was forced to provide a detailed account of how the project, previously known as the Mbudzi Roundabout, ballooned in cost. The new revelations have reinforced allegations of inflated tenders, unapproved expenditures, and deep-rooted corruption within Mnangagwas inner circle.\n\nInitially, government reports claimed the interchange was funded by an US$88 million loan from Fossil Mines (Pvt) Ltdan entity with reported ties to Mnangagwas alliescombined with allocations from Zimbabwes International Monetary Fund (IMF) Special Drawing Rights (SDRs). The loan, signed on December 6, 2021, carried an interest rate of LIBOR plus 5% per annum under the Public Debt Management Act.\n\nHowever, MPs from across the aisle, including Descent Bajila (Citizens Coalition for Change), grilled Ncube over unexplained budget escalations and demanded clarity on the projects true cost. What emerged was an admission that, in addition to the US$88 million, Treasury spent another US$26 milliontaken from Zimbabwes SDRsraising the final price tag to US$114 million.\n\nPressed for details, Ncube offered vague justifications, citing unforeseen project variations such as the relocation of affected residents and additional infrastructure components like 12 new bridges. He claimed US$65.5 million went toward core civil works, including storm drainage, road signs, erosion protection, and foundational structures.\n\nYet MPs were left unconvinced. Prosper Mutseyami (Chikanga) challenged the logic behind the so-called variations, arguing that such major cost escalations should have required fresh parliamentary approval.\n\nMore troubling, Mbizo MP Coborn Madzivanyika exposed contradictions in Ncubes statements. The US$26 million, originally described as a down payment, was now being repositioned as a budget overruneffectively masking an illegal overspend. Madzivanyika questioned how the Finance Ministry had unilaterally extended itself beyond Parliaments approved borrowing threshold.\n\nIn response, Ncube claimed sweeping powers under the Public Finance Management Act, insisting he did not need to return to Parliament for further authorisationan assertion critics say signals a dangerous erosion of legislative oversight under Mnangagwas watch.\n\nThe saga surrounding the Trabablas Interchangesymbolically renamed by critics to reflect the chaos of Zimbabwes governancehas become a glaring emblem of elite plunder, shady financing, and the Mnangagwa administrations disregard for accountability.\n\nAs public outrage grows over deteriorating public services, economic stagnation, and runaway inflation, the US$114 million Trabablas project is being seen not as a symbol of progress, but as a monument to state-sanctioned looting.\n\nAsk ChatGPT\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Finance Minister Mthuli Ncube has inadvertently lifted the lid on the staggering scale of looting and financial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/mthuli-exposes-us114-million-trabablas-looting/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli  Exposes US$114 Million ‘Trabablas’ Looting\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "Mohammed Kudus Seals £55m Move to Tottenham Hotspur",
            "url": "https://www.zimeye.net/2025/07/11/mohammed-kudus-seals-55m-move-to-tottenham-hotspur/",
            "content": "Sports Correspondent\n\nLONDON  Tottenham Hotspur have completed the signing of Ghanaian international Mohammed Kudus from West Ham United in a deal worth 55 million.\n\nThe 23-year-old attacking midfielder has penned a six-year contract with Spurs, committing his long-term future to the North London club. Despite reported interest from several top European sides, Kudus was reportedly resolute in his desire to join Tottenham, with sources close to the player saying he never had doubts about the move.\n\nKudus enjoyed an impressive season at West Ham following his arrival from Ajax in 2023, quickly establishing himself as one of the Premier Leagues most dynamic midfielders. Known for his versatility, flair, and eye for goal, Kudus is expected to add creativity and energy to Ange Postecoglous evolving squad.\n\nThe transfer represents a major statement of intent from Tottenham, who are looking to build on their recent progress and re-establish themselves as serious contenders for silverware.\n\nSpurs fans have already taken to social media to welcome Kudus, who becomes one of the clubs marquee signings in recent years. The Ghanaian is expected to join the team for pre-season training in the coming days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent LONDON – Tottenham Hotspur have completed the signing of Ghanaian international Mohammed Kudus from West Ham United in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/mohammed-kudus-seals-55m-move-to-tottenham-hotspur/\">Continue reading<span class=\"screen-reader-text\"> \"Mohammed Kudus Seals £55m Move to Tottenham Hotspur\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "Arsenal Fans Reject Noni Madueke ….",
            "url": "https://www.zimeye.net/2025/07/11/arsenal-fans-reject-noni-madueke/",
            "content": "Sports Correspondent\n\nLONDON  Arsenal supporters have strongly opposed the clubs reported interest in Chelsea winger Noni Madueke, flooding social media with backlash and launching a petition to block the move.\n\nThe online petition, titled No to Madueke, has already attracted over 4,000 signatures. Fans are voicing concerns over the players price tag and frustration at the prospect of signing yet another player from Chelsea, a trend that has previously divided the fanbase.\n\nTensions have spilled offline as well, with some disgruntled fans defacing murals near the Emirates Stadium, scrawling graffiti such as Arteta Out in protest of the transfer rumours.\n\nThe club has yet to comment on the speculation, but the reaction underscores growing unease among some Arsenal supporters over recent transfer strategies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent LONDON – Arsenal supporters have strongly opposed the club’s reported interest in Chelsea winger Noni Madueke, flooding social … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/arsenal-fans-reject-noni-madueke/\">Continue reading<span class=\"screen-reader-text\"> \"Arsenal Fans Reject Noni Madueke ….\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "Mnangagwa’s US$100K Cash Donation to Rugby Team – A Blessing or a Curse?",
            "url": "https://www.zimeye.net/2025/07/11/mnangagwas-us100k-cash-donation-to-rugby-team-a-blessing-or-a-curse/",
            "content": "By A Correspondent\n\nHARARE  President Emmerson Mnangagwa has donated US$100,000 in cash to the Zimbabwe national rugby team, the Sables, ahead of their Africa Cup semi-final against Kenya this Sunday.\n\nThe gesture, made at a State House ceremony on Thursday, comes with bold promises of government supportbut many Zimbabweans are questioning whether its genuine backing for sport or just another calculated political performance.\n\nBe assured that the nation is supporting you, Mnangagwa told the Zimbabwe Rugby Union delegation.\n\nThe Government will continue to support you, and I, your President, am confident in your dedication and sporting abilities.\n\nHe went further: Go out there and make Zimbabwe proud. I have prepared monetary tokens to assist you in your preparations.\n\nBut away from the polished speeches and photo ops, the donation has sparked debateif not outright anger. Why, many ask, is such a large sum being handed to a single sports team while hospitals remain under-equipped, teachers are underpaid, and civil servants struggle to survive on wages eroded by inflation?\n\nObservers point out that the president has been largely absent on issues affecting everyday Zimbabweans, yet has found timeand cashfor a well-timed donation with guaranteed media attention.\n\nTheres always money for a photo opportunity, said one Harare resident. But when nurses ask for gloves or families beg for clean water, theres no budget.\n\nOthers are also questioning the source of the money. Is it public money being used for political branding? Or is the president so personally flush with cash that he can casually pull out US$100,000 while the rest of the country sinks deeper into economic distress?\n\nThe Sables are defending champions of the Africa Cup, and a win on Sunday would place them one game away from qualifying for the 2027 Rugby World Cup in Australia. But the fear is that the team may now be caught in the middle of a political gameused as pawns to project a caring image of leadership ahead of future elections.\n\nWhile support for national sport is welcome, critics argue that this kind of ad hoc, high-profile handout lacks vision. Theres no national rugby development plan. No sustained investment in facilities. No funding for rural teams or forgotten sporting disciplines. Just cash, cameras, and carefully crafted quotes.\n\nFor the players, the focus remains on qualifying for the World Cup. But for many Zimbabweans, Mnangagwas donation rings hollowanother performance by a leader whose priorities appear more about optics than outcomes.\n\nIn a country with collapsing infrastructure, deepening poverty, and mounting unrest, the presidents US$100,000 gesture feels less like leadershipand more like a headline stunt.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – President Emmerson Mnangagwa has donated US$100,000 in cash to the Zimbabwe national rugby team, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/mnangagwas-us100k-cash-donation-to-rugby-team-a-blessing-or-a-curse/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s US$100K Cash Donation to Rugby Team – A Blessing or a Curse?\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "Zanu PF Bribes Chief Tshovani Ahead Of By-election",
            "url": "https://www.zimeye.net/2025/07/11/zanu-pf-bribes-chief-tshovani-ahead-of-by-election/",
            "content": "By A Correspondent\n\nAs the 26 July by-election for Chiredzi East approaches, the ZANU-PF campaign team has intensified efforts in Ward 4, Save Valley, backing ruling party candidate Ostine Phikelele.\n\nLed by Masvingo provincial chairperson Robson Mavhenyengwa, the party has been actively engaging with Chief Tshovani and local residents.\n\nDuring the campaign at Chief Tshovanis area, women clad in party regalia were seen urging the traditional leader to back ZANU-PF.\n\nThis has sparked criticism since Zimbabwes constitution explicitly forbids traditional leaders from engaging in political activities.\n\nAddressing the community, Mavhenyengwa said, We are here as your children; we ask for support from you and your village herds. Demonstrating humility and respect, he sat on the ground, embodying the spirit of Ubuntu.\n\nHowever, party insiders have alleged that Zanu PF offered cash and various freebies to Chief Tshovani in exchange for his political backing, a move widely condemned as a blatant violation of constitutional provisions governing traditional authorities.\n\nWhen asked about these allegations, Mavhenyengwa dismissed the bribery claims, stating, Our presence here is about unity and progress for the community. We respect the role of our traditional leaders and seek their moral support, not through inducements but through shared goals.\n\nDespite these denials, the controversy raises concerns about the politicization of traditional leadership and the fairness of the electoral process in Chiredzi East.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As the 26 July by-election for Chiredzi East approaches, the ZANU-PF campaign team has intensified efforts in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/zanu-pf-bribes-chief-tshovani-ahead-of-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Bribes Chief Tshovani Ahead Of By-election\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "ZRP Intensifies Search For Blessed Geza",
            "url": "https://www.zimeye.net/2025/07/11/zrp-intensifies-search-for-blessed-geza/",
            "content": "By A Correspondent  HARARE  Zimbabwe Republic Police (ZRP) have escalated efforts to locate ex-ZANU PF member and war veteran Blessed Geza, with international law enforcement agencies now involved in the manhunt.\n\nZRP spokesperson Assistant Commissioner Paul Nyathi confirmed the development, saying the force had reached out to Interpol and regional police networks as part of ongoing investigations.\n\nThe police are still looking for Blessed Geza in relation to ongoing criminal investigations, said Nyathi.\n\nIt is correct that the Zimbabwe Republic Police has engaged Interpol and relevant regional police services as investigations into the case continue.\n\nGeza is facing a range of accusations, including motor vehicle theft, inciting public violence, and undermining the authority of the President. Authorities claim the charges stem from recent statements he made sharply criticising President Emmerson Mnangagwa and issuing him a 10-day ultimatum to step down.\n\nThe former ruling party official has been vocal on social media, where he denounced Mnangagwas leadership and called for political changerhetoric that has drawn the ire of authorities.\n\nThe police say investigations are ongoing and have urged the public to report any information regarding Gezas whereabouts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – HARARE – Zimbabwe Republic Police (ZRP) have escalated efforts to locate ex-ZANU PF member and war … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/zrp-intensifies-search-for-blessed-geza/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Intensifies Search For Blessed Geza\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        },
        {
            "title": "Woman Violently Pulls Husband’s Manhood Over Text Messages",
            "url": "https://www.zimeye.net/2025/07/11/woman-violently-pulls-husbands-manhood-over-text-messages/",
            "content": "By A Correspondent\n\nHWANGE  A 19-year-old woman from Makwika Village has been convicted of domestic violence and assault after subjecting her husband to a brutal attack triggered by a confrontation over text messages on her phone.\n\nThe incident, which occurred on June 2, 2025, saw the young woman lash out violently after her husband questioned her about the messages.\n\nIn a fit of rage, she reportedly slapped him, grabbed his manhood, and dragged him into the kitchen where she poured boiling water over his lower body, inflicting severe burns.\n\nAccording to police reports, the man was rushed to hospital for treatment, and a case was subsequently opened with ZRP Hwange. A neighbour who tried to intervene during the attack was also scalded on the chest with boiling water and had to be hospitalized.\n\nThe matter was brought before the Hwange Magistrates Court, where the woman was convicted on two counts  one of domestic violence and another of assault.\n\nIn sentencing, the court handed her 12 months imprisonment for the domestic violence charge. For the assault charge, she received 24 months imprisonment, of which 12 months were suspended for five years on condition of good behaviour.\n\nThe remaining 12 months were suspended on the condition that she performs 630 hours of community service.\n\nThe shocking case has sparked concern over rising domestic violence incidents and the severity of the methods used in household disputes. Authorities have urged the public to seek peaceful conflict resolution and report abuse early to avoid further harm.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HWANGE – A 19-year-old woman from Makwika Village has been convicted of domestic violence and assault after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/11/woman-violently-pulls-husbands-manhood-over-text-messages/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Violently Pulls Husband’s Manhood Over Text Messages\"</span></a></p>",
            "time": "20:29",
            "date": "12 Jul 2025"
        }
    ]
}