{
    "news": [
        {
            "title": "Michael Nees Names Strong Warriors Squad For Clash With Benin",
            "url": "https://www.zimeye.net/2025/03/15/michael-nees-names-strong-warriors-squad-for-clash-with-benin/",
            "content": "Sports Correspondent\n\nWarriors coach Michael Nees has announced a formidable squad to face Nigeria and Benin in the 2026 World Cup Qualifiers Group C games. Zimbabwe will host Benin on March 21 at the Moses Mabida Stadium in Durban, South Africa, before traveling to Uyo, Nigeria to face the Super Eagles at the Godswill Akpabio International Stadium four days later.\n\nIn a significant boost to the team, Knowledge Musona has ended his international retirement and returns to the Warriors fold. Musona had retired from national duty in May 2022 to focus on his club career and give younger players a chance. However, after convincing from Nees, the midfielder has reconsidered his decision and rejoins the squad.\n\nCurrent captain Marvelous Nakamba and goalkeeper Washington Arubi, who have both struggled with injuries recently, have been named in the squad. Other notable inclusions are Wolves new signing Marshall Munetsi, Huddersfields on-loan signing Tawanda Chirewa, and Khama Billiat, who plays for Scotland FC in the Castle Lager Premiership.\n\nThe Warriors squad for the 2026 FIFA World Cup Qualifiers is as follows:\n\nGoalkeepers:\n\nDefenders:\n\nMidfielders:\n\nForwards:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors coach Michael Nees has announced a formidable squad to face Nigeria and Benin in the 2026 World … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/michael-nees-names-strong-warriors-squad-for-clash-with-benin/\">Continue reading<span class=\"screen-reader-text\"> \"Michael Nees Names Strong Warriors Squad For Clash With Benin\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Stay Calm Behind The Wheel",
            "url": "https://www.zimeye.net/2025/03/15/stay-calm-behind-the-wheel/",
            "content": "In our fast-paced world, impatience often seeps into our daily lives, including how we behave behind the wheel.\n\nBut the road is not a place for rash decisions or hasty actionsits a place where patience can literally save your life. If you refuse to exercise patience while riding or driving, you might find yourself in a far worse situation: as a patient in a hospital bed, a casualty in a morgue, or another statistic in a graveyard.\n\nThe roads are filled with vital signs and markings that serve a critical purpose. Road signs, signals, and lane markings arent just there for decorationthey are messages designed to guide and protect you. When you choose to ignore them, whether by speeding, overtaking dangerously, or neglecting to follow traffic rules, you put yourself and others at risk.\n\nPatience on the road means taking the time to properly assess your surroundings, respecting speed limits, yielding when necessary, and abiding by the rules set forth to ensure everyones safety. These guidelines are not meant to slow you down or ruin your day; they are meant to preserve your life. A single moment of impatience could lead to an irreversible consequence.\n\nFor example, ignoring a red light or failing to yield could lead to a tragic collision, leaving not only you but also others involved suffering the consequences. If youre driving too fast for road conditions or overtaking on blind corners, you might be tempting fate. That sudden moment of impatience can result in an accident that could change your life foreveror end it prematurely.\n\nThe road messages are clear. The speed limits are there to keep you safe. The warning signs are there to prepare you for potential hazards ahead. The lane markings are there to help you stay in your lane and avoid dangerous intersections. Respecting these messages is an act of self-preservation. Ignoring them could place you in a hospital bed, or worse, a morgue.\n\nSo, the next time you find yourself behind the wheel, take a deep breath and remind yourself of the consequences of impatience. Your life is worth more than reaching your destination a few minutes earlier. Be patient. Respect the road, its messages, and the safety of those around you. It could mean the difference between life and death.\n\nDrive safe. Be patient. Save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In our fast-paced world, impatience often seeps into our daily lives, including how we behave behind the wheel. But the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/stay-calm-behind-the-wheel/\">Continue reading<span class=\"screen-reader-text\"> \"Stay Calm Behind The Wheel\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Muchinguri Letter: Mutsvangwa Attacks President ED And VP Chiwenga",
            "url": "https://www.zimeye.net/2025/03/15/muchinguri-letter-chiwenga-direct-attack-by-cde-chris-mutsvangwa/",
            "content": "The Zanu Pf National ChairpersonCde OCZ MuchinguriZANU PF HQ\n\n15 March 2025\n\nDear Cde Muchinguri\n\n*RE: VP Chiwenga Direct Attack by Cde Chris Mutsvangwa.*\n\nI write this letter to your attention seeking a legal intervention pertaining to the utterances made by Cde Chris Mutsvangwa to Vice President and second secretary of the party Zanu Pf Cde CDGN Chiwenga.\n\nThe statements made which are awash on social media denigrating VP Chiwenga affects the reputation of the party and first secretary since Cde Mutsvangwa is a Party Spokeperson and everything that he says binds the party. As a concerned cadre the effects of such utterances has got a negative bearing which poses a security threat. Infact he seems to imply the President is above the law and can interfere with issues before the courts.\n\nCde Mutsvangwa in his utterances brought the party into disrepute and will now destabilise the political environment which will in turn affect the social life of the masses. The Direct attack on VP Chiwenga has got a negative implication on our international relations and the nation at large eroding the gains of the new dispensation.\n\nHon Vice President CDGN Chiwenga is a Presidential Appointee and the attacks by Cde Mutsvagwa might seem as if the President has made a mistake in Appointing him which is also a direct attack on President Mnangagwa.\n\nWe have lower level cadres who were expelled from the party due to purpoted social media abuse. I strongly advocate for a corrective action against Cde Mutsvangwa.\n\nSuch actions should be strongly condernmed as they undermine the Authority of Cde Chiwenga and cause serious divisions within the Zanu Pf party.\n\nMashonaland West Province leadership cannot look aside at this Gross Indiscipline.\n\nWe hope and trust that your office shall take this matter with the importance and urgency it deserves\n\nYours Concerned Cadre\n\nCde Gifford Gomwe\n\nCc: First Secretary of the Party Cde ED MnangagwaCc: Second Secretary of the Party Cde CDGN Chiwenga.Cc: Second Secretary of the Party Cde KCD Mohadi.Cc:Secretary for legal Affairs Cde P.ChinamasaCc: Secretary General of the Party Cde O.Mpofu.Cc: Secretary for Security Cde L.Matuke.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Zanu Pf National Chairperson Cde OCZ Muchinguri ZANU PF HQ 15 March 2025 Dear Cde Muchinguri *RE: VP Chiwenga … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/muchinguri-letter-chiwenga-direct-attack-by-cde-chris-mutsvangwa/\">Continue reading<span class=\"screen-reader-text\"> \"Muchinguri Letter: Mutsvangwa Attacks President ED And VP Chiwenga\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Sad: Fuel Tanker Overturns After Collision",
            "url": "https://www.zimeye.net/2025/03/15/sad-fuel-tanker-overturns-after-collision/",
            "content": "By A Correspondent\n\nA devastating accident occurred on Friday night, approximately 5 kilometers from Nyazura along the Rusape-Murambinda road.\n\nA fuel tanker collided with a Toyota Wish, resulting in the tanker overturning and spilling its hazardous contents.\n\nEmergency responders are currently at the scene, working to contain the fuel leak and prevent any further damage.\n\nFortunately, there are no reported fatalities, but the extent of injuries and damage is still being assessed.\n\nThe cause of the collision is under investigation, and authorities are urging motorists to exercise extreme caution when traveling on the Rusape-Murambinda road.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating accident occurred on Friday night, approximately 5 kilometers from Nyazura along the Rusape-Murambinda road. A … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/sad-fuel-tanker-overturns-after-collision/\">Continue reading<span class=\"screen-reader-text\"> \"Sad: Fuel Tanker Overturns After Collision\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Muchinguri-Kashiri Admits Total Chaos In Zanu PF",
            "url": "https://www.zimeye.net/2025/03/15/muchinguri-kashiri-admits-total-chaos-in-zanu-pf/",
            "content": "By A Correspondent\n\nZanu PF Chairperson Oppah Muchinguri-Kashiri acknowledged on Thursday that the resolution passed at the partys annual conference in Bulawayo last year, which proposed constitutional amendments to extend President Emmerson Mnangagwas term until 2030, is being misused by a few individuals to create divisions within the party.\n\nDuring a party briefing at Zanu PF headquarters in Harare, Muchinguri-Kashiri explained that some activists were facing disciplinary action in the provinces due to the manipulation of the 2030 slogan. Allow me to put the 21st National Peoples Conference resolution number one under spotlight. Party leadership has observed, with dismay, the abuse of the resolution and the weaponisation of the 2030 slogan, she said.\n\nShe emphasized that the resolution was a collective decision and should not be hijacked by a few for personal interests. The resolution is a collective outcome that cannot be monopolised by a few individuals for personal gain and glory. These few individuals are now exploiting the resolution and the 2030 slogan to provoke discord and petty disciplinary cases. This must stop forthwith.\n\nMuchinguri-Kashiri also reiterated that the resolution had broad support within the party, calling for patience as proper party protocols were followed. Youre all aware that the resolution was and is supported by everyone hence let us give the requisite party protocol time to process it accordingly, she added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Chairperson Oppah Muchinguri-Kashiri acknowledged on Thursday that the resolution passed at the party’s annual conference … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/muchinguri-kashiri-admits-total-chaos-in-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Muchinguri-Kashiri Admits Total Chaos In Zanu PF\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Trump Expels SA Ambassador to the United States",
            "url": "https://www.zimeye.net/2025/03/15/trump-expels-sa-ambassador-to-the-united-states/",
            "content": "By A Correspondent\n\nSouth African President Cyril Ramaphosa has officially confirmed the expulsion of the countrys Ambassador to the United States, Mr. Ebrahim Rasool.\n\nIn a statement issued by his office, the Presidency expressed its regret over the situation, noting, The Presidency has noted the regrettable expulsion of South Africas Ambassador to the United States of America, Mr. Ebrahim Rasool.\n\nThe statement continued with a call for diplomatic decorum in the handling of the matter: The Presidency urges all relevant and impacted stakeholders to maintain the established diplomatic decorum in their engagement with the matter.\n\nDespite the expulsion, South Africa remains committed to fostering a positive relationship with the U.S., as emphasized in the statement: South Africa remains committed to building a mutually beneficial relationship with the United States of America.\n\nThe statement was officially issued by the Presidency of the Republic of South Africa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent South African President Cyril Ramaphosa has officially confirmed the expulsion of the country’s Ambassador to the United … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/trump-expels-sa-ambassador-to-the-united-states/\">Continue reading<span class=\"screen-reader-text\"> \"Trump Expels SA Ambassador to the United States\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Ukaita Bonde Neni Unohakira Zodzo, Muporofita Orura Kunyepera Vakadzi Vevanhu Achiti Anogadzirisa Matambudziko Emuwanano?",
            "url": "https://www.zimeye.net/2025/03/15/ukaita-bonde-neni-unohakira-zodzo-muporofita-orura-kunyepera-vakadzi-vevanhu-achiti-anogadzirisa-matambudziko-emuwanano/",
            "content": "Dear Editor.\n\nKusagadzikana mumusha weMasvingo zvichikonzerwa nevamwewo vakuru vemakereke vari kunzi vari kurara nevakadzi vevanhu zvinosiririsa.\n\nMumwedzi mitatu yapfuura vamwe Papa vanonzi Josiah Nyambazi avo vari kutyisa kudarika maShurugwi emabhemba, kunonzi mufundisi wenhema uyu ari kufeva nevakadzi vevanhu zvinosiririsa.\n\nIzvo zvapa kuti vanhukadzi varambidzwe kuinda kudzisvondo apo varume vavo vachityityira kuti vana amai vanonopfimbiwa\n\nNhubu iyi yakapa mukadzi wangu siki uye haizezi kupfimba vakadzi vevanhu, ikozvino mukadzi wangu ava nedzimwe mhopo dzava kuramba kupera uye kubuda hurwa hune zimweya rinokashidza\n\nAkavatazve nevamwe amai vemu church uye nevana veku praise and worship, mbiri yake yekuda mamai yava kutotyisa  anodaro umwe ati aimbova nhengo yekereke yetsotsi iri\n\nUyo murume akabva kare achingoita zvemamai evanhu achivanyepera kuti ndinobatsira zvemudzimba uye anonyepera kuti ukavata naye unohakira zodzo , vanodaro pastor Terrence avo vaimbova sahwira wembavha Josiah inoba nezita raMwari .\n\nfrom concerned citizens\n\nPastor Josiah Nyambazi can you urgently respond to the above allegations from individuals who are accusing you of being mischievous\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dear Editor…. Kusagadzikana mumusha weMasvingo zvichikonzerwa nevamwewo vakuru vemakereke vari kunzi vari kurara nevakadzi vevanhu zvinosiririsa. Mumwedzi mitatu yapfuura vamwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/ukaita-bonde-neni-unohakira-zodzo-muporofita-orura-kunyepera-vakadzi-vevanhu-achiti-anogadzirisa-matambudziko-emuwanano/\">Continue reading<span class=\"screen-reader-text\"> \"Ukaita Bonde Neni Unohakira Zodzo, Muporofita Orura Kunyepera Vakadzi Vevanhu Achiti Anogadzirisa Matambudziko Emuwanano?\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "ED Moves To Delete Chiwenga",
            "url": "https://www.zimeye.net/2025/03/15/ed-moves-to-delete-chiwenga/",
            "content": "By Munacho Gwamanda-Zanu PF is moving to delete Vice President Constantino Chiwengas political career as it formally tables a proposal in Parliament to extend President Emmerson Mnangagwas rule beyond his constitutional mandate.\n\nSpeaking at an inter-district meeting in Mazowe, Mashonaland Central Province, Zanu PFs Chitepo School of Ideology principal, Munyaradzi Machacha, confirmed that the partys resolution to keep Mnangagwa in power was being actively implemented through government channels.\n\nHe dismissed claims that the proposal sought to grant Mnangagwa a third term, clarifying that it aimed to extend his current leadership until 2030 to ensure stability and continuity.To facilitate the implementation of Resolution Number 1, a committee has been established, comprising provincial chairpersons from all 10 provinces, provincial political commissars, and representatives from all party wings, Machacha explained. This committee will work closely with the legal department to craft strategies, while Parliament explores ways to bring this resolution to life.\n\nAs tensions escalate between Mnangagwa and his deputy, Constantino Chiwenga, Zanu PF National Chairperson Oppah Muchinguri has stepped in to mediate the growing factional rift.\n\nThe two leaders are embroiled in a fierce battle for control of the party beyond 2028.\n\nInitially, Mnangagwa and Chiwenga had a verbal agreement that the vice president would succeed Mnangagwa after his second term.\n\nHowever, Mnangagwa has since backtracked, instead maneuvering to extend his grip on power, a move that has triggered internal divisions.\n\nMnangagwas loyalists have been pushing for constitutional amendments to enable him to remain in office, portraying him as an indispensable leader whose rule should continue.\n\nThis has led to heightened discord within the ruling party.\n\nAt a special State of the Party indaba held at the Zanu PF headquarters in Harare on Thursday, Muchinguri acknowledged the damaging impact of the leadership wrangles on party cohesion.It is shameful for any leader to engage in primitive and barbaric political bickering that divides the party, she said. Such behavior only benefits opposition forces.\n\nShe commended the partys Information and Publicity Department for implementing a robust social media policy to curb factionalism and urged members to focus on promoting the partys achievements rather than engaging in internal disputes.\n\nMuchinguri reaffirmed that Mnangagwa, as Zanu PFs First Secretary, remains the face of the party. She warned that any member found denigrating him would face disciplinary action.Our President and the entire Presidium must be protected by shunning factionalism, which is a creation of self-serving individuals. This behavior poses a national security risk, she stated.\n\nThe indaba was attended by Politburo members, Central Committee members, Ministers of State for Provincial Affairs and Devolution, provincial chairpersons, and other senior party officials.\n\nMuchinguri emphasized the importance of discipline, warning against unresolved primary election disputes and the misuse of disciplinary processes for personal gain.Some members are using government resources to campaign in constituencies where there are duly elected MPs. This behavior will not be tolerated, she said, adding that a circular would be issued to address these issues.\n\nShe also stressed the need to empower women and war veterans through economic initiatives, citing Mnangagwas Presidential Solar, Borehole, and Loan Schemes as key development efforts.\n\nMuchinguris intervention highlights the severity of the ongoing power struggle between Mnangagwa and Chiwenga.\n\nThe rift, which has been simmering since the 2017 coup that brought Mnangagwa to power, has now reached a critical juncture.\n\nChiwenga, who played a pivotal role in the military takeover that ousted Robert Mugabe, is determined to assert his claim to the presidency.\n\nMeanwhile, Mnangagwas manoeuvres to retain power have intensified, threatening to destabilize Zanu PF ahead of the 2028 elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Zanu PF is moving to delete Vice President Constantino Chiwenga’s political career as it formally tables a proposal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/ed-moves-to-delete-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"ED Moves To Delete Chiwenga\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Nelson Chamisa Bemoans Recurring Brain Drain, Citizens’ Suffering",
            "url": "https://www.zimeye.net/2025/03/15/nelson-chamisa-bemoans-recurring-brain-drain-citizens-suffering/",
            "content": "By A Correspondent\n\nOpposition leader Advocate Nelson Chamisa has expressed his concern over the ongoing brain drain in Zimbabwe, attributing it to the actions of the Zanu PF regime. In a statement released on Friday, Chamisa lamented the worsening plight of citizens, emphasizing how the country continues to lose its brightest minds.\n\nChamisa shared his personal frustration, stating, Just this morning, I received four different calls from some professionals, all planning on leaving the country to seek opportunities in other countries. He described the constant distress of receiving calls from Zimbabweans desperate to leave, adding, My daily agony is waking up every day to the lived nightmare of receiving yet another call from a fellow Zimbabwean desperate to leave the country searching for what is believed to be greener pastures. This is a story I have experienced repeatedly for the past 20 years.\n\nThese calls, according to Chamisa, are not mere conversations but often pleas for help. Often, these calls are not just conversations, they are pleas for assistance, requests for guidance on finding a way to exit and escape to a perceived better life and future, he explained.\n\nHe criticized the countrys leadership for failing to address the crisis, pointing out the negative impact of the brain drain on the nations future. The sheer scale of brain drain we are experiencing is staggering. As a nation, we are hemorrhaging talent and gifts, losing the very citizens we have invested in and educated (with meager resources for that matter), to other economies, where they go to build and strengthen economies elsewhere.\n\nChamisa described this as plainly heartbreaking and blamed the lack of leadership in the country. Leadership is the missing link. Those in leadership have let the people down. By leadership, I mean everyone within the ecosystem of governance and influence. Any serious leadership would not allow this hemorrhaging to continue untamed or unchecked, he said.\n\nHe further stressed the unsustainable situation, noting, We cannot continue with a situation where all of us, as a people, are perennially preoccupied with finding a way out of our own country. I am yet to see a nation that thrives when the bulk of its best minds are outside it. It cant!\n\nChamisa also commented on the widespread belief that opportunities lie outside the country, saying, It has become a common disposition for citizens to go seeking opportunities in other countries. The motivation being that the grass is greener elsewhere. Granted, the grass always seems greener elsewhere, but it should be greenest wherever we are. Yet, right now, that green grass is benefitting no one hereexcept a select few.\n\nHe concluded by calling for a collective effort to address the issue and work towards Zimbabwes transformation and prosperity. This must stop. It will take all of us a collective effort to win Zimbabwe for transformation and prosperity, and end this nightmare, he urged.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Advocate Nelson Chamisa has expressed his concern over the ongoing brain drain in Zimbabwe, attributing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/nelson-chamisa-bemoans-recurring-brain-drain-citizens-suffering/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Bemoans Recurring Brain Drain, Citizens’ Suffering\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "ED, Chiwenga Fight Escalates",
            "url": "https://www.zimeye.net/2025/03/15/ed-chiwenga-fight-escalates-2/",
            "content": "By Munacho Gwamanda-Zanu PF has formally tabled a proposal in Parliament seeking to extend President Emmerson Mnangagwas rule beyond his constitutional mandate, further fueling tensions within the ruling party.\n\nSpeaking at an inter-district meeting in Mazowe, Mashonaland Central Province, Zanu PFs Chitepo School of Ideology principal, Munyaradzi Machacha, confirmed that the partys resolution to keep Mnangagwa in power was being actively implemented through government channels.\n\nHe dismissed claims that the proposal sought to grant Mnangagwa a third term, clarifying that it aimed to extend his current leadership until 2030 to ensure stability and continuity.To facilitate the implementation of Resolution Number 1, a committee has been established, comprising provincial chairpersons from all 10 provinces, provincial political commissars, and representatives from all party wings, Machacha explained. This committee will work closely with the legal department to craft strategies, while Parliament explores ways to bring this resolution to life.\n\nAs tensions escalate between Mnangagwa and his deputy, Constantino Chiwenga, Zanu PF National Chairperson Oppah Muchinguri has stepped in to mediate the growing factional rift.\n\nThe two leaders are embroiled in a fierce battle for control of the party beyond 2028.\n\nInitially, Mnangagwa and Chiwenga had a verbal agreement that the vice president would succeed Mnangagwa after his second term.\n\nHowever, Mnangagwa has since backtracked, instead maneuvering to extend his grip on power, a move that has triggered internal divisions.\n\nMnangagwas loyalists have been pushing for constitutional amendments to enable him to remain in office, portraying him as an indispensable leader whose rule should continue.\n\nThis has led to heightened discord within the ruling party.\n\nAt a special State of the Party indaba held at the Zanu PF headquarters in Harare on Thursday, Muchinguri acknowledged the damaging impact of the leadership wrangles on party cohesion.It is shameful for any leader to engage in primitive and barbaric political bickering that divides the party, she said. Such behavior only benefits opposition forces.\n\nShe commended the partys Information and Publicity Department for implementing a robust social media policy to curb factionalism and urged members to focus on promoting the partys achievements rather than engaging in internal disputes.\n\nMuchinguri reaffirmed that Mnangagwa, as Zanu PFs First Secretary, remains the face of the party. She warned that any member found denigrating him would face disciplinary action.Our President and the entire Presidium must be protected by shunning factionalism, which is a creation of self-serving individuals. This behavior poses a national security risk, she stated.\n\nThe indaba was attended by Politburo members, Central Committee members, Ministers of State for Provincial Affairs and Devolution, provincial chairpersons, and other senior party officials.\n\nMuchinguri emphasized the importance of discipline, warning against unresolved primary election disputes and the misuse of disciplinary processes for personal gain.Some members are using government resources to campaign in constituencies where there are duly elected MPs. This behavior will not be tolerated, she said, adding that a circular would be issued to address these issues.\n\nShe also stressed the need to empower women and war veterans through economic initiatives, citing Mnangagwas Presidential Solar, Borehole, and Loan Schemes as key development efforts.\n\nMuchinguris intervention highlights the severity of the ongoing power struggle between Mnangagwa and Chiwenga.\n\nThe rift, which has been simmering since the 2017 coup that brought Mnangagwa to power, has now reached a critical juncture.\n\nChiwenga, who played a pivotal role in the military takeover that ousted Robert Mugabe, is determined to assert his claim to the presidency.\n\nMeanwhile, Mnangagwas manoeuvres to retain power have intensified, threatening to destabilize Zanu PF ahead of the 2028 elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Zanu PF has formally tabled a proposal in Parliament seeking to extend President Emmerson Mnangagwa’s rule beyond his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/15/ed-chiwenga-fight-escalates-2/\">Continue reading<span class=\"screen-reader-text\"> \"ED, Chiwenga Fight Escalates\"</span></a></p>",
            "time": "21:46",
            "date": "15 Mar 2025"
        }
    ]
}