{
    "news": [
        {
            "title": "The Erosion of Democratic Governance in Africa’s Revolutionary Parties",
            "url": "https://www.zimeye.net/2025/10/31/the-erosion-of-democratic-governance-in-africas-revolutionary-parties/",
            "content": "By Gifford Gomwe\n\nAs I reflect on the state of affairs in some African countries, I am deeply concerned about the rise of undemocratic governance, particularly among revolutionary parties that once championed the struggles of the people. Across the region, citizens are increasingly frustrated with leaders who prioritize personal interests over the welfare of the masses.\n\nIts worth noting that social and economic injustice often sparked the formation of revolutionary parties, with the aim of protecting the rights and interests of the marginalized. However, it seems that some of these parties have lost sight of their original purpose.\n\nCountries like Tanzania, which played a pivotal role in African politics and liberation struggles, continue to inspire us with their history. Julius Nyereres legacy as a champion of Pan-Africanism and African unity remains a guiding light for many.\n\nThe insatiable appetite for power among leaders is costing revolutionary parties their history and credibility. Instead of serving the people, they are serving their own interests and those of their close allies. This trend undermines the very foundations of the liberation struggles that brought these parties to power.\n\nTo leaders in revolutionary parties across the continent, I say please govern in a way that protects the interests of the revolutionary struggle. Respect the constitution and the rule of law. Do not let your appetite for power consume you, as it has far-reaching implications for the nation and the party as a whole.\n\nLet us support proper governance that prioritizes the people and protects the integrity of revolutionary parties. We owe it to the next generation to ensure that the struggles of the past are not in vain. As we say Aluta continua the struggle continues.\n\nLeaders need to prioritize the peoples interests and uphold democratic principles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Gifford Gomwe As I reflect on the state of affairs in some African countries, I am deeply concerned about … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/the-erosion-of-democratic-governance-in-africas-revolutionary-parties/\">Continue reading<span class=\"screen-reader-text\"> \"The Erosion of Democratic Governance in Africa’s Revolutionary Parties\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Zanu PF Legislator Accused of Fleecing More Than 400 Home Seekers Under Presidential Title Deeds Programme",
            "url": "https://www.zimeye.net/2025/10/31/zanu-pf-legislator-accused-of-fleecing-more-than-400-home-seekers-under-presidential-title-deeds-programme/",
            "content": "By A Correspondent\n\nHarare  Zanu PF Member of Parliament for Epworth South, Honourable Mbofana Mutana Taedzwa, is being accused by high-ranking party officials and senior administrative authorities of working with controversial residents associations to dupe more than 400 families, promising them residential stands with full ownership deeds under the Presidential Title Deeds Programme at an undisclosed fee.\n\nThe Epworth South legislator, allegedly working secretly with Kushinga Siname Development Fund and the Epworth Urban Residents Association, is said to have fleeced hundreds of poor families of their hard-earned money. He reportedly claimed that Zanu PF was conducting an operation to identify loyal grassroots members in Epworth who would be rewarded with residential stands under the Presidential Title Deeds Programme at affordable fees and flexible payment conditions.\n\nAnonymous local officials allege that Hon. Taedzwa, through these residents associations, abused his political influence to fraudulently allocate residential stands on land that had been reserved for the construction of a district general hospital  a critical facility that Epworth still lacks.\n\nThe land, designated for the hospital under the Epworth Master Layout Plan approved by the Ministry of Local Government and Public Works, is now reportedly occupied by more than 600 families, up from an initial 200.\n\nThese families were originally supposed to be relocated to proper residential areas free of charge under the Presidential Title Deeds Programme.\n\nHowever, it is alleged that the MP colluded with residents associations to allocate additional stands on the hospital site to new settlers, inflating the number of households eligible for reallocation  thereby increasing his potential financial gain.\n\nReports further suggest that about five years ago, while the Presidential Title Deeds Programme was still being planned, Taedzwa, through the same associations, misled home seekers by claiming that the ruling party was identifying loyal members who would benefit from the initiative. He allegedly allocated temporary shelter to them on the hospital site, collecting money under the pretext of facilitating future formal allocation of stands with title deeds.\n\nNow, hundreds of families who were duped by the legislator are desperate and homeless, struggling to find permanent shelter following the recent regularization exercise.\n\nI have been paying money to these residents associations for a long time, hoping that one day I would get my own place to stay, said Brian, one of the victims. I am now hopeless and cant afford rent because most of my savings were used up paying for this.\n\nWhen contacted for comment, the Epworth legislator refused to entertain questions, saying he could not speak to journalists over the phone.\n\nHandigone kutaura nemunhu pafoni shamwari, itai henyu zvamunoda, he said before hanging up. I cant speak to anyone on the phone, my friend. Do whatever you want.\n\nTaedzwa dismissed the allegations, insisting he had nothing to fear.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – Zanu PF Member of Parliament for Epworth South, Honourable Mbofana Mutana Taedzwa, is being accused … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/zanu-pf-legislator-accused-of-fleecing-more-than-400-home-seekers-under-presidential-title-deeds-programme/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Legislator Accused of Fleecing More Than 400 Home Seekers Under Presidential Title Deeds Programme\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Education Minister: Schools Can’t Function Without Corporal Punishment",
            "url": "https://www.zimeye.net/2025/10/31/education-minister-schools-cant-function-without-corporal-punishment/",
            "content": "By A Correspondent\n\nPrimary and Secondary Education Minister Torerayi Moyo has argued that the governments ban on corporal punishment is making it increasingly difficult for teachers to maintain discipline in schools.\n\nMoyos remarks come amid growing concerns that students are challenging authority, with some reportedly bullying educators under the guise of asserting their rights.\n\nResponding to a trade unionist advocating for the reinstatement of corporal punishment this week, Moyo said:\n\nI truly wonder if we havent erred too far in the name of progress. The classroom, once a place of order and respect, has become a battleground where our frontline educators are stripped of the authority to instill discipline.\n\nWe are witnessing a troubling shift  a Grade 7 learner now dares to bully a teacher, invoking rights without understanding responsibility.\n\nLet us be honest. The erosion of discipline in our schools is not just an educational issue; it is a societal one. Broken families, economic hardship, and the loss of communal values have left many children without guidance. The teacher, once supported by the community, now stands alone.\n\nMoyo clarified that he is not advocating for violence but believes authorities should reconsider traditional methods that helped shape responsible citizens.\n\nA stick in time saves nine, as our elders say. This is not about punishment. It is about correction, about restoring balance, he said. Many traditional leaders and lawmakers have echoed this call. We must explore a legal framework that allows for firm, fair discipline without abuse.\n\nLet us not allow misguided interpretations of rights to dismantle the foundation of learning. Discipline is not oppression; it is preparation for life. And if we do not act, we risk raising a generation that respects neither authority nor consequence.\n\nCurrently, corporal punishment in schools is prohibited under Zimbabwean law. A 2017 High Court ruling declared corporal punishment of children unconstitutional, citing protections against cruel, inhuman, or degrading treatment. The Education Amendment Act (2020) reinforced this by explicitly banning corporal punishment and ensuring children are not subjected to physical or psychological abuse.\n\nDespite the legal prohibition, reports indicate corporal punishment persists in some areas, as cultural and traditional attitudes toward discipline continue to clash with the law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Primary and Secondary Education Minister Torerayi Moyo has argued that the government’s ban on corporal punishment is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/education-minister-schools-cant-function-without-corporal-punishment/\">Continue reading<span class=\"screen-reader-text\"> \"Education Minister: Schools Can’t Function Without Corporal Punishment\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Three Cops In Trouble For Stealing Police Uniforms",
            "url": "https://www.zimeye.net/2025/10/31/three-cops-in-trouble-for-stealing-police-uniforms/",
            "content": "By A Correspondent\n\nThree officers from the Zimbabwe Republic Police (ZRP) General Headquarters have appeared in Harare Magistrates Court accused of stealing police uniforms and selling them for personal gain.\n\nThe accusedThabane Hugh Bajilla (43), Makomborero Dziva (31), and Sadat Cader (37)were on Wednesday granted bail of US$150 each by Magistrate Artwell Sanyatwe and are scheduled to return to court on November 27.\n\nAccording to prosecutor Takudzwa Jambawu, between 2024 and October 13, 2025, Bajilla and Dziva, who had authorized access to ZRP uniform storage, allegedly removed various uniforms and passed them to Cader for resale. The proceeds from the sales were reportedly shared among the three.\n\nThe theft came to light after a break-in at the PGHQ Ordinance Stores on October 13, 2025, where numerous uniforms went missing. During follow-up investigations on October 26, detectives from CID Harare received information that Sergeant Masceline Chirambadare of the Chitungwiza ZRP Camp was in possession of a satchel containing seven new police shirts suspected to be stolen.\n\nFurther inquiry revealed that the satchel had been handed to Constable Manyika by Junior Chihambakwe, who had been transporting it in a Nissan AD Van. Chihambakwe reported that two uniformed officers had boarded his vehicle on October 14 carrying bags of uniforms, leaving one behind in Chitungwiza, which he later turned over to police staff.\n\nEvidence gathered included an audio recording of Dziva attempting to persuade Sergeant Chirambadare to release the satchel. Following this, Dziva was arrested at work on October 27, admitting that he had received the uniforms from his supervisor, Bajilla, and handed them to Cader, who sold them at ZRP Harare Central lockers.\n\nInvestigators discovered that the thefts had been occurring in small amounts over a prolonged period. In an effort to avoid detection, Dziva allegedly instructed Cader to move the stolen shirts to a different location. However, the satchel was accidentally left in Chihambakwes vehicle, enabling police to recover the items.\n\nThe stolen uniforms were verified by PGHQ Clothing Factory experts based on their distinctive markings, fabric, colour, buttons, and construction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Three officers from the Zimbabwe Republic Police (ZRP) General Headquarters have appeared in Harare Magistrates’ Court accused … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/three-cops-in-trouble-for-stealing-police-uniforms/\">Continue reading<span class=\"screen-reader-text\"> \"Three Cops In Trouble For Stealing Police Uniforms\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "ZiG Stability’ Nothing But Empty Talk, Say Frustrated Zimbabweans",
            "url": "https://www.zimeye.net/2025/10/31/zig-stability-nothing-but-empty-talk-say-frustrated-zimbabweans/",
            "content": "By A Correspondent\n\nThe Reserve Bank of Zimbabwe (RBZ) has come under fire for claiming that the gold-backed ZiG currency means business and that the future is rock solid. Many citizens say the central banks optimistic tone is far removed from the economic hardship they face daily.\n\nIn a statement released on Wednesday, the RBZ said, Month-on-month ZiG inflation has remained relatively low and stable in recent months, averaging 0.6%, attesting to ZiG stability. The bank also boasted that the Willing-Buyer-Willing-Seller interbank exchange rate remained largely stable against the US dollar, and that this had increased availability of forex and contained the parallel market premium.\n\nBut ordinary Zimbabweans are far from convinced. Across the country, the local currency continues to lose public confidence, with most people still preferring to transact in US dollars.\n\nStability only exists on paper, said one teacher from Masvingo. Prices keep changing, and no one trusts the ZiG when buying essentials.\n\nA businessman added, They say inflation is low, but every week something goes uptransport, food, rent. If this is stability, then its meaningless.\n\nDespite RBZ claims that low monthly inflation keeps prices steady allowing Zimbabweans to manage their budgets, savings, and planning with more certainty, many say there is nothing certain about their economic reality.\n\nShops, fuel stations, and landlords continue to demand foreign currency, making it nearly impossible for those earning in ZiG to survive. The moment you get paid, the money starts losing value, said another frustrated worker. How can you plan for the future when your currency doesnt hold?\n\nThe central bank insists that a stable ZiG and consistent exchange rate show that the currency is holding its value over time, yet the parallel market still dictates prices, exposing the weakness behind the official numbers.\n\nWhile authorities celebrate what they call key facts indicating stability, many citizens see it as empty rhetoric meant to mask an economy still struggling under inflation, poor confidence, and chronic dependency on the US dollar.\n\nFor most Zimbabweans, the supposed ZiG stability remains nothing more than a government illusiona glossy narrative masking a harsh, uncertain reality.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Reserve Bank of Zimbabwe (RBZ) has come under fire for claiming that the gold-backed ZiG currency … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/zig-stability-nothing-but-empty-talk-say-frustrated-zimbabweans/\">Continue reading<span class=\"screen-reader-text\"> \"ZiG Stability’ Nothing But Empty Talk, Say Frustrated Zimbabweans\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Army Coup Tanks Spotted In Harare",
            "url": "https://www.zimeye.net/2025/10/31/army-coup-tanks-spotted-in-harare/",
            "content": "By A Correspondent-Several Zimbabwe National Army (ZNA) tanks were spotted in Harare on Friday, reviving chilling memories of the dramatic November 2017 coup that toppled long-time ruler Robert Mugabe after nearly four decades in power.\n\nThe convoy of armoured vehicles was seen moving along Harare Drive towards the city centre, drawing public attention and igniting fears of renewed military involvement in politics. It seems the military has started conducting drills every month, but in preparation for what? a post on the popularCrime Watchsocial media platform read. This morning, I spotted a convoy of military vehicles moving along Harare Drive.\n\nThe unusual movement of military hardware comes amid escalating tensions within the ruling ZANU PF party, following the just-ended annual conference in Mutare, which endorsed President Emmerson Mnangagwas controversial Vision 2030 agenda and effectively sidelined Vice President Constantino Chiwengas long-held presidential ambitions.\n\nAt the Mutare conference, a senior Central Intelligence Organisation (CIO) officer and ZANU PF member was arrested for attempting to smuggle a firearm into the venue, further heightening the already charged atmosphere.\n\nThe incident, according to insiders, exposed deep mistrust within Mnangagwas inner circle and the growing rift between military-aligned factions loyal to Chiwenga and those rallying behind Mnangagwa.\n\nThe MnangagwaChiwenga succession feud dates back to the aftermath of the 2017 coup.\n\nAt the time, the two men reportedly entered into a gentlemens agreement that Mnangagwa would serve a single term before handing over power to Chiwenga, who was then the commander of the Zimbabwe Defence Forces and the public face ofOperation Restore Legacy.\n\nHowever, Mnangagwas decision to extend his rule beyond 2023, and now to seek to remain in power until 2030, has shattered that pact.\n\nChiwenga, whose influence within the military remains significant, has since been systematically weakened through cabinet reshuffles, the retirement of key generals loyal to him, and the elevation of Mnangagwas allies in both the army and party structures.\n\nAnalysts say this gradual sidelining of Chiwengas faction has intensified factional suspicion, with the militarys movements in Harare this week rekindling fears of renewed instability.\n\nThe last time armoured tanks rolled into Harare, the military insisted it was not staging a coup but was merely targeting criminals around the president. Within days, Mugabe was forced to resign, paving the way for Mnangagwas rise to power.\n\nEight years later, the sight of tanks again on Harares streets is fuelling speculation that the uneasy alliance forged in 2017 between Mnangagwa and Chiwenga has all but collapsed  and that the military, still the ultimate arbiter of political power in Zimbabwe, may be preparing for yet another decisive intervention.\n\nhttps://www.facebook.com/reel/1378000113836894\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Several Zimbabwe National Army (ZNA) tanks were spotted in Harare on Friday, reviving chilling memories of the dramatic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/army-coup-tanks-spotted-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Army Coup Tanks Spotted In Harare\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Gutu Villagers “Reject” Auxillia Mnangagwa Rice Donation",
            "url": "https://www.zimeye.net/2025/10/31/gutu-villagers-reject-auxillia-mnangagwa-rice-donation/",
            "content": "By A Correspondent\n\nVillagers in Gutu South have expressed anger and disappointment over a rice donation distributed during First Lady Auxillia Mnangagwas Gota/Nhanga program held recently at Maungwa School, accusing authorities of offering useless relief instead of meaningful agricultural support.\n\nResidents said they had expected farming inputs such as maize seed to prepare for the rainy season, not small bags of rice that would only last a few days.\n\nWe were told to come for a development program, only to be handed a few cups of rice, said a villager from Mawere area. This is not what we need. The rains are coming, and we have no seed to plant. Rice wont help us feed our families in the long run.\n\nFrom Mugoni area, another villager expressed frustration, saying the donation felt more like a political show than genuine assistance. People here are hungry and struggling. What will a handful of rice do? Its better if they bring seed or fertilizer so we can work for ourselves.\n\nA villager from Mukaro area echoed similar sentiments, warning that handouts were creating dependency. These donations make people idle, the villager said.\n\nWe want empowerment, not charity. The government should focus on helping us produce food, not giving us leftovers.\n\nThe rice distribution, part of the First Ladys community outreach initiative, has sparked debate in the district, with many questioning the sustainability and purpose of such programs in rural communities already facing economic hardship and poor harvests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Villagers in Gutu South have expressed anger and disappointment over a rice donation distributed during First Lady … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/gutu-villagers-reject-auxillia-mnangagwa-rice-donation/\">Continue reading<span class=\"screen-reader-text\"> \"Gutu Villagers “Reject” Auxillia Mnangagwa Rice Donation\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Zanu PF Launches “Top Soup 4ED” Affiliate",
            "url": "https://www.zimeye.net/2025/10/31/zanu-pf-launches-top-soup-4ed-affiliate/",
            "content": "By A Correspondent\n\nZanu PF has reportedly launched a new affiliate called Top Soup 4ED, a name loosely interpreted to mean women ready to provide pleasure on behalf of Mnangagwa. Critics have raised concerns over the name, questioning whether it denigrates women and treats them as mere instruments for political gain.\n\nA video circulating online shows a young woman wearing a T-shirt with the words Top Soup 4ED, fueling debate about the groups intentions and messaging.\n\nThis appears to be yet another Zanu PF affiliate reportedly established to support President Emmerson Mnangagwas 2030 Agenda. Observers suggest the move is part of broader efforts to consolidate power and potentially extend his term of office beyond constitutional limits.\n\nWatch: Top Soup 4ED VideoAnother Zanu PF affiliate emerges? Top Soup 4ED is yet another affiliate reportedly launched to prop up President Emmerson Mnangagwa's 2030 AgendaVideo: Top Soup 4EDpic.twitter.com/FxiErPHfMX\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF has reportedly launched a new affiliate called Top Soup 4ED, a name loosely interpreted to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/zanu-pf-launches-top-soup-4ed-affiliate/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Launches “Top Soup 4ED” Affiliate\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Prophet Passion Java’s “Luxury” Pharaoh Costume Exposed — It Costs Just US$23 Online",
            "url": "https://www.zimeye.net/2025/10/31/prophet-passion-javas-luxury-pharaoh-costume-exposed-it-costs-just-us23-online/",
            "content": "By ZimEye Lifestyle Desk | October 31, 2025\n\nFlamboyant preacher and self-styled prophet Passion Java has once again found himself trending for all the wrong reasons  this time after claiming his outfit cost more than musician Baba Harares annual rent, only for internet users to expose that the exact costume is selling for just US$23 on Temu.\n\nIn a Facebook post that quickly went viral, Java boasted:\n\nCost ye makeup iyo inobhadhara rent ya Baba Harare ye Gore rese!!!\n\n(The cost of my makeup alone can pay Baba Harares rent for a whole year!!!)\n\nHe went on to taunt the Theresa hitmaker as Winky Ds curtain raiser, drawing thousands of laughing reactions and comments from fans and critics alike.\n\nHowever, the self-proclaimed prophets lavish claims were soon deflated when sharp-eyed social media users discovered his Pharaoh outfit listed on Temu and other online stores for a mere US$23.38  complete with free shipping.\n\nOne Facebook user mockingly captioned side-by-side photos of Java and the Temu listing:\n\nPane azongo dzizoomer ku Temu,\n\nwhich loosely translates to Someone just zoomed in on Temu.\n\nThe online costume, marketed as an Egyptian Pharaoh King Outfit, is a popular Halloween item made from polyester and faux gold accents  a far cry from the image of opulence Java tried to project.\n\nCommenters were merciless:\n\nThe incident has reignited debate about social media deception and fake wealth displays among Zimbabwes celebrity preachers. Java, known for flaunting designer brands, luxury cars, and private jets, has often courted controversy with ostentatious displays that critics say mask a deeper culture of performance and vanity.\n\nMeanwhile, Baba Harare, who was the butt of Javas joke, has so far remained silent  leaving fans to draw their own conclusions as the Temu receipts continue circulating across social platforms.\n\nZimEye Lifestyle Sidebar: What US$23 Can Buy in Zimbabwe vs. Passion Javas Pharaoh Costume\n\nBottom Line:\n\nWhile Passion Java may have dressed like an Egyptian king, the internet has crowned him King of Temu  proving once again that in the digital age, even prophets cant escape a quick reverse image search.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By ZimEye Lifestyle Desk | October 31, 2025 Flamboyant preacher and self-styled prophet Passion Java has once again found himself … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/prophet-passion-javas-luxury-pharaoh-costume-exposed-it-costs-just-us23-online/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Passion Java’s “Luxury” Pharaoh Costume Exposed — It Costs Just US$23 Online\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        },
        {
            "title": "Mnangagwa Minister Questions Ban on Corporal Punishment Amid Rising Indiscipline in Schools…",
            "url": "https://www.zimeye.net/2025/10/31/mnangagwa-minister-questions-ban-on-corporal-punishment-amid-rising-indiscipline-in-schools/",
            "content": "By A Correspondent\n\nPrimary and Secondary Education Minister Torerayi Moyo has suggested that the governments decision to ban corporal punishment in schools may have been misguided.\n\nMoyos comments come amid growing concerns that teachers feel powerless to maintain discipline in classrooms, with some students reportedly bullying educators under the guise of asserting their rights.\n\nResponding to a trade unionist advocating for the reinstatement of corporal punishment this week, Moyo acknowledged the challenges teachers face. He said:\n\nI truly wonder if we havent erred too far in the name of progress. The classroom, once a place of order and respect, has become a battleground where our frontline educators are stripped of the authority to instill discipline.\n\nWe are witnessing a troubling shift  a Grade 7 learner now dares to bully a teacher, invoking rights without understanding responsibility.\n\nLet us be honest. The erosion of discipline in our schools is not just an educational issue; it is a societal one. Broken families, economic hardship, and the loss of communal values have left many children without guidance. The teacher, once supported by the community, now stands alone.\n\nMoyo clarified that he is not advocating for violence but believes authorities should reconsider methods that once helped shape responsible citizens.\n\nA stick in time saves nine, as our elders say. This is not about punishment. It is about correction, about restoring balance, he said. Many traditional leaders and lawmakers have echoed this call. We must explore a legal framework that allows for firm, fair discipline without abuse.\n\nLet us not allow misguided interpretations of rights to dismantle the foundation of learning. Discipline is not oppression; it is preparation for life. And if we do not act, we risk raising a generation that respects neither authority nor consequence.\n\nCurrently, corporal punishment in schools is prohibited under Zimbabwean law. A 2017 High Court ruling declared corporal punishment of children unconstitutional, citing protections against cruel, inhuman, or degrading treatment. The Education Amendment Act (2020) reinforced this by explicitly banning corporal punishment and ensuring children are not subjected to physical or psychological abuse.\n\nDespite the legal ban, reports suggest corporal punishment persists in some areas, as cultural and traditional attitudes toward discipline continue to clash with the law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Primary and Secondary Education Minister Torerayi Moyo has suggested that the government’s decision to ban corporal punishment … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/31/mnangagwa-minister-questions-ban-on-corporal-punishment-amid-rising-indiscipline-in-schools/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister Questions Ban on Corporal Punishment Amid Rising Indiscipline in Schools…\"</span></a></p>",
            "time": "09:08",
            "date": "01 Nov 2025"
        }
    ]
}