{
    "news": [
        {
            "title": "Chimene Edges Closer to Tangawarimwa’s Record After Fifth Referee of the Year Award",
            "url": "https://www.zimeye.net/2025/12/08/chimene-edges-closer-to-tangawarimwas-record-after-fifth-referee-of-the-year-award/",
            "content": "Sports Correspondent  Brighton Chimene is steadily closing in on legendary referee Felix Tangawarimwas long-standing record after securing his fifth Referee of the Year award on Friday.\n\nChimenes latest honour puts him just three awards behind Tangawarimwa, who remains the all-time leader with eight accolades.\n\nThe milestone strengthens Chimenes position as one of the most consistent and respected match officials in local football.\n\nWith his reputation growing each season, many in the football community believe Chimene is on course to challenge  and possibly surpass  Tangawarimwas remarkable legacy if he maintains his current trajectory.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Brighton Chimene is steadily closing in on legendary referee Felix Tangawarimwa’s long-standing record after securing his fifth … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/chimene-edges-closer-to-tangawarimwas-record-after-fifth-referee-of-the-year-award/\">Continue reading<span class=\"screen-reader-text\"> \"Chimene Edges Closer to Tangawarimwa’s Record After Fifth Referee of the Year Award\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "Vemuganga FM Honoured For Championing Girls’ Rights And Fighting New HIV Infections",
            "url": "https://www.zimeye.net/2025/12/08/vemuganga-fm-honoured-for-championing-girls-rights-and-fighting-new-hiv-infections/",
            "content": "By Claris Madhuku| In a major endorsement of the power of grassroots journalism, Vemuganga Community Radio Station (Vemuganga FM 106.8) was last week honoured with a Recognition Award by the AIDS Healthcare Foundation (AHF) for its outstanding contribution to raising awareness on issues affecting girls and young women in Manicaland Province.\n\nThe award was presented during a colourful ceremony held in Mutare on 4 December 2025.\n\nAHFs recognition comes at a critical time. New research by ZAN in Chipinge shows a worrying rise in new HIV infections among teenagers aged 1019, with the highest concentration among young women aged 2024. Experts warn that the surge is driven by structural vulnerabilities, including transactional relationships, school dropouts linked to early pregnancies, lack of information, and various forms of sexual exploitation.\n\nAgainst this backdrop, AHF praised Vemuganga Community Radio as a powerful example of how community media can drive behaviour change, uplift grassroots experiences, and hold duty-bearers accountable.\n\nVemuganga Community Radio has shown us the true power of local storytelling. At a time when teenagers are facing rising HIV infections, this station has become a protective shieldeducating, inspiring, and mobilising communities to act. AHF Representative confirmed at the Award Ceremony in Mutare.\n\nThe stations programming has been instrumental in debunking harmful myths, promoting HIV testing, and raising awareness about prevention tools such as PrEP, condoms, early treatment, and safe relationships. By ensuring these messages reach deep-rural audiences, Vemuganga is equipping young women with the knowledge needed to protect themselves.\n\nFor the Vemuganga team, the award is both a celebration and a call to action. Vemuganga FM Board ChairpersonMr. Robinson Peyisai Nyakurwaexpressed profound gratitude, saying:\n\nThis award is not just for Vemuganga Radio, it belongs to the girls and young women whose voices we elevate every day. We will continue shining a light on issues that matter, and we stand ready to help reverse the tide of new HIV infections in our communities.\n\nAs Manicaland continues to grapple with persistent cases of child marriages, teen pregnancies, and rising HIV infections among teenagers, Vemuganga Community Radio stands as a beacon of hopeproving that information is power, and that empowered communities can protect their children and shape a healthier future.\n\nVemuganga Community Radio has set itself apart with hard-hitting features, survivor testimonies, youth-led conversations, and policy dialogues that have sparked essential public debate. Its reporting has helped shift community attitudes, expose enablers of child marriages, and inspire protective interventions led by parents, traditional leaders, and local institutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Claris Madhuku| In a major endorsement of the power of grassroots journalism, Vemuganga Community Radio Station (Vemuganga FM 106.8) … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/vemuganga-fm-honoured-for-championing-girls-rights-and-fighting-new-hiv-infections/\">Continue reading<span class=\"screen-reader-text\"> \"Vemuganga FM Honoured For Championing Girls’ Rights And Fighting New HIV Infections\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "Despite Political Heat, Gen Chiwenga Stands Out for Humility and Service",
            "url": "https://www.zimeye.net/2025/12/08/despite-political-heat-gen-chiwenga-stands-out-for-humility-and-service/",
            "content": "Tinashe Sambiri A Catholic priest has praised Vice President Dr Constantino Chiwenga for his unwavering dedication to both his family and the church, describing his example as a model for nurturing spiritual growth and reinforcing social cohesion.\n\nFather Victor Bushu of the Roman Catholic Church made the remarks over the weekend during celebrations marking VP Chiwengas graduation from the first stage of the Guild, a program dedicated to embodying the virtues of St Joseph, particularly love and the protection of family.\n\nVP Chiwenga graduated alongside five of his sons, with his wife, Colonel Miniyothabo Chiwenga, in attendance. The induction included Dr Kudzai Chiwenga and Messrs Gamuchirai Chiwenga, Tawanda Chiwenga, Kudakwashe Chiwenga, and Takudzwa Chiwenga.\n\nWhat makes his achievements even more remarkable is that he is living out the churchs teachings alongside his family as they graduate together, said Father Bushu. The teachings of St Joseph highlight the significance of love and care within the family, and there is no better way to embody this than by raising children in a faith-filled environment. Such commitment nurtures not only spiritual growth but also strengthens family bonds.\n\nCatechist Mr Alois Makwembere also lauded the Vice Presidents dedication. He truly set an exemplary standard; it was apparent that his role as Vice President did not define him, said Mr Makwembere. He approached every task with humility and dedication, fulfilling all the requirements to advance to the next stage with remarkable competence.\n\nVP Chiwenga has publicly emphasized that his close ties to the Roman Catholic Church and his spiritual convictions remain his central motivation in life, guiding his service to the nation with honesty and selfless dedication.\n\nHis steadfastness comes amid growing political tension, with critics calling for the extension of President Emmerson Mnangagwas term beyond constitutional limitsa situation that has placed Chiwenga under intense scrutiny.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– A Catholic priest has praised Vice President Dr Constantino Chiwenga for his unwavering dedication to both his family … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/despite-political-heat-gen-chiwenga-stands-out-for-humility-and-service/\">Continue reading<span class=\"screen-reader-text\"> \"Despite Political Heat, Gen Chiwenga Stands Out for Humility and Service\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "Chimombe, Mpofu Launch Supreme Court Appeal",
            "url": "https://www.zimeye.net/2025/12/08/chimombe-mpofu-launch-supreme-court-appeal/",
            "content": "VIDEO LOADING BELOW\n\nWe are challenging the conviction itself, Mike Chimombe and Moses Mpofu lawyers announce outside court.https://t.co/E1juSuEOKkpic.twitter.com/eHez4tJG9n\n\nBy Court Correspondent | ZimEye |  BREAKING NEWS: Chimombe & Mpofu JAILED  Judge Sets 20-Year Fraud Benchmark, Adds Extra Years for Aggravation\n\nHigh Court Judge Justice Pisirayi Kwenda has handed down stiff prison sentences to controversial businessmen Moses Mpofu and Mike Chimombe, jailing them 22 years and 17 years respectively for defrauding the Zimbabwean government of US$7.3 million under the failed Presidential Goat Scheme.\n\n Sentences at a GlanceMoses Mpofu: 22 years  15 years effective 3 years suspended for good behaviour 4 years suspended on restitution conditionsMike Chimombe: 17 years  12 years effective 3 years suspended for good behaviour 2 years suspended on restitution of US$964,024\n\nJustice Kwenda declared the presumptive sentence for the scale of this public fraud to be 20 years, and Mpofus aggravating circumstances warranted going beyond that, due to his role in orchestrating the crime, lack of remorse, and failure to account for missing funds.\n\n Key Court Findings:The pair acted as co-perpetrators using forged documents to win a goat supply tender through their company Blackdeck Pvt Ltd.Only 4,000 goats were delivered out of the 85,000 promised.US$7.3 million was paid out, with no accounting or valid documentation to show where it went.Public funds were stolen, trust was abused, and no funds were voluntarily reimbursed.Chimombe was ruled to have played a leading role, contrary to his claim of being a mere side player.\n\n Justice Kwenda:\n\nThe prejudice was about US$26 million The actual loss was high, and the potential even greater. The offence breached public trust and was committed under aggravating circumstances.\n\nThough Chimombe apologised to President Emmerson Mnangagwa and the nation, the judge found Mpofus attitude less sincere and his mitigation weaker.\n\n What This Really MeansWhile the court focused on the goat fraud, public suspicion still simmers over the duos leaked documents that exposed a US$100 million election ballot printing scandal linked to President Mnangagwa and business tycoon Wicknell Chivayo. That leakwidely shared across the countrydiscredited the 2023 election, triggering SADC condemnation.\n\n OPINIONAnalysts believe this sentencing was more than just about goatsit was a political message to silence those who shine a light where power prefers darkness.\n\nAs the dust settles, Zimbabweans are left wondering:Is justice truly blind, or just tightly bound to the throne?\n\n#BreakingNews #ChimombeMpofuJailed #GoatScandal #ZimJustice #BallotGate #WicknellLeaks #Chivayo #Mnangagwa #Corruption #ZACC #Blackdeck #ZimbabweNews\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW By Court Correspondent | ZimEye | 🔴 BREAKING NEWS: Chimombe & Mpofu JAILED — Judge Sets 20-Year … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/chimombe-mpofu-launch-supreme-court-appeal/\">Continue reading<span class=\"screen-reader-text\"> \"Chimombe, Mpofu Launch Supreme Court Appeal\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "JUST IN: Mike Chimombe, Moses Mpofu Full Jail Terms",
            "url": "https://www.zimeye.net/2025/12/08/just-in-mike-chimombe-moses-mpofu-full-jail-terms/",
            "content": "By Court Correspondent  Business partners Moses Mpofu and Mike Chimombe will together serve 27 years behind bars after the High Court convicted them of orchestrating a multimillion-dollar fraud under the Presidential Goat Pass-On Scheme, a rural empowerment initiative meant to uplift vulnerable communities.\n\nJustice Pisirayi Kwenda sentenced Mpofu to 22 years, suspending three years on condition of good behaviour and a further four years on condition of restitution, leaving him with an effective 15-year term. Chimombe received 17 years, with three years suspended on condition he does not commit another dishonesty-related offence, and two more suspended upon payment of US$964,000 in restitution, resulting in an effective 12-year sentence. Both men have filed notices of appeal against conviction and sentence.\n\nThe convictions stem from the 2021 Presidential Goat Project, which aimed to supply 85,000 breeding goats to poor rural households to improve food security and income generation. In 2022, Government paid ZWL1.6 billion  then equivalent to US$7.7 million  to Blackdeck Pvt Ltd, a company jointly controlled by Mpofu and Chimombe, to deliver the livestock. By year-end, only 4,208 goats worth US$331,445 had been supplied. Operations were halted thereafter, leaving a staggering shortfall of more than 103,000 goats and a public loss calculated at US$7.38 million.\n\nThe State successfully proved that the two businessmen misrepresented their capacity to fulfil the tender, submitting forged ZIMRA and NSSA compliance certificates to win the contract. Evidence presented during trial showed that instead of procuring livestock, they diverted large portions of the funds for personal and unrelated business activities. This deception fundamentally crippled a project designed to benefit some of the poorest families in Zimbabwe.\n\nIn his judgment, Justice Kwenda stressed that fraud involving public funds demanded stern punishment, noting that the presumptive starting point in cases of this magnitude is 20 years imprisonment. He said the pairs conduct revealed a serious abuse of public trust, citing the sheer scale of the financial prejudice, the calculated nature of the fraud, and the deliberate use of falsified documents to mislead government authorities. The judge emphasised that the national interest required a strong deterrent, particularly where corruption undermines social programmes meant to alleviate poverty.\n\nProsecutor Whisper Mabhaudhi had earlier urged the court to impose sentences of up to 35 years, arguing that the duo stole from the poorest of the poor and that anything less than a severe custodial term would betray justice and erode confidence in public institutions. The case has sparked widespread public anger, with many Zimbabweans viewing the prosecution as a rare test of whether the justice system is willing to hold well-connected business figures accountable.\n\nMpofu and Chimombes fall from grace has intensified scrutiny on the awarding of government tenders and raised questions about systemic weaknesses that enable large-scale procurement fraud. The Goat Pass-On Scheme, marketed as a key pillar of rural resilience, now stands as a cautionary example of how corruption can derail development projects and deepen mistrust in State programmes.\n\nThe sentencing of the two businessmen is one of the most consequential rulings in recent years involving the misuse of public resources. As the nation awaits the outcome of their appeal, debate continues over whether this verdict marks a turning point in the fight against elite corruption or simply a response to a scandal too significant to ignore.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Court Correspondent — Business partners Moses Mpofu and Mike Chimombe will together serve 27 years behind bars after the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/just-in-mike-chimombe-moses-mpofu-full-jail-terms/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Mike Chimombe, Moses Mpofu Full Jail Terms\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "Mpofu Jailed 15 Years, Chimombe 12 After Goat Scheme Fraud Conviction",
            "url": "https://www.zimeye.net/2025/12/08/mpofu-jailed-15-years-chimombe-12-after-goat-scheme-fraud-conviction/",
            "content": "By A Correspondent -High Court Justice Pisirayi Kwenda has handed down heavy prison terms to Moses Mpofu and Mike Chimombe following their conviction for defrauding the State of more than US$7 million under the Presidential Goat Pass-On Scheme.\n\nMpofu was sentenced to 22 years behind bars, with seven years suspended  three on condition of good behaviour and four on condition of restitution  leaving him with an effective 15 years to serve.\n\nChimombe received a 17-year sentence, with five years suspended  three for good behaviour and two linked to restitution  resulting in an effective 12-year jail term.\n\nJustice Kwenda said the severity of the fraud warranted strong punishment, noting the massive loss to the State and the abuse of public trust.\n\nBoth Mpofu and Chimombe have indicated their intention to appeal both their convictions and sentences.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent -High Court Justice Pisirayi Kwenda has handed down heavy prison terms to Moses Mpofu and Mike Chimombe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/mpofu-jailed-15-years-chimombe-12-after-goat-scheme-fraud-conviction/\">Continue reading<span class=\"screen-reader-text\"> \"Mpofu Jailed 15 Years, Chimombe 12 After Goat Scheme Fraud Conviction\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "2030 Agenda : Mnangagwa Hoodwinks Masvingo Traditional Leaders With Heifers",
            "url": "https://www.zimeye.net/2025/12/08/2030-agenda-mnangagwa-hoodwinks-masvingo-traditional-leaders-with-heifers/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwa has once again attempted to buy loyalty from traditional leaders in Masvingo Province, distributing heifers under the so-called Presidential Livestock Empowerment Programme on Sunday.\n\nCritics say the handouts serve more as political theatre than genuine empowerment.\n\nTraditional leaders were quick to express gratitude, seemingly ignoring the broader issues affecting their communities. Today is a great day for us as traditional leaders in Masvingo, we received heifers from President Mnangagwa as part of his initiatives to empower us, Chief Mpapa said.\n\nPresident Mnangagwa is delivering all his promise and the most important one being no one and no place will be left behind. As Chiefs, we are happy that our lives have been transformed for the better, Chief Murinye added, overlooking persistent challenges such as poverty and lack of infrastructure in their districts.\n\nThe programme, touted as a means to improve rural livelihoods, appears to primarily benefit a select group of political allies. We have seen a lot happening in our communities from community gardens, poultry projects, goat schemes, the Pfumvudza Intwasa, all transforming the face of rural communities, Chief Chitenga said, though many ordinary villagers continue to struggle with limited access to these schemes.\n\nProvincial authorities hailed the cattle distribution as a boost for local herds and breeding programmes. As a province, we have got the largest herd and this development will boost livestock production in the province. Again the programme will enhance the lives of our traditional leaders, Masvingo Minister of State for Provincial Affairs and Devolution, Honourable Ezra Chadzamira said.\n\nZANU PF officials framed the gesture as swift delivery on campaign promises. The ZANU PF-led government is delivering its promise of empowering communities as we have witnessed today. Last week, President Mnangagwa promised empowerment to our traditional leaders and barely a week later, he has delivered, ZANU PF Masvingo Provincial Chairperson, Senator Robson Mavhenyengwa, said.\n\nAnalysts argue that while livestock handouts are highly visible, they do little to address systemic rural poverty, serving instead as a symbolic tool to secure political loyalty ahead of Vision 2030.\n\nEmmerson Mnangagwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa has once again attempted to buy loyalty from traditional leaders in Masvingo Province, distributing heifers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/2030-agenda-mnangagwa-hoodwinks-masvingo-traditional-leaders-with-heifers/\">Continue reading<span class=\"screen-reader-text\"> \"2030 Agenda : Mnangagwa Hoodwinks Masvingo Traditional Leaders With Heifers\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "UPDATED: Mpofu, Chimombe Caged 39 Years, Presumptive To 20 | BREAKING",
            "url": "https://www.zimeye.net/2025/12/08/updated-mpofu-chimombe-caged-39-years-presumptive-to-20-breaking/",
            "content": "By Court Correspondent | ZimEye |  BREAKING NEWS: Chimombe & Mpofu JAILED  Judge Sets 20-Year Fraud Benchmark, Adds Extra Years for Aggravation\n\nHigh Court Judge Justice Pisirayi Kwenda has handed down stiff prison sentences to controversial businessmen Moses Mpofu and Mike Chimombe, jailing them 22 years and 17 years respectively for defrauding the Zimbabwean government of US$7.3 million under the failed Presidential Goat Scheme.\n\n Sentences at a GlanceMoses Mpofu: 22 years  15 years effective 3 years suspended for good behaviour 4 years suspended on restitution conditionsMike Chimombe: 17 years  12 years effective 3 years suspended for good behaviour 2 years suspended on restitution of US$964,024\n\nJustice Kwenda declared the presumptive sentence for the scale of this public fraud to be 20 years, and Mpofus aggravating circumstances warranted going beyond that, due to his role in orchestrating the crime, lack of remorse, and failure to account for missing funds.\n\n Key Court Findings:The pair acted as co-perpetrators using forged documents to win a goat supply tender through their company Blackdeck Pvt Ltd.Only 4,000 goats were delivered out of the 85,000 promised.US$7.3 million was paid out, with no accounting or valid documentation to show where it went.Public funds were stolen, trust was abused, and no funds were voluntarily reimbursed.Chimombe was ruled to have played a leading role, contrary to his claim of being a mere side player.\n\n Justice Kwenda:\n\nThe prejudice was about US$26 million The actual loss was high, and the potential even greater. The offence breached public trust and was committed under aggravating circumstances.\n\nThough Chimombe apologised to President Emmerson Mnangagwa and the nation, the judge found Mpofus attitude less sincere and his mitigation weaker.\n\n What This Really MeansWhile the court focused on the goat fraud, public suspicion still simmers over the duos leaked documents that exposed a US$100 million election ballot printing scandal linked to President Mnangagwa and business tycoon Wicknell Chivayo. That leakwidely shared across the countrydiscredited the 2023 election, triggering SADC condemnation.\n\n OPINIONAnalysts believe this sentencing was more than just about goatsit was a political message to silence those who shine a light where power prefers darkness.\n\nAs the dust settles, Zimbabweans are left wondering:Is justice truly blind, or just tightly bound to the throne?\n\n#BreakingNews #ChimombeMpofuJailed #GoatScandal #ZimJustice #BallotGate #WicknellLeaks #Chivayo #Mnangagwa #Corruption #ZACC #Blackdeck #ZimbabweNews\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW By Court Correspondent | ZimEye | 🔴 BREAKING NEWS: Chimombe & Mpofu JAILED — Judge Sets 20-Year … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/updated-mpofu-chimombe-caged-39-years-presumptive-to-20-breaking/\">Continue reading<span class=\"screen-reader-text\"> \"UPDATED: Mpofu, Chimombe Caged 39 Years, Presumptive To 20 | BREAKING\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "The Real Sentence: Chimombe and Mpofu’s 39-Year Jail Baseline Is About What They Exposed, Not Just What They Stole",
            "url": "https://www.zimeye.net/2025/12/08/the-real-sentence-chimombe-and-mpofus-20-year-jail-baseline-is-about-what-they-exposed-not-just-what-they-stole/",
            "content": "By Dorrothy Moyo | When Justice Pisirayi Kwenda announced a 20-year starting point for sentencing convicted fraudsters Moses Mpofu and Mike Chimombe, the courtroom atmosphere was one of measured finality. On the surface, this was a reckoning for the US$7.7 million Presidential Goat Scheme fraud that saw the pair deliver only 4,000 out of 85,000 promised goats to poor rural communities.\n\nBut to reduce this saga to just a case of goat theft would be wilfully blind to the real magnitude of the political undercurrents now colliding at the heart of Zimbabwes ruling elite.\n\nThe Sentence Behind the Sentence\n\nWhat is being paraded as justice for rural Zimbabweans may, in reality, be political retribution dressed as legal procedure. Chimombe and Mpofus fate was sealed not by their fraud, but by their unforgivable leak: a bombshell expos implicating President Emmerson Mnangagwa and his ally Wicknell Chivayo in the 2023 election scandal involving over USD $100 million in allegedly corrupt ballot printing deals.\n\nThe leaked audio and documents  which circulated widely in mid-2023  pierced the veil of the Zimbabwean states democratic legitimacy, revealing what critics had long suspected: that the ZEC (Zimbabwe Electoral Commission) and Mnangagwas inner circle colluded to secure the presidency through fraud and offshore cash movements linked to election materials.\n\nThe whistleblowers? None other than Mpofu and Chimombe themselves  the same men now being handed potentially decades-long prison sentences. Their real crime was not only defrauding a goat scheme  but blowing open the backdoor dealings of a regime already condemned by SADC for electoral fraud.\n\nA Presidency in Disgrace\n\nIt is no coincidence that SADCs Election Observer Mission issued one of the most damning reports in the regions history after the 2023 Zimbabwean elections. The findings spoke of unjust voter suppression, shadowy procurement of ballots, and questionable results transmission processes.\n\nWhat the public didnt know until Mpofu and Chimombes leak was who benefitted  and how.\n\nTheir revelations laid bare how Wicknell Chivayo  then acting as a proxy and financier for Mnangagwas campaign  controlled the procurement of election materials through shadowy companies, receiving multimillion-dollar payments through offshore accounts in South Africa and Mauritius. Evidence showed that the money trail led straight into the heart of Mnangagwas campaign, casting a dark shadow over the legitimacy of the presidency itself.\n\nThe Price of Truth in a Captured State\n\nIt is critical to understand that Chimombe and Mpofu are no angels. They did commit a crime  and the US$7 million fraud must not be whitewashed.\n\nBut let us be clear: thieves are rarely sentenced this aggressively in Zimbabwean courts unless theyve touched nerve endings close to the State House. Many have stolen more. Few have served time. The rule of thumb? You stay free as long as your silence is intact.\n\nChimombe and Mpofu broke that rule. Their punishment is more about what they said  and whom they exposed  than it is about goats.\n\nThe 20-year baseline sentence announced by Justice Kwenda signals more than the weight of financial loss; it is a message to anyone inside the ZANU PF machinery who dares to cross the line from beneficiary to whistleblower.\n\nIt tells them: if you speak, you will be buried.\n\nMnangagwas Wounded Legacy\n\nPresident Mnangagwas second term is already haunted by a legitimacy crisis. The SADC condemnation, combined with a growing dossier of leaks from within his own ranks, now paints him as a president who rules through manipulation, loyalty-purchases, and fear  not popular mandate.\n\nAnd the irony? In trying to silence Chimombe and Mpofu through a judicial sledgehammer, the regime has only made their original leak even more credible. The message rings louder now: the ballot boxes of 2023 were drenched in scandal.\n\nConclusion: Goat Fraud Was the Cover Charge\n\nAs the nation watches two men walk into what may be decades in prison, we must remember this: in Zimbabwe, fraud is often a feature of politics  not a bug. What differentiates survivors from prisoners is not guilt or innocence, but whether they stay useful and quiet.\n\nChimombe and Mpofu failed on both counts.\n\nAnd in doing so, they committed the ultimate Zimbabwean political crime: they embarrassed the King.\n\nTheir sentence? Its not just 20 years  its a warning.\n\nAnd its not just to them  its to us all.\n\n#TheRealFraud #ZimJustice #ChimombeMpofu #MnangagwaBallotScandal #WicknellLeaks #SADCreport #ZimElections2023\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | When Justice Pisirayi Kwenda announced a 20-year starting point for sentencing convicted fraudsters Moses Mpofu and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/the-real-sentence-chimombe-and-mpofus-20-year-jail-baseline-is-about-what-they-exposed-not-just-what-they-stole/\">Continue reading<span class=\"screen-reader-text\"> \"The Real Sentence: Chimombe and Mpofu’s 39-Year Jail Baseline Is About What They Exposed, Not Just What They Stole\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        },
        {
            "title": "Tungwarara For Zanu PF Central Committee…",
            "url": "https://www.zimeye.net/2025/12/08/tungwarara-for-zanu-pf-central-committee-2/",
            "content": "Tinashe Sambiri Manicaland Provincial Executive Committee (PEC) has resolved to co-opt Paul Tungwarara into the Zanu PF Central Committee, marking a significant step for supporters of extending President Emmerson Mnangagwas tenure to 2030.\n\nThe move, approved over the weekend, was seen as a boost for those advocating for the constitutional amendment to prolong the Presidents rule. Dr Tungwarara, a known promoter of the extension, will now have a direct voice in the partys top decision-making body.\n\nA Zanu PF source in Manicaland said, Dr Tungwararas co-option into the Central Committee reflects his dedication to the partys objectives and his commitment to ensuring stability and continuity in leadership. It is a well-deserved recognition of his work at the provincial level.\n\nThe inclusion of Tungwarara into the Central Committee is expected to strengthen the faction pushing for the extension, signaling growing support within key party structures.\n\nZanu PF leaders have in the past emphasized that decisions regarding the tenure of President Mnangagwa will be taken collectively by the partys leadership, and Tungwararas co-option places him at the heart of these discussions.\n\nPaul Tungwarara\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Manicaland Provincial Executive Committee (PEC) has resolved to co-opt Paul Tungwarara into the Zanu PF Central Committee, marking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/08/tungwarara-for-zanu-pf-central-committee-2/\">Continue reading<span class=\"screen-reader-text\"> \"Tungwarara For Zanu PF Central Committee…\"</span></a></p>",
            "time": "09:13",
            "date": "09 Dec 2025"
        }
    ]
}