{
    "news": [
        {
            "title": "Six Perish In Another Horrific Crash At Kuwadzana Turn-Off",
            "url": "https://www.zimeye.net/2025/11/07/six-perish-in-another-horrific-crash-at-kuwadzana-turn-off/",
            "content": "By A Correspondent  The Zimbabwe Republic Police (ZRP) has confirmed a deadly road accident that took place on 6 November 2025 at the Kuwadzana Turn-Off, also known as Pamagetsi, along the Harare-Bulawayo Highway.\n\nAccording to police reports, a bus carrying 55 passengers bound for Bulawayo veered off the road and toppled onto its left side. Six passengers sustained injuries and were rushed to Parirenyatwa Hospital for treatment.\n\nAuthorities say investigations into the cause of the crash are ongoing, and further updates will be provided as more information becomes available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Republic Police (ZRP) has confirmed a deadly road accident that took place on 6 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/six-perish-in-another-horrific-crash-at-kuwadzana-turn-off/\">Continue reading<span class=\"screen-reader-text\"> \"Six Perish In Another Horrific Crash At Kuwadzana Turn-Off\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Community Calls for Urgent Safety Measures at Deadly Kuwadzana–Dzivarasekwa Intersection",
            "url": "https://www.zimeye.net/2025/11/07/community-call-for-urgent-safety-measures-at-deadly-kuwadzana-dzivarasekwa-intersection/",
            "content": "Kuwadzana/Dzivarasekwa  commonly known aspamagetsi has become a danger zone, with serious accidents occurring almost every week, some resulting in fatalities.\n\nResidents say the intersection has turned into a death trap due to speeding motorists and poor road design. The road from Bulawayo into Harare serves several high-traffic suburbs including Kuwadzana, Dzivarasekwa, Westlea, Warren Park, Belvedere, and the city centre. With no filter roads in or out of Harare like those in Bulawayo, traffic congestion has worsened, forcing many drivers to speed in an attempt to beat the rush.\n\nWe kindly request for humps between the Kuwadzana roundabout and the two deadly intersections before we lose more lives. That stretch of road must have a strict speed limit, reads a local appeal.\n\nResidents are calling on theCity of Harareand theMinistry of Local Governmentto urgently intervene. They also suggest thatKuwadzana 2 Police Stationbe equipped with a dedicated traffic section to help manage and monitor the growing crisis.\n\nContact:Chairman JB 0771 651 437[emailprotected] 7 November 2025\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Kuwadzana/Dzivarasekwa — commonly known as pamagetsi — has become a danger zone, with serious accidents occurring almost every week, some … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/community-call-for-urgent-safety-measures-at-deadly-kuwadzana-dzivarasekwa-intersection/\">Continue reading<span class=\"screen-reader-text\"> \"Community Calls for Urgent Safety Measures at Deadly Kuwadzana–Dzivarasekwa Intersection\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "AU Throws Tanzania’s Samia Suluhu Hassan Under The Bus",
            "url": "https://www.zimeye.net/2025/11/07/au-throws-tanzanias-samia-suluhu-hassan-under-the-bus/",
            "content": "By A Correspondent  The African Union (AU) Election Observation Mission has raised serious concerns over Tanzanias recent elections, held on 29 October 2025, stating that they fell short of international democratic standards.\n\nIn a preliminary statement released on 5 November, mission head Mokgweetsi Masisi said observers documented a series of irregularities, including voters receiving multiple ballot papers and cases of ballot box stuffing. He added that several of our monitors were asked to leave polling stations before the counting process was completed, undermining transparency.\n\nThe mission also highlighted restrictions on media outlets in the lead-up to the vote and noted that civil society organisations were obstructed from conducting voter education. On election day and in the days that followed, an internet shutdown further hindered the transparency and credibility of the polls.\n\nMasisi pointed out that the main opposition party, CHADEMA, boycotted the elections after the government failed to implement proposed electoral reforms, which significantly undermined competitiveness. He emphasised that constitutional reformssuch as independent oversight in appointing electoral commissioners and legal mechanisms to challenge presidential resultswere not enacted, weakening the electoral process.\n\nThe mission criticised the arrests and prosecution of opposition leaders and the disqualification of candidates, describing these actions as contributing to a restrictive political climate that curtailed fair electoral participation. Voting was also disrupted by violent protests, particularly on Election Day, creating security challenges for observers.\n\nObservers further noted that the electoral commission and other institutions were poorly prepared to manage ballot-stuffing incidents and ensure transparency during counting. The report reads:\n\nAt this preliminary stage, the Mission concludes that (a) the 2025 Tanzania General Elections did not comply with AU principles, normative frameworks, and other international obligations and standards for democratic elections; (b) the environment surrounding the electionsbefore, during, and immediately afterwas not conducive to peaceful conduct and acceptance of electoral outcomes; (c) the preparedness level of the electoral commission and other electoral institutions was inadequate to address the challenges that compromised the integrity of the elections.\n\nIn this regard, Tanzania should prioritise electoral and political reforms to address the root causes of its democratic and electoral challenges witnessed ahead of, during, and after the 2025 General Elections. Such reforms should be underpinned by transparent and accountable conduct by state institutions, inclusion and accommodation of divergent views, citizen participation, and the upholding and respect for human rights.\n\nDespite being declared the winner by a landslide, President Samia Suluhu Hassans victory was widely disputed. Opposition supporters accused the government of fraud, and protests over the exclusion of her main challengers turned deadly in several areas.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The African Union (AU) Election Observation Mission has raised serious concerns over Tanzania’s recent elections, held … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/au-throws-tanzanias-samia-suluhu-hassan-under-the-bus/\">Continue reading<span class=\"screen-reader-text\"> \"AU Throws Tanzania’s Samia Suluhu Hassan Under The Bus\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Mnangagwa Vows To Electrify Rural Schools By 2026—As Nation Remains in Darkness",
            "url": "https://www.zimeye.net/2025/11/07/mnangagwa-vows-to-electrify-rural-schools-by-2026-as-nation-remains-in-darkness/",
            "content": "By A Correspondent  President Emmerson Mnangagwa has once again announced a bold plan to electrify all rural schools by 2026. While ZANU-PF hailed the pledge as a landmark initiative, critics warn that it highlights a persistent gap between political promises and reality on the ground.\n\nZANU-PF said on Thursday, Under President Mnangagwas visionary leadership, Zimbabwe is on the path to transformation. He is ensuring that every rural child will have access to modern learning tools and a bright future. This initiative is a testament to his unwavering commitment to development, turning our villages into hubs of innovation and opportunity.\n\nHowever, opposition figures and rural educators argue that many schools remain in dire conditions, lacking electricity, basic classrooms, and other critical infrastructure. Teachers report that students still rely on candles and firewood to study after dark, raising doubts about the feasibility of the 2026 deadline.\n\nObservers note that while the electrification pledge is positioned as a cornerstone of Vision 2030, the reality for most rural communities is starkly different. Some argue that such announcements are increasingly used as political propaganda to glorify Mnangagwa rather than deliver tangible improvements.\n\nAs rural Zimbabweans continue to struggle with under-resourced schools, critics say the Presidents promise remains largely symbolica bright headline overshadowing the persistent darkness in classrooms across the countryside.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has once again announced a bold plan to electrify all rural schools by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/mnangagwa-vows-to-electrify-rural-schools-by-2026-as-nation-remains-in-darkness/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Vows To Electrify Rural Schools By 2026—As Nation Remains in Darkness\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Bulawayo Man Takes Mnangagwa To Court Over Extension Of Presidential Term Of Office",
            "url": "https://www.zimeye.net/2025/11/07/bulawayo-man-takes-mnangagwa-to-court-over-extension-of-presidential-term-of-office/",
            "content": "By A Correspondent  A Bulawayo-based human rights activist has approached the Constitutional Court in a bold move to stop what he describes as an unconstitutional attempt by ZANU-PF to prolong President Emmerson Mnangagwas tenure beyond the 2028 limit.\n\nMbuso Fuzwayo, secretary of the advocacy group Ibhetshu Likazulu, filed the court application naming the ruling party as the primary respondent. Also listed are key government figures, including Justice Minister Ziyambi Ziyambi, Parliamentary Speaker Jacob Mudenda, Attorney General Virginia Mabiza, and President Mnangagwa, all in their official capacities.\n\nThe legal challenge targets ZANU-PFs Resolution Number 1 of 2024, passed at its National Peoples Conference in Bulawayo last October. The resolution explicitly calls for the presidents term to be extended beyond 2028 to 2030 and instructs both the party and government to initiate constitutional amendments to make this possible. The directive was later reiterated at the 2025 party conference in Mutare, which criticised the lack of progress and urged the Secretary of Legal Affairs and Justice Minister to ensure full implementation ahead of the 2026 conference.\n\nIn his founding affidavit, Fuzwayo claims the resolution presents a real and imminent threat to constitutional governance and infringes upon his fundamental rights. He is therefore seeking direct access to the Constitutional Court to halt any steps toward its implementation.\n\nIf the court grants leave for direct access, Fuzwayo plans to request an interdiction preventing respondents from acting on the resolution until the matter is decided. He also seeks a declaration confirming that sections 95(2)(b) and 143(1) of the Constitution establish presidential and parliamentary term limits under sections 328(1) and 328(7), and that enforcing ZANU-PFs resolution would violate his rights under sections 3, 56, and 67.\n\nCentral to his argument is Section 328, which governs constitutional amendments. On legal advice, Fuzwayo contends that presidential and parliamentary term provisions are protected term-limit provisions, making any extension without a public referendum unconstitutional.\n\nIbhetshu Likazulu, through its vice-chairperson Thamsanqa Ncube, formally aligned itself with Fuzwayos stance, highlighting the groups commitment to safeguarding the Constitution from violations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A Bulawayo-based human rights activist has approached the Constitutional Court in a bold move to stop … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/bulawayo-man-takes-mnangagwa-to-court-over-extension-of-presidential-term-of-office/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Man Takes Mnangagwa To Court Over Extension Of Presidential Term Of Office\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Just In: Job Sikhala Arrested in South Africa Over Alleged Explosives",
            "url": "https://www.zimeye.net/2025/11/07/just-in-job-sikhala-arrested-in-south-africa-over-alleged-explosives/",
            "content": "By A Correspondent  Opposition politician Job Sikhala has reportedly been arrested in South Africa on allegations of possessing explosives.\n\nTransform Zimbabwe leader Jacob Ngarivhume confirmed the development on Friday afternoon, alleging that Sikhala was a victim of a setup.\n\nI have been informed that Job Sikhala has been arrested in South Africa, Ngarivhume said. Mai Sikhala told me that while Job was at a meeting last night, one of his hosts asked to check something in his car. He took the keys and went away. He returned after about thirty minutes and suggested that they all leave the meeting because it was getting late.\n\nAccording to Ngarivhume, Sikhala was later stopped by police while driving from the venue.\n\nJob then got into the car he was using. As they were on their way, police stopped them and searched the vehicle, he explained. They reportedly found planted explosives, and he was immediately arrested. He is currently being held at a local police station in Pretoria.\n\nNgarivhume said both Zimbabwean and South African lawyers were now involved in the matter.\n\nLawyers have been dispatched from Zimbabwe to assist him, while South African lawyers are already on the case, he added.\n\nHe further accused regional actors of working with Harare to suppress dissenting voices.\n\nThis shows how the regime is desperately networking with regional bodies to fight those who are opposed to the corrupt and illegal 2030 agenda, Ngarivhume said.\n\nSouth African authorities have not yet issued an official statement on the alleged arrest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Opposition politician Job Sikhala has reportedly been arrested in South Africa on allegations of possessing explosives. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/just-in-job-sikhala-arrested-in-south-africa-over-alleged-explosives/\">Continue reading<span class=\"screen-reader-text\"> \"Just In: Job Sikhala Arrested in South Africa Over Alleged Explosives\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Hip Hop Star Named In Magaya Scandals",
            "url": "https://www.zimeye.net/2025/11/07/hip-hop-star-named-in-magaya-scandals/",
            "content": "By A Correspondent  Hip Hop Star Ti Gonzi, real name, Tinashe Gonzara, has been named in a case in which Prophet Walter Magayas aide, who assaulted a police officer and is now detained alongside him, smuggled a car.\n\nThe aide, Tapiwa Felix Chikondo, appeared before Harare regional magistrate Francis Mapfumo this week, facing charges of smuggling and fraud. He was not asked to plead and was released on US$600 bail pending trial.\n\nThe complainant in the matter is the Zimbabwe Revenue Authority (ZIMRA), represented by revenue supervisor Collins Ncube, while Lancelot Mutsokoti appeared for the State.\n\nAccording to the prosecution, Chikondo  a security aide at Prophet Magayas PHD Ministries  allegedly smuggled a Toyota Mark X from Japan between July and August 2024 and later sold it to Ti Gonzi. The vehicle is said to have been parked at Yadah Hotel in Waterfalls, one of Magayas flagship properties.\n\nThe State alleges that Chikondo identified another vehicle, registration number ABX 7852, which was registered under a man named Dumisani Dube. He then allegedly used that cars registration details to fraudulently obtain new number plates for his smuggled vehicle  which had not been cleared through ZIMRA and had no import duty paid.\n\nChikondo is said to have applied for a fraudulent change of number plates at the CID Vehicle Theft Squad and engaged a car clearing agent, Andrew Musoni, to process the papers through the Central Vehicle Registry. Musoni allegedly presented the forged documents, resulting in a new registration number AGS 2550 being issued under Dubes name.\n\nAfter paying Musoni US$50 for the service, Chikondo reportedly affixed the fake plates onto the smuggled Toyota Mark X and sold the vehicle to Ti Gonzi for US$5,000.\n\nThe car was later seized by officers from the Vehicle Theft Squad on January 7 this year after being spotted in Mbare, where it was being driven by Ti Gonzi. Police informed the musician that the car had fake plates and had been illegally imported.\n\nInvestigations revealed that the vehicle had no import record or customs clearance, resulting in ZIMRA losing US$3,389.55 in unpaid import duty.\n\nAccording to court papers, Ti Gonzi had purchased the vehicle in good faith from Eastlea Car Sales, after being introduced to Chikondo by dealer Jarmine Rubatika. The deal was reportedly concluded at the Yadah Hotel car park, where the smuggled vehicle was displayed.\n\nThe musician paid the full amount, but the car was later impounded by authorities, and nothing was recovered.\n\nChikondo, who is still facing separate charges for assaulting a police officer alongside Prophet Magaya, now finds himself at the centre of yet another scandal  one that deepens the cloud of controversy surrounding Magayas embattled empire.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Hip Hop Star Ti Gonzi, real name, Tinashe Gonzara, has been named in a case in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/hip-hop-star-named-in-magaya-scandals/\">Continue reading<span class=\"screen-reader-text\"> \"Hip Hop Star Named In Magaya Scandals\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Mnangagwa Administration Mismanagement Hits Farmers Hard",
            "url": "https://www.zimeye.net/2025/11/07/mnangagwa-administration-mismanagement-hits-farmers-hard/",
            "content": "By A Correspondent  Zimbabwes agricultural sector is reeling as government mismanagement leaves farmers grappling with unpaid deliveries and mounting financial pressure.\n\nOn Thursday, Hon. Saul Maburutse, Chairperson of the Parliamentary Portfolio Committee on Lands, Agriculture, Water, Fisheries and Rural Development, revealed that theGrain Marketing Board (GMB)andCottcostill owe farmers overUS$20 million and ZiG 259.4 millionfor maize, wheat, and cotton.\n\nThese persistent arrears have eroded confidence in the sector and caused a noticeable drop in crop deliveries.\n\nMaburutse warned that continued payment delays threaten the2025/26 planting season, risk reducing national grain reserves, and could disrupt cotton exports. The lack of a structured payment system and delayed Treasury disbursements were cited as key contributors to the problem.\n\nCritics argue that the administrations inability to address these bottlenecks reflects deeper systemic failures that undermine Zimbabwes agricultural productivity, discourage investment, and jeopardize food security. Without urgent intervention to clear arrears and restore trust, farmers face a precarious future while the nations agricultural sector teeters on the edge of crisis.Headline:Mnangagwa Administration Mismanagement Hits Farmers Hard\n\nArticle:Zimbabwes agricultural sector is reeling as government mismanagement leaves farmers grappling with unpaid deliveries and mounting financial pressure.\n\nOn Thursday, Hon. Saul Maburutse, Chairperson of the Parliamentary Portfolio Committee on Lands, Agriculture, Water, Fisheries and Rural Development, revealed that theGrain Marketing Board (GMB)andCottcostill owe farmers overUS$20 million and ZiG 259.4 millionfor maize, wheat, and cotton. These persistent arrears have eroded confidence in the sector and caused a noticeable drop in crop deliveries.\n\nMaburutse warned that continued payment delays threaten the2025/26 planting season, risk reducing national grain reserves, and could disrupt cotton exports. The lack of a structured payment system and delayed Treasury disbursements were cited as key contributors to the problem.\n\nCritics argue that the administrations inability to address these bottlenecks reflects deeper systemic failures that undermine Zimbabwes agricultural productivity, discourage investment, and jeopardize food security. Without urgent intervention to clear arrears and restore trust, farmers face a precarious future while the nations agricultural sector teeters on the edge of crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe’s agricultural sector is reeling as government mismanagement leaves farmers grappling with unpaid deliveries and mounting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/mnangagwa-administration-mismanagement-hits-farmers-hard/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Administration Mismanagement Hits Farmers Hard\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Magaya Top Aide Up for Car Smuggling",
            "url": "https://www.zimeye.net/2025/11/07/magaya-top-aide-up-for-car-smuggling/",
            "content": "By A Correspondent  Trouble continues to stalk the empire of Prophet Walter Magaya. Just months after his arrest for allegedly assaulting a police officer, one of his top aides  the same man detained alongside him  has now been dragged to court on allegations of car smuggling and fraudulently selling a vehicle to rapper Ti Gonzi.\n\nThe aide, Tapiwa Felix Chikondo, appeared before Harare regional magistrate Francis Mapfumo this week facing charges of smuggling and fraud. He was not asked to plead and was released on US$600 bail pending trial.\n\nThe complainant in the matter is the Zimbabwe Revenue Authority (ZIMRA), represented by revenue supervisor Collins Ncube, while Lancelot Mutsokoti appeared for the State.\n\nAccording to the prosecution, Chikondo  a security aide at Prophet Magayas PHD Ministries  allegedly smuggled a Toyota Mark X from Japan between July and August 2024 and later sold it to Ti Gonzi. The vehicle is said to have been parked at Yadah Hotel in Waterfalls, one of Magayas flagship properties.\n\nThe State alleges that Chikondo identified another vehicle, registration number ABX 7852, which was registered under a man named Dumisani Dube. He then allegedly used that cars registration details to fraudulently obtain new number plates for his smuggled vehicle  which had not been cleared through ZIMRA and had no import duty paid.\n\nChikondo is said to have applied for a fraudulent change of number plates at the CID Vehicle Theft Squad and engaged a car clearing agent, Andrew Musoni, to process the papers through the Central Vehicle Registry. Musoni allegedly presented the forged documents, resulting in a new registration number AGS 2550 being issued under Dubes name.\n\nAfter paying Musoni US$50 for the service, Chikondo reportedly affixed the fake plates onto the smuggled Toyota Mark X and sold the vehicle to Ti Gonzi for US$5,000.\n\nThe car was later seized by officers from the Vehicle Theft Squad on January 7 this year after being spotted in Mbare, where it was being driven by Ti Gonzi. Police informed the musician that the car had fake plates and had been illegally imported.\n\nInvestigations revealed that the vehicle had no import record or customs clearance, resulting in ZIMRA losing US$3,389.55 in unpaid import duty.\n\nAccording to court papers, Ti Gonzi had purchased the vehicle in good faith from Eastlea Car Sales, after being introduced to Chikondo by dealer Jarmine Rubatika. The deal was reportedly concluded at the Yadah Hotel car park, where the smuggled vehicle was displayed.\n\nThe musician paid the full amount, but the car was later impounded by authorities, and nothing was recovered.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Trouble continues to stalk the empire of Prophet Walter Magaya. Just months after his arrest for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/magaya-top-aide-up-for-car-smuggling/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Top Aide Up for Car Smuggling\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        },
        {
            "title": "Mohadi Evicts 21 Families",
            "url": "https://www.zimeye.net/2025/11/07/mohadi-evicts-21-families/",
            "content": "At least 21 families are sleeping in the open after they were violently evicted from a farm in Mashonaland Central province early this week, in a case that exposes the persistent involvement of senior political figures in land disputes.\n\nThe eviction, carried out on Monday, saw families dumped along the HarareBindura Highway with their damaged belongings after being forced out of Arnold Farm in Mazowe. The property, also known as Manzou Farm, has a long and controversial history and has previously been linked to powerful politicians, including former First Lady Grace Mugabe, who once tried to remove settlers from the same land.\n\nIn the latest eviction, victims described a brutal and chaotic process in which they were given only minutes to remove their belongings before their homes were set ablaze. The operation left many, including children, stranded and exposed at the start of the rainy season.\n\nThe eviction was so cruel. We were told to remove our property within minutes, said Pearson Tagara, one of the affected villagers. This resulted in furniture like kitchen units, wardrobes and beds being damaged as we rushed to move. Its heartbreaking. Soon after, the villagers said, their huts were torched.\n\nThe 1,245-hectare Arnold Farm, located near the scenic Mazowe Dam, has long been at the centre of political controversy and contested ownership. The latest eviction appears to be the climax of a long-running dispute over the property, with villagers accusing Vice President Mohadis son, Mafenyadira, of orchestrating the removals. The victims are appealing for government intervention, saying they have been left destitute and without shelter.\n\nWe are suffering abuse that is ill-timed, depriving us of our right to peace and shelter, said one of the displaced settlers. Efforts to obtain comment from Mafenyadira Mohadi were unsuccessful by the time of publication.\n\nTensions over the same farm had been brewing for months. In December last year, more than 300 villagers staged a demonstration at Arnold Farm to resist what they described as Mafenyadiras attempts to evict them. They accused him of unleashing state security agents to intimidate residents and of erecting fences around the property. Reports at the time indicated that he had deployed security guards to patrol the area at night, leading to several arrests for alleged trespassing.\n\nSpeaking through his cousin, Hardlife Samuwi, in an interview withNewsDayat the time, Mafenyadira confirmed the clashes, accusing villagers of being violent. I understand that violent illegal settlers at Old Arnold Farm in Mazowe demonstrated, vandalised property and harmed security guards at Vice-President Mohadis sons place over a farm he was allocated by the Ministry of Lands, Samuwi said. Our farm hand had his hand broken by these illegal settlers.\n\nThe latest eviction is not the first at Manzou Farm. In March 2017, police forcibly removed villagers from the same property, demolishing homes and destroying crops under the pretext of establishing a national monument and expanding business interests linked to the then First Lady, Grace Mugabe. Following that incident, the Zimbabwe Lawyers for Human Rights intervened, resulting in a High Court ruling in favour of the villagers and a temporary halt to their eviction.\n\nDespite that ruling, Manzou Farm has remained a flashpoint for politically charged land conflicts involving some of the countrys most powerful figures. Reports have also suggested that First Lady Auxillia Mnangagwa has shown interest in the same property, further underscoring the deep political contestation over its ownership.\n\nAs the displaced families now camp along the roadside with their belongings scattered and their homes reduced to ashes, their ordeal once again highlights the human cost of Zimbabwes unresolved land politics  a system where ordinary citizens continue to suffer while the powerful battle over land and privilege.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Vice President Kembo Mohadi’s son, Mafenyadira, has been dragged into the eviction of 21 families from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/07/mohadi-evicts-21-families/\">Continue reading<span class=\"screen-reader-text\"> \"Mohadi Evicts 21 Families\"</span></a></p>",
            "time": "06:00",
            "date": "08 Nov 2025"
        }
    ]
}