{
    "news": [
        {
            "title": "2 Top Military Generals Involved In Horror Accidents Same Day Driving ‘Chivayo Cars’",
            "url": "https://www.zimeye.net/2025/11/18/2-top-military-generals-involved-in-horror-accidents-same-day-driving-chivayo-cars/",
            "content": "video loading below .2 top senior military generals were involved in two separate accidents on the same day last week Wednesday. The other one was fataland Gen Phillip Valerio Sibandas driver, Phillip Chiura died.\n\nIn the other accident, the notorious FAZ organisations founder Gen Walter Tapfumaneyi escaped a near fatal crash in Kadoma, on the same day.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below . 2 top senior military generals were involved in two separate accidents on the same day last … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/2-top-military-generals-involved-in-horror-accidents-same-day-driving-chivayo-cars/\">Continue reading<span class=\"screen-reader-text\"> \"2 Top Military Generals Involved In Horror Accidents Same Day Driving ‘Chivayo Cars’\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Police “Ban” Headphones, Mobile Phones On The Road",
            "url": "https://www.zimeye.net/2025/11/18/police-ban-headphones-mobile-phones-on-the-road/",
            "content": "By A Correspondent  Chitungwiza, Zimbabwe  Drivers and pedestrians have been urged not to use or wear headphones on the roads, as maintaining alert hearing is vital to avoiding accidents.\n\nThe warning was issued by Officer Commanding Harare Province, Commissioner Maxwell Chikunguru, during the World Day of Remembrance for Road Traffic Victims at Manyame Bridge, a known accident blackspot along Seke Road, on Monday.\n\nComm Chikunguru highlighted mobile phone use as a growing contributor to road accidents and specifically addressed kombi drivers about an ongoing police operation targeting unroadworthy vehicles and those stopping at undesignated points.\n\nToday we join the world in remembering road traffic victims whose lives were tragically lost in preventable crashes, Comm Chikunguru said. I commend Chief Seke for organising this event which brings together the police and all like-minded stakeholders. This memorial gathering allows us to unite in reflection on the lives lost and remember the families forever affected along this stretch of Seke Road.\n\nHe added: We honour the men, women and children whose lives were cut short, and we remember survivors living with pain, trauma and long-term injuries. On behalf of the Zimbabwe Republic Police, I extend heartfelt condolences to all bereaved families. We mourn with you, empathise with your pain, and stand in solidarity with you. While no words can erase your loss, today affirms that your loved ones are not forgotten.\n\nComm Chikunguru stressed that the event was a call for unity, reflection, and responsibility. Road safety is not abstract; it is about preserving human life. The tragedies here have been linked to speeding, reckless overtaking, drunk driving and unroadworthy vehicles, behaviours that can be prevented. We must act collectively to halt further loss of life.\n\nHe announced that police would intensify enforcement along Seke Road, increase visibility, and conduct awareness campaigns. However, enforcement alone is not enough. We appeal to all road users to adopt life-saving measures: maintain safe speeds, especially near bus stops, residential areas and curves; overtake only when the road is clear; never drink and drive or use mobile phones behind the wheel.\n\nComm Chikunguru urged drivers and pedestrians to ensure vehicles are roadworthy with functional brakes, tyres, and lights, to use designated crossing points, and for passengers to speak up against dangerous driving. Every life lost was a valued family member. Every safe journey begins with discipline, patience and respect for others on the road, he said.\n\nTogether with community leaders, transport operators, traditional leaders and the public, we can transform this blackspot from a place of grief into a symbol of collective responsibility and hope. We remain committed to supporting road safety and sanity. Let us honour the memories of those we lost by choosing safer roads and actions. Together we can prevent the next tragedy.\n\nChief Seke, whose birth name is Stanley Chimanikire, criticised traffic police for allowing unroadworthy vehicles through checkpoints. I feel compelled to fight this menace that claims lives along Seke Road. It is our communitys reputation that is at stake, tainted by reckless drivers who disregard the sanctity of life. We feel humiliated and traumatised whenever we pass this spot where 17 lives were lost. We plan to engage bereaved families to consider erecting a statue to honour the deceased.\n\nMadzibaba Simbarashe Nengomasha added that the church is praying for an end to road traffic accidents caused by drug-abusing drivers. Many drivers are using drugs leading to accidents. Substance abuse is an enemy on the roads and in our homes, causing untold suffering for parents of those involved, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Chitungwiza, Zimbabwe – Drivers and pedestrians have been urged not to use or wear headphones on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/police-ban-headphones-mobile-phones-on-the-road/\">Continue reading<span class=\"screen-reader-text\"> \"Police “Ban” Headphones, Mobile Phones On The Road\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "TEMBA MLISWA: THE HIRED MEGAPHONE OF BORROWDALE POLITICS",
            "url": "https://www.zimeye.net/2025/11/18/temba-mliswa-the-hired-megaphone-of-borrowdale-politics/",
            "content": "By Reason Wafawarova\n\nThere are clowns, there are loud clowns, and then there is Temba Mliswa  Zimbabwes unrivalled national public-address system; a man who has turned shouting into a political career and conspiracy-theorising into a gym routine. If ever Zimbabwe needed proof that a pigs bladder hanging on a stick can rise to ZANU PF Provincial Chairperson and even become a Member of Parliament, Mliswas biography stands as the definitive case study.\n\nOn paper, Mliswas political CV is impressive  a polished catalogue of posts held, committees chaired, and power accidentally stumbled upon. But just beneath that shimmering surface lies a trail of academic rubble, failed sporting dreams, and the unmistakable odour of manufactured relevance. For a man who markets himself as a former rugby great, his sporting record reads less like Jonah Lomu and more like played a few games with the under-15s at Prince Edward.\n\nTHE FALL, THE RISE, AND THE NORTON ACCIDENT\n\nAfter losing the political powers thrust upon him by ZANU PF  the same powers he now pretends he earned by merit  Mliswa surprised everyone by doing something for himself. In 2018, he entered the Norton race as an independent and defeated Chris Mutsvangwa, another walking pigs bladder imposed on the constituency by ZANU PFs patronage machinery. It was a contest of the unwanted, the politically recyclable, the men whose names voters circled only because abstaining felt too polite.\n\nMliswa came out on top. And for a brief moment, Zimbabwe thought perhaps, just perhaps, the man had turned a corner. But 2023 arrived with the predictability of a Harare pothole. Mliswa lost his Norton seat. The ZANU PF machinery rolled back in and packed him off to Shurugwi  where, in classic Mliswa fashion, he overthrew a village head and installed himself as the new emperor of a rural ward that never hired him.\n\nUnable to adjust to life away from Parliaments microphones, Mliswa took to Twitter (or X for the pretentious) like a drowning man grabbing at straws. He picked fights with anyone whose name trends longer than five minutes, fashioning himself as Zimbabwes anti-corruption prophet, an uncle to the First Family, and the countrys unofficial National Security Advisor  depending on which donor he met the previous night.\n\nENTER TAGWIREI: THE CONTRACTOR OF LOUD VOICES\n\nThen came the Tagwirei-Chiwenga feud, the civil war inside ZANU PFs succession race  a war fought through whispers, proxies, paid tweets, and memoranda that read like failed spy novels.\n\nMliswa, who never misses a chance to insert himself into national crises, picked a side early. He defended Tagwirei with the zeal of a paid influencer and condemned Chiwenga with the enthusiasm of a man anticipating a reward. And sure enough, he was noticed. Hired. Equipped. Financially lubricated.\n\nOvernight, Mliswa became the official attack dog tasked with eliminating the Chiwenga factor from the succession matrix.\n\nThe timing was perfect: Chiwenga had confronted Mnangagwa and the Politburo with a dossier so detailed, so forensic, and so incriminating that it made Command Agriculture look like petty theft. The document spelled out exactly how Tagwirei and a cartel linked to the First Family siphoned billions through state projects. No one refuted it. Not even those whose names featured prominently.\n\nMnangagwas response  that he was ready to resign but only if procedure was followed  said everything. The Politburos refusal to discuss the dossier without knowing its author said even more.\n\nChiwenga owned the document. And with that admission, Tagwirei needed a counteroffensive.\n\nEnter Mliswa, fresh from a night meeting in Borrowdale, armed with a script so poorly written it would embarrass a Nollywood extra.\n\nPHASE ONE: THE EXPOS THAT EXPOSED ONLY THE AUTHOR\n\nMliswa launched his attack with the enthusiasm of a man who had just received an ECOCASH message titled Transfer from Sakunda.\n\nChiwenga was corrupt, he declared. Chiwenga was a beneficiary of Wicknell Chivayos stolen money, he thundered. Chiwenga had plundered diamonds in the DRC and Marange, he bellowed. But in the same breath, Chiwenga was so broke he had begged Chivayo to fund his wedding.\n\nEven ZBC sound engineers would have demanded a retake.\n\nThe contradictions were too large to ignore. The entire expos collapsed under its own nonsense. But Mliswa, a man incapable of shame, promised a Phase Two.\n\nZimbabwe braced for fireworks. What came was a wet matchstick.\n\nPHASE TWO: THE LAND SCANDAL THAT WASNT\n\nTwo days ago, Mliswa re-emerged, panting with self-importance, to announce the next big revelation. And what did we get?\n\nA Harare City Council land dispute. One among the thousands that litter the capitals urban landscape  all caused by ZANU PFs interference and its breeding of land barons like rabbits.\n\nThe story:\n\nA piece of land allegedly repossessed by the council from politically linked land barons, supposedly meant for the Catholic Church, with Mliswa speculating  not proving  that Chiwenga was the shadowy beneficiary.\n\nChiwenga had not grabbed the land. Had not applied for the land. Had not even visited the land.But this, Mliswa declared, was corruption.\n\nHe even roped in George Charamba, rebranding the Presidential Spokesperson as Chiwengas personal spokesman, as though the country was watching a poorly scripted sitcom.\n\nWHAT MLISWA WONT TALK ABOUT\n\nFor all his loudness, Mliswa has never once confronted the real corruption scandals highlighted in Chiwengas dossier:\n\nthe Command Agriculture heist,\n\nthe dodgy tenders,\n\nthe Kuvimba Mining House labyrinth,\n\nthe Sakunda hijacking of Noczim,\n\nthe First Familys dealings with known criminals,\n\nand the billions moved in quiet, untraceable loops.\n\nNot a word from Mliswa. Not a whisper. Not even one of his famous sweating monologues.\n\nFor the US$300,000 Tagwirei reportedly paid him, the return on investment is catastrophically low. Even the most nave oligarch would demand a refund.\n\nTHE HIRED TROLL WHO ADMITS HE KNOWS HE IS WRONG\n\nBut perhaps the most telling moment was Mliswas own pre-emptive confession. He told viewers:\n\nI know you will scold and attack me, but I dont care.\n\nThat is not confidence.That is not courage.That is a man who knows he is on the wrong side of history but must soldier on because the cheque already cleared.\n\nThis is not activism. It is not patriotism. It is mercenary politics  loud, clumsy, and embarrassingly cheap.\n\nA COUNTRY DESERVES BETTER THAN HIRED MEGAPHONES\n\nZimbabwes political discourse has been hijacked by men who shout for a living. Men who mistake volume for wisdom. Men who measure patriotism by the number of retweets from anonymous burner accounts.\n\nAnd Mliswa stands at the front of this choir  a hired megaphone serving those who can afford to switch him on.\n\nHis attacks on Chiwenga are not ideological. They are not patriotic. They are not principled. They are not even logical.\n\nThey are paid-for noise.\n\nZimbabwe deserves better.\n\nThe public deserves truth.\n\nAnd history will record Mliswa not as a reformist, not as a whistleblower, not even as a political maverick  but as a loud, clumsy troll hired to fight battles whose logic he himself cannot defend.\n\nThe tragedy is not that he shouts.\n\nThe tragedy is that for a price, he will shout for anyone.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Reason Wafawarova There are clowns, there are loud clowns, and then there is Temba Mliswa — Zimbabwe’s unrivalled national … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/temba-mliswa-the-hired-megaphone-of-borrowdale-politics/\">Continue reading<span class=\"screen-reader-text\"> \"TEMBA MLISWA: THE HIRED MEGAPHONE OF BORROWDALE POLITICS\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Human Rights Defenders Slam Nick Mangwana Over “Fake Abductions” Statement",
            "url": "https://www.zimeye.net/2025/11/18/human-rights-defenders-slam-nick-mangwana-over-fake-abductions-statement/",
            "content": "Tinashe Sambiri  Human rights defenders have slammed government spokesperson Nick Mangwana over his recent remarks suggesting that some Zimbabweans may stage abductions to strengthen asylum claims abroad.\n\nIn a post on X over the weekend, Mangwana warned that with Certificates of Sponsorship (CoS) for the United Kingdom no longer easily obtainable, some citizens could resort to faking abductions to facilitate migration. He wrote: The COS route is no longer viable. This will likely lead to an increase in individuals falsely claiming abduction in an attempt to seek asylum elsewhere. We should anticipate a rise in such narratives and understand the strategic reasoning behind them.\n\nMangwana emphasized that reported abductions should not automatically be taken at face value and must be carefully investigated to determine their authenticity.\n\nHuman rights activists based in Harare have strongly criticized Mangwanas statement, describing it as reckless and demeaning. One activist said: Such comments undermine real cases of abduction and harassment in Zimbabwe. Suggesting that citizens fabricate such incidents casts doubt on the genuine suffering of vulnerable people.\n\nAnother activist added: This kind of rhetoric shifts blame onto victims and absolves authorities from addressing the root causes of insecurity and human rights abuses in the country.\n\nThe statement has sparked outrage on social media, with many accusing the government of dismissing serious human rights concerns while unfairly targeting citizens who seek safety and justice abroad.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Human rights defenders have slammed government spokesperson Nick Mangwana over his recent remarks suggesting that some Zimbabweans … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/human-rights-defenders-slam-nick-mangwana-over-fake-abductions-statement/\">Continue reading<span class=\"screen-reader-text\"> \"Human Rights Defenders Slam Nick Mangwana Over “Fake Abductions” Statement\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Watch: Malloti and Hulengende Performing Obscene Gestures At Zanu PF Rally",
            "url": "https://www.zimeye.net/2025/11/18/watch-malloti-and-hulengende-performing-obscene-gestures-at-zanu-pf-rally/",
            "content": "By A Correspondent- Controversial social media personalities and Zimbabwean dancehall artists Malloti and Hulengende drew attention at a Zanu PF rally in Harare over the weekend by performing obscene gestures.\n\nThe performers were met with cheers from Zanu PF supporters, a response critics say reflects troubling and warped ideologies within the ruling party.\n\nWatch until the end. Malloti & Hulengende performing at a ZANU PF rally.Bustop TVpic.twitter.com/2hHx6B7r3R\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- Controversial social media personalities and Zimbabwean dancehall artists Malloti and Hulengende drew attention at a Zanu PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/watch-malloti-and-hulengende-performing-obscene-gestures-at-zanu-pf-rally/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Malloti and Hulengende Performing Obscene Gestures At Zanu PF Rally\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Zanu PF Prodigal Son Godfrey Tsenengamu Claims Zanu PF Doesn’t Rig Elections",
            "url": "https://www.zimeye.net/2025/11/18/zanu-pf-prodigal-son-godfrey-tsenengamu-claims-zanu-pf-doesnt-rig-elections/",
            "content": "Tinashe Sambiri Zanu PFs returning activist, Godfrey Tsenengamu, has sparked shockwaves after boldly claiming that the ruling party does not rig elections, insisting instead that its strength lies in relentless mobilisation and structured recruitment.\n\nTsenengamu, who once served as a firebrand Youth League political commissar before his 2020 expulsion, recently made a dramatic return to Zanu PF. In what observers view as an attempt to endear himself to President Emmerson Mnangagwa and the party leadership, he took to social media on Monday to make a declaration many found startling.\n\nHe wrote:Here is the secret to election rigging. ZANUPF does not stop mobilizing and recruiting. It is a well structured institution. ZANUPF pays attention to detail and understands the critical importance of figures.\n\nTsenengamu went on to boast about rapid recruitment activity, saying:Imagine between 4pm yesterday and 10am today, we have managed to add 106 votes excluding those of spouses and parents of the new members and this excludes efforts being made by others elsewhere.\n\nHe added that the new recruits were being redirected to proper party structures for formal onboarding:These new members will be guided and redirected through the KHE (Kumusha Home Ekhaya) program to the rightful office holders in their respective provinces, DCCs and Wards for formal admission and formalisation of their membership into the revolutionary party.\n\nTsenengamuwho now describes himself as a committed recruiterended his message by urging others to join the drive, writing:Usasare famba nevamwe ndibate pa whatsapp +263775519111.We are #FishersOfMen.\n\nHis remarks have ignited debate, with critics viewing the comments as political theatre aimed at securing his place in Zanu PFs inner circles, while supporters argue he is merely explaining the partys organisational discipline.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF’s returning activist, Godfrey Tsenengamu, has sparked shockwaves after boldly claiming that the ruling party does not … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/zanu-pf-prodigal-son-godfrey-tsenengamu-claims-zanu-pf-doesnt-rig-elections/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Prodigal Son Godfrey Tsenengamu Claims Zanu PF Doesn’t Rig Elections\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Tanzania’s President Appoints Daughter, Son-in-Law to Cabinet",
            "url": "https://www.zimeye.net/2025/11/18/tanzanias-president-appoints-daughter-son-in-law-to-cabinet/",
            "content": "Tinashe Sambiri- The President of Tanzania, Samia Suluhu Hassan is facing growing criticism after appointing her daughter and son-in-law to senior government positions just weeks after securing an election victory.\n\nAccording to Africa Facts Zone on X, the appointments were announced on 17 November 2025 in Dodoma as part of a fresh cabinet reshuffle.\n\nAfrica Facts Zone reported: President Samia Suluhu Hassan has appointed her daughter Wanu Hafidh Ameir as Deputy Minister for Education, Science, and Technology and her son-in-law Mohamed Mchengerwa as Minister of Health.\n\nThe reshuffle also saw Ridhiwani Kikwete, son of former President Jakaya Kikwete, promoted to Minister of Foreign Affairs and East African Cooperation.\n\nThese moves follow Hassans October 2025 election win, where her CCM party secured a parliamentary supermajority. Africa Facts Zone noted that this victory came despite opposition allegations of irregularities and international concerns over restrictions on freedoms.\n\nThe appointments have sparked wide debate, with critics accusing the government of entrenching nepotism, while supporters argue that the President is selecting competent figures she trusts to drive her policy agenda.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri- The President of Tanzania, Samia Suluhu Hassan is facing growing criticism after appointing her daughter and son-in-law to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/tanzanias-president-appoints-daughter-son-in-law-to-cabinet/\">Continue reading<span class=\"screen-reader-text\"> \"Tanzania’s President Appoints Daughter, Son-in-Law to Cabinet\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "“Translate National Strategy into Concrete Deliverables For Binga Communities” – Cumanzala",
            "url": "https://www.zimeye.net/2025/11/18/translate-national-strategy-into-concrete-deliverables-for-binga-communities-cumanzala/",
            "content": "Harare  In response to President Emmerson Mnangagwas 2025 State of the Nation Address (SONA), Binga South legislator, Fanuel Cumanzala has issued a stark rebuttal, stating that the national vision of leaving no one and no place behind remains a distant reality for his constituency.\n\nWhile acknowledging the laudable national commitments, including a 6.6% growth target and a focus on climate adaptation, Cumanzala painted a grim picture of the local realities in the Binga District and Zambezi Valley.\n\nFar too often we hear that no place will be left behind. Yet in Binga the service delivery, infrastructure, opportunities remain severely lacking, said Cumanzala.\n\nHe called on government to expedite the upgrading of the Cross-Dete/ Binga road and other feeder roads to open the district for tourism, markets and investment.\n\nThe provision of reliable energy and water is important. Communities should be provided with backup power for pump stations, ZINWA and ZETDC should coordinate and provide reliable supply and ensure communities are not forced to fetch water from hazardous sources, he said.\n\nRecognise the unique vulnerabilities of riverine/fisher folk communities and climate-sensitive agriculture; support sustainable fisheries, livestock insurance, drought-resilient crops, and market access for local products such as baskets, fish, tourism services.\n\nIn his address to parliament, Cumanzala detailed a series of critical challenges facing the community. Residents reportedly endure weeks without reliable water, at times forced to draw water directly from the crocodile-infested Zambezi River. Deplorable road conditions are constraining tourism and market access, while traditional livelihoods like fishing and livestock farming are under severe strain from overfishing and drought.\n\nCumanzala also raised the alarm on social issues, noting that children are being withdrawn from school due to hunger and poverty, leading to a rise in child labour.\n\nThe MP called for a direct and immediate translation of national strategy into concrete deliverables.\n\nHe presented a list of specific demands for the government, including investing in education with better school infrastructure, teachers, and vocational training linked to the local economy.\n\nCumanzala also called on government to guarantee and ensure transparent community benefits from mining and tourism ventures in the region.\n\nHe concluded by emphasizing that for the people of Binga, the national vision is more than policyit is a matter of survival, dignity and opportunity.\n\nThe vision set by the President is laudable, he said. But vision becomes meaningful only when translated into bricks, roads, pumps, schools, jobs and dignified lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – In response to President Emmerson Mnangagwa’s 2025 State of the Nation Address (SONA), Binga South legislator, Fanuel Cumanzala … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/translate-national-strategy-into-concrete-deliverables-for-binga-communities-cumanzala/\">Continue reading<span class=\"screen-reader-text\"> \"“Translate National Strategy into Concrete Deliverables For Binga Communities” – Cumanzala\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Jail Break at Plumtree Prison",
            "url": "https://www.zimeye.net/2025/11/18/jail-break-at-plumtree-prison/",
            "content": "By A Correspondent  Chaos has erupted in Plumtree after convicted fugitive Mike Danger Mathe slipped out of custody in a daring escape that has triggered a massive manhunt and raised suspicions of an inside job.\n\nThe Zimbabwe Prisons and Correctional Service (ZPCS) has deployed security teams across the border town as they search for the dangerous inmate, who vanished in the early hours of Saturday.\n\nMathe, who reportedly cut through burglar bars with a hacksaw blade in a movie-style escape, disappeared into the darkness before guards realised he was gone.\n\nZPCS spokesperson Assistant Commissioner Meya Khanyezi confirmed the dramatic breakout, saying investigators were already on the ground following up on leads.\n\nThe Zimbabwe Prisons and Correctional Service wishes to inform the public that an inmate unlawfully escaped from Plumtree Prison. We want to assure the nation that investigations are underway and we are working diligently to apprehend the escaped inmate, she said.\n\nShe added that the incident had prompted a full review of security procedures as officials try to determine whether Mathe had assistance.\n\nAs an institution dedicated to the incarceration and rehabilitation of offenders, we remain committed to ensuring the safety and security of society. We uphold the highest standards of professionalism and are continuously reviewing our procedures to strengthen our operations, Asst Comm Khanyezi said.\n\nResidents living along common escape routes are on high alert, with many fearing that Mathe may attempt to slip across the border or hide in nearby villages.\n\nAuthorities have urged the public not to confront the fugitive if spotted.\n\nWe call on the community to remain vigilant and report any information that may assist in the swift recapture of the inmate. Do not approach him. Report immediately to the police, said Asst Comm Khanyezi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Chaos has erupted in Plumtree after convicted fugitive Mike “Danger” Mathe slipped out of custody in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/jail-break-at-plumtree-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Jail Break at Plumtree Prison\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Magaya Remanded to 9 Dec, As Lawyer Says Cases Are Not Won by Police Statements on Twitter",
            "url": "https://www.zimeye.net/2025/11/18/magaya-remanded-to-9-dec-as-lawyer-says-cases-are-not-won-by-police-statements-on-twitter/",
            "content": "By Court Reporter | Harare  Monday, 17 November 2025\n\nProphetic Healing and Deliverance (PHD) Ministries leader Walter Magaya and his wife Tendai Magaya have been remanded to 9 December 2025 for the setting of a trial date, following a brief but tense appearance at the Harare Magistrates Court today.\n\nThe State successfully applied for a postponement, arguing that investigations were still incomplete, despite Magaya having been arrested on 1 November on charges involving rape and 13 counts of fraud linked to alleged fake residential stands and investment schemes.\n\nJosey Mahachi says nobody can bring Walter Magaya down.The Same Dangote-Deal-Girl Josey Mahachi defending Walter Magaya, has opened an illegal supermarket for Tempter Paul Tungwararas 17y old daughter using taxpayer funds. She is on an audio she sent out to newsdeskshttps://t.co/rlOdJehm52pic.twitter.com/OhhJYTWeHs\n\nDEFENCE: We Are Ready for Trial\n\nMagayas lawyer, Admire Rubaya, told the court that the defence team was fully prepared to proceed and accused the police of contributing to delays by investigating through press statements.\n\nRubaya said in court:\n\nWe are saying no to megaphone investigations. Cases are not won by police statements on social media. The investigating team must take a leaf from their homicide counterparts.\n\nHe warned that ongoing postponements would be prejudicial to our clients.\n\nRubayas criticism comes days after the Zimbabwe Republic Police issued a public statement warning of alleged attempts to bribe investigators and derail the Magaya cases  a statement the defence says improperly places their clients in a prejudicial spotlight.\n\nSTATE: Investigations Still Underway\n\nProsecutors insisted that more time was needed to consolidate witness statements, update dockets, and finalise aspects of parallel investigations involving Magaya, his wife, and associated corporate entities.\n\nMagaya is jointly charged with Tendai in the CR 720/12/23 docket, which details alleged misrepresentations involving land supposedly available in New Donnington, Chishawasha, Bulawayo, Mutare, and other areas.\n\nMAGAYA ARRIVES HOLDING WIFES HAND\n\nMagaya, dressed in a grey suit, arrived at court hand-in-hand with his wife Tendai, accompanied by a small entourage of PHD officials.Photographs captured by Munashe Chokodza show the couple walking calmly into the courthouse despite the growing pressure surrounding their cases.\n\nTheir demeanour appeared notably composed, even as critics and complainants continue to demand accountability over the multi-year allegations.\n\nBACKGROUND: A CASE HEADING TOWARD TRIAL\n\nMagaya is currently out on US$3,000 High Court bail granted last week by Justice Gibson Mandaza.He remains under strict conditions, including: Surrendering his passport Reporting weekly to police Avoiding contact with complainants\n\nHis wife Tendai, and companies Plannet Africa and Yadah Connect, also remain central to the fraud docket, which alleges that over US$50,000, R190,000 and other amounts were collected from church members for non-existent projects.\n\nNEXT COURT SESSION: 9 DECEMBER\n\nThe matter has officially been rolled over to 9 December, when the court is expected to set a firm trial date  provided the State has completed its investigations.\n\nZimEye will continue providing live updates as the case progresses, with additional analysis from the investigative files that have been tracked since 2014.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Court Reporter | Harare – Monday, 17 November 2025 Prophetic Healing and Deliverance (PHD) Ministries leader Walter Magaya and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/18/magaya-remanded-to-9-dec-as-lawyer-says-cases-are-not-won-by-police-statements-on-twitter/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Remanded to 9 Dec, As Lawyer Says Cases Are Not Won by Police Statements on Twitter\"</span></a></p>",
            "time": "06:33",
            "date": "19 Nov 2025"
        }
    ]
}