{
    "news": [
        {
            "title": "Inside Tagwirei’s secret phonecalls evading VP Chiwenga",
            "url": "https://www.zimeye.net/2025/07/07/inside-tagwireis-secret-phonecalls-evading-vp-chiwenga/",
            "content": "video loading below\n\nKuda Tagwireis secret talks evading VP Constantino Chiwengahttps://t.co/Hn8KhXSFAxpic.twitter.com/EWwkLWpltO\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "“Mnangagwa Is Going Soon”",
            "url": "https://www.zimeye.net/2025/07/07/mnangagwa-is-going-soon/",
            "content": "By A Correspondent| Outspoken war veteran Blessed Geza has launched a scathing attack on President Emmerson Mnangagwa, declaring publicly that Mnangagwa is going soon during a fiery address on Sunday.Mobile money\n\nGeza, who has in recent months emerged as a vocal critic of the President and his close allies, did not hold back as he took aim at Zvigananda within Zanu PF.\n\nYou are aware of what is happening in Zanu PF, Geza said.\n\nTagwirei was blocked from joining the Central Committee. He thought he could use money to buy his way to the top. But we thank General Constantino Chiwenga for showing us the way.\n\nGezas comments appear to confirm growing tensions within the ruling party, particularly between Mnangagwa loyalists and those aligned with Vice President Chiwenga.Mobile money\n\nThe businessman Kudakwashe Tagwirei, widely seen as a Mnangagwa ally, was recently sidelined from the Central Committee of the ruling Zanu PF party an event Geza interpreted as a sign of shifting internal dynamics.Mobile money\n\nTagwirei, you wanted to use the money you stole from the people to buy loyalty, Geza said. But Zimbabwe is not for sale.Zimbabwean fashion\n\nHe went further to condemn the continued influence of what he calls the Zviganandaa term he uses to describe corrupt and power-hungry elements around the President.\n\nZviganandas are still roaming free, Geza warned. But the chickens are coming home to roost. Be warned, Zvigananda!\n\nGeza accused Mnangagwa of feigning ignorance and denouncing corruption publicly while enabling it behind the scenes. Emmerson Mnangagwa is the godfather of Zvigananda, he charged. His sloganeering denouncing Zvigananda is cheap rhetoric.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Outspoken war veteran Blessed Geza has launched a scathing attack on President Emmerson Mnangagwa, declaring publicly that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/mnangagwa-is-going-soon/\">Continue reading<span class=\"screen-reader-text\"> \"“Mnangagwa Is Going Soon”\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "Real Madrid Stars Praise PSG Ahead of Blockbuster Club World Cup Semi-Final",
            "url": "https://www.zimeye.net/2025/07/07/real-madrid-stars-praise-psg-ahead-of-blockbuster-club-world-cup-semi-final/",
            "content": "Sports Correspondent\n\nEast Rutherford, New Jersey  July 7, 2025As football fans gear up for a titanic clash between Real Madrid and Paris Saint-Germain in the semi-finals of the FIFA Club World Cup 2025, players from the Spanish giants have heaped praise on their French opponents, acknowledging the immense challenge that awaits them.\n\nThe match, set to take place on Wednesday, brings together the last two UEFA Champions League winners and promises to be one of the most anticipated showdowns in recent Club World Cup history.\n\nReal Madrid boast 15 European titles, including their 2024 triumph, while PSG come into the tie fresh off a dominant 2-0 victory over Bayern Munich in the quarter-finals.\n\nSpeaking after Real Madrids thrilling 3-2 win over Borussia Dortmund in their own quarter-final, defender Antonio Rudiger acknowledged PSGs formidable form.\n\nPSG are a very, very tough team to play against, he told FIFA. Theyve shown theyre one of the best teams in Europe, so itll be a hard match. But were Real Madrid and were ready for the challenge.\n\nTrent Alexander-Arnold, who joined Madrid in May and faced PSG earlier this year with Liverpool in the UEFA Champions League, echoed the sentiment.\n\nI played against PSG this season and they were exceptional, he said. Of course, itll be a tough game. Both teams have earned their place in the semi-finals, but in the knockout stages anything can happen. Were going to go back now, recover, work hard and get ready for a tough match. May the best team win!\n\nFran Garcia, another Madrid player interviewed by FIFA, credited PSG for their tactical discipline and attacking prowess under coach Luis Enrique, warning that they are not the same side Real eliminated back in 2022.\n\nThe last encounter between these two European powerhouses came in the Champions League Round of 16 in 2022, where Real Madrid prevailed 3-2 on aggregate and went on to claim their 14th European crown. But this time, PSG arrive as a transformed side, filled with youthful energy and tactical maturity that has seen them dismantle giants like Bayern.\n\nEven Dortmund forward Julian Brandt, after his teams loss to Madrid, admitted PSG look like serious contenders.\n\nI saw the PSG-Bayern match, and I think PSG are in outstanding form right now, he said. Its hard to say whether weve faced the future world champions.\n\nAs coaches Luis Enrique and Xabi Alonso prepare their squads for this epic clash, anticipation is mounting across the football world. With star-studded lineups, tactical brilliance, and pride on the line, the Real Madrid vs. PSG semi-final promises a night of drama and high-stakes football.\n\nKick-off is set for Wednesday in what could be a defining moment in the FIFA Club World Cup 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent East Rutherford, New Jersey – July 7, 2025As football fans gear up for a titanic clash between Real … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/real-madrid-stars-praise-psg-ahead-of-blockbuster-club-world-cup-semi-final/\">Continue reading<span class=\"screen-reader-text\"> \"Real Madrid Stars Praise PSG Ahead of Blockbuster Club World Cup Semi-Final\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "Fuming Sakupwanya Storms Out of Rufaro as CAPS United Defeat Scottland FC",
            "url": "https://www.zimeye.net/2025/07/07/fuming-sakupwanya-storms-out-of-rufaro-as-caps-united-defeat-scottland-fc/",
            "content": "Sports Correspondent\n\nScottland FC owner Scott Sakupwanya stormed out of Rufaro Stadium in frustration on Sunday, leaving before the final whistle as his team trailed 1-0 to CAPS United in a tense Castle Lager Premier Soccer League Matchday 19 fixture.\n\nThe match ended in a narrow victory for CAPS United, who are now on a four-game unbeaten run, continuing their resurgence after a sluggish start to the season. The Green Machine now sit 10th on the table with 23 points.\n\nThe decisive moment came in the 35th minute, when newly signed Zambian forward Mugalu Kope Mutshimba marked his debut for CAPS with a well-taken goal, ultimately sealing all three points for the hosts.\n\nSakupwanyas early exit reflected growing frustration within the Scottland camp, as the defeat delivered a blow to their title ambitions. The loss leaves Scottland 12 points adrift of league leaders MWOS, who secured a full set of points on Saturday.\n\nDespite the disappointment, there was a bright spot for Scottland fans as Terrence Dzvukamanja made his long-awaited return to the Zimbabwean top flight after seven years, debuting for Scottland FC.\n\nWith pressure mounting and results slipping, all eyes will be on how Sakupwanya and his team respond in the crucial weeks ahead.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Scottland FC owner Scott Sakupwanya stormed out of Rufaro Stadium in frustration on Sunday, leaving before the final … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/fuming-sakupwanya-storms-out-of-rufaro-as-caps-united-defeat-scottland-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Fuming Sakupwanya Storms Out of Rufaro as CAPS United Defeat Scottland FC\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "ZimEye Pressure Forces Police Scotland To Release Details in Murder of Zimbabwean Doctor",
            "url": "https://www.zimeye.net/2025/07/07/zimeye-pressure-forces-police-scotland-to-release-details-in-murder-of-zimbabwean-doctor/",
            "content": "Dundee, Scotland Under mounting pressure from ZimEye, Police Scotland has formally identified the Zimbabwean woman murdered in Dundee on Saturday as 39-year-oldDr. Fortune Gomo, alocalresident and respected scholar in community health.\n\nThe breakthrough announcement was made byDetective Superintendent Peter Sharp, the lead investigator on the case, following sustained efforts byZimEyes Simba Chikanza to compel the authorities to publicly acknowledge the incident and offer reassurance to a grieving and alarmed African community in Scotland.\n\nDr. Gomo, who had recently completed her PhD at the University of Dundee, was stabbed onSouth Roadaround4:25 p.m. on July 5thwhile walking with her 10-year-old daughter. Despite the efforts of paramedics, she was pronounced dead at the scene. A post-mortem has since confirmed that she was murdered.\n\nA20-year-old manhas been arrested and charged in connection with her death and is expected to appear inDundee Sheriff CourtonMonday, 7 July 2025.\n\nThe polices delayed response and initial silence sparked widespread criticism, withZimEyeleading the charge. In a tense phone call with a Police Scotland operator, Chikanza challenged the forces failure to issue a deterrent statement, publish the suspects image, or provide timely information to the public  particularly in the context of what some believe may be racially motivated violence.\n\nWhen I say deterrent, I mean at least a statement with a picture  something to discourage similar incidents from happening again, Chikanza said.\n\nHe raised urgent concerns about a perceived pattern of racial violence and a disturbing lack of urgency from authorities.\n\nThe sentiment across the community is that the police do not care about the welfare of workers of Black African origin, Chikanza added. If the police dont do anything, Im going to have to do it myself. Im a publisher.\n\nPolice Scotland has now promised an ongoing investigation and urged the public not to speculate about the circumstances. However, their public relations response remains under scrutiny. Nearly48 hours after the murder, the police had yet to issue a press conference, community safety alert, or even release the suspects name or image  common practice in cases involving white victims or high-profile crimes.\n\nIn the meantime, viral videos show Black women in Dundee expressing frustration and heartbreak, accusing authorities of applying a double standard in race-related crimes.\n\nIf the roles were reversed, this would be on every front page by now, one woman said. But theres nothing online. No names, no justice.\n\nWith pressure mounting, calls are growing louder for anindependent reviewof Police Scotlands communication protocols and how it handles crimes involving communities of color.\n\nZimEye has vowed to continue pressing for justice, transparency, and accountability.\n\nAnyone with information is urged to contact Police Scotland on 101 quoting incident number 2283 of 5 July 2025, or anonymously via Crimestoppers on 0800 555 111.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dundee, Scotland – Under mounting pressure from ZimEye, Police Scotland has formally identified the Zimbabwean woman murdered in Dundee on Saturday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/zimeye-pressure-forces-police-scotland-to-release-details-in-murder-of-zimbabwean-doctor/\">Continue reading<span class=\"screen-reader-text\"> \"ZimEye Pressure Forces Police Scotland To Release Details in Murder of Zimbabwean Doctor\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "Local Feed Solutions Key to Cutting Livestock Production Costs",
            "url": "https://www.zimeye.net/2025/07/07/local-feed-solutions-key-to-cutting-livestock-production-costs/",
            "content": "By Doctor Trywell Muzerengi\n\nImproving Local Feed Resources for Better Livestock Nutrition\n\nFeeding remains one of the biggest expenses in livestock production, consuming up to 80% of total input costs. For both smallholder and commercial farmers, the reliance on expensive and sometimes unavailable commercial feeds is a major challenge. However, utilizing locally available feed resources can provide a sustainable, affordable, and effective solutionif managed strategically.\n\nHere are key areas that farmers can focus on to improve livestock nutrition while cutting costs:\n\nIn conclusion, livestock farming can become more profitable and sustainable by shifting focus toward improving local feed resources. With the right knowledge, group initiatives, and proper feed management, farmers can significantly lower costs while improving animal health and productivity.\n\nInstagram: lasmuzagro1\n\nLinkedIn: Lasmuz Agro\n\nlasmuzagrosolutions@gmail.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Doctor Trywell Muzerengi Improving Local Feed Resources for Better Livestock Nutrition Feeding remains one of the biggest expenses in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/local-feed-solutions-key-to-cutting-livestock-production-costs/\">Continue reading<span class=\"screen-reader-text\"> \"Local Feed Solutions Key to Cutting Livestock Production Costs\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "Geza Sends Stern Warning To Zvigananda…",
            "url": "https://www.zimeye.net/2025/07/07/geza-sends-stern-warning-to-zvigananda/",
            "content": "By Tinashe Sambiri\n\nWar veteran Blessed Geza has intensified his criticism of President Emmerson Mnangagwa, branding him the godfather of Zvigananda and accusing him of presiding over a corrupt and self-serving clique within Zanu PF. In a hard-hitting address delivered on Sunday, Geza said Mnangagwas days in power are numbered.\n\nGeza, who has become an unrelenting critic of the President and his inner circle, focused his speech on what he described as the decay and betrayal festering at the top levels of government.\n\nYou are aware of what is happening in Zanu PF, Geza said.\n\nTagwirei was blocked from joining the Central Committee. He thought he could use money to buy his way to the top. But we thank General Constantino Chiwenga for showing us the way.\n\nGezas comments appear to confirm growing tensions within the ruling party, particularly between Mnangagwa loyalists and those aligned with Vice President Chiwenga.\n\nThe businessman Kudakwashe Tagwirei, widely seen as a Mnangagwa ally, was recently sidelined from the Central Committee of the ruling Zanu PF party an event Geza interpreted as a sign of shifting internal dynamics.\n\nTagwirei, you wanted to use the money you stole from the people to buy loyalty, Geza said. But Zimbabwe is not for sale.\n\nHe went further to condemn the continued influence of what he calls the Zviganandaa term he uses to describe corrupt and power-hungry elements around the President.\n\nZviganandas are still roaming free, Geza warned. But the chickens are coming home to roost. Be warned, Zvigananda!\n\nGeza accused Mnangagwa of feigning ignorance and denouncing corruption publicly while enabling it behind the scenes. Emmerson Mnangagwa is the godfather of Zvigananda, he charged. His sloganeering denouncing Zvigananda is cheap rhetoric.\n\nPasi nezvigananda! Zvigananda will fall. Mnangagwa, your grandstanding will never fool usyou are going very soon, he thundered.\n\nGeza ended his address with a rallying cry to what he termed progressive forces within the liberation movement and civil society. The progressive forces are alert. There is no turning back.\n\nWhile Zanu PF has not issued a formal response to Gezas comments, insiders say his remarks reflect deeper rifts within the party ahead of a potential succession showdown.\n\nFor now, Geza remains defiant and undeterred, determined to continue speaking out against what he calls the rot at the heart of the system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri War veteran Blessed Geza has intensified his criticism of President Emmerson Mnangagwa, branding him the “godfather of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/geza-sends-stern-warning-to-zvigananda/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Sends Stern Warning To Zvigananda…\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "Shock as Man Brutally Kills Neighbour’s 10-Year-Old Child in Harare",
            "url": "https://www.zimeye.net/2025/07/07/shock-as-man-brutally-kills-neighbours-10-year-old-child-in-harare/",
            "content": "By A Correspondent\n\nHarare  July 6, 2025A horrific crime has sent shockwaves across the Eatview community in Harare after a 10-year-old child was brutally murdered by a neighbour who had been entrusted to care for him.\n\nThe Zimbabwe Republic Police (ZRP) has confirmed the arrest of Kudzanayi Tapiwa Mukura, who now faces murder charges in connection with the tragic incident that occurred early Saturday morning, July 6, in Eatview Phase 14.\n\nAccording to police spokespersons, the victims mother had left the child in the custody of the suspect on Friday, July 5, to attend a memorial service in Goromonzi. The suspect, a neighbour and reportedly known to the family, was considered a trusted guardian for the short period.\n\nTragically, instead of ensuring the childs safety, Mukura is alleged to have stabbed the young boy once in the chest before mutilating his private parts, in what police described as a deeply disturbing and senseless act of violence.\n\nThe Zimbabwe Republic Police confirms the arrest of Kudzanayi Tapiwa Mukura in connection with a murder case involving a minor that occurred on 06/07/25 in Eatview Phase 14. The motive is still under investigation, the police said in a brief statement.\n\nAuthorities say the motive for the gruesome killing remains unclear, and investigations are ongoing. Forensic teams were dispatched to the scene, and a postmortem is expected to be conducted in the coming days to determine the full extent of the childs injuries.\n\nResidents in the quiet neighbourhood are reeling in shock. Community members expressed outrage and disbelief over the murder, especially given the trust placed in the accused.\n\nThis is beyond comprehension. That child was so innocent. We cannot understand what could lead someone to do this, said one neighbour, who asked not to be named.\n\nSocial workers and child protection activists have called for swift justice and better systems of community childcare support, warning that the case highlights the dangers children face even in supposedly safe environments.\n\nAs of now, Mukura remains in police custody, and further charges are likely as more details emerge. The ZRP has promised to provide updates as the case develops.\n\nThe incident adds to a worrying trend of violent crimes against minors in Zimbabwe, raising urgent questions about mental health support, community vigilance, and the protection of vulnerable children.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – July 6, 2025A horrific crime has sent shockwaves across the Eatview community in Harare after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/shock-as-man-brutally-kills-neighbours-10-year-old-child-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Shock as Man Brutally Kills Neighbour’s 10-Year-Old Child in Harare\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "Opposition Dead and Buried, Boasts Tatenda Mavetera",
            "url": "https://www.zimeye.net/2025/07/07/opposition-dead-and-buried-boasts-tatenda-mavetera/",
            "content": "By A Correspondent\n\nCHIKOMBA WEST  Zimbabwes ICT Minister and Chikomba West MP Tatenda Mavetera has sparked fresh political controversy after declaring that the opposition is dead and buried during a campaign rally held on Sunday.\n\nSpeaking at the launch of the Ward 10 by-election campaign, Mavetera claimed that the ruling ZANU PF was on an unstoppable trajectory, pointing to a growing number of defectors from opposition parties as evidence of a political shift on the ground.\n\nYesterday at the Ward 10 by-election campaign launch, Chikomba West witnessed over 10 committed returnees from opposition ranks rejoining the revolutionary ZANU PF, said Mavetera. This was not just a campaign rally  it is proof that our people see through opposition parties lies and disunity and are coming HOME to the party of DEVELOPMENT.\n\nHer remarks come amid ongoing debates about the state of opposition politics in Zimbabwe, where critics have accused the ruling party of exploiting state resources and intimidating dissenting voices. However, Mavetera painted a different picture, portraying the defection of former opposition supporters as a vote of confidence in ZANU PFs leadership and developmental agenda.\n\nTo the returnees, your return strengthens our collective mission, she said. To Ward 10 voters, this is your movement. Let us finish what we started on 26 July 2025. Together, we will triumph as we vote for Councillor Mukandi from the moving elephant  ZANU PF.\n\nThe event also featured the commissioning of a solar-powered borehole at Highview School Site in Ward 10, which Mavetera presented as a tangible sign of ZANU PFs commitment to grassroots development.\n\nBut her critics have blasted her comments as premature and inflammatory, especially in a region where political tensions remain high.\n\nMavetera is celebrating too early, said a former opposition councillor who asked not to be named. These are small symbolic defections, not a mass exodus. The real issues  poverty, corruption, poor service delivery  remain unresolved.\n\nDespite that, Mavetera appeared confident, positioning ZANU PF as the only viable political force in the country and dismissing the opposition as fractured and irrelevant.\n\nHer bold assertion  that the opposition is dead and buried  may please the ruling party base, but it is sure to deepen political divisions as Zimbabwe inches closer to the July 26 by-election.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent CHIKOMBA WEST – Zimbabwe’s ICT Minister and Chikomba West MP Tatenda Mavetera has sparked fresh political controversy … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/opposition-dead-and-buried-boasts-tatenda-mavetera/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition Dead and Buried, Boasts Tatenda Mavetera\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        },
        {
            "title": "Mnangagwa Going Soon, Declares Geza",
            "url": "https://www.zimeye.net/2025/07/07/mnangagwa-going-soon-declares-geza/",
            "content": "By Tinashe Sambiri\n\nOutspoken war veteran Blessed Geza has launched a scathing attack on President Emmerson Mnangagwa, declaring publicly that Mnangagwa is going soon during a fiery address on Sunday.\n\nGeza, who has in recent months emerged as a vocal critic of the President and his close allies, did not hold back as he took aim at Zvigananda within Zanu PF.\n\nYou are aware of what is happening in Zanu PF, Geza said.\n\nTagwirei was blocked from joining the Central Committee. He thought he could use money to buy his way to the top. But we thank General Constantino Chiwenga for showing us the way.\n\nGezas comments appear to confirm growing tensions within the ruling party, particularly between Mnangagwa loyalists and those aligned with Vice President Chiwenga.\n\nThe businessman Kudakwashe Tagwirei, widely seen as a Mnangagwa ally, was recently sidelined from the Central Committee of the ruling Zanu PF party an event Geza interpreted as a sign of shifting internal dynamics.\n\nTagwirei, you wanted to use the money you stole from the people to buy loyalty, Geza said. But Zimbabwe is not for sale.\n\nHe went further to condemn the continued influence of what he calls the Zviganandaa term he uses to describe corrupt and power-hungry elements around the President.\n\nZviganandas are still roaming free, Geza warned. But the chickens are coming home to roost. Be warned, Zvigananda!\n\nGeza accused Mnangagwa of feigning ignorance and denouncing corruption publicly while enabling it behind the scenes. Emmerson Mnangagwa is the godfather of Zvigananda, he charged. His sloganeering denouncing Zvigananda is cheap rhetoric.\n\nPasi nezvigananda! Zvigananda will fall. Mnangagwa, your grandstanding will never fool usyou are going very soon, he thundered.\n\nGeza ended his address with a rallying cry to what he termed progressive forces within the liberation movement and civil society. The progressive forces are alert. There is no turning back.\n\nWhile Zanu PF has not issued a formal response to Gezas comments, insiders say his remarks reflect deeper rifts within the party ahead of a potential succession showdown.\n\nFor now, Geza remains defiant and undeterred, determined to continue speaking out against what he calls the rot at the heart of the system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Outspoken war veteran Blessed Geza has launched a scathing attack on President Emmerson Mnangagwa, declaring publicly that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/07/mnangagwa-going-soon-declares-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Going Soon, Declares Geza\"</span></a></p>",
            "time": "06:44",
            "date": "08 Jul 2025"
        }
    ]
}