{
    "news": [
        {
            "title": "Maskiri Makes a Strong Comeback",
            "url": "https://www.zimeye.net/2025/01/04/maskiri-makes-a-strong-comeback/",
            "content": "By A Correspondent\n\nRenowned hip-hop artist Alishas weMaskiri is back in the spotlight, with his latest hit songs rapidly gaining attention across social media platforms. The rapper, celebrated for his clever lyrics, sharp punchlines, and signature wordplay, has confirmed that his musical journey is far from over.\n\nMaskiri has returned with two new tracks: Harare Drive and Huku, both released in December. These tracks have already made a significant impact, with Harare Drive accumulating 79,000 views on YouTube and Huku reaching 71,000 views by Thursday.\n\nI am back in the game, I am still here to do what I do! When I dropped Harare Drive in November, people didnt expect it, and I want to show them I still got it, Maskiri shared. He continued, I made sure to keep up with the current beats but maintain that Maskiri style you know, from punchlines to metaphors and wordplay. Especially after reading the comments on the video, I knew Id get the positive reactions I got from people. I am Maskiri the skilled one, I am hip-hop.\n\nThe Chitungwiza-based rapper is also excited about the rising talent within Zimbabwes hip-hop scene. He expressed his admiration for the new generation of artists, saying, These days there is Volts JT, Bagga, TGonzi, Holy Ten and I enjoy their skills because it is hip hop. As long as its hip hop, it doesnt matter if I have beef with someone or not, I love it because its hip hop.\n\nMaskiri also reassured his fans: To my fans, I wont disappoint you, Im here to stay, look out for more hits during the year.\n\nWith his songs gaining traction online, Maskiri is clearly poised for a strong return to the urban charts, further cementing his place in the Zim hip-hop scene.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Renowned hip-hop artist Alishas weMaskiri is back in the spotlight, with his latest hit songs rapidly gaining … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/04/maskiri-makes-a-strong-comeback/\">Continue reading<span class=\"screen-reader-text\"> \"Maskiri Makes a Strong Comeback\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "G40 Panicking Over State Security Appointments",
            "url": "https://www.zimeye.net/2025/01/04/g40-panicking-over-state-security-appointments/",
            "content": "Dear Editor.Have you noticed that the G40 faction is in sixes and sevens over the recent political move by ZANU PF President. In yet another master stroke of strategic planning and deployment President ED Mnangagwa has left the G40 in a serious panic.\n\nFollowing the announcement of the retirement of the Commissioner General of Police, the G40-aligned COZWA fabricated a narrative claiming that the former Commissioner had openly defied President Emmerson Mnangagwa by refusing to be retired. This prompted an official police statement aimed at quelling the falsehoods stirred by G40 aligned COZWA.\n\nCOZWA was not alone in trying to sow confusion and discord over the appointments. Walter Mzembi, a prominent G40 kingpin, took to social media platform X (formerly Twitter) to express his views on the newly appointed officials, particularly Dr. Fulton Upenyu Magwanya, who has been described as a career intelligence officer. Mzembis post reads: Career Intelligence Officers will be pleased with the appointment of Dr. Fulton Upenyu Magwanya, a sober and disciplined Civil Servant. Looking forward to more professional reporting not concocted reports targeting personalities and creating non-existent enemies of the State. Fulton brought much-needed sanity in Parks & Wildlife. Well done @edmnangagwa.\n\nWhile Mzembis approval of Magwanya marks an apparent endorsement of the new direction under the President, it raises eyebrows given his history of swiftly reversing support. Mzembi, whose stateless predicament has him floating between various countries, is known for praising appointees only to later attack them when it suits his agenda. Notably, he previously lauded John Mushayavanhus appointment as Governor of the Reserve Bank before launching into personal jabs against Mushayavanhu.\n\nAdding to the tumult, Saviour Kasukuwere, self-proclaimed President of the G40, opted for sarcasm in response to the reshuffles. He posted an image of a luxurious bottle of Macallan whisky accompanied by the caption, This is the most expensive whisky and has a key role in the governance of countries. Some get fired or promoted at elite drinking binges in the farms around our good country. Good day MaCitizens. His mocking tone underscores the displeasure and the displeasure of G40 over the appointments.\n\nAs members of the G40 grapple with the implications of these appointments, it is clear that this upheaval means any influence of the G40 within the government will never return. Observers note that the mounting criticisms and backdoor scheming by G40 are symptomatic of a dead faction scrambling to retain its relevance amid a changing political environment.\n\n-Mazowe Agenda For Development\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dear Editor. Have you noticed that the G40 faction is in sixes and sevens over the recent political move by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/04/g40-panicking-over-state-security-appointments/\">Continue reading<span class=\"screen-reader-text\"> \"G40 Panicking Over State Security Appointments\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "Khama Billiat Joins Scotland FC",
            "url": "https://www.zimeye.net/2025/01/04/khama-billiat-joins-scotland-fc/",
            "content": "Former Warriors, Kaizer Chiefs, Mamelodi Sundowns, and Yadah FC forward Khama Billiat has signed with newly promoted PSL side, Scotland FC.\n\nYadah FC issued a statement on Friday expressing their gratitude to the player:\n\nTHANK YOU!!\n\nYadah FC owner Prophet Walter Magaya, the executive team, technical staff, and supporters would like to extend their heartfelt thanks to Khama Billiat for his remarkable 2024 season in Yadah FC colors.\n\nKhama Billiat, an inspiration to many and an idol to both the young and old, has now joined Scotland FC. His exploits with Yadah FC will always be etched in the hearts of our supporters.\n\nAs a player who embodies humility and has enjoyed a distinguished career, Khama came, conquered, and left an indelible mark. We are thankful for the unforgettable memories he has given us.\n\nGo in grace, Khama. Go and conquer. You will forever remain in our hearts, talisman.\n\nAdis, the mercurial one (Khama Billiat).\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Former Warriors, Kaizer Chiefs, Mamelodi Sundowns, and Yadah FC forward Khama Billiat has signed with newly promoted PSL side, Scotland … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/04/khama-billiat-joins-scotland-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Khama Billiat Joins Scotland FC\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "Remembering Richard Chihoro: A Football Icon",
            "url": "https://www.zimeye.net/2025/01/04/remembering-richard-chihoro-a-football-icon/",
            "content": "Sports Correspondent\n\nThe Zimbabwean football world is in mourning with the passing of Richard Chihoro, a former manager of Dynamos Football Club.\n\nChihoro, who dedicated much of his life to the club, held several roles, including team manager, assistant coach, and director of football. He passed away on Friday morning at the age of 68.\n\nHis connection to Dynamos dates back to the late 1960s when he joined as a junior player. Over the years, Chihoros commitment and passion for the club saw him rise through the ranks to become one of its most respected and beloved figures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwean football world is in mourning with the passing of Richard Chihoro, a former manager of Dynamos … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/04/remembering-richard-chihoro-a-football-icon/\">Continue reading<span class=\"screen-reader-text\"> \"Remembering Richard Chihoro: A Football Icon\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "Woman Stabbed By Lover In Mzansi",
            "url": "https://www.zimeye.net/2025/01/04/woman-stabbed-by-lover-in-mzansi/",
            "content": "By A Correspondent\n\nA 26-year-old woman is fighting for her life after being stabbed multiple times by her boyfriend in Kempton Park.\n\nThe altercation turned violent, prompting community members to intervene and restrain the 30-year-old suspect.\n\nHe has been arrested and charged with attempted murder.\n\nThe victim is receiving medical treatment at Thembisa Tertiary Hospital.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 26-year-old woman is fighting for her life after being stabbed multiple times by her boyfriend in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/04/woman-stabbed-by-lover-in-mzansi/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Stabbed By Lover In Mzansi\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "Government Imposes Fishing Ban at Lake Chivero Amid Environmental Crisis",
            "url": "https://www.zimeye.net/2025/01/04/government-imposes-fishing-ban-at-lake-chivero-amid-environmental-crisis/",
            "content": "By A Correspondent\n\nThe government has enforced a ban on fishing at Lake Chivero until comprehensive investigations by the Ministry of Health and Child Care are concluded. The ban follows a significant environmental disaster, with reports of water contamination leading to the loss of wildlife and aquatic life in the area.\n\nAt a media briefing held at Munhumutapa Building in Harare on Thursday, Dr. Sithembiso Nyoni, the Minister of Environment, Climate, and Wildlife, spoke candidly about the crisis. She labeled the situation at Lake Chivero as critical and emphasized the need for an integrated approach to address the severe pollution and ecological disruptions affecting the lake.\n\nGoing forward, we will rope in the Ministry of Health to do the finding because we want to save lives. The ban cannot be lifted now and a whole of government and stakeholders approach is required to reverse the situation at Chivero, stated Minister Nyoni.\n\nThe fishing ban comes after alarming reports of poisoning in the water, which has caused widespread damage to both animal and aquatic populations. While the Ministry of Environment has been at the forefront of managing the crisis, questions are being raised about the adequacy of government actions.\n\nCritics argue that the governments shifting of responsibility onto the Ministry of Health highlights a failure to address the root causes of the disaster effectively. Many believe that the continued environmental degradation at Lake Chivero could have been prevented with earlier and more decisive action. The shifting of blame has left some questioning the governments ability to handle such a major environmental catastrophe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The government has enforced a ban on fishing at Lake Chivero until comprehensive investigations by the Ministry … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/04/government-imposes-fishing-ban-at-lake-chivero-amid-environmental-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Government Imposes Fishing Ban at Lake Chivero Amid Environmental Crisis\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "Prioritize Safety: Avoid Speeding",
            "url": "https://www.zimeye.net/2025/01/03/prioritize-safety-avoid-speeding/",
            "content": "It is essential to always adhere to speed limits while driving. In areas where speed limits are not posted, its crucial to drive at a controlled speed, particularly during the night. Broken-down vehicles, especially trucks, are sometimes left on the road without sufficient warning signals, such as proper warning triangles. This poses a significant hazard, particularly on curves and bends, where visibility is limited.\n\nBy slowing down, especially at night, you can ensure you have enough time to react to unexpected obstacles and potentially avoid dangerous situations. Remember, driving within safe speed limits is not just about following the lawits about protecting yourself and others on the road.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :tr*************@gm***.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "It is essential to always adhere to speed limits while driving. In areas where speed limits are not posted, it’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/prioritize-safety-avoid-speeding/\">Continue reading<span class=\"screen-reader-text\"> \"Prioritize Safety: Avoid Speeding\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "Chivayo Surprises Airport Woman with USD 5000 After Controversial Incident",
            "url": "https://www.zimeye.net/2025/01/03/chivayo-surprises-airport-woman-with-usd-5000-after-controversial-incident/",
            "content": "By A Correspondent\n\nControversial Zanu PF businessman Wicknell Chivayo has made headlines again, this time by giving away USD 5000 to a woman who was left out after he distributed money to airport staff during a recent visit to Victoria Falls. The incident, which caused an online stir, has sparked both criticism and a surprising act of generosity from Chivayo.\n\nChivayo explained the situation in a statement, acknowledging the misunderstanding that led to the womans embarrassment. From VICTIM to VICTORY he began, addressing the unfortunate criticism directed at the woman in the viral video. My attention has been drawn to the unfortunate criticism directed at the woman in the video circulating on social media, who did not receive USD 100 like other airport staff during my recent visit to Victoria Falls.\n\nThe businessman explained that during his trip, he had decided to show gratitude to the airport staff who were on duty during the Christmas holiday. As I prepared to board my private jet back to Harare in the company of my beautiful and beloved partner, I felt deeply moved by the airport staff who were on duty, sacrificing time with their families during Christmas time. Out of gratitude and compassion, I decided to bless the staff wearing green reflective vests with USD 100 each as a small token of appreciation.\n\nHowever, things took a turn when other people, including the woman, mistakenly approached Chivayo for money. Unfortunately, this kind gesture was misunderstood, and other non-staff members, including the woman in question, began to join in, leading to the regrettable incident, he explained.\n\nIn the video that went viral, the woman in a pink top and blue jeans was seen trying to get her share, but after Chivayo realized that she wasnt part of the airport staff, he stopped giving out money. The woman was left out, which led to her making frantic requests to receive USD 100. When I stopped giving out the money, the woman in the pink top and blue jeans was unfortunately left out, despite making frantic requests to also get the USD.\n\nChivayo expressed regret over the situation, which led to the woman facing online ridicule. This incident has regrettably subjected her to online ridicule and derogatory comments. I personally dont know this woman, but I wish to extend my heartfelt apology for the public embarrassment she has endured, as well as to her family and husband, if she is married, he said.\n\nHe acknowledged the womans actions, stating that he understood why she approached him. I understand her actions. I would have done exactly the same thing if I saw a millionaire giving money in that context. This woman simply decided to seize the opportunity out of hope and necessity.\n\nIn a gesture to make amends, Chivayo offered a significant amount of money. As a small gesture of my goodwill and token of apology for the unfortunate incident, please urgently contact my lawyer, Mr. Sikhumbuzo Mpofu of Munangate & Associates and collect USD 5000 cash for the reputational damage this incident has caused, Chivayo announced. I wish you and your family a prosperous 2025!\n\nThis move from Chivayo, who is known for his controversial public image, marks an unexpected resolution to a situation that sparked both public derision and a surprising act of kindness.\n\nFrom VICTIM to VICTORYMy attention has been drawn to the UNFORTUNATE CRITICISM directed at the woman in the video circulating on social media, who did not receive USD100 like other airport staff during my recent visit to VICTORIA FALLS. As I prepared to board my private jetpic.twitter.com/syEqdldRMT\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF businessman Wicknell Chivayo has made headlines again, this time by giving away USD 5000 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/chivayo-surprises-airport-woman-with-usd-5000-after-controversial-incident/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Surprises Airport Woman with USD 5000 After Controversial Incident\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "Fear Grips Kariba as Lions Roam Free",
            "url": "https://www.zimeye.net/2025/01/03/fear-grips-kariba-as-lions-roam-free/",
            "content": "By A Correspondent\n\nResidents of Kariba have been strongly advised to stay away from bush pathways, particularly at night, following reports of two lionesses crossing the main road into a nearby bush corridor near Summerset Road.\n\nDebbie Ottman, spokesperson for the Kariba Animal Welfare Trust Fund, issued a warning to the community, urging caution in light of the recent sighting. It is vital to walk in groups of at least two or more individuals and to stay on the main roads, avoiding pathways through the bush, particularly at night, Ottman advised in an interview with NewsDay.\n\nKariba, situated within a wildlife area teeming with lions and other predators, poses unique risks for both residents and visitors. Ottman emphasized the importance of vigilance and added that anyone who spots a lion should report it promptly. \n\nReporting sightings helps us monitor their movements and ensures the safety of the community, she said.\n\nWith the presence of wildlife in the area, Ottmans advice serves as a crucial reminder for everyone to stay alert and prioritize safety when moving around at night.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Residents of Kariba have been strongly advised to stay away from bush pathways, particularly at night, following … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/fear-grips-kariba-as-lions-roam-free/\">Continue reading<span class=\"screen-reader-text\"> \"Fear Grips Kariba as Lions Roam Free\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        },
        {
            "title": "7-Year-Old Survives Four Days In Lion-Infested Game Park",
            "url": "https://www.zimeye.net/2025/01/03/7-year-old-survives-four-days-in-lion-infested-game-park/",
            "content": "By Munacho Gwamanda-Aseven-year-old fromthe Marindi area of Manhanga, north of Kariba in Mashonaland West Province, has captured thenationsadmiration aftersurvivingfour harrowing days in the lion-infested wilderness of Matusadonha National Park, subsisting on wild fruits and water he ingeniously accessed by digging holes in a dry riverbed.\n\nTinotenda went missing on December 27, 2024, sparking a desperate search operation involving the Zimbabwe Parks and Wildlife Management Authority (ZimParks), local villagers, and the Zimbabwe Republic Police (ZRP).\n\nHeavy rains initially hampered the search as they washed away his tracks, but the persistence of the search party paid off.\n\nOn December 30, his footprints were found in the Sakata Valley area, leading to his miraculous rescue the following morning.\n\nZimParks spokesperson Tinashe Farawo detailed the incredible journey, noting that Tinotenda had walked an estimated 49kilometersthrough the treacherous park.\n\nDespite being surrounded by predators, including lions, theboysresourcefulness and resilience ensured his survival.\n\nAfter being found on December 31, Tinotendawas immediately takenfor medical examinations at Siakobvu Hospital, where hewasreportedto bein stable condition.\n\nThe search effort, lauded as a model of community collaboration, demonstrated the strength of unity in the face of adversity.\n\nTheboysdisappearance and subsequent rescue were widely followed, with Mashonaland West Proportional Representation MP Mutsa Murombedzi announcing updates on social media.\n\nHis story hassincebecome a beacon of hope and a testament to the humanspiritsability to endure.\n\nTinotendasincredible feat has earned him a place in Zimbabwean folklore as a symbol of bravery and survival against all odds.\n\nThe nation celebrates this young hero, whose lion-hearted courage willbe rememberedfor generationsto come.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-A seven-year-old from the Marindi area of Manhanga, north of Kariba in Mashonaland West Province, has captured the nation’s admiration after surviving four harrowing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/7-year-old-survives-four-days-in-lion-infested-game-park/\">Continue reading<span class=\"screen-reader-text\"> \"7-Year-Old Survives Four Days In Lion-Infested Game Park\"</span></a></p>",
            "time": "21:26",
            "date": "04 Jan 2025"
        }
    ]
}