{
    "news": [
        {
            "title": "Mnangagwa Extends Own Cousin-Brother Phillip Valerio Sibanda’s Military Job Post",
            "url": "https://www.zimeye.net/2025/01/07/mnangagwa-extends-own-cousin-brother-phillip-valerio-sibandas-military-job-post/",
            "content": "By Dorrothy Moyo |Harare In a move that has sparked widespread criticism and reignited accusations of nepotism, President Emmerson Mnangagwa has extended the tenure of his cousin-brother, General Phillip Valerio Sibanda, as Commander of the Zimbabwe Defence Forces (ZDF) for another year. The extension, announced in the Government Gazette dated January 3, 2025, ensures General Sibanda remains in his role until November 2025.\n\nThe decision, framed by Mnangagwa as essential for maintaining stability in the military, has fueled speculation about the presidents reliance on close family ties to consolidate power within Zimbabwes security and governance structures.\n\nExtension Amid Leadership Shuffles\n\nThe announcement of General Sibandas extended term follows the retirement of Police Commissioner General Godwin Matanga, aged 61, who was replaced by Stephen Mutamba, a 63-year-old with reported familial connections to First Lady Auxillia Mnangagwa. These developments have raised questions about the consistency of retirement policies, with critics arguing that the rules are selectively applied to favor Mnangagwas relatives and allies.\n\nGeneral Sibanda, a close relative of the president, has long been a central figure in Zimbabwes military hierarchy. His leadership has been instrumental in maintaining cohesion within the ZDF during politically turbulent times. However, his familial ties to Mnangagwa have fueled concerns over nepotism, with opposition leaders accusing the president of prioritizing family loyalty over institutional integrity.\n\nConsolidating Power Through Family Appointments\n\nThe extension of Sibandas term and the appointment of Stephen Mutamba as Police Commissioner General are seen as part of a broader strategy by Mnangagwa to tighten his grip on power. Mutamba, reportedly a senior relative of the First Lady, has faced accusations of being a politically convenient choice rather than the best candidate for the role.\n\nMilitary Promotions Add to Speculation\n\nThe controversy over Sibandas extended tenure coincides with the promotion of 26 Zimbabwe National Army (ZNA) Lieutenant Colonels to the rank of Colonel. While these promotions were celebrated as a recognition of hard work and dedication, the timing has added to the perception of a carefully orchestrated power consolidation.\n\nAt the promotion ceremony held at Josiah Magama Tongogara Barracks, ZNA Chief of Staff Quarter Master Staff, Major General Simo Maseko, emphasized the importance of professionalism and loyalty. However, critics argue that the culture of promotions and appointments is increasingly influenced by political considerations.\n\nPolitical Implications and Public Reaction\n\nThe reliance on relatives and close allies in key positions raises concerns about the erosion of institutional independence. With General Sibanda as a trusted family member and Mutamba tied to the First Family, Mnangagwa has placed the countrys most critical security apparatus firmly under the control of his inner circle.\n\nA Critical Moment for Zimbabwe\n\nMnangagwas latest moves come at a time of increasing public discontent over economic hardships and governance issues. As the 2028 elections approach, these leadership changes are likely to shape the political landscape, with questions about fairness and transparency at the forefront.\n\nWhile supporters of Mnangagwa argue that these appointments ensure stability and continuity, detractors see them as yet another example of a president prioritizing personal interests over national progress. The extension of General Sibandas tenure, in particular, has become a lightning rod for criticism, symbolizing the perceived entrenchment of a political dynasty.\n\nAs Zimbabwes political and economic challenges intensify, the focus will remain on how these leadership changes impact the nations future. Whether they strengthen governance or deepen public mistrust remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Harare – In a move that has sparked widespread criticism and reignited accusations of nepotism, President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/mnangagwa-extends-own-cousin-brother-phillip-valerio-sibandas-military-job-post/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Extends Own Cousin-Brother Phillip Valerio Sibanda’s Military Job Post\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Chivayo Luxury-Cars Can Be SoldOff To Buy USD10 Million Worth of Solar Panel",
            "url": "https://www.zimeye.net/2025/01/07/chivayo-luxury-cars-can-be-soldoff-to-buy-usd10-million-worth-of-solar-panel/",
            "content": "The USD10 million worth of luxury cars splurged by the convicted money launderer Wicknell Chivayo if disposed of, could purchase solar farms worth of panels to power all hospitals and clinics in the country so they have non stop voltage without intermission.\n\nHundreds of millions of Dollars More\n\nWillowvale Motors could not meet demand for brand new vehicles in Zimbabwe in 1988. Because of the shortage, one needed to prove special urgency circumstances to jump the long waiting queue in order to buy a car.\n\nSome Ministers started writing letters requesting Willowvale Motors to give special preference to some individual buyers or companies who were after new vehicles, mainly Mazda and Toyotas, topping the Toyota list being the Cressida.\n\nA total 120 cars were sold to individuals this way and 103 of them were resold to desperate companies like Triangle Sugar Estates at 4 times the market price. This summarizes the infamous 1988/89 Willowgate Scandal.\n\n4 Cabinet Miniisters resigned in shame, and the 5th committed suicide.\n\nThis was after President Robert Mugabe set an Independent Commission of Inquiry led by Justice Wilson Sandura to investigate the scandal.\n\nThis by far was the greatest corruption scandal of the first decade of independent Zimbabwe.\n\nThe Commission concluded there were evident integrity and ethics failures, but did not find the writing of letters by the involved Ministers constituting criminal offending.\n\nPresident Robert Mugabe visited the White House at the time of the scandal and on return said the Amerucans were asking him where the actual crime was in the whole scandal.\n\nFredrick Shava at Foreign Affairs today, or is it now Higher zeducation, was one of the 5 shamed Ministers. He is back today of course.\n\nNow compare this to Wicknell Chivayo s $100 million ZEC looting scandal, compare that to the Chivayo Solar Energy ZESA scandal, compare it to the $120 million Drax scandal, compare it to the $100 million per month gold smuggling scandal, compare it to the $104 million Belarus Zupco scandal, compare it to the ongoing selling of Tongaat Hullets, compare it to the looting of chrome, coal, granite today, compare it to the $88 million goat scandal involving Mpofu and Mike Chimombe, the list goes on.\n\nWillowgate happened when we still had a conscience to resign in shame and to kill ourselves over writing a mere letter to a friend so they can jump the purchasing queue.\n\nCompare the Sandura Comission to ZACC today. Its like the Archangel Gabriel compared to the Great Satan, writes Herald Columnist Reason Wafawarova.\n\n$10 million car money could buy 33,000 solar panels.\n\nWith an investment of $10 million, a solar power plant with a capacity ranging from approximately 3 to 10 megawatts (MW), depending on various factors such as location, technology, and specific project costs, could be established.\n\nA 10MW solar plant could meet the energy needs of a manufacturing industry like Sable Chemicals in Kwekwe, significantly reducing reliance on expensive and often unreliable electricity imports or fossil fuels. Such a facility would enable consistent production, lower operational costs, and improve energy independence, which is critical for industries like fertilizer production.\n\nThe decision to spend $10.5 million on luxury vehicles must therefore be critically evaluated against its opportunity cost to the nation. That same investment could have funded renewable energy infrastructure to power local manufacturing, reducing the need to import 100 tonnes of fertilizer. This would not only save foreign currency but also enhance local production, generate employment, and boost downstream industries that depend on a reliable supply of fertilizers for agricultural productivity. The lost opportunity represents a setback to both national economic growth and industrial self-sufficiency.\n\nCost Estimates for Solar Power Plants: Per Megawatt Cost: The cost of installing a 1 MW solar power plant typically ranges from $1 million to $3 million.  Total Capacity with $10 Million Investment: Lower Estimate: At $3 million per MW, a $10 million investment could fund approximately 3.33 MW of capacity. Upper Estimate: At $1 million per MW, the same investment could support up to 10 MW of capacity.\n\nPotential Power Generation: Average Energy Generation: A well-installed 1 MW solar power plant can generate an average of 4,200 kilowatt-hours (kWh) per day, translating to about 126,000 kWh monthly and 1.5 million kWh annually, depending on weather conditions and location. Total Annual Generation for 10 MW Plant:\n\nComparison with Expenditures on Luxury Cars:\n\nThe $10 million spent on luxury cars could have been alternatively invested in a solar power plant with a capacity between 3.33 MW and 10 MW.\n\nEnvironmental and Economic Benefits: Renewable Energy Contribution: Investing in solar power contributes to sustainable energy infrastructure, reducing reliance on fossil fuels and decreasing greenhouse gas emissions. Long-Term Savings: While the initial investment in solar power is substantial, it leads to long-term savings on energy costs and potential revenue from selling excess power back to the grid.\n\nThe $10 million expenditure on luxury vehicles represents a significant opportunity cost. Redirecting such funds towards renewable energy projects like solar power plants could have provided substantial power generation capacity, contributing to both economic and environmental benefits.\n\nTo calculate how many solar panels could be purchased with $10 million, we need to consider the cost per solar panel. The price of a solar panel varies based on size, type, and quality, but for a rough estimate:\n\nThe average cost of a single residential solar panel is approximately $200 to $300.\n\nCommercial solar panels or larger panels may cost $400 to $600 each.\n\nLets calculate the number of solar panels based on these price ranges.\n\nCalculation:\n\n1. Using the average cost of $300 per panel:\n\n2. Using the higher cost of $600 per panel (commercial grade):\n\nResult:\n\nWith $10 million, one could purchase between 16,667 and 33,333 solar panels, depending on the quality and size of the panels.( contributors- Reason Wafawarova; Wilbert Mukori)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The USD10 million worth of luxury cars splurged by the convicted money launderer Wicknell Chivayo if disposed of, could purchase … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/chivayo-luxury-cars-can-be-soldoff-to-buy-usd10-million-worth-of-solar-panel/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Luxury-Cars Can Be SoldOff To Buy USD10 Million Worth of Solar Panel\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Desecration Of Graves At Chitungwiza Cemetery Worrisome",
            "url": "https://www.zimeye.net/2025/01/07/desecration-of-graves-at-chitungwiza-cemetery-worrisome/",
            "content": "By A Correspondent\n\nThe grave of the late Madzibaba Godfrey Nzira at Chitungwiza Cemetery has sparked controversy after it was revealed that a path leading to his burial site was constructed over other graves.\n\nNzira, a well-known spiritual leader, is buried at the cemetery, and his grave stands out prominently, drawing the attention of visitors. However, the path allegedly built by his church members and family has caused outrage, as it appears to have desecrated several graves in the process.\n\nOne local resident expressed their disapproval, stating, Thats inhumane. We should respect the dead. Those with relatives buried here dont even have a clue where their relatives remains are buried now. Another resident also condemned the actions, remarking, This is not allowed. In our culture, desecrating a grave is taboo.\n\nConcerns have also been raised about the reasoning behind the relocation of other graves to make way for the path. We dont know whats so special about this person to the extent of displacing other graves, said another individual.\n\nCriticism has also been directed at the local authorities for permitting the construction. The town council is answerable. How can they allow something like this to happen? Relatives of the deceased must sue them, one resident added.\n\nIn response to the outcry, Chitungwiza Municipality spokesperson Mr. Tafadzwa Kachiko confirmed that the local authority had launched an investigation into the matter. Desecration of graves is in violation of council by-laws, and we are looking into the matter so that we ascertain what transpired so that those responsible for this are held accountable, Kachiko stated.\n\nMadzibaba Nzira, who passed away in 2011, had been released a few months earlier after serving a 20-year sentence for rape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The grave of the late Madzibaba Godfrey Nzira at Chitungwiza Cemetery has sparked controversy after it was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/desecration-of-graves-at-chitungwiza-cemetery-worrisome/\">Continue reading<span class=\"screen-reader-text\"> \"Desecration Of Graves At Chitungwiza Cemetery Worrisome\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "MSD Warns Of Impending Floods",
            "url": "https://www.zimeye.net/2025/01/07/msd-warns-of-impending-floods/",
            "content": "The Meteorological Services Department (MSD) has issued a warning of heavy rains, thunderstorms, and flash floods expected to hit most parts of Zimbabwe until Saturday, January 11, 2025. Heavy downpours exceeding 50 millimeters within 24 hours are expected across the country, with an abundance of moisture in the atmosphere causing rainfall since late December 2024.\n\nAccording to the MSD, areas such as Matabeleland North, northern areas of Midlands, Harare Metropolitan, northern parts of Manicaland, and all Mashonaland Provinces can expect scattered thundershowers from January 5-8, 2025. Additional moisture from the southeast coast of Southern Africa is expected to bring cloudy, windy, and cold conditions over Matabeleland South, Masvingo, and Manicaland Provinces by Wednesday evening.\n\nThe MSD warned that rain showers are expected to intensify in the southern parts of Mashonaland West, Mashonaland East, and Harare Metropolitan Provinces by Friday, January 10, with rainfall exceeding 50mm in 24 hours. The department cautioned that potential flooding can occur even in areas that might not have experienced heavy rains, and violent storms could lead to falling trees, blown-off rooftops, and collapsing billboards due to strong winds.\n\nResidents are advised to take necessary precautions and stay informed about weather updates to ensure their safety.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Meteorological Services Department (MSD) has issued a warning of heavy rains, thunderstorms, and flash floods expected to hit most … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/msd-warns-of-impending-floods/\">Continue reading<span class=\"screen-reader-text\"> \"MSD Warns Of Impending Floods\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Video of Wicknell Chivayo Boasts He’s Got Diplomatic Passport At Airports",
            "url": "https://www.zimeye.net/2025/01/07/video-of-wicknell-chivayo-boasts-hes-got-diplomatic-passport-at-airports/",
            "content": "VIDEO LOADING BELOW\n\nReport: The Implications of Wicknell Chivayos Airport Privileges\n\nWicknell Chivayo, the boasting ZANU PF money laundering convict, often showcases his lifestyle and privileges, particularly when it comes to his treatment at airports. He claims that his passport is cleared without him entering the airport, a police escort is always available outside his private jet, and he bypasses immigration entirely. These assertions paint a picture of extraordinary privilege and raise important questions about the implications of such actions.\n\nKey Observations\n\nChivayos claim that his passport is cleared without entering the airport suggests he has access to privileges typically reserved for the most elite. This highlights the influence he holds and raises questions about how such special treatment is granted. It signals an erosion of equality, where some individuals can circumvent systems meant to serve everyone equally.\n\nThe presence of a police car waiting outside his private jet implies a high level of state-backed security. While such treatment is common for heads of state or diplomats, Chivayos status as a businessman raises concerns about the use of public resources for private individuals. This sparks debates about fairness and the priorities of law enforcement.\n\nSkipping immigration entirely is a significant claim, as immigration checks are a cornerstone of national security and border control. For someone to avoid this process suggests a troubling disregard for standard protocols, which could compromise national security and highlight the selective application of the law.\n\nWhat Do These Actions Represent?\n\nChivayos behavior serves as a bold display of power and privilege. By flaunting these benefits, he reinforces his public persona as an untouchable figure who operates beyond the rules that apply to ordinary citizens. These actions symbolize the growing divide between those with influence and the rest of society.\n\nHis claims also reflect the ways in which wealth and political connections can grant immunity from standard procedures. This undermines the ideals of fairness and equality, leaving ordinary citizens questioning the integrity of institutions.\n\nIn addition, his public demonstrations may also be intended to send a message to his allies and critics, emphasizing his access to state resources and his perceived dominance within Zimbabwes socio-political landscape.\n\nConcerns and Consequences\n\nDisplays of privilege like this erode trust in institutions. Citizens may begin to feel that the systems in place are not designed to serve them, but rather to cater to the elite.\n\nThe bypassing of immigration procedures is particularly troubling, as it sets a precedent for others to demand similar treatment. This could weaken the countrys ability to enforce border security and uphold the rule of law.\n\nThe use of police escorts and other VVIP services for private convenience raises questions about the allocation of public resources. Such actions detract from the broader mandate of serving the public and addressing national needs.\n\nWicknell Chivayos public demonstrations of privilege highlight deeper systemic issues in Zimbabwe. They reflect a culture where influence and wealth can override laws and processes, creating a sense of inequality and impunity. Addressing these issues requires stronger accountability mechanisms, transparency in the granting of privileges, and a commitment to fairness in the treatment of all citizens. Without these measures, public trust in governance and institutions will continue to erode, deepening societal divisions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW… Report: The Implications of Wicknell Chivayo’s Airport Privileges Wicknell Chivayo, the boasting ZANU PF money laundering convict, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/video-of-wicknell-chivayo-boasts-hes-got-diplomatic-passport-at-airports/\">Continue reading<span class=\"screen-reader-text\"> \"Video of Wicknell Chivayo Boasts He’s Got Diplomatic Passport At Airports\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Malunga Unleashes Scathing Attack on Mnangagwa",
            "url": "https://www.zimeye.net/2025/01/07/malunga-unleashes-scathing-attack-on-mnangagwa/",
            "content": "By A Correspondent\n\nLegendary musician and former freedom fighter Clive Malunga has launched a blistering attack on President Emmerson Mnangagwa, labeling him heartless and accusing him of running the country like a tuckshop.\n\nThis is not Malungas first criticism of Mnangagwa, as he spoke out against him last year.\n\nIn a video circulating on social media, Malunga expressed his frustration with Zimbabwes current state of affairs, stating, You see, fear factor is our major setback. Mr. Mnangagwa is taking us for granted. He is failing to feed the nation. This has gone too far. We have to challenge this.\n\nMalunga drew parallels between Mnangagwas leadership and that of former President Robert Mugabe, who was ousted in 2017. Remember Robert Mugabe also exploited us, and now Mnangagwa is doing the same thing. Mr. Mnangagwa is heartless, Malunga added.\n\nMalungas criticism comes amid growing concerns about Zimbabwes economic and social challenges. His outspoken comments have sparked debate among Zimbabweans, with some praising his courage and others criticizing his approach. Malunga has been a vocal critic of Mnangagwas administration, earning him both support and backlash .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Legendary musician and former freedom fighter Clive Malunga has launched a blistering attack on President Emmerson Mnangagwa, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/malunga-unleashes-scathing-attack-on-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Malunga Unleashes Scathing Attack on Mnangagwa\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Young Mighty Warriors Pull Out of U17 World Cup Qualifiers",
            "url": "https://www.zimeye.net/2025/01/07/young-mighty-warriors-pull-out-of-u17-world-cup-qualifiers/",
            "content": "In a shocking decision, the Zimbabwe Football Association (ZIFA) has withdrawn the Young Mighty Warriors from the FIFA Under-17 Womens World Cup Qualifiers. The team was initially set to face Ethiopia in the first round, with the first leg scheduled for this month.\n\nAccording to the Ethiopian Football Federation, Zimbabwes withdrawal means Ethiopia will automatically advance to the next round. Ethiopia were drawn to play Zimbabwe in the first round of Womens Under 17 qualifiers. However, the matches have been canceled due to Zimbabwe withdrawing from the competition, the statement read.\n\nAs a result, Ethiopia will now face the winner of the Egypt and Cameroon match in the next round. ZIFA has not disclosed the reason behind their decision to withdraw the team from the competition, leaving many questions unanswered.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In a shocking decision, the Zimbabwe Football Association (ZIFA) has withdrawn the Young Mighty Warriors from the FIFA Under-17 Women’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/young-mighty-warriors-pull-out-of-u17-world-cup-qualifiers/\">Continue reading<span class=\"screen-reader-text\"> \"Young Mighty Warriors Pull Out of U17 World Cup Qualifiers\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Olmo Future Uncertain",
            "url": "https://www.zimeye.net/2025/01/07/olmo-commits-to-barcelona-amid-registration-drama/",
            "content": "By A Correspondent\n\nThe agent of FC Barcelona midfielder Dani Olmo has reassured fans that the player is committed to staying with the club, despite being de-registered by La Liga due to financial issues.\n\nAndy Bara, Olmos agent, spoke out about the players future, saying: Danis feelings? Its a stressful situation for him as would be for any other player but hes a great player & person, hes trying to be calm.\n\nBara also highlighted Olmos competitive spirit, stating: Of course, Dani is a winner and he loves to play the games, not to watch them. The agents comments suggest that Olmo is eager to resolve the registration issue and continue playing for Barcelona.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The agent of FC Barcelona midfielder Dani Olmo has reassured fans that the player is committed to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/olmo-commits-to-barcelona-amid-registration-drama/\">Continue reading<span class=\"screen-reader-text\"> \"Olmo Future Uncertain\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Basketball Legend Dies",
            "url": "https://www.zimeye.net/2025/01/07/basketball-legend-dies/",
            "content": "By A Correspondent\n\nThe Harare basketball community is reeling in shock and sadness following the passing of renowned basketball personality, Ngoni Mukukula, on Sunday. Mukukulas demise has left a gaping void in the local basketball scene, where he was a towering figure and a passionate advocate for the sport.\n\nIn a heartfelt tribute, the Harare Basketball Association (HBA) remembered Mukukula as a phenomenal basketball player, coach, administrator, team manager, and a champion of the underprivileged. His influence on the sport was immense, particularly in his hometown of Dzivarasekwa, where he was instrumental in developing community-based basketball programs aimed at empowering young people.\n\nMukukulas impressive credentials included stints as a coach and administrator of the womens national team. He was also the co-founder of Hoops 4 Hope, an innovative initiative that leverages basketball to improve lives, provide a safe haven from substance abuse, and identify and nurture talent within the community.\n\nAs the Harare basketball community comes to terms with Mukukulas passing, they will undoubtedly remember his tireless dedication, passion, and commitment to the sport and its development. His legacy will undoubtedly continue to inspire future generations of basketball enthusiasts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Harare basketball community is reeling in shock and sadness following the passing of renowned basketball personality, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/basketball-legend-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Basketball Legend Dies\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        },
        {
            "title": "Controversy Over Madzibaba Nzira Grave",
            "url": "https://www.zimeye.net/2025/01/07/controversy-over-madzibaba-nzira-grave/",
            "content": "By A Correspondent\n\nThe grave of the late Madzibaba Godfrey Nzira at Chitungwiza Cemetery has sparked controversy after it was revealed that a path leading to his burial site was constructed over other graves.\n\nNzira, a well-known spiritual leader, is buried at the cemetery, and his grave stands out prominently, drawing the attention of visitors. However, the path allegedly built by his church members and family has caused outrage, as it appears to have desecrated several graves in the process.\n\nOne local resident expressed their disapproval, stating, Thats inhumane. We should respect the dead. Those with relatives buried here dont even have a clue where their relatives remains are buried now. Another resident also condemned the actions, remarking, This is not allowed. In our culture, desecrating a grave is taboo.\n\nConcerns have also been raised about the reasoning behind the relocation of other graves to make way for the path. We dont know whats so special about this person to the extent of displacing other graves, said another individual.\n\nCriticism has also been directed at the local authorities for permitting the construction. The town council is answerable. How can they allow something like this to happen? Relatives of the deceased must sue them, one resident added.\n\nIn response to the outcry, Chitungwiza Municipality spokesperson Mr. Tafadzwa Kachiko confirmed that the local authority had launched an investigation into the matter. Desecration of graves is in violation of council by-laws, and we are looking into the matter so that we ascertain what transpired so that those responsible for this are held accountable, Kachiko stated.\n\nMadzibaba Nzira, who passed away in 2011, had been released a few months earlier after serving a 20-year sentence for rape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The grave of the late Madzibaba Godfrey Nzira at Chitungwiza Cemetery has sparked controversy after it was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/controversy-over-madzibaba-nzira-grave/\">Continue reading<span class=\"screen-reader-text\"> \"Controversy Over Madzibaba Nzira Grave\"</span></a></p>",
            "time": "09:28",
            "date": "07 Jan 2025"
        }
    ]
}