{
    "news": [
        {
            "title": "Killer Zivhu Defends Chamisa, Tells Critics to “Form Their Own Parties”",
            "url": "https://www.zimeye.net/2025/10/25/killer-zivhu-defends-chamisa-tells-critics-to-form-their-own-parties/",
            "content": "By Tinashe Sambiri\n\nControversial ZANU PF politician Killer Zivhu has come out in defence of opposition leader Advocate Nelson Chamisa, urging critics to stop obsessing over the Citizens Coalition for Change (CCC) founder and instead focus on building their own political movements.\n\nIn a bold post on X (formerly Twitter) on Saturday, Zivhu  known for his outspoken and often unpredictable views  appeared to take aim at both ruling party loyalists and opposition figures who continuously attack Chamisa.\n\nEnough is enough! Chamisa isnt the only one who needs power in Zimbabwe, Zivhu wrote. Form your own parties and stop fixating on this young man. Every day its Chamisa this and that Some of you are too old to be relying on him to fight your battles. Stop it!\n\nZivhus remarks immediately sparked debate online, with some interpreting them as a rare show of respect for Chamisa from within ZANU PFs ranks, while others dismissed them as attention-seeking.\n\nPolitical observers say Zivhus comments reflect growing fatigue among citizens with the countrys toxic political discourse, where Chamisa has often been a lightning rod for both admiration and criticism.\n\nThis is typical Zivhu  he likes to stir debate, said one analyst. But his point resonates with many Zimbabweans who are tired of endless political bickering centred on personalities instead of solutions.\n\nZivhu, who was once expelled from ZANU PF before later reconciling with the party, has maintained a reputation for speaking his mind, often crossing political lines in the process.\n\nWhile ZANU PF has not officially responded to his comments, some party supporters have privately expressed discomfort with his apparent defence of Chamisa  a man long viewed by the ruling elite as their fiercest opponent.\n\nWhether his remarks will reignite friction within ZANU PF remains to be seen, but one thing is clear: Killer Zivhu has once again positioned himself at the centre of Zimbabwes political storm  this time by defending the very man his party loves to attack.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Controversial ZANU PF politician Killer Zivhu has come out in defence of opposition leader Advocate Nelson Chamisa, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/killer-zivhu-defends-chamisa-tells-critics-to-form-their-own-parties/\">Continue reading<span class=\"screen-reader-text\"> \"Killer Zivhu Defends Chamisa, Tells Critics to “Form Their Own Parties”\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Government Agents Deny Madzibaba Veshanduko Medical Attention",
            "url": "https://www.zimeye.net/2025/10/25/government-agents-deny-madzibaba-veshanduko-medical-attention/",
            "content": "By A Correspondent\n\nAuthorities have once again blocked Madzibaba Veshanduko from receiving medical care, despite a court order issued on Thursday explicitly directing that he be granted immediate access to treatment.\n\nSources confirmed that on Friday morning, officials at Harare Remand Prison refused entry to a private doctor and nurse who had arrived to attend to the detained activist.\n\nPrison authorities reportedly insisted that a separate internal application must be submitted before any medical examination can take place  a move described by legal observers as a deliberate act of defiance.\n\nA government insider, speaking on condition of anonymity, said the refusal is part of a wider effort to conceal evidence of torture.\n\nThey dont want medical professionals to record the extent of his injuries, the source said.\n\nThis so-called administrative process is just a delay tactic. Theyre waiting for the wounds to fade so that theres no physical proof linking the abuse to state agents.\n\nCourt records show that during proceedings on Wednesday, the magistrate temporarily cleared the courtroom to allow officials to privately inspect the injuries sustained by Madzibaba Veshanduko during his alleged abduction and torture earlier in the week.\n\nFollowing that inspection, the court issued an order directing prison authorities to ensure he receives immediate medical attention.\n\nHowever, as of Friday, that directive remains unfulfilled.\n\nAccording to his legal team, Madzibaba Veshanduko is suffering from serious injuries, including a suspected fractured rib, heavy bruising on his back and buttocks, a swollen face, and pain so severe that he struggles to walk or sit.\n\nHe is in visible distress, said a relative who spoke to the media. We cant understand why the authorities are defying a lawful court order. This is cruel and inhumane.\n\nSince his alleged abduction and assault on Monday night, the activist has reportedly not received any medical treatment. Rights groups have condemned the ongoing denial of care, describing it as a blatant violation of human rights and judicial authority.\n\nAs the standoff continues, questions are mounting over the governments unwillingness to comply with court directives  and over what officials may be trying to hide.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Authorities have once again blocked Madzibaba Veshanduko from receiving medical care, despite a court order issued on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/government-agents-deny-madzibaba-veshanduko-medical-attention/\">Continue reading<span class=\"screen-reader-text\"> \"Government Agents Deny Madzibaba Veshanduko Medical Attention\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Former Top Spies Predict Another Coup",
            "url": "https://www.zimeye.net/2025/10/25/former-top-spies-predict-another-coup/",
            "content": "By a Correspondent  Former Central Intelligence Organisation (CIO) chiefs Happyton Bonyongwe and Lovemore Itai Mukandi have revealed the extent of political interference in Zimbabwes intelligence services, warning  through their own accounts  of a recurring pattern that could culminate in another military-assisted transition similar to the 2017 coup.\n\nTheir memoirs, published earlier this year, detail how the CIO became deeply entangled in ZANU-PFs succession politics, transforming what should have been a professional national institution into a partisan tool for preserving political power. Analysts say the revelations expose the same institutional weaknesses and factional rivalries that triggered Mugabes ouster  and could once again threaten stability as the Mnangagwa-Chiwenga succession battle intensifies.\n\nIn an opinion piece published byZimEye, Professor Allen Munoriyarwa of Walter Sisulu University argues that the two former spy chiefs accounts demonstrate how the intelligence agency serves not national interests but the narrow political objectives of the ruling party. He warns that the ongoing infiltration of state security structures into internal ZANU-PF conflicts echoes the same patterns that preceded the 2017 coup, reflecting what he terms institutional capture and parallel intelligence operations.\n\nBelow is an abridged version of Professor Munoriyarwas opinion piece:\n\nBy Professor Allen Munoriyarwa-This year has been a pivotal one for Zimbabwean politics. The ongoing succession dispute between the President and his Vice President shows no sign of abating. All signs point to a dog-eat-dog contest in the coming years, with the potential for a brutal, even violent, conclusion.\n\nTo understand the unfolding crisis, let us rewind to February 2025. Former CIO Director-General Happyton Bonyongwethe longest-serving head of the countrys state security service under the late ex-president Robert Mugabelaunched an autobiography titledOne Among Many: My Contribution to the Zimbabwean Story.Almost immediately after, another former CIO Deputy Director-General, Lovemore Itai Mukandi, published his own tell-all book,How Mnangagwa Blindsided Robert Mugabe and Grabbed Zimbabwe.\n\nIt now seems fashionable for former spy chiefs to document their organisational experiences. The icing on the cake, however, came with the ruling partys annual conference, which served as comic relief amid the release of the two explosive books. At this ZANU-PF conference, the party resolved to extend the Presidents tenure to 2030. Notably, in Bulawayo last year, Patrick Chinamasa had announced the same resolution.\n\nThese three developments are deeply interlinked, and their coincidence bodes ominously for the country. Yet, it is hardly productive to dwell on the ZANU-PF conference itselfit has become a predictable annual ritual, recycling the same hollow rhetoric. The usual party stalwarts shouted the same slogans, applauded by hungry, unemployed, and disillusioned youths, cheering proclamations of imaginary economic progress.\n\nThe Mutare and Bulawayo conferences, stripped to their core, are about one thing: the vicious succession dispute between President Mnangagwa and Vice President Chiwenga. The two men, to their credit, have not publicly exchanged blowsat least not yet. But their proxies are already at war on their behalf.\n\nWe are repeatedly told that the President has no interest in a third term. He has reportedly assured Chinamasa and others that he is a constitutionalist. For those who lived through November 2017, this claim may sound ironicbut that is beside the point.\n\nOne wonders: where are the third-termists drawing their energy from? This crusade would have died a natural death had the President emphatically declared his intention to step down in 2028. The fact that the debate persists suggests encouragement from within. Some even suspect that 2028 is merely a stepping stone toward abolishing term limits altogether. Otherwise, why all this noise and polarisation over just two years?\n\nAs in 2017, the final arbiters of this conflict will not be ZANU-PFs rank and filelong accustomed to uncritical obediencebut the states coercive institutions. Already, movements within the Central Intelligence Organisation (CIO) hint at such an outcome.\n\nWhat makes this fight particularly dangerous for ordinary Zimbabweans is the involvement of the intelligence agency itself. The two books mentioned earlier expose the CIOs long-standing entanglement with partisan politics. Both authors confirm that the institution serves not national interests but the narrow political objectives of the ruling partyjust as the military did during the 2017 coup and arguably continues to do today.\n\nIn Bonyongwes memoir, he admits trying to persuade Mugabe to retireeven seeking a meeting with Grace Mugabe to do so. This was not the work of a national intelligence head but that of a political operative. Was Mugabes succession a national security issue? Clearly not. If it were, why did ZANU-PF nominate him as a candidate in 2013, and why did subsequent party congresses endorse him despite his advanced age?\n\nMukandis book goes further. He alleges that President Mnangagwa continued to run aparallel CIO structureafter leaving the Ministry of State Security in 1999, holding meetings in Gweru with faction-aligned operatives who briefed him behind Mugabes back. These revelations expose the deep partisanship and capture of the intelligence services.\n\nThe November 2017 coup revealed the extent of institutional capture in Zimbabwe. The army, after defending Mugabe for 37 years, suddenly turned against him. The CIO played its part, while ordinary citizens were mobilised to march against Mugabe under false pretences. Reports later emerged that some security and intelligence officers involved in the coup were promised money and goldtransforming them from professionals into mercenaries.\n\nMukandis allegations about the existence of a parallel intelligence structure are therefore deeply alarming. They highlight how politicisation and personalisation of intelligence can destabilise a nation. Mugabe himself was accused of maintaining a similar structure during his rule. The repetition of such practices points to systemic failure in the oversight and governance of security institutions.\n\nTo prevent further deterioration, Zimbabwe must first ensure that intelligence officers are properly remunerated. Underpaid and impoverished agents can easily be co-opted into political or factional service. Furthermore, ZANU-PFs reported involvement in recruiting party-aligned youth into the CIO compounds the problemit embeds partisanship within the institution itself.\n\nThis raises a fundamental question: can citizens still trust such institutions? And if so, on what grounds?\n\nZimbabwe urgently needs to reflect on the kind of intelligence agency it desiresone that is professional, well-compensated, and non-partisan. The fact that individuals can run parallel intelligence structures or that top spies intervene in party succession disputes shows how deeply flawed our oversight mechanisms are.\n\nWe need acivilian-driven oversight modelfor intelligence institutionsone that monitors their welfare, budget, and conduct to shield them from political interference. Such reform would require a bold constitutional process involving civil society and independent experts. Admittedly, those benefiting from the current politicisationparticularly within ZANU-PFwould resist it, fearing the loss of their grip on power.\n\nBut this reform should not be viewed as an attack on any political party. It would, in fact, strengthen national institutions and safeguard democracy. ZANU-PFs greatest illusion is the belief that it will rule forever. It will not. Therefore, the party itself would benefit from institutions that serve the nation rather than transient political elites.\n\nThe convergence of an unrestrained, partisan intelligence apparatus and a volatile succession struggle within ZANU-PF is a ticking time bomb. For a nation already weighed down by poverty, unemployment, and despair, the spectre of collapse looms large.\n\nHow we reform and depoliticise our intelligence agencies will determine whether Zimbabwe retains even the remnants of democracyor slides further into authoritarian decay.\n\nProfessor Allen Munoriyarwa is a Professor of Journalism at Walter Sisulu University, South Africa. This article forms part of an eight-country research project titled Public Oversight of Digital Surveillance for Intelligence Purposes: A Comparative Case Study of Oversight Practices in Southern Africa, supported by the British Academy Global Professorship Programme through the University of Glasgow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent — Former Central Intelligence Organisation (CIO) chiefs Happyton Bonyongwe and Lovemore Itai Mukandi have revealed the extent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/former-top-spies-predict-another-coup/\">Continue reading<span class=\"screen-reader-text\"> \"Former Top Spies Predict Another Coup\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Fat Zanu PF Bank Statement Leaks",
            "url": "https://www.zimeye.net/2025/10/25/fat-zanu-pf-bank-statement-leaks/",
            "content": "By A Correspondent  A leaked ZANU PF bank statement has revealed that the ruling party is sitting on a staggering war chest of nearly US$10 million, even though it has not yet received its statutory allocation under the Political Parties (Finance) Act.\n\nThe figures  contained in the central committee report tabled at the partys 22nd National Peoples Conference in Mutare recently  show that ZANU PFs accounts hold US$9 819 821.64 and ZWG722 860.97, placing it among the wealthiest political organisations in Southern Africa.\n\nThe disclosure has reignited public outrage over how the party continues to amass vast resources in a collapsing economy  where hospitals lack basic supplies, civil servants earn below the poverty line, and millions of citizens languish in deprivation.\n\nFor over four decades, ZANU PF has sustained its political dominance through an intricate web of state-linked financial extraction, fusing government institutions, parastatals, and private businesses into its economic bloodstream. Analysts have long described this as a shadow financing system  one that keeps the ruling elite thriving while the rest of the nation sinks deeper into crisis.\n\nSince the 1980s, state-owned enterprises such as the National Railways of Zimbabwe (NRZ), Grain Marketing Board (GMB), ZESA Holdings, TelOne, and the Zimbabwe Mining Development Corporation (ZMDC) have been routinely compelled to donate cash, vehicles, fuel, and equipment to bankroll ZANU PFs programmes and election campaigns. These so-calledpatriotic contributionshave blurred the lines between state resources and party finances, effectively transforming public assets into partisan tools.\n\nCivil servants have also been ensnared in the system. Teachers, nurses, agricultural officers, and district administrators have for years complained about forced donations deducted from their salaries  funds critics say are channelled into ZANU PFs political machinery.\n\nIn the private sector, the pressure is more subtle but no less coercive. Executives in mining, construction, and tobacco industries quietly admit that survival often depends onunofficial donationsto the ruling party. Access to government contracts, tenders, and licences is widely perceived to hinge on financial loyalty to ZANU PF.\n\nThis entrenched patronage economy has enabled the party to convert political power into perpetual wealth, even as the national economy withers.\n\nAgainst this backdrop, ZANU PFs national fundraising committee  chaired by flamboyant businessman Philip Chiyangwa and including figures such as James Makamba, Supa Mandiwanzira, Betty Kaseke, John Paradza, Patience Tapomwa, and gold dealer Scott Sakupwanya  has raised millions in both local and foreign currency. The committee oversees the mobilisation of resources for party operations, staff salaries, congresses, and restructuring exercises.\n\nAccording to the leaked report, ZANU PF collected US$120 869 and ZWG40 216 from membership subscriptions, with provincial structures instructed by treasurer-general Jacob Mudenda to ensure full annual payments by all senior party officials  including Politburo, Central Committee, and District Coordinating Committee members.\n\nThe party also reported US$9.17 million and ZWG361 644.97 in donations, US$163 595 from vehicle sales, US$268 690 from conference contributions, and US$95 103.64 from tent hire. On the expenditure side, ZANU PF disbursed US$3.98 million in staff salaries and US$1.74 million in gratuities.\n\nEven without its state allocation under the Political Parties (Finance) Act  or dividends from its investment arms  the partys robust balance sheet demonstrates its ability to sustain itself independently of formal public funding. Critics, however, argue that this financial strength stems from decades of systemic resource extraction from state-controlled entities and businesses dependent on government favour.\n\nThe partys commissariat report further boasts of 81 167 cells and villages nationwide, representing a membership base of 4 058 350. Analysts note that this vast structure is maintained not only through ideological loyalty but through material incentives  food aid, contracts, and loans tied to political allegiance. The report also lists 150 affiliate organisations, many of which benefit from the Presidential Empowerment Revolving Fund, a scheme opposition parties and civil society describe as a vehicle for distributing patronage.\n\nWhile the party claims to have introduced mechanisms for financial accountability, previous audits of empowerment initiatives  including the Youth Fund, Command Agriculture, and the Presidential Inputs Scheme  exposed rampant looting by politically connected elites.\n\nPolitical scientist Professor Eldred Masunungure has long described ZANU PFs financial model as a fusion of public and partisan finance, warning that it corrodes democratic competition and entrenches corruption by rewarding loyalty over merit.\n\nMeanwhile, ZANU PFs digitalisation project, slated for completion by September 2025, is being touted as a transparency measure  but critics argue it doubles as a surveillance tool designed to monitor loyalty and tighten social control.\n\nThe leaked ZANU PF bank statement, therefore, is more than just an accounting record. It is a window into the ruling partys enduring machinery of political extraction  a system that bleeds the state to enrich the few while impoverishing the many.\n\nIn a country where public hospitals are on life support and citizens endure chronic shortages, the ruling partys financial abundance underscores Zimbabwes enduring paradox: a regime that prospers as the nation collapses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — A leaked ZANU PF bank statement has revealed that the ruling party is sitting on a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/fat-zanu-pf-bank-statement-leaks/\">Continue reading<span class=\"screen-reader-text\"> \"Fat Zanu PF Bank Statement Leaks\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Government Issues Diarrhoea Alert",
            "url": "https://www.zimeye.net/2025/10/25/government-issues-diarrhoea-alert/",
            "content": "By Health Correspondent  The government has issued a nationwide health alert following a surge in diarrhoea and other infectious diseases across Zimbabwe, according to the latest epidemiological report from the Ministry of Health and Child Care.\n\nThe alert comes as health authorities warn of rising cases ofinfluenza, malaria, dysentery, and common diarrhoea, particularly affecting children under five years old.\n\nAccording to the Health Ministrys weekly disease surveillance update, influenza remains widespread, with 5 220 new suspected cases reported this week and two deaths recorded at Sally Mugabe Central Hospital in Harare. Manicaland (1 884 cases) and Mashonaland West (1 556 cases) were the hardest-hit provinces. Cumulatively, 276 054 influenza cases and six deaths have been reported nationwide this year.\n\nDysentery also remains a concern, with 357 new cases and one death reported this week. Mashonaland West recorded 77 cases, followed by Mashonaland Central and Manicaland with 55 each. The cumulative figure now stands at 12 979 cases and five deaths since the start of the year.\n\nMalaria continues to pose a major public health challenge, claiming 12 lives this week out of 3 021 new cases. Fatalities were recorded in Harare Metropolitan, Mashonaland East, Manicaland, Matabeleland North, Mashonaland West, and Matabeleland South. Among the new cases, 363 involved children under five years old. Mashonaland East led with 1 202 cases, followed by Mashonaland Central with 895. The total malaria burden this year has reached 147 556 cases and 401 deaths.\n\nMeanwhile, common diarrhoea cases remain worryingly high, with 9 261 new cases reported this week  nearly half involving children under five. Mashonaland West (1 679) and Mashonaland Central (1 360) reported the highest numbers. Since January, Zimbabwe has recorded 257 714 diarrhoea cases and 152 deaths.\n\nThe Health Ministry also reported eight anthrax cases in Gokwe North, Midlands Province, though no deaths have been recorded. To date, there have been 125 anthrax cases this year, all non-fatal.\n\nDog bites continue to be a frequent health concern, with 553 new cases recorded this week  including 103 from vaccinated dogs, 96 from unvaccinated dogs, and 354 from dogs of unknown vaccination status. Masvingo (80 cases) and Manicaland (79 cases) reported the highest numbers. Zimbabwe has so far registered 21 201 dog bite incidents this year, though no related deaths have been reported.\n\nThe Ministry of Health urged communities to maintain high levels of hygiene, ensure safe drinking water, and seek prompt medical attention for any diarrhoeal symptoms, especially among young children, as the rainy season approaches.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Health Correspondent — The government has issued a nationwide health alert following a surge in diarrhoea and other infectious … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/government-issues-diarrhoea-alert/\">Continue reading<span class=\"screen-reader-text\"> \"Government Issues Diarrhoea Alert\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Mnangagwa’s CIOs Seize Girls’ Soccer Jerseys Donated by Opposition MP",
            "url": "https://www.zimeye.net/2025/10/25/mnangagwas-cios-seize-girls-soccer-jerseys-donated-by-opposition-mp/",
            "content": "By A Correspondent\n\nState security agents have reportedly confiscated girls soccer jerseys donated byMutsa Murombedzi, theCCC Member of Parliament for Mashonaland West (Proportional Representation), in what observers say is yet another example of politically motivated intimidation.\n\nMurombedzi revealed on Saturday that the seizure took place in ruralMhondoro, sparking fear among local residents.\n\nSecurity agents have just confiscated the soccer jerseys I donated to a girls soccer team in rural Mhondoro, she said. While I stood in Beijing marking 30 years of the Beijing Declaration  a global promise to protect girls, promote equality, and end child marriage  they stripped girls in Mhondoro.\n\nThe legislator said the agents claimed she was not allowed to support the team, a justification she described as senseless and cruel.\n\nTheir reason? That I must not support them. Support them how? By helping them stay in school? By fighting teen pregnancies? By giving them dignity through sport? By helping them stay out of drugs? she asked.\n\nMurombedzi said the action showed that authorities fear empowered girls more than they fear teen pregnancies or poverty.\n\nThey fear empowered girls more than they fear teen pregnancies. Through that platform, many girls who were destined to vanish from classrooms into poverty are coming up, opening up, and we are intervening to keep them in school, she said.\n\nDescribing the incident as radioactive irony, Murombedzi contrasted her advocacy for girls empowerment abroad with the repression faced by girls at home.\n\nIn Beijing, we reaffirmed our commitment to girls. In Zimbabwe, they punished a rural Mhondoro girls soccer team for being seen, for being supported, for daring to dream, she said.\n\nShe condemned the seizure as shameful and sabotage, saying it undermines national efforts to tackle social challenges.\n\nYou dont fight teen pregnancies by stripping girls of opportunity. You dont fight poverty by punishing those who intervene. You dont preach gender equality while silencing women in action, she said.\n\nReflecting on the symbolic importance of the jerseys, Murombedzi concluded:\n\nThe jerseys were never just fabric  they were armor.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent State security agents have reportedly confiscated girls’ soccer jerseys donated by Mutsa Murombedzi, the CCC Member of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/mnangagwas-cios-seize-girls-soccer-jerseys-donated-by-opposition-mp/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s CIOs Seize Girls’ Soccer Jerseys Donated by Opposition MP\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Malaria Kills 78 In Mashonaland West Province",
            "url": "https://www.zimeye.net/2025/10/25/malaria-kills-78-in-mashonaland-west-province/",
            "content": "By A Correspondent  The Emmerson Mnangagwa administration is facing mounting criticism as malaria continues to claim lives across Zimbabwe, with Mashonaland West province reporting 78 deaths since January this year.\n\nObservers say the spike highlights systemic failures in the governments health response and raises questions about preparedness in malaria-prone areas.\n\nGovernment sources on Thursday said  that they are intensifying efforts through community awareness programs, vaccination campaigns, and larva scoping in stagnant water bodies. Community-based health workers are at the forefront, bringing services directly to households.\n\nNyakasikana Village health worker Mr Friday Kavhinga told the Zimbabwe Broadcasting Corporation yesterday, We test people right at their homes and refer serious cases to the clinic. Before, people would travel long distances, but now help is at their doorstep.\n\nDespite these interventions, Hurungwe district alone has recorded 28 deaths, marking it as one of the hardest-hit areas in Mashonaland West. Health officials attribute the surge to irregular rainfall patterns and inadequate preventive infrastructure.\n\nHurungwe remains one of the hardest districts hit by malaria in Mashonaland West. We have recorded 28 deaths, and our teams are working tirelessly to reduce this number as we head into the rainy season. We are installing new diagnostic machines, Chemistry Analyser, ensuring adequate drug supplies, and intensifying spraying and awareness programs. The goal is to curb new infections and prevent avoidable deaths, said a source in the Ministry of Health and Child Care last week.\n\nThe International Federation of Red Cross and Red Crescent Societies is also involved, providing testing kits and training for village health workers. PMER Officer Mrs Tariro Kamangira told State media : As the International Federation of Red Cross and Red Crescent Societies, we believe fighting malaria requires a collective effort. The government is doing a tremendous job in prevention and response, but communities also need strong support systems. Thats why we are complementing these efforts through training village health workers, providing testing kits, and ensuring that critical health services reach even the most remote areas. Our focus is to save lives by strengthening community resilience.\n\nCritics argue, however, that these measures are long overdue and fail to address deeper systemic weaknesses in Zimbabwes health sector. Observers point out that despite repeated warnings and previous malaria outbreaks, the governments reactive strategies have left communities vulnerable, resulting in preventable deaths.\n\nAt the national level, a source in the Ministry of Health and Child Care said last week that indoor residual spraying has been scaled up, insecticide-treated nets distributed, and awareness campaigns intensified. The Ministry aims to reduce malaria incidence by 90 percent by 2030.\n\nBut for many Zimbabweans watching loved ones fall victim to a disease that is largely preventable, such targets offer little consolation. The unfolding crisis underscores a harsh reality: under the Mnangagwa regime, public health emergencies continue to expose gaps in governance and preparedness.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Emmerson Mnangagwa administration is facing mounting criticism as malaria continues to claim lives across Zimbabwe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/malaria-kills-78-in-mashonaland-west-province/\">Continue reading<span class=\"screen-reader-text\"> \"Malaria Kills 78 In Mashonaland West Province\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Machakaire Jailed Over Public Indecency",
            "url": "https://www.zimeye.net/2025/10/25/kwekwe-man-jailed-for-public-indecency/",
            "content": "By A Correspondent | KWEKWE, Zimbabwe  The Kwekwe Magistrates Court has convicted and sentenced Samson Machakaire (35) to four months in prison for an act of public indecency that shocked residents of the Midlands mining town.\n\nAccording to court proceedings, the incident occurred on 16 September 2025 at around 7:00 AM when a domestic worker, while sweeping her employers yard, noticed Machakaire masturbating while staring at her. Terrified, the victim ran inside and alerted her employer, who immediately contacted the police, leading to the offenders arrest.\n\nMagistrates described Machakaires conduct as disturbing and unacceptable, adding that it warranted a custodial sentence to deter similar offences.\n\nHe will, however, serve an effective two months in jail, after the remaining two months were suspended for five years on condition of good behaviour.\n\nResidents in Kwekwe have since expressed outrage and called for stronger penalties against acts of public sexual misconduct.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | KWEKWE, Zimbabwe — The Kwekwe Magistrates’ Court has convicted and sentenced Samson Machakaire (35) to four … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/kwekwe-man-jailed-for-public-indecency/\">Continue reading<span class=\"screen-reader-text\"> \"Machakaire Jailed Over Public Indecency\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "Masvingo Academics Dismiss Mohadi’s Honorary Doctorate as Political Showmanship",
            "url": "https://www.zimeye.net/2025/10/25/masvingo-academics-dismiss-mohadis-honorary-doctorate-as-political-showmanship/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa on Thursday conferred an Honorary Doctor of Social Sciences in Leadership (Honoris Causa) on his deputy, Kembo Mohadi, during Great Zimbabwe Universitys (GZU) 19th graduation ceremony in Masvingo.\n\nMnangagwa, who serves as Chancellor of all state universities, said the honour recognised Mohadis distinguished contribution to the liberation struggle and decades of public service. More than 3,400 graduates from various disciplines were capped at the event.\n\nHowever, several academics in Masvingo dismissed the conferment as a political gesture rather than a recognition of genuine merit.\n\nOne academic said the decision illustrates how universities have become tools for political endorsement instead of institutions that uphold academic integrity.\n\nThis is no longer about honouring scholarship or leadership excellence, the academic added. Its about rewarding loyalty. Such moves cheapen the meaning of an honorary degree and erode public trust in universities.\n\nAnother lecturer echoed similar sentiments, describing the ceremony as a staged performance meant to sanitise the image of political elites.\n\nThe timing is too convenient and the message is clearalign yourself with power and you will be decorated, regardless of past controversies, said the lecturer.\n\nGZUs citation praised Mohadi as a patriotic leader, liberation war veteran, and public servant whose unwavering commitment to national development continues to inspire generations.\n\nYet, the decision has reignited debate about the politicisation of higher education in Zimbabwe. Critics argue that honorary degrees are increasingly being used to legitimise ruling party figures rather than celebrate authentic achievement.\n\nThe Zimbabwe Council for Higher Education (ZIMCHE) has previously cautioned institutions against awarding honorary degrees without clear merit, warning that such actions undermine the credibility of the higher education system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa on Thursday conferred an Honorary Doctor of Social Sciences in Leadership (Honoris Causa) on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/25/masvingo-academics-dismiss-mohadis-honorary-doctorate-as-political-showmanship/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Academics Dismiss Mohadi’s Honorary Doctorate as Political Showmanship\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        },
        {
            "title": "BREAKING- ‘VP Chiwenga’ “Traore” Campaigner Arrested",
            "url": "https://www.zimeye.net/2025/10/24/breaking-vp-chiwengas-traore-campaigner-arrested-report/",
            "content": "By Investigations Reporter | ZimEye | The self proclaimed Vice President Constantino Chiwenga campaigner, Malcolm Masarira has been arrested, it has emerged.\n\nImpeccable sources in the state security revealed to ZimEye that Masarira, popularly known on social media, as Traore, has been apprehended.\n\nTraore who is recognised for donning a VP Chiwenga t shirt, was caught on Friday night, ZimEye can reveal.\n\nHe was arrested at a property in the capital city, Harare.\n\nIdentities of state security personnel who arrested Masarira could not be ascertained at the time of writing.\n\nMasarira pulled attention of the state security when he accused Defence Minister Oppah Muchinguri of supplying drugs, a close source suggested to ZimEye.\n\nFurther details were not available at the time of writing.\n\nHe is currently held at Harare Central Police station.   ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigations Reporter | ZimEye | The self proclaimed Vice President Constantino Chiwenga ‘campaigner’, Malcolm Masarira has been arrested, it … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/breaking-vp-chiwengas-traore-campaigner-arrested-report/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING- ‘VP Chiwenga’ “Traore” Campaigner Arrested\"</span></a></p>",
            "time": "06:39",
            "date": "26 Oct 2025"
        }
    ]
}