{
    "news": [
        {
            "title": "Council Charges Money To Draw Borehole Water",
            "url": "https://www.zimeye.net/2024/12/21/council-charges-money-to-draw-borehole-water/",
            "content": "Upper Manyame Sub-Catchment Council\n\nBy A Correspondent | ZimEye |A resident has come forward with shocking allegations of corruption and unethical practices at the Upper Manyame Sub-Catchment Council after experiencing frustration while attempting to make a payment for a borehole permit. The incident, which occurred today, has sparked outrage over the alleged abuse of authority and lack of transparency in government-related institutions.\n\nAccording to the complainant, they were denied the ability to swipe their bank card to make the payment without producing a national IDa demand that many feel is excessive and unnecessary. What made the situation more questionable is that paying in USD cash was allowed without any such requirement.\n\nI was told I could only swipe if I produced my ID, yet paying in cash required no such proof, the complainant said. This inconsistency shows clear favoritism towards cash payments, which raises serious questions about financial integrity and transparency.\n\nConcerns Over Transparency\n\nThe complainant noted that a notice was posted at the cash office clearly outlining the ID requirement for swiping, further reinforcing suspicions about deliberate efforts to inconvenience card payments in favor of cash transactions. Why would they make it harder to pay digitally unless theres something fishy happening with cash payments? the complainant asked.\n\nWater Access Crisis\n\nThe allegations are made worse by frustrations over the councils poor service delivery. Despite charging fees for borehole drilling and water usage, the complainant reported that the council does not supply water to their area. Access to water is a basic human right. How can they charge us exorbitant fees and then make the process of paying unnecessarily difficult?\n\nThe situation has reignited anger over the state of water services in Zimbabwe, where residents often bear the cost of drilling their own boreholes while receiving little to no support from local authorities.\n\nCalls for Action\n\nThe complainant is calling on the Government of Zimbabwe and anti-corruption agencies to investigate the alleged misconduct and hold those responsible accountable. This is unacceptable. Financial intelligence authorities must step in, and those involved should face justice. Access to water is a right, not a privilege, they said.\n\nallegations.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Upper Manyame Sub-Catchment Council By A Correspondent | ZimEye | A resident has come forward with shocking allegations of corruption … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/council-charges-money-to-draw-borehole-water/\">Continue reading<span class=\"screen-reader-text\"> \"Council Charges Money To Draw Borehole Water\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "Are You Coming To Winky D’s Birmingham Bash Tonight?",
            "url": "https://www.zimeye.net/2024/12/21/are-you-coming-to-winky-ds-birmingham-bash-tonight/",
            "content": "By Showbiz Reporter | ZimEye |A Night of Fire: Winky D Brings Magic to Birmingham Tonight\n\nBirmingham, prepare to be swept off your feet as the self-proclaimedGaffa, Winky D, takes the stage tonight. Its not just another concert; its a night destined for the history booksa momentous occasion set to light up the hearts and souls of his adoring fans. The date is marked: 21st December, and the city is buzzing with anticipation.\n\nDraped in charisma, Winky D teased his fans with the promise,Its going to be a night to remember.His words resonate not just as an invitation but as a guarantee of pure energy, lyrical genius, and unforgettable vibes.\n\nThe Set-Up:\n\nFrom soulful reggae ballads to hard-hittingZimdancehallanthems, tonights playlist is expected to be a carefully curated rollercoaster of emotions. Fans are gearing up to sing along to hits likeDisappear,Ngirozi,andHappy Again.Expect a blend of messages that inspire, empower, and unitea musical therapy session for Zimbabweans and beyond.\n\nBirminghams Streets Feel the Pulse\n\nSpotted earlier in the city, the Gaffa looked casual yet confident, rocking a Hilfiger sweater and his signature charm. Fans were quick to snap pictures, sharing their excitement on social media, as they speculated about tonights surprises.\n\nWhat to Expect:\n\nA Visual Extravaganza: With Winky Ds reputation for breathtaking performances, expect dazzling lights and captivating stagecraft.\n\nA Diverse Crowd: Fans from all walks of life will unite under the banner of music, proving once again that the Gaffas reach knows no borders.\n\nUnmatched Vibes: Known for his ability to connect with audiences, Winky D promises to leave no heart untouched.\n\nThe Gaffas Message:\n\nIn a world filled with chaos, Winky D remains a messenger of hope. Through his lyrics, he touches on social issues, love, and the human spirits resilience. Tonight, Birmingham gets the rare opportunity to bask in his genius, and as the crowd chants,Gaffa ndiyo ndiyo!the city will come alive.\n\nThe clock is ticking, and the stage is set. Will you be part of the magic? Birmingham, tonight belongs to Winky D. Let the music play!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter | ZimEye | A Night of Fire: Winky D Brings Magic to Birmingham Tonight Birmingham, prepare to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/are-you-coming-to-winky-ds-birmingham-bash-tonight/\">Continue reading<span class=\"screen-reader-text\"> \"Are You Coming To Winky D’s Birmingham Bash Tonight?\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "Man Devoured By 2 Crocs",
            "url": "https://www.zimeye.net/2024/12/21/man-devoured-by-2-crocs/",
            "content": "Tragic Incident: Man Devoured by Crocodiles in Gonarezhou National Park\n\nBy A Correspondent |In a shocking tragedy, a 23-year-old man lost his life after being attacked by two crocodiles while engaging in illegal night fishing in Gonarezhou National Park. His remains were later recovered from the crocodiles. This incident, along with another case of an 18-year-old boy drowning in prohibited waters at Matobo National Park, has sparked renewed calls for adherence to park rules and safety regulations.\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) released a statement addressing the incidents. We wish to remind all visitors into Parks Estates of the importance of adhering to the rules and regulations established to preserve the safety of both individuals and wildlife within our estates, said Tinashe Farawo, ZimParks spokesperson.\n\nOffering condolences to the bereaved families, ZimParks stated, Our condolences to the bereaved families. May their souls rest in peace. These incidents serve as a reminder of the risks associated with failure to follow laid-down rules and regulations within the parks estates.\n\nThe statement further urged visitors to strictly observe designated park visiting hours and to avoid unauthorized activities. We urge members of the public to adhere to the strictly designated park visiting hours (6 AM  6 PM). Always follow the rules and regulations and familiarize yourself with the wildlife present in the area in order to understand the potential dangers they pose, the statement read.\n\nPublic Safety Warning\n\nThe incidents underscore the life-threatening risks of disregarding park regulations. ZimParks emphasized their commitment to maintaining public safety while preserving wildlife. Our staff is dedicated to ensuring a safe and enjoyable environment for everyone during this festive season, Farawo added.\n\nVisitors are encouraged to report any unsafe activities or concerns to park officers immediately. If you witness any unsafe activities or have any concerns, do not hesitate to contact our officers immediately, the statement concluded.\n\nThese tragedies serve as a somber reminder of the need for vigilance and respect for the rules designed to protect lives and preserve the delicate balance between humans and wildlife.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tragic Incident: Man Devoured by Crocodiles in Gonarezhou National Park By A Correspondent | In a shocking tragedy, a 23-year-old … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/man-devoured-by-2-crocs/\">Continue reading<span class=\"screen-reader-text\"> \"Man Devoured By 2 Crocs\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "Winky D’s HICC, Tagwireyi Saga",
            "url": "https://www.zimeye.net/2024/12/21/winky-ds-hicc-tagwireyi-saga/",
            "content": "By Cde Dread Tongogara |The much-anticipated annual performance by Zimbabwean music icon Winky D has been overshadowed by a growing controversy involving Tagwireyis Bridging Gaps Foundation, the Harare International Conference Centre (HICC), and allegations of corporate interference.\n\nReports suggest that the Bridging Gaps Foundation, spearheaded by businessman Kudakwashe Tagwireyi, made a lucrative offer to the HICC, effectively displacing Winky Ds event. According to ZIMLIVE, the deal included booking 200 rooms for five days, catering to 200 couplesa move many view as prioritizing financial gain over public interest. Critics argue that this not only denies thousands of Zimbabweans their annual source of solace and celebration but also exposes the power dynamics at play in the country.\n\nPublic Outcry Over Financial Power Abuse\n\nWinky Ds fans, numbering in the thousands, have expressed their outrage over what they describe as a betrayal of public trust and cultural values. For many, his performances are more than just entertainmentthey are a source of comfort and empowerment for Zimbabwes economically and socially downtrodden. The sudden cancellation has left fans feeling robbed of their annual ritual of healing and celebration.\n\nThis is not just about a concert, said one fan. Its about the disregard for ordinary people in favor of financial muscle. Its a disturbing precedent where might trumps right.\n\nMoral Concerns Highlighted\n\nCritics of the saga argue that this incident reflects a broader issue of power imbalance in Zimbabwe. Questions are being raised about the ethical implications of allowing financial power to override principles and commitments. A widely shared concern is that such practices could spill over into other aspects of public life, from the justice system to business ethics, creating a dangerous culture of impunity.\n\nIf someone with money can disrupt this tradition, what stops them from undermining other systems meant to serve the public? a concerned citizen asked. Where do we draw the line?\n\nWinky Ds Silence\n\nWinky D himself has remained tight-lipped about the controversy, leaving his fans to speculate on the reasons behind his absence from this years event. While some are hopeful for a statement or a possible rescheduling of the event, others feel this is a wake-up call for a more equitable and transparent system that prioritizes public interest over private gain.\n\nA Call for Justice\n\nAs public outrage grows, many are calling for accountability from the parties involved. The hope is that this incident will spark a broader conversation about the need for fairness, transparency, and the protection of cultural spaces from undue influence.\n\nFor now, Winky Ds fans are left with disappointment and questions about whether their beloved artist will be allowed to continue providing the solace and inspiration they so desperately seek. The ball is now in the court of HICC, Tagwireyi, and Winky D to address the publics concerns and restore trust in a society where cultural heritage often feels under siege.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Cde Dread Tongogara | The much-anticipated annual performance by Zimbabwean music icon Winky D has been overshadowed by a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/winky-ds-hicc-tagwireyi-saga/\">Continue reading<span class=\"screen-reader-text\"> \"Winky D’s HICC, Tagwireyi Saga\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "ZIFA Polls Latest",
            "url": "https://www.zimeye.net/2024/12/21/zifa-polls-latest/",
            "content": "Sports Correspondent\n\nThe countdown to the much-anticipated ZIFA Executive Committee elections has taken a dramatic turn, with three more candidatesbusinessman Nqobile Magwizi, former legislator Themba Mliswa, and former PSL Chairperson Twine Phirihaving their eligibility questioned. This follows formal complaints made by private individuals to the ZIFA Ethics Committee, raising concerns over the suitability of these candidates.\n\nTheir scrutiny comes just days after Yadah FC owner Prophet Walter Magaya, Northern Region Chairperson Martin Kweza, and former ZIFA board member Philemon Machana were similarly challenged on their eligibility.\n\nThe challenges against Magwizi, Mliswa, and Phiri follow a familiar pattern, with letters sent to the ZIFA Ethics Committee questioning whether the trio meet the necessary qualifications for the position.\n\nSports analyst Malvern Moyo has described the situation as a form of electioneering. Its an interesting time ahead of us. January 25 seems far away, but looking at the letters, it seems like the work of one individual trying to eliminate others. Some of the allegations lack merit, while others have already been cleared. Its election season, so you can expect anything, Moyo commented.\n\nAmong the candidates vying for the ZIFA presidency are Marshal Gore of Team Zimbabwe UK, former Warriors captain Benjani Mwaruwari, and PSL Chairperson Farai Jere.\n\nAccording to Article 38, Paragraph 6 of the new ZIFA Statutes, all members of the Executive Committee must not have been previously convicted or sentenced for any offense.\n\nThe ZIFA Ethics Committee is currently reviewing the candidates eligibility and integrity, with an announcement of the approved candidates scheduled for December 23. The elections will take place on January 25 next year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The countdown to the much-anticipated ZIFA Executive Committee elections has taken a dramatic turn, with three more candidates—businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/zifa-polls-latest/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Polls Latest\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "What’s Going On Julius?",
            "url": "https://www.zimeye.net/2024/12/21/whats-going-on-julius/",
            "content": "South African politician and Economic Freedom Fighters (EFF) leader Julius Malema has ignited controversy after removing all photos of his wife, Mantwa Matlala Malema, from his Instagram account. This sudden move has fueled speculation about the status of their marriage, especially since they were set to celebrate their 10th wedding anniversary on December 27   .\n\nMalema and Mantwa tied the knot in an intimate ceremony in 2014 and have two sons together, Kopano and Munzhedzi. Malema also has a third son, Ratanang, from a previous relationship. Despite removing his wifes images, Malema has retained photos of his children on his Instagram page, further fueling the divorce rumors.\n\nThe EFF leader has been known to share glimpses of his family life on social media, from grand appearances at events like the Durban July to heartwarming birthday and anniversary posts. However, his recent decision to purge his wifes photos has left many scrambling to understand the implications.\n\nMalemas silence on the matter has only added to the intrigue. In a recent interview on Lasizwes YouTube show Awkward Dates, Malema spoke fondly of his wife, describing proposing to her as the most romantic gesture he had ever made. This contrast between his words and actions has left many wondering whats really going on.\n\nAs the couples anniversary approaches, all eyes are on Malema to see whether hell address the rumors or continue to maintain his silence. Only time will reveal the truth behind Malemas decision to remove his wifes photos from Instagram.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South African politician and Economic Freedom Fighters (EFF) leader Julius Malema has ignited controversy after removing all photos of his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/whats-going-on-julius/\">Continue reading<span class=\"screen-reader-text\"> \"What’s Going On Julius?\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "Three Arrested For Stock Theft",
            "url": "https://www.zimeye.net/2024/12/21/three-arrested-for-stock-theft/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has confirmed the arrest of Trust Mpofu (37), Prince Dube (40), and Mthuthukisi Msizi (31) at an abattoir in Belmont, Bulawayo, on December 17, 2024, in connection with a suspected stock theft case.\n\nThe suspects were apprehended after attempting to present a forged stock clearance form to police officers at the abattoir for the slaughter of cattle.\n\nFollowing the arrest, authorities recovered 11 cattle bearing foreign brand marks. The vehicle used to transport the stolen livestock, a UD 60 truck with registration number AFK4503, was also impounded by the police.\n\nThe cattle are believed to have been stolen from outside the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has confirmed the arrest of Trust Mpofu (37), Prince Dube (40), and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/three-arrested-for-stock-theft/\">Continue reading<span class=\"screen-reader-text\"> \"Three Arrested For Stock Theft\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "ED’s Prophet Wutaunashe Demands A New Car From Poor Tswana Citizens After Telling UK He’s For The Poor",
            "url": "https://www.zimeye.net/2024/12/21/eds-prophet-wutaunashe-demands-a-new-car-from-poor-tswana-citizens-after-telling-uk-hes-for-the-poor/",
            "content": "By A Correspondent | ZimEye |Barely three years after presenting himself as a voice for the poor during a meeting with Archbishop of Canterbury Justin Welby, Prophet Andrew Wutaunashe, a controversial religious figure aligned with Zimbabwean President Emmerson Mnangagwa, has come under fire for pressuring his Botswana congregants to buy him a car.\n\nSpeaking at a church gathering in Gaborone five days ago, Wutaunashe, described by critics as giant-bellied and advised by doctors to walk for his health, demanded that members of his economically struggling congregation procure a vehicle for him within four months.\n\nBarely 3 years after telling@JustinWelby@churchofenglandthat his UK trip is because he is troubled for the poor, Emmerson Mnangagwas giant-bellied prophet, Andrew Wutaunashe, 5 days ago, demands a car from poor Botswana church members (pictured). The preacher advised byhttps://t.co/uDQbeJ6Q95pic.twitter.com/UXfqzFzfCh\n\nIn his address, Wutaunashe joked with the audience, saying, Say Halleluyah! Praise God! I know all the Bishops love me, so I know that at Easter Camp next year, the Bishops will give me a car Just provoking you, but I really appreciate all Despite his light-hearted tone, the implicit demand has sparked outrage across social and religious circles.\n\nA Troubling Contradiction\n\nThis recent development stands in stark contrast to Wutaunashes claims in November 2021 when he lobbied the Archbishop of Canterbury to support the removal of Western sanctions against Zimbabwe. During his meeting with Justin Welby, Wutaunashe portrayed himself as a champion of the impoverished, blaming sanctions for crippling Zimbabwes economy and exacerbating poverty.\n\nWere actually troubled for the poor, Wutaunashe said at the time, suggesting that sanctions, rather than corruption and mismanagement, were responsible for Zimbabwes dire economic state. However, his demands in Gaborone paint a different picture, with critics accusing him of exploiting the very poor he once claimed to advocate for.\n\nArchbishops Warning Revisited\n\nArchbishop Welbys 2021 response to Wutaunashes plea now carries renewed significance. In his remarks, the Archbishop emphasized that sanctions relief should only benefit the truly disadvantaged and not those involved in corruption. Sanctions relief should be only for the poor who dont steal money that is not theirs, he stated.\n\nWutaunashes actions have reignited debate about the integrity of religious leaders who align themselves with political figures like Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Barely three years after presenting himself as a voice for the poor during a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/eds-prophet-wutaunashe-demands-a-new-car-from-poor-tswana-citizens-after-telling-uk-hes-for-the-poor/\">Continue reading<span class=\"screen-reader-text\"> \"ED’s Prophet Wutaunashe Demands A New Car From Poor Tswana Citizens After Telling UK He’s For The Poor\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "ZESA Promises To  End Load Shedding  By 2025",
            "url": "https://www.zimeye.net/2024/12/21/zesa-promises-to-end-load-shedding-by-2025/",
            "content": "By A Correspondent\n\nThe Zimbabwe Electricity Supply Authority (ZESA) has announced that load shedding will soon be a thing of the past, citing the ongoing construction of 13 new power stations that are set to significantly increase the countrys electricity supply.\n\nThese 13 new power stations are either under construction or will be commissioned by 2025, ZESA said in a statement. These are not just plans; they are actual investments. Collectively, they will add 4,600 Megawatts to the grid, which is three times our current maximum demand.\n\nZESA also noted that the surge in power generation may bring new challenges, such as the possibility of surplus electricity that could attract interest from neighboring countries. We may face a situation where other countries are more eager to take advantage of this surplus power, the statement added.\n\nThe authority highlighted the importance of collaboration with the informal sector to fully utilize these resources and assured the public that the issue of load shedding will soon be resolved.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Electricity Supply Authority (ZESA) has announced that load shedding will soon be a thing of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/zesa-promises-to-end-load-shedding-by-2025/\">Continue reading<span class=\"screen-reader-text\"> \"ZESA Promises To  End Load Shedding  By 2025\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        },
        {
            "title": "One-Year -Old Drowns In Waterlogged Pit",
            "url": "https://www.zimeye.net/2024/12/21/one-year-old-drowns-waterlogged-pit/",
            "content": "By A Correspondent\n\nA heartbreaking incident occurred in Epworth, east of Harare, where a 1-year-old baby boy tragically drowned in a waterlogged rubbish pit. The Zimbabwe Republic Police (ZRP) confirmed the devastating event, which took place on December 18, 2024, near Corner Store, Overspill, Epworth.\n\nThe ZRP reports a sad incident in which a baby boy (1 year 4 months) drowned in a waterlogged rubbish pit on 18/12/24 at a house near Corner Store, Overspill, Epworth, Harare, said the ZRP in a post on their official X handle.\n\nAccording to the police, the toddler was playing outside while his mother was engaged in household chores when the tragedy struck. The incident occurred when the victim was playing outside the house while the mother was doing household chores, the police reported.\n\nThis tragic event has added to growing concerns about child safety, especially during the rainy season, when waterlogged areas pose increased risks. Drowning incidents involving children have become a cause for alarm, highlighting the need for greater awareness and preventive measures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A heartbreaking incident occurred in Epworth, east of Harare, where a 1-year-old baby boy tragically drowned in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/one-year-old-drowns-waterlogged-pit/\">Continue reading<span class=\"screen-reader-text\"> \"One-Year -Old Drowns In Waterlogged Pit\"</span></a></p>",
            "time": "08:38",
            "date": "21 Dec 2024"
        }
    ]
}