{
    "news": [
        {
            "title": "Senior Air Force Official Dies In Jet Crash",
            "url": "https://www.zimeye.net/2025/09/12/senior-air-force-official-dies-in-jet-crash/",
            "content": "By A Correspondent  A senior Zimbabwe Air Force Instructor Squadron Leader, identified asChidyausikuhas died in a fighter jet crash during a routine training exercise atJosiah Magama Tongogara Airbase in Gweru. The trainee pilot on board also succumbed to injuries hours after the crash.\n\nThe Air Force of Zimbabwe (AFZ) confirmed the tragedy, revealing that the aircraft went down shortly after take-off during a training sortie. While an official investigation has been launched, no details about the aircraft type or preliminary findings have been released.\n\nThis latest accident has reignited concerns about the safety and condition of Zimbabwes military aircraft, with social media flooded with grief and anger. Many Zimbabweans questioned why the AFZ continues to operate ageing jets inherited from the pre-independence era.\n\nOn Facebook, Malvern Mukuya wrote:Those jets should be grounded. Ngatimbosiyana nendege dza Ian Smith.\n\nAnother eyewitness, Lovejoy Raymond Gibby Mandaza, who saw the jet moments before it crashed nearLalapanzi, said:The one that crashed passed overhead producing a queer sound and everyone commented that the aircraft had a mechanical fault. Within minutes we heard a loud bang and we knew it had gone down. RIP.\n\nJames Mendi added:The Air Force must take a leaf from Chivayo. He flies the latest planes on the market. He doesnt take chances.\n\nKwanele Ndlovu summed it up bluntly:2nd deadly Air Force crash.\n\nThis is not the first time Zimbabwe has been forced to confront the vulnerabilities of its Air Force. Over the years, a series of fatal crashes has raised questions about maintenance, training, and investment in the sector:\n\nMilitary analysts say many of the AFZs aircraft are outdated, some dating back to the Rhodesian era, while others, such as the Chinese K-8s, have reportedly faced maintenance challenges due to limited spare parts and sanctions-related restrictions.\n\nDefence analysts argue that this latest crash underscores the urgent need for Zimbabwe to modernise its Air Force fleet. Without consistent maintenance and investment in new aircraft, tragedies like this will keep recurring, one analyst said.\n\nFor now, however, the AFZ has chosen silence. Authorities have not publicly addressed the causes or implications of the crash, leaving grieving families and a frustrated nation searching for answers.\n\nFuneral arrangements for Squadron Leader Chidyausiku and the trainee pilot will be announced once their families have been notified.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A senior Zimbabwe Air Force Instructor Squadron Leader, identified as  Chidyausiku has died in a fighter jet … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/senior-air-force-official-dies-in-jet-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Senior Air Force Official Dies In Jet Crash\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "Public Anger As Chadzamira Mocks Advocate Chamisa Over “Abandoning Politics For Church”",
            "url": "https://www.zimeye.net/2025/09/12/public-anger-as-chadzamira-mocks-advocate-chamisa-over-abandoning-politics-for-church/",
            "content": "By A Correspondent\n\nMasvingo Minister of State for Provincial Affairs and Devolution, Ezra Chadzamira, has sparked public outrage after openly mocking Citizens leader Advocate Nelson Chamisa, claiming he has abandoned politics for church activities.\n\nThe minister stunned residents on Thursday while addressing Masvingo Urban Ward 7 voters at Rujeko Secondary School, ahead of Saturdays by-election.\n\nYou say you are following Chamisa, but he is no longer involved in politics, Chadzamira told the crowd. Avakuita zvechurch Chamisahe is now concentrating on church ministry. So all these opposition candidates do not have a leader. If they come to my office, I will not even open the door.\n\nChadzamira added, How can you support people who dont have a leader? You must join Zanu PF today.\n\nHis remarks were met with fierce criticism from political leaders and ordinary residents alike. Former Masvingo Central Constituency MP Jeffryson Chitando described the ministers comments as reckless and politically motivated.\n\nThey must leave Advocate Chamisa alone, Chitando said. The regime is terrified of Chamisas influence. He has consistently inspired hope and unity among our people. Chadzamiras attempt to belittle him shows fear and desperation. Chamisa continues to lead with vision and integrity, and no amount of mockery will change that.\n\nResidents also dismissed Chadzamiras statements, calling them insulting and divisive. We know who our leaders are, one voter said. Chadzamiras comments will not sway our support for Chamisa. We are tired of empty threats and ridicule from those in power.\n\nAs the by-election approaches, tensions remain high, with citizens vowing to defend their political choices against what they see as intimidation and smear tactics.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo Minister of State for Provincial Affairs and Devolution, Ezra Chadzamira, has sparked public outrage after openly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/public-anger-as-chadzamira-mocks-advocate-chamisa-over-abandoning-politics-for-church/\">Continue reading<span class=\"screen-reader-text\"> \"Public Anger As Chadzamira Mocks Advocate Chamisa Over “Abandoning Politics For Church”\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "Baba Jukwa Drops A Video To Support His Claim That Sanyatwe Was Poisoned",
            "url": "https://www.zimeye.net/2025/09/12/baba-jukwa-drops-a-video-to-support-his-claim-that-sanyatwe-was-poisoned/",
            "content": "By Own Correspondent | ZimEye | The whistleblower Baba Jukwa this morning published a video to support his claim that Sports Minister Anselem Sanyatwe was poisoned.\n\nThe video footage is of Mozambican opposition leader, Venncio Mondlaneavoiding a glass of wine at a meeting with his nemesis of the Frelimo party, and quickly sanitizing his hands. At the end is a comparison clip pairing Mondlanes attitude to that of Sanyatwe during meetings with Emmerson Mnangagwas emissaries. Jukwa announces the footage alleging that the general does not listen to him.\n\nHe stated this without mentioning the identity of the person he accuses of poisoning Sanyatwe.\n\nSanyatwe who has not commented over the allegations, has however denied that his decision making was compromised, contrary to allegations raised by Baba Jukwa.\n\nKuda Tagwirei, who is the last person on the Jukwa pictures standing with Sanyatwe, has denied allegations that he poisoned or in any way breached Sanyatwes security.\n\nMORE TO FOLLOW\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Own Correspondent | ZimEye | The whistleblower Baba Jukwa this morning published a video to support his claim that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/baba-jukwa-drops-a-video-to-support-his-claim-that-sanyatwe-was-poisoned/\">Continue reading<span class=\"screen-reader-text\"> \"Baba Jukwa Drops A Video To Support His Claim That Sanyatwe Was Poisoned\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "Join Top Military Petitioners Session Tonight",
            "url": "https://www.zimeye.net/2025/09/12/join-top-military-petitioners-session-tonight/",
            "content": "LINK TO JOIN TOP MILITARY PETITIONERS AT 8PM TONIGHT\n\nhttps://x.com/zimeye/status/1966294585241645124?s=46x.com/zimeye/status/\n\nhttps://t.co/mvw6lT5ySa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "LINK TO JOIN TOP MILITARY PETITIONERS AT 8PM TONIGHT https://x.com/zimeye/status/1966294585241645124?s=46x.com/zimeye/status/…",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "Greatman Look-Alike’s Graduation Pictures Rock Social Media",
            "url": "https://www.zimeye.net/2025/09/12/greatman-look-alikes-graduation-pictures-rock-social-media/",
            "content": "By A Correspondent Pictures of a man strikingly resembling Zimbabwean musician Greatman Gwaze, real name Tongai Gwaze, went viral on social media Thursday after he graduated from Midlands State University (MSU).\n\nThe graduate, however, was not the popular Zimdancehall and Afro-fusion singer celebrated for his inspirational rise despite living with a disability. Instead, it was his look-alike,Nare Tsepang, who proudly walked away with aBachelor of Science Honours Degree in Local Governance and Management.\n\nAdding to the moment, Tsepang  who also lives with a disability  received theZIMDEF Award for Best Male Undergraduate with a Disability, a recognition of his resilience and academic brilliance.\n\nGreatman, best known for his breakout hitPandakazvarwa, has become a symbol of perseverance in Zimbabwes music industry. He has used his career to challenge societal stereotypes about disability, all while facing personal and financial hurdles, including public scrutiny around his marriage and family life. Because of his fame and physical resemblance, many Zimbabweans initially believed the man in the graduation pictures was the singer himself, sparking a flood of congratulatory messages online.\n\nClarification later confirmed that the graduate was not Greatman but Tsepang, a young man carving his own legacy through scholarship. While Greatman continues to inspire through music, Tsepangs success in academia offers a powerful reminder that disability does not limit ones potential to achieve greatness.\n\nThe coincidence has drawn admiration for both men  one celebrated for triumphing in the arts and the other for excelling in education. Together, their journeys highlight the different but equally inspiring ways Zimbabweans living with disabilities continue to break barriers and redefine success.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Pictures of a man strikingly resembling Zimbabwean musician Greatman Gwaze, real name Tongai Gwaze, went viral on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/greatman-look-alikes-graduation-pictures-rock-social-media/\">Continue reading<span class=\"screen-reader-text\"> \"Greatman Look-Alike’s Graduation Pictures Rock Social Media\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "Mnangagwa Keeps MSU Graduands Waiting for Hours Amid Chaotic Ceremony",
            "url": "https://www.zimeye.net/2025/09/12/mnangagwa-keeps-msu-graduands-waiting-for-hours-amid-chaotic-ceremony/",
            "content": "By A Correspondent| President Emmerson Mnangagwa, in his capacity as Chancellor of the Midlands State University (MSU), yesterday left thousands of graduands frustrated after they were forced to wait more than five hours for the graduation ceremony to begin.\n\nAccording to some graduands, the President only arrived at the venue around 2:30 pm, long after the scheduled start.\n\nTensions were worsened by MSUs decision to shift the event from its Gweru campus to the newly built ED Mnangagwa Law School, located about 15 kilometres outside Kwekwes central business district. The change of venue posed major logistical challenges, with motorists spending up to two hours navigating the poor and bumpy road leading to the site.\n\nThe delays and difficult access left many graduates and their families visibly disgruntled. Some who had travelled long distances reportedly abandoned the event midway. Security personnel, including soldiers and Central Intelligence Organisation operatives, were deployed to block exits, but the swelling crowd eventually pushed down parts of the perimeter fence.\n\nIn several cases, graduates slipped out of the venue once their faculties had been capped, as order broke down and chaos overshadowed the ceremony.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| President Emmerson Mnangagwa, in his capacity as Chancellor of the Midlands State University (MSU), yesterday left thousands … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/mnangagwa-keeps-msu-graduands-waiting-for-hours-amid-chaotic-ceremony/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Keeps MSU Graduands Waiting for Hours Amid Chaotic Ceremony\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "6 People Killed in Mhizha Bus and Toyota Aqua Crash on Bubi–Rutenga Road",
            "url": "https://www.zimeye.net/2025/09/12/3-people-killed-in-mhizha-bus-and-toyota-aqua-crash-on-bubi-rutenga-road/",
            "content": "By Farai D Hove | ZimEye | BubiRutenga Road, Zimbabwe  Tragedy struck early this morning when a Mhizha cross-border bus heading to Cape Town collided with a truck carrying a newly purchased Toyota Aqua, leaving multiple people dead and dozens injured.\n\nMidnight Horror: Mhizha Bus Crash Leaves Six Dead, Dozens Injured on BubiRutenga Roadpic.twitter.com/Ln7XcolJYH\n\nAccording to a detailed incident report sent to the ZimEye News Network, the horrific crash occurred at approximately 2:35 a.m. in a remote area between Bubi and Rutenga. The Mhizha bus reportedly suffered a sudden tyre burst, veered off course, and slammed into the oncoming truck carrying the Toyota Aqua with four passengers onboard.\n\nCasualties Confirmed:\n\nEyewitnesses told ZimEye that network coverage problems in the area severely delayed emergency services. We were in the middle of nowhere, and calling for help was almost impossible, one survivor said.\n\nPhotos from the crash site show the Mhizha bus overturned on its side with injured passengers, including women carrying children, scattered around the scene. The Toyota Aqua and the transport truck were left mangled beyond recognition, with debris littering the road.\n\nLocal authorities and emergency responders are still working to clear the wreckage and assist survivors. Police have urged motorists travelling along the BubiRutenga corridor to exercise extreme caution while investigations into the cause of the crash continue.\n\nPolice were still to comment at the time of writing.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | Bubi–Rutenga Road, Zimbabwe – Tragedy struck early this morning when a Mhizha cross-border … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/3-people-killed-in-mhizha-bus-and-toyota-aqua-crash-on-bubi-rutenga-road/\">Continue reading<span class=\"screen-reader-text\"> \"6 People Killed in Mhizha Bus and Toyota Aqua Crash on Bubi–Rutenga Road\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "Hospitals Are Pathetic, Zanu PF Women’s League Boss Openly Tells Mnangagwa",
            "url": "https://www.zimeye.net/2025/09/12/hospitals-are-pathetic-zanu-pf-womens-league-boss-openly-tells-mnangagwa/",
            "content": "By A Correspondent\n\nWhile appealing directly to President Emmerson Mnangagwa for urgent intervention, Zanu PF Womens League boss Mabel Chinomona painted a grim picture of Zimbabwes hospitals during a womens event in Harare on Monday.\n\nChinomona described the healthcare system as pathetic, highlighting the severe shortage of essential medicines across the country.\n\nThere is no medication in hospitals, Sir. The situation is bad, she told the President, drawing gasps and murmurs from attendees.\n\nThe remarks were notable for their bluntness, with Chinomona breaking from the usual deferential tone often observed by party officials when addressing the President.\n\nObservers noted that her appeal underscored growing frustrations even within Zanu PF ranks about the declining state of public services. Its unusual to hear such honesty from a senior party figure, especially in front of the President. This shows that the healthcare crisis is undeniable, said one political analyst.\n\nThe Womens League event provided a platform for Chinomona to call for urgent attention to the countrys health sector, urging the government to address shortages that have left patients struggling to access basic treatment.\n\nThe people are suffering, and we cannot continue to ignore the plight of our hospitals. Patients deserve proper care, and the lack of medication is unacceptable, she added.\n\nHer comments come amid increasing public outcry over chronic shortages of drugs and medical supplies in government hospitals, an issue that has sparked protests and widespread criticism in recent months.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent While appealing directly to President Emmerson Mnangagwa for urgent intervention, Zanu PF Women’s League boss Mabel Chinomona … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/hospitals-are-pathetic-zanu-pf-womens-league-boss-openly-tells-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Hospitals Are Pathetic, Zanu PF Women’s League Boss Openly Tells Mnangagwa\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "Chinamasa Named in Manicaland ED 2030 Push",
            "url": "https://www.zimeye.net/2025/09/12/chinamasa-named-in-manicaland-ed-2030-push/",
            "content": "By A Correspondent Zanu PF Secretary for Legal Affairs Patrick Chinamasa has been named as one of the senior officials expected to preside over Manicalands preparations for the ruling partys 22nd National Peoples Conference, where the province has formally revived the ED 2030 agenda  a push to extend President Emmerson Mnangagwas rule beyond current constitutional limits.\n\nThe move comes as factional battles over succession once again take centre stage in Zanu PF. Rival camps, particularly Mnangagwas loyalists and those aligned to Vice President Constantino Chiwenga, are jostling for influence ahead of the Mutare conference in October. For years, the party has struggled with internal divisions over leadership renewal, with succession tensions dating back to the dramatic 2017 ouster of the late Robert Mugabe.\n\nIn Manicaland, the provincial structures recently convened meetings that produced two headline resolutions: extending Mnangagwas presidential tenure beyond 2030 and adopting a hardline stance against drug and substance abuse.\n\nProvincial chairman Tawanda Mukodza said the resolutions reflect the will of grassroots supporters. The people desire that President Mnangagwa remains in office beyond 2030, and are calling for the necessary constitutional amendments to facilitate this. As a party, we must respect the will of the people, he said.\n\nMukodza confirmed that an inter-district conference will be held next week to consolidate these resolutions into a formal provincial position paper. The process will be supervised by Chief Secretary to the President and Cabinet Martin Rushwaya and Chinamasa, who, as Zanu PFs chief legal strategist, is responsible for guiding constitutional and legal reforms within the party.\n\nWhile supporters frame the ED 2030 agenda as a popular demand, party insiders caution that it risks deepening divisions. Critics argue the plan undermines internal democracy and is designed to block potential successors, with Chiwengas allies particularly uneasy about the push.\n\nAlongside the succession resolution, Manicaland leaders also prioritised a crackdown on drug abuse, including calls for stiffer penalties and probes into alleged complicity by security and political elites.\n\nPreparations for the 22nd National Peoples Conference, scheduled for October 1318 at Mutare Polytechnic, are nearly complete. The conference is expected to draw 4,000 delegates, raise US$5 million in funding, and feature accommodation, catering, and infrastructure upgrades already in place. SMEs will also be allowed to operate under controlled commercial arrangements during the event.\n\nBut beyond the logistics, the political significance is undeniable: Manicalands embrace of the ED 2030 agenda, under the guidance of senior figures like Chinamasa, signals a calculated intervention in the succession debate. The test will be whether other provinces follow suit  or whether the unresolved question of who takes over after Mnangagwa continues to fuel factional turbulence inside Zanu PF.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF Secretary for Legal Affairs Patrick Chinamasa has been named as one of the senior officials … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/chinamasa-named-in-manicaland-ed-2030-push/\">Continue reading<span class=\"screen-reader-text\"> \"Chinamasa Named in Manicaland ED 2030 Push\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        },
        {
            "title": "No Leads in Mutangadura Murder",
            "url": "https://www.zimeye.net/2025/09/12/no-leads-in-mutangadura-murder/",
            "content": "By Crime and Courts Reporter A month after the shocking murder of Ruwa businessmanJoseph Mutangaz Mutangadura, police are yet to provide any concrete leads, leaving family, friends, and the wider community demanding answers.\n\nPolice maintain that investigations are ongoing, despite reports that leaked soon after Mutangaduras death suggested he may have been killed by his wifes alleged lover, according to a local online news portal.\n\nMutangaduras marriage toPatience Dambudzowas marked by turbulence, with longstanding allegations of infidelity and mistrust. The tensions became public last year when Mutangadura reportedly launched a failed manhunt for his wifes suspected lover. At one point, he moved out of their home in protest, though he later returned under uneasy circumstances.\n\nBy the time of his death, the couple had seemingly reconciled, but close associates suggest unresolved tensions may have lingered.\n\nOn the night ofSunday, 17 August, seven masked men stormed Mutangaduras Lisheen Estate farmhouse in Ruwa. They overpowered a security guard, tied him up, and demanded a description of Mutangadura before heading straight to the couples bedroom.\n\nDespite his reported offer to take them to cash at his abattoir, the intruders shot the 67-year-old businessman multiple times in the chest and stomach. Strikingly, they left behind valuables and took only a cellphone worth aboutUS$10, intensifying suspicions that the attack was atargeted assassinationrather than a robbery.\n\nPatience was rendered unconscious during the ordeal and remains hospitalised under police protection. Investigators have seized her cellphone for forensic analysis, a move that has fuelled speculation of possible insider involvement.\n\nLeaked messages circulating on social media point to potential insider communication, though police have not confirmed these claims. Relatives of the slain businessman are convinced the killing was deliberate.\n\nWhat is disturbing is that the gang was not after money but the life of Joseph, one family member told reporters.\n\nMutangadura was a well-known entrepreneur in Ruwa and beyond, owningbutcheries, Lisheen Estate, and the popular entertainment venueMutangadura Hideout. He was laid to rest in Goromonzi last Saturday, with mourners describing him as a hardworking businessman whose violent death has left a gaping wound in the community.\n\nFor now, the motive behind his murder remains shrouded in mystery, as detectives from theCID Homicide Unitcontinue their hunt for the seven suspects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – A month after the shocking murder of Ruwa businessman Joseph “Mutangaz” Mutangadura, police are yet to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/12/no-leads-in-mutangadura-murder/\">Continue reading<span class=\"screen-reader-text\"> \"No Leads in Mutangadura Murder\"</span></a></p>",
            "time": "09:26",
            "date": "13 Sep 2025"
        }
    ]
}