{
    "news": [
        {
            "title": "Ostallos Continues Defending Hopewell Despite Public Outcry Revealing He’s A Big Problem",
            "url": "https://www.zimeye.net/2025/08/29/ostallos-continues-defending-hopewell-despite-public-outcry-revealing-hes-a-big-problem/",
            "content": "Heres a drafted expos article based on the evidence youve provided:\n\nOstallos Defends Hopewell While Public Reveal Hes A Zimbabwe Problem\n\nBy A Correspondent | ZimEye | HARARE  The man many believed to be Nelson Chamisas shield, Gift Ostallos Siziba, has come under fire after openly defending controversial journalist Hopewell Chinono at a time when growing evidence suggests Chinono is entangled in identity fraud and political manipulation.\n\nIn a widely circulated post, Ostallos leapt to Chinonos defence, painting Zimbabwes crisis as a product of executive tyranny while completely sidestepping the troubling allegations of fraud and disinformation swirling around Chinono. This has now triggered outrage, with critics accusing Ostallos of protecting not the people, nor Chamisa, but a man increasingly seen as a liability to Zimbabwes democratic struggle.\n\nPublic Backlash: Hopewell Is The Problem\n\nCitizens across platforms have repeatedly warned that Hopewell Chinono is not the solution but a deepening problem for Zimbabwe. In a viral Twitter Space, speaker Mukundi bluntly declared:\n\nHopewell is the one big problem for Zimbabwe. He knows everything, wants to control everything, crushes everything. Even Chamisa welcomed him, but Chinono acted like a dictator himself. He wants to be credited in everything.\n\nHopewell is the one big problem for Zimbabwe  @Mukundi_IIBut let me tell you Hopewell@daddyhope, he says some good things, but Hopewell is the one big problem for Zimbabwe as well.You will realize it later, but the problem he knows everything. He is the richest person,https://t.co/x0Da8Gzwxrpic.twitter.com/HxGbaqcKwn\n\nHopewell is the one big problem for Zimbabwe  @Mukundi_IIBut let me tell you Hopewell@daddyhope, he says some good things, but Hopewell is the one big problem for Zimbabwe as well.You will realize it later, but the problem he knows everything. He is the richest person,https://t.co/x0Da8Gzwxrpic.twitter.com/HxGbaqcKwn\n\nHopewell is the one big problem for Zimbabwe  @Mukundi_IIBut let me tell you Hopewell@daddyhope, he says some good things, but Hopewell is the one big problem for Zimbabwe as well.You will realize it later, but the problem he knows everything. He is the richest person,https://t.co/x0Da8Gzwxrpic.twitter.com/HxGbaqcKwn\n\nThese concerns were echoed by other civic voices who point to Chinonos erratic behaviourpraising Chamisa one day, attacking him the next; claiming to be barred from Zimbabwe, yet boasting of paying taxes to Emmerson Mnangagwas government; insisting he is not interested in politics, yet weighing in heavily on leadership succession debates.\n\nHopewell Chinono is a great danger to Zimbabweans.Few weeks ago he said I am not interested in Geza, today he posts about Geza?One day he attacks Nelson Chamisa, the following day Ostallos (who is close to Chamisa) is praising Hopewell?One day he claims that ED is\n\nAllegations of Identity Fraud\n\nBeyond political inconsistency, Chinono faces disturbing allegations of identity fraud. Official records and leaked documents reveal that he has operated under three separate identities:\n\nPassports, affidavits, and media IDs attached to these names suggest a deliberate manipulation of identity records over the years. Chinono even claimed the British Embassy in Harare conducted a criminal records check and conducted police clearance on money he illegally moved from Britain to Zimbabwe  a claim publicly dismissed as false by the UK Embassy, which confirmed it has never carried out such services for him or anyone else.\n\nOstallos Defence Raises Questions\n\nWhile public concern grows, Ostallos decision to shield Chinono has cast suspicion over his own political motives. Instead of addressing the identity scandal and growing evidence of fraud, he has consistently reframed the issue as one of executive overreach. Critics argue this is a diversionary tactic, designed to protect an ally whose credibility is collapsing.\n\nHulu, another critic, put it bluntly:\n\nHopewell Chinono is a great danger to Zimbabweans. He captured everybody around Chamisa to ensure Chamisa does not return to politics.\n\nA Manufactured Protector?\n\nThe contradiction is glaring: while Zimbabweans expected Ostallos to safeguard Chamisa from infiltration, he has instead positioned himself as Chinonos shield. The result is deepening mistrust, with many now questioning whether Chamisas inner circle is compromised by individuals defending fraudsters under the guise of democracy.\n\nThe unfolding revelations expose a grim reality: the battle for Zimbabwes democracy is being undermined not only by the ruling regime but also by actors within the oppositions orbit who protect controversial figures like Hopewell Chinono.\n\nAs the identity fraud allegations mount and public voices grow louder, one question lingers: is Ostallos defending Zimbabwes democracy, or is he defending a fraudster?\n\nHopewell Chinono is a great danger to Zimbabweans.Few weeks ago he said I am not interested in Geza, today he posts about Geza?One day he attacks Nelson Chamisa, the following day Ostallos (who is close to Chamisa) is praising Hopewell?One day he claims that ED is\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Here’s a drafted exposé article based on the evidence you’ve provided: Ostallos Defends Hopewell While Public Reveal He’s A Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/ostallos-continues-defending-hopewell-despite-public-outcry-revealing-hes-a-big-problem/\">Continue reading<span class=\"screen-reader-text\"> \"Ostallos Continues Defending Hopewell Despite Public Outcry Revealing He’s A Big Problem\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Prominent Harare Slayqueen Arrested",
            "url": "https://www.zimeye.net/2025/08/29/prominent-harare-slayqueen-arrested/",
            "content": "By Showbiz Reporter Popular Harare socialite and slayqueenMarvelous Gumise, widely known asMarvelous Marvelous, has been arrested on allegations ofcyberbullying and threats of violence.\n\nGumise was summoned toBorrowdale Police Station on Wednesdayfor questioning before giving a warned-and-cautioned statement under docket numberCR 282/08/25.\n\nThe case stems from herfallout with a fellow socialite and businesswoman, following a heated confrontation at a recent party attended by both women.\n\nAccording to the complaint, Marvelous allegedly accused the businesswoman ofstealing a phoneduring the party. The incident later spilled onto social media, where Marvelous is said to have made posts that triggered a wave of online backlash and ridicule against the complainant.\n\nThe businesswoman has since reported the matter to the police, citing reputational damage and threats received online as a result of Marvelous actions.\n\nPolice are continuing with investigations.\n\n-H-Metro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Popular Harare socialite and slayqueen Marvelous Gumise, widely known as Marvelous Marvelous, has been arrested on allegations of cyberbullying and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/prominent-harare-slayqueen-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Harare Slayqueen Arrested\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Chisumbanje Community Sues Mnangagwa Ally Billy Rautenbach’s Greenfuel",
            "url": "https://www.zimeye.net/2025/08/29/chisumbanje-community-sues-mnangagwa-ally-billy-rautenbachs-greenfuel/",
            "content": "By A Correspondent The Chisumbanje community has taken Greenfuel, owned by business magnate and close Mnangagwa ally Billy Rautenbach, to court demandingUS$110,000 in compensationfor 11 pupils from Katanga Secondary School who were brutally assaulted by the companys security guards.\n\nThe lawsuit follows the recent conviction of three Greenfuel guardsMakina Ngwenya, Benjamin Dube, and Munorwei Gomonderawho were found guilty of assaulting the children. The guards were sentenced to 280 hours of community service, a punishment community leaders have condemned asgrossly inadequategiven the physical and psychological trauma endured by the minors.\n\nGreenfuels operations in Chisumbanje have long been controversial. Since its establishment, the ethanol producer has been embroiled in bitter disputes with villagers overdisplacement, loss of communal land, environmental degradation, and alleged intimidation by security details.\n\nTensions between the company and locals have frequently spilled into open confrontation, with villagers accusing Greenfuel ofexploiting their land while offering little in terms of meaningful development.\n\nAt the forefront of resistance has been thePlatform for Youth and Community Development (PYCD),a grassroots organisation that has consistently fought for villagers rights against corporate and state power. Working closely with theZimbabwe Lawyers for Human Rights (ZLHR),PYCD has ensured that the voices of marginalised groupsparticularly women and childrenare amplified.\n\nIn this latest case, PYCD mobilised parents of the victims and facilitated the legal action. Outrage spread after videos circulated online showing Greenfuel guardsboasting about and celebrating the assaultswhich included attacks on young girlsfueling anger and galvanising the demand for justice.\n\nParents turned to PYCD, which swiftly engaged ZLHR lawyersPeggy Tavagadza and Tonderai Sigauketo represent the children in the lawsuit.\n\nThe claim, now before theChipinge Magistrates Court,demands that Greenfuel payUS$10,000 per pupil, totalling US$110,000. Beyond monetary damages, the community is also calling for apublic apology to be broadcast on local radio stations, including Vemuganga FM,as a step toward rebuilding trust and deterring future abuses.\n\nPYCD directorClaris Madhukustressed that the lawsuit is not just about compensation, but about recognition and dignity for the community.Greenfuel has failed over the years to build a relationship of trust with the people,Madhuku said.If there had been genuine dialogue and respect for community rights, such incidents could have been avoided.\n\nFor many villagers, the lawsuit goes beyond the assault case and represents abroader fight against corporate impunity and political protection. Greenfuels controversial presence in Chisumbanje, coupled with Rautenbachs close ties to Zimbabwes ruling elite, has left many residents feelingmarginalised and powerless.\n\nThe community now hopes the courts will deliver not only justice for the assaulted children but also send a clear message thatcorporate power cannot override basic human rights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Chisumbanje community has taken Greenfuel, owned by business magnate and close Mnangagwa ally Billy Rautenbach, to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/chisumbanje-community-sues-mnangagwa-ally-billy-rautenbachs-greenfuel/\">Continue reading<span class=\"screen-reader-text\"> \"Chisumbanje Community Sues Mnangagwa Ally Billy Rautenbach’s Greenfuel\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Zanu PF MP Misfires, Fired Again",
            "url": "https://www.zimeye.net/2025/08/29/zanu-pf-mp-misfires-fired-again/",
            "content": "By A Correspondent  Zanu PF Bubi legislator and Deputy Higher Education Minister, Simelisizwe Sibanda, has been barred from accessing provincial offices and attending party meetings amid accusations of gross misconduct and bringing the party into disrepute.\n\nThe Zanu PF Matabeleland North provincial leadership accuses Sibanda of defying party structures, creating parallel structures, and making statements deemed damaging to the partys image.\n\nZANUPF memorabilia\n\nIn a letter dated Monday,provincial disciplinary committeechairpersonSilas Maligooutlined charges against Sibanda,sayinghis conduct violated the partys constitution and undermined unity.\n\nYour behaviour has the potential to provoke division, disunityorimpact negatively on the unity of the party by creating and promoting your own parallel structures, Maligo wrote.\n\nAmong the allegations, Sibanda is accused of:\n\nFollowing complaints by the Bubi DCC, the provincial executive council met on Sunday and resolved to issue a prohibition order against Sibanda, effective August 24, pending a full disciplinary hearing.\n\nThe order bars him from performing any duties as a DCC member, entering provincial or party offices, and attending Zanu PF gatherings. He has 21 days to respond to the allegations before a hearing scheduled for November 19.\n\nContacted yesterday, Sibanda said he was unaware of the prohibition order.\n\nThis is not the first time the outspoken legislator has courted controversy. In July last year, President Emmerson Mnangagwa fired Sibanda from his deputy ministerial post after he sparked outrage for transferring an early childhood development teacher from Bubi district on the grounds of insufficient proficiency in isiNdebele. He was, however, reinstated weeks later after issuing what insiders described as profuse apologies.\n\nThe latest developments raise fresh questions about Sibandas political future as Zanu PF battles to contain internal dissent in its provincial structures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF Bubi legislator and Deputy Higher Education Minister, Simelisizwe Sibanda, has been barred from accessing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/zanu-pf-mp-misfires-fired-again/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF MP Misfires, Fired Again\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Mnangagwa’s Politburo Address Full of Rhetoric as Economy Bleeds",
            "url": "https://www.zimeye.net/2025/08/29/mnangagwas-politburo-address-full-of-rhetoric-as-economy-bleeds/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has once again resorted to grand promises and political sloganeering, pledging empowerment and industrialisation while millions of Zimbabweans continue to suffer under economic collapse, unemployment, and poverty.\n\nSpeaking at Zanu PFs 386th Ordinary Session of the Politburo in Harare yesterday, Mnangagwa insisted that his government will never lose interest in scaling up programmes to improve livelihoods. Yet, years into his Second Republic, citizens remain trapped in a worsening cost-of-living crisis, with little evidence that these promises translate into reality.\n\nWe are masters of our own destiny and a proud African people. This must never change. On the economic front, Zanu PF will never tire of scaling up programmes and projects that are deliberately designed to broadly empower the citizens of this great country, Mnangagwa said.\n\nHowever, analysts argue that the Presidents remarks ignore glaring failures, including rampant corruption, collapsing public services, and a struggling agricultural sector despite repeated pledges of timely support to farmers. While Mnangagwa spoke of providing inputs and irrigation systems for the 2025-2026 summer cropping season, past initiatives have been riddled with mismanagement and political favoritism.\n\nMnangagwa also touted the so-calledProductivity Booster Kit Programme, claiming it will accelerate rural industrialisation and boost food security. Yet, critics dismiss the scheme as another publicity stunt, pointing to chronic fertilizer shortages, delayed inputs, and the absence of meaningful mechanisation in most rural areas.\n\nThe President urged the diaspora to invest rural, while assigning local authorities to provide land for manufacturing hubsa call that rings hollow in a country where land corruption scandals and lack of infrastructure investment are the norm.\n\nIn an attempt to project regional influence, Mnangagwa boasted of Zimbabwes donation to Mozambique after cyclones Chido and Jude, and praised his countrys tenure as SADC chair. Meanwhile, back home, millions rely on food aid and inflation erodes incomes daily.\n\nMnangagwa also hyped the outcomes of the 9th Tokyo International Conference on Africas Development (TICAD), framing them as opportunities for industrialisation and skills transfer. Yet, Zimbabwe remains one of the least attractive destinations for foreign investment due to policy inconsistency, a broken currency system, and state capture by political elites.\n\nAs the President called for hard-honest work, discipline, focus, courage and determination, Zimbabweans are left wondering when these values will apply to the leadership itself. For many, Mnangagwas Politburo speech was just another exercise in hollow rhetoric while the economy and livelihoods remain in freefall.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has once again resorted to grand promises and political sloganeering, pledging “empowerment” and “industrialisation” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/mnangagwas-politburo-address-full-of-rhetoric-as-economy-bleeds/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Politburo Address Full of Rhetoric as Economy Bleeds\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Devastating Fire Destroys Gweru Home Industry…",
            "url": "https://www.zimeye.net/2025/08/29/devastating-fire-destroys-gweru-home-industry/",
            "content": "By A Correspondent- Scores of traders at DST Home Industry in Gweru are counting their losses after a raging fire tore through their market stalls, reducing property worth thousands of dollars to ashes.\n\nAlthough the cause of the inferno is yet to be confirmed, eyewitnesses suspect an electrical fault. I was working on my station when I heard a spark in the shade where the fire started. It looks like there was a short circuit and what transpired later was quite scary, narrated Mr. Moses Mupakurirwa.\n\nThe form rubbers were burning like paraffin and so were the asbestos. We tried to put out the fire, but the power was just too much. The fire was eventually put out by the fire brigade team. It was something that disrupted our work here as we are waiting for the quantification of the losses for us to start again.\n\nFor many traders, the incident has completely destroyed their source of livelihood. The incident is still fresh on my mind. It is very difficult to think that we have been left with nothing here. I tried to retrieve some of the wares but the fire was just too much. I had been given a contract by a local school where I was making 20 desks and only one desk survived the fire. It is hard to understand, but it is what it is, one trader said.\n\nAnother trader added: The confusion that was brought by this fire made us fail to even call the fire brigade on time. I am sure they were called in by the workers at N Richards, as we were left dumbfounded by the fire. Up to now, we are still in a state of shock. We are saying well-wishers should now intervene.\n\nIt is difficult to realise that we had managed to set up a place to survive. We were hopeful of growing our small businesses, but today, it is a pity that all is gone just like that. We are now poorer following this inferno, another devastated trader said.\n\nThe government has expressed concern over the incident and urged the Small to Medium Enterprises sector to get organised and secure proper licensing for support in times of crisis. It is a pity that we have a situation like this on our people who are trying to earn an honest living. They have indeed experienced some losses here and it is quite disturbing. We are with them at this critical juncture, said Midlands Minister of State for Provincial Affairs and Devolution, Hon Owen Ncube.\n\nGweru Mayor, Councillor Martin Chivhoko, echoed similar sentiments, adding: We are very grateful to the Central government for providing us with the fire tenders, which were critical in putting out the fire during the unfortunate incident. The traders should get the necessary licensing so that they get the necessary support at the click of their fingers.\n\nYou will realise that most of those who lost their wares are not registered, which makes it difficult for them to get the necessary compensation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- Scores of traders at DST Home Industry in Gweru are counting their losses after a raging fire … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/devastating-fire-destroys-gweru-home-industry/\">Continue reading<span class=\"screen-reader-text\"> \"Devastating Fire Destroys Gweru Home Industry…\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Rapist Runs Out Of Luck",
            "url": "https://www.zimeye.net/2025/08/29/rapist-runs-out-of-luck/",
            "content": "By Dorrothy Moyo | A chilling ordeal on a quiet Bindura road has ended with justice delivered. A 21-year-old pregnant woman, walking to a routine medical check-up, was dragged into the bushes by a man who attempted to rape her  but through remarkable courage and quick thinking, she turned the trap on her attacker. That bold act has now seen the offender, Robert Sebastian (39), sentenced to 20 years behind bars by the Bindura Regional Magistrates Court.\n\nBindura  A 39-year-old man from Withington Farm, Bindura, has been sentenced to 20 years in prison after being convicted of attempting to rape a pregnant woman.\n\nThe Bindura Regional Magistrates Court found Robert Sebastian guilty of the crime following an incident that occurred on 7 August 2025.\n\nAccording to court proceedings, a 21-year-old pregnant woman was on her way to Foothills Clinic for a medical check-up when she encountered Sebastian. After greeting her, the offender followed, grabbed her jacket, and dragged her into nearby bushes. He then tripped her to the ground and attempted to rape her.\n\nIn a desperate bid to save herself, the complainant cleverly convinced the assailant that they could enjoy the act at her home, where she claimed to live alone.\n\nUnaware that he was walking into a trap, Sebastian followed the complainant to her residence. Upon arrival, the woman alerted her husband and neighbors, who quickly apprehended the suspect and handed him over to the police.\n\nIn court, the prosecution presented strong evidence, including the complainants testimony and clothing that had been torn during the struggle.\n\nThe magistrate handed down a 20-year sentence, stressing that the justice system would continue to impose tough penalties on those who prey on women and vulnerable persons.\n\nThis conviction demonstrates that offenders will be held accountable, and public safety must be protected, a court official stated.\n\nAuthorities have since urged communities to remain vigilant and report crimes swiftly in order to strengthen law enforcement efforts and ensure the safety of women and vulnerable groups.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | A chilling ordeal on a quiet Bindura road has ended with justice delivered. A 21-year-old pregnant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/rapist-runs-out-of-luck/\">Continue reading<span class=\"screen-reader-text\"> \"Rapist Runs Out Of Luck\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Police Recover Fake Guns in Mnangagwa’s Home Town",
            "url": "https://www.zimeye.net/2025/08/29/police-recover-fake-guns-in-mnangagwas-home-town/",
            "content": "By Farai D Hove | ZimEye |\n\nKWEKWE  Several suspects have been arrested in a sweeping police operation in Kwekwe District following a spate of violent robberies, some of which involved criminals brandishing fake pistols and pellet guns to terrify their victims.\n\nDuring the crackdown, police recovered a cache of imitation firearms  including replica pistols and pellet guns  which were being used in place of real weapons to commit serious crimes. Authorities say the discovery highlights how criminals are increasingly resorting to deception to instill fear while carrying out robberies.\n\nKwekwe District police commander, Chief Superintendent Ison Chapeta, confirmed the arrests and the seizure of the fake weapons.\n\nWe have been rocked by unresolved cases of armed robberies as a district. On 14 August, we enacted a prohibition order that bars the public from carrying dangerous weapons. This has led to several arrests of people in connection with armed robberies and grievous bodily harm. The suspects are facing several charges before the courts, he said.\n\nPolice have vowed to expand the operation and tighten enforcement on the use of both real and fake weapons in crime.\n\nThe net is widening. There is no place to hide for would-be offenders. We cannot win this war without public support. I therefore urge the community to work hand in glove with the police until we weed out uncouth elements in our society. Recently, the national command instructed us to deal decisively with the issue of firearms and other dangerous weapons. We are all out, as you have seen. This is just the beginning, Chief Superintendent Chapeta warned.\n\nThe operation comes amid growing concern over the countrys worsening wave of armed robberies. In some cases, the violence has turned fatal  most recently with the brutal killing of Harare businessman Joseph Mutangadura, an incident that has reignited national debate over Zimbabwes gun laws and the urgent need for tougher enforcement.\n\n Police have reiterated that anyone found carrying real or fake firearms with criminal intent will face the full wrath of the law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | KWEKWE – Several suspects have been arrested in a sweeping police operation in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/police-recover-fake-guns-in-mnangagwas-home-town/\">Continue reading<span class=\"screen-reader-text\"> \"Police Recover Fake Guns in Mnangagwa’s Home Town\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "Police Pounce on Kwekwe Robbers, Seize Fake Guns and Pellets",
            "url": "https://www.zimeye.net/2025/08/28/police-pounce-on-kwekwe-robbers-seize-fake-guns-and-pellets/",
            "content": "By A Correspondent\n\nSeveral suspects have been arrested in a sweeping police operation in Kwekwe District following a spate of armed robberies, many of which were carried out using fake pistols and pellet guns.\n\nThe crackdown, which has already led to the recovery of imitation firearms and other dangerous weapons, comes after a surge in violent crimes that left the community gripped with fear.\n\nKwekwe Districts Officer Commanding (DISPOL), Chief Superintendent Ison Chapeta, confirmed the arrests, saying the district had been plagued by unresolved robbery cases.\n\nOn 14 August, we enacted a prohibition order that bars the public from carrying dangerous weapons. This has led to several arrests in connection with armed robberies and grievous bodily harm. The suspects are already facing multiple charges before the courts, he said.\n\nChief Superintendent Chapeta vowed that law enforcement agencies would continue widening the operation to root out criminal gangs.\n\nThe net is widening. There is no place to hide for would-be offenders. But we cannot win this war without public support. I therefore urge the community to work hand in glove with the police until we weed out these uncouth elements in our society, he stressed. As directed by the national command, we are dealing decisively with firearms and other dangerous weapons. What you are seeing is only the beginning.\n\nZimbabwe has in recent months witnessed a sharp rise in armed robberies, some of which have turned deadly. The brutal killing of Harare businessman Joseph Mutangadura earlier this month has renewed debate about gun laws in the country and intensified calls for stronger police action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Several suspects have been arrested in a sweeping police operation in Kwekwe District following a spate of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/police-pounce-on-kwekwe-robbers-seize-fake-guns-and-pellets/\">Continue reading<span class=\"screen-reader-text\"> \"Police Pounce on Kwekwe Robbers, Seize Fake Guns and Pellets\"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        },
        {
            "title": "ED Blasts Mutsvangwa, Chinamasa",
            "url": "https://www.zimeye.net/2025/08/28/ed-blasts-mutsvangwa-chinamasa/",
            "content": "By Correspondent  President Emmerson Mnangagwa on Wednesday used the ZANU PF Politburo meeting to deliver a stern warning against factionalism and indiscipline, in what insiders described as reading the riot act to his top lieutenants.\n\nWithout naming individuals, Mnangagwa cautioned senior party officials against abusing theZANU PFname to advance personal interests, warning that divisive behaviour would not be tolerated.\n\nHis remarks come amid renewed factional tensions in the ruling party, fuelled by the unresolved succession question.\n\nThe rebuke followed weeks of contradictory statements from senior figures that publicly exposed deep splits.\n\nParty spokesperson Christopher Mutsvangwa recently dismissed suggestions that businessman Kudakwashe Tagwirei  a close Mnangagwa ally and newly co-opted Central Committee member  could buy his way to the top.\n\nHe insisted the party had safeguards to block such moves. But Secretary for Legal Affairs Patrick Chinamasa contradicted him, writing on X (formerly Twitter) that resisting Tagwireis rise was futile  a rare clash of narratives between top officials.\n\nChairing the 386th Ordinary Session of the Politburo at the partys Harare headquarters, Mnangagwa made it clear the discord had gone too far.\n\nWe must all speak with one voice and march in one direction, he told the gathering. Leaders of the party are bound by collective responsibility and must unite around party decisions and resolutions, which serve as our ideological and moral compass.Hauroti zvinhu kumba kwako woenda uchitaura sehurongwa hwemusangano. Our communication must be disciplined. MuZANU PF tinomira pachokwadi. Zvemazvake-mazvake, pasi nazvo.\n\nWhile Mnangagwa avoided mentioning names, some observers believe the warning was also aimed at his deputy, Vice President Constantino Chiwenga, who was notably absent from the meeting.\n\nOfficially said to be on business in India, Chiwengas trip was not reported by state media, fuelling speculation about internal manoeuvres.\n\nFor years,ZANU PFhas been divided between Mnangagwas camp and Chiwengas military-aligned faction.Seen as a natural successorsincehis decisive role in the 2017 coup that toppled Robert Mugabe, Chiwenga retains influenceinthe army and grassroots structures.\n\nHis absence from the Politburo added weight to speculation that Mnangagwas message was a direct shot across the bow at his camp.\n\nThis is not the first time Mnangagwa has used party meetings to tighten his grip.\n\nObservers note that he has consistently turned Politburo and Central Committee sessions into platforms to project authority, reprimand rivals, and assert control over succession narratives.\n\nWith Mnangagwa increasingly elevating allies such as Tagwirei, Chiwengas backers fear being sidelined from the partys future leadership matrix.\n\nAs the battle over succession intensifies, Mnangagwas latest intervention highlights both his determination to stamp out dissent and the fragility of unity within ZANU PF.\n\nWhether the warning restores discipline or deepens factional divides remains to be seen  but the Presidents words signal that the succession struggle is entering a more confrontational phase.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Correspondent – President Emmerson Mnangagwa on Wednesday used the ZANU PF Politburo meeting to deliver a stern warning against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/ed-blasts-mutsvangwa-chinamasa/\">Continue reading<span class=\"screen-reader-text\"> \"ED Blasts Mutsvangwa, Chinamasa \"</span></a></p>",
            "time": "09:07",
            "date": "30 Aug 2025"
        }
    ]
}