{
    "news": [
        {
            "title": "Usavi 4ED ? Zanu PF Launches Controversial Affiliate Group",
            "url": "https://www.zimeye.net/2025/11/02/usavi-4ed-zanu-pf-launches-controversial-affiliate-group/",
            "content": "By A Correspondent\n\nZanu PF has reportedly launched a new affiliate called Top Soup 4ED, a name loosely interpreted to mean women ready to provide pleasure on behalf of Mnangagwa.\n\nCritics have raised concerns over the name, questioning whether it denigrates women and treats them as mere instruments for political gain.\n\nA video circulating online shows a young woman wearing a T-shirt emblazoned with the words Top Soup 4ED, sparking debate about the groups intentions and its underlying message.\n\nThe development adds to the growing list of Zanu PF-aligned affiliates established in support of President Emmerson Mnangagwas Vision 2030 Agenda. Political observers say the initiative is part of a broader campaign to consolidate political influence and possibly pave the way for extending the Presidents stay in office beyond constitutional limits.\n\nWatch: Top Soup 4ED VideoAnother Zanu PF affiliate emerges? Top Soup 4ED is yet another affiliate reportedly launched to prop up President Emmerson Mnangagwa's 2030 AgendaVideo: Top Soup 4EDpic.twitter.com/FxiErPHfMX\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF has reportedly launched a new affiliate called Top Soup 4ED, a name loosely interpreted to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/usavi-4ed-zanu-pf-launches-controversial-affiliate-group/\">Continue reading<span class=\"screen-reader-text\"> \"Usavi 4ED ? Zanu PF Launches Controversial Affiliate Group\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "Rev Musindo Attacks VP Chiwenga",
            "url": "https://www.zimeye.net/2025/11/02/rev-musindo-attacks-vp-chiwenga/",
            "content": "By A Correspondent  A controversial figure known for his strong alignment with ZANUPF, self-styled pastor and party apologist Obadiah Musindo has publicly defended President Emmerson Mnangagwas inner circle, including those labelled by Vice-President Constantino Chiwenga as Zvigananda.\n\nMusindo dismissed critics of these figures as jealous of successful people and urged Zimbabweans to respect those whom God has blessed.\n\nSpeaking at a pastors conference in Chinhoyi this week, Musindo declared:\n\nThere is nothing wrong with success  those you call Zvigananda are blessed people who are using their wisdom to prosper. We must not demonise them because of envy.\n\nHis comments drew sharp criticism from citizens who accused him of glorifying corruption and shielding politically connected business elites. One Chinhoyi resident who attended the event responded:\n\nHow can a pastor defend looting and call it a blessing? People are hungry because of these so-called blessed businessmen.\n\nAnother added:\n\nIf these men are truly patriotic, let them show us their tax records and how many jobs theyve created without government handouts.\n\nMusindos remarks come amid mounting public anger over corruption and inequality. Civil society groups condemned the clerics words as dangerously tone-deaf. According to one activist with the Zimbabwe AntiCorruption Forum:\n\nReligious leaders should be standing with the poor, not with looters  To call those accused of corruption visionaries is to normalise theft.\n\nMusindo has a history of serious allegations that have drawn into question his moral authority. He was charged in 2006 with five counts of raping his 22-year-old domestic servant, after accusations that he had assaulted her multiple times and threatened her if she reported him. A magistrate ruled there was a prima facie case against him. More recent reports allege he has locked up vulnerable girls in a Harare hotel and used political connections to intimidate them from reporting.\n\nDespite these serious accusations, Musindo has continued to appear at state-linked events and publicly support ZANU-PF, raising concerns that politically connected figures remain accountable to little more than the party line. Critics say that when a pastor known to face such allegations turns to defending elites, it symbolically erodes the moral standing of the church and weakens the countrys ethics\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A controversial figure known for his strong alignment with ZANU‑PF, self-styled pastor and party apologist Obadiah … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/rev-musindo-attacks-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Rev Musindo Attacks VP Chiwenga\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "ZANU PF Spokesperson Declares Calls for Term Extension Show Mnangagwa’s Popularity",
            "url": "https://www.zimeye.net/2025/11/02/zanu-pf-spokesperson-declares-calls-for-term-extension-show-mnangagwas-popularity/",
            "content": "By A Correspondent\n\nZANU PF spokesperson Christopher Mutsvangwa has said that growing discussions about extending President Emmerson Mnangagwas term in office are a reflection of the publics confidence in his leadership rather than a political ploy.\n\nSpeaking in an interview with SABC News on Tuesday, Mutsvangwa dismissed reports of internal divisions within the ruling party and claims of a brewing succession battle. He said Zimbabweans overwhelmingly support President Mnangagwa and trust his leadership to continue guiding the nation.\n\nThe people have spoken, Mutsvangwa said. Zimbabweans are behind President Mnangagwa. Leadership transitions are determined by the will of the people through elections, not rumours or factional speculation.\n\nAddressing speculation that Vice President Constantino Chiwenga might be next in line for leadership, Mutsvangwa stressed that the countrys Constitution does not provide for automatic succession.\n\nIt is not correct to assume the vice president is next in line, he said. There is no constitutional provision for automatic succession. Anyone who wants to lead must contest in an election, just like any other citizen.\n\nUsing a pointed analogy, the ZANU PF spokesperson compared Zimbabwes political system to that of the Vatican. This is not Rome, where cardinals sit in secret and decide who becomes pope. This is a democratic country  our leaders are chosen by the people, Mutsvangwa said.\n\nHe further argued that citizens discussions around Mnangagwas possible term extension should be interpreted as a sign of trust, not ambition. When people talk about the duration of the term, it is because they trust his leadership. The public has shown its confidence in him, he said.\n\nMutsvangwas comments come as debate intensifies over President Mnangagwas political future, with some ruling party members reportedly advocating for constitutional amendments to allow him to serve beyond his second term.\n\nDespite rising speculation, Mutsvangwa maintained that the Presidents popularity remains intact and that the people, not internal factions, will determine the countrys political direction. The people are the ultimate authority, he said. As long as the President continues to deliver, the people will continue to support him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF spokesperson Christopher Mutsvangwa has said that growing discussions about extending President Emmerson Mnangagwa’s term in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/zanu-pf-spokesperson-declares-calls-for-term-extension-show-mnangagwas-popularity/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Spokesperson Declares Calls for Term Extension Show Mnangagwa’s Popularity\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "AU Endorses Chaotic Polls In Tanzania",
            "url": "https://www.zimeye.net/2025/11/02/au-endorses-chaotic-polls-in-tanzania/",
            "content": "By A Correspondent\n\nAddis Ababa / Dar es Salaam  The African Union has issued a statement endorsing the results of Tanzanias controversial presidential election, which saw President Samia Suluhu Hassan declared the overwhelming winner amid allegations of irregularities and the exclusion of key opposition candidates.\n\nIn a statement released on Saturday, the Chairperson of the African Union Commission, H.E. Mahmoud Ali Youssouf, congratulated President Hassan on her victory while expressing regret over the loss of life during post-election protests.\n\nThe Chairperson deeply regrets the loss of human life during the post-electoral protests and extends his sincere condolences to the families of the victims, the AU statement read.\n\nHe underscores the imperative of upholding fundamental rights and freedoms, including the right to peaceful assembly and expression, and encourages the authorities to safeguard these rights within the framework of the law. He also calls on citizens to exercise their rights in a peaceful and responsible manner.\n\nThe AU emphasized the importance of democratic principles, recalling the African Charter on Democracy, Elections and Governance. The Chairperson recalls the principles of the African Charter on Democracy, Elections and Governance, in particular respect for the rule of law, human rights, fundamental freedoms, and political pluralism, which are the cornerstones of democratic and stable societies, the statement continued.\n\nDespite the violence and widespread concerns over the fairness of the polls, the AU reaffirmed its commitment to supporting Tanzania. The African Union reaffirms its readiness to support the people and Government of Tanzania in their efforts to preserve peace, national cohesion, and democracy, the statement concluded.\n\nAccording to the countrys electoral commission, President Hassan won 97.66 percent of the vote in Wednesdays election, dominating every constituency after leading opposition figures were barred from participating. Critics argue that the election lacked competitiveness and that the exclusion of opposition candidates undermined the legitimacy of the results.\n\nPresident Hassans near-unanimous victory comes amid post-election unrest, with several protesters killed in clashes with security forces following the announcement of the results. The AUs endorsement has drawn mixed reactions, with some observers warning that legitimizing the polls without addressing human rights concerns could set a worrying precedent for democratic processes in the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Addis Ababa / Dar es Salaam – The African Union has issued a statement endorsing the results … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/au-endorses-chaotic-polls-in-tanzania/\">Continue reading<span class=\"screen-reader-text\"> \"AU Endorses Chaotic Polls In Tanzania\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "ZANU PF Gnashes Teeth As Gorimbo Loses His First Fight In A Long Time",
            "url": "https://www.zimeye.net/2025/11/02/zanu-pf-gnashes-teeth-as-gorimbo-loses-his-first-fight-in-a-long-time/",
            "content": "THE ANSWER BLEEDS, BUT NEVER BREAKS: THEMBA GORIMBOS LAS VEGAS WAR WITH JEREMIAH WELLS\n\nBy ZimEye Sports | Las Vegas, Nevada\n\nUnder the blinding lights of the UFC APEX, the Zimbabwean warrior Themba The Answer Gorimbo walked into the Octagon like a man stepping into destiny. Across the cage stood a snarling Jeremiah Wells  stocky, explosive, and desperate to save his career. The air in Las Vegas was thick with tension. It wasnt just a fight; it was survival.\n\nThe opening bell rang  and Gorimbo struck first. Lightning-fast, he ducked under Wells wild right hand and scooped the American clean off his feet. The crowd gasped as the Zimbabwean slammed him to the mat, sliding into full mount like a predator that had done this a thousand times before. For two minutes, Wells could barely breathe as Gorimbo rained down punches and hunted for position, his face calm, his heart pounding like tribal drums from the Matabeleland highlands he calls home.\n\nBut Wells is a veteran of chaos. He rose from the canvas with blood in his mouth and fury in his eyes, pressing Gorimbo to the cage, reversing the tide with brute strength. The first round ended with Wells on top, elbows cocked, but the horn spared Gorimbo  for now.\n\nThe second round was a storm. Wells came out swinging, ripping body kicks and combinations that echoed through the Apex. Gorimbo absorbed them like a man possessed, answering with relentless takedown attempts. But this time, fatigue crept in  the kind that burns your lungs and betrays your muscles. Each time he shot, Wells sprawled. Each time he stood, Wells pressed him back down. Wells began to flow, chaining strikes with wrestling, his rhythm sharp, his intent cruel. Gorimbos face told a story  pain, defiance, and something else: refusal to quit.\n\nBy the final round, both men looked like soldiers crawling through the trenches. Wells still had fire in his legs; Gorimbo had only pride  but that pride was pure iron. When Wells dragged him down again, the crowd could see it  the American was the fresher fighter, but the Zimbabwean refused to die in there. Even as Wells hunted for arm-triangle chokes, even as the seconds ticked away, Gorimbo kept moving, kept fighting, kept trying to stand.\n\nWhen the final horn sounded, both warriors collapsed  drained, battered, but unbroken. Wells hand was raised by unanimous decision (29-28, 29-28, 29-28), but Gorimbo had once again shown what Zimbabwean grit looks like under pressure.\n\nHis record now stands at 146, but numbers dont tell the story. This was a fight of spirit  of a man who rose from poverty, who once slept in a bush as a refugee, now bleeding under Vegas lights against one of the worlds best.\n\nAs Gorimbo walked out of the cage, he smiled through a swollen lip and said simply:\n\nThis is not the end. Its part of the journey. Ill come back stronger. Zimbabwe, this one was for you.\n\nAnd thats the thing about The Answer  he doesnt fade when the lights get bright. He bleeds, he learns, and he keeps coming. Always.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "THE ANSWER BLEEDS, BUT NEVER BREAKS: THEMBA GORIMBO’S LAS VEGAS WAR WITH JEREMIAH WELLS By ZimEye Sports | Las Vegas, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/zanu-pf-gnashes-teeth-as-gorimbo-loses-his-first-fight-in-a-long-time/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Gnashes Teeth As Gorimbo Loses His First Fight In A Long Time\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "Opposition MPs Dismiss Allegations of Supporting Mnangagwa’s Term Extension",
            "url": "https://www.zimeye.net/2025/11/02/opposition-mps-dismiss-allegations-of-supporting-mnangagwas-term-extension/",
            "content": "By A Correspondent\n\nHarare  The Opposition Progressive Caucus has strongly rejected claims that its Members of Parliament participated in singing the controversial 2030 NdeyaEmmerson song during President Emmerson Mnangagwas State of the Nation Address (SONA) on Tuesday.\n\nIn a statement released on Saturday, the caucus described the allegations as entirely false and misleading, emphasizing that the video circulating on social media clearly shows that only ruling ZANU PF legislators were involved.\n\nThe Opposition Progressive Caucus dismisses false claims that its MPs joined in the 2030 song, the statement read. We remain committed to defending the Constitution and upholding the rule of law.\n\nThe caucus expressed concern over what it described as deliberate attempts to discredit principled parliamentarians who have remained steadfast in representing citizens interests.\n\nThe accusation that opposition Members of Parliament participated in singing a song encouraging the President to extend his term to 2030 is entirely false, the statement continued. The video in question clearly shows that only certain Members of Parliament from the ruling ZANU PF party were involved.\n\nHighlighting a breach of parliamentary rules, the caucus noted that the Standing Orders prohibit any singing during a sitting of the House.\n\nGiven this clear rule, we are surprised that no corrective measures appear to have been taken by the Chair to restore order, the statement added. The failure to enforce parliamentary procedure raises serious concerns about consistency and the protection of the dignity of the House.\n\nOpposition legislators reaffirmed their loyalty to Zimbabwes constitutional order, pledging to continue acting with integrity, courage, and accountability.\n\nMembers of the Progressive Parliamentary Caucus remain deeply committed to upholding, protecting, and respecting the Constitution of Zimbabwe, said Shadow Cabinet Spokesperson Hon Darlington Chigumbu. Despite ongoing attempts to destabilize or discredit the opposition in Parliament, we reaffirm our mission to defend constitutional democracy and represent citizens interests.\n\nChigumbu further called on all Zimbabweans to remain united in protecting democratic values.\n\nAt this defining moment, we call upon all Zimbabweans across political affiliations, tribes, genders, and social classes to remain united and patriotic in defending our Constitution, he said. Protecting our democratic order is a shared responsibility that transcends politics. Together, we can safeguard the integrity of our Constitution.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – The Opposition Progressive Caucus has strongly rejected claims that its Members of Parliament participated in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/opposition-mps-dismiss-allegations-of-supporting-mnangagwas-term-extension/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition MPs Dismiss Allegations of Supporting Mnangagwa’s Term Extension\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "Did You Know VP Chiwenga Removed Mugabe On His Son’s Own Birthday 15 Nov, Suggesting He Planned The Whole Operation?",
            "url": "https://www.zimeye.net/2025/11/02/did-you-know-vp-chiwenga-removed-mugabe-on-his-sons-own-birthday-15-nov/",
            "content": "By A Correspondent | ZimEye | Vice President Constantino Chiwengas son, Christian (mother Marry Mubaiwa) was born on the 15th November, the same day he would execute operation Restore Order, exactly 5 years later.\n\nHis first two kids with Mubaiwa were born in November.\n\nTendai was born 4 Nov 2011; Christian was born on 15 November 2012; Michael was born 13 Feb 2014.\n\nThe three kids are however blocked from seeing their biological mother for over 7 years to date.\n\nMarry Mubaiwa is accused of the same allegations, as those laid against the VPs previous wife, Jocelyn Jacobson, who in 2011 was accused of worse violence than just trying to kill the VP while he is sleeping on the bed sedated. Chiwenga accused her of taking over a whole army base and destroying furniture inside KG6 barracks. A lawyer commenting, has asked Chiwenga how on earth he keeps seeing his wives doing the same thing while he is sedated; asking, how do you see them while you are sedated, and how does that become credible witness evidence?\n\nThe kids are banned from seeing their own mother, and arrest of these repeat-allegations.\n\nAnother of Chiwengas kids from a previous mother way before Jocelyn, has raised accusations against his dad. Blessing, uses the term molested to describe how he was treated.\n\nThe VP is someone I respect and Ive been consistent for years in my calls for justice for Marrys kids. Faithful are the wounds of a friend than the kisses of an enemy. People kissing the VP are not all his friends. Many are poisonous snakes, Human Rights Director Comfort Dondo comments saying.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Vice President Constantino Chiwenga’s son, Christian (mother Marry Mubaiwa) was born on the 15th … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/did-you-know-vp-chiwenga-removed-mugabe-on-his-sons-own-birthday-15-nov/\">Continue reading<span class=\"screen-reader-text\"> \"Did You Know VP Chiwenga Removed Mugabe On His Son’s Own Birthday 15 Nov, Suggesting He Planned The Whole Operation?\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "Every Parent in Africa Should Watch This",
            "url": "https://www.zimeye.net/2025/11/02/every-parent-in-africa-should-watch-this/",
            "content": "By Engineer Jacob Kudzayi Mutisi | The BBC documentary Blackmailer: The Sextortion Killers exposes a terrifying crime targeting teenagers online. Criminals trick young people into sharing intimate photos, then blackmail them with some victims driven to suicide.\n\nhttps://www.bbc.co.uk/programmes/m002kl4v\n\nFor too long, Africans have had nowhere to report such crimes. To close this gap, we have scamalert.africa a platform where victims can safely report online scams, sextortion, and cyber-abuse.\n\nParents, talk to your children before its too late. Governments must act now to strengthen online safety education and protection.\n\nIf you need help, please visit scamalert.africa or email[emailprotected].tps://www.bbc.co.uk/programmes/m002kl4v\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi | The BBC documentary “Blackmailer: The Sextortion Killers” exposes a terrifying crime targeting teenagers online. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/every-parent-in-africa-should-watch-this/\">Continue reading<span class=\"screen-reader-text\"> \"Every Parent in Africa Should Watch This\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "URGENT APPEAL FOR HELP – TONDERAI MAUCHAZA (16)",
            "url": "https://www.zimeye.net/2025/11/02/urgent-appeal-for-help-tonderai-mauchaza-16/",
            "content": "We are making a heartfelt appeal for assistance to helpTonderai Mauchaza, a 16-year-old boy fromBocha, Mutare, who is battling a rare and painful skin condition known asXeroderma Pigmentosum (XP).\n\nThis condition makes Tonderai extremely sensitive to sunlight, causing severe burns and the development oftumours on his face and head. His situation has become urgent, and he now requires immediate medical attention.\n\nTonderai lives under very difficult circumstances. He is under the care of our grandmother, who is unemployed. I do my best to support him through small piece jobs, but the little I earn goes towards food and other basic needs. Sadly, we cannot afford the medical care he urgently needs.\n\nWe are therefore appealing to thepublic, friends, and well-wishersfor financial assistance so that Tonderai can receive the treatment that could save his life.\n\nEvery contribution, no matter how small, will make a big difference. Together, we can give Tonderai hope and a chance to live a healthier and more comfortable life.\n\n(Please note: I have attached a less graphic picture of Tonderai. For those who may wish to see his current condition, you may contact me on WhatsApp using the number below.)\n\nThank you for your compassion, kindness, and support. May God bless you all.\n\nEcoCash:Talent Mauchaza +263 781 484 509\n\nInnbucks:Talent Mauchaza +263 781 484 509\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "We are making a heartfelt appeal for assistance to help Tonderai Mauchaza, a 16-year-old boy from Bocha, Mutare, who is battling a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/urgent-appeal-for-help-tonderai-mauchaza-16/\">Continue reading<span class=\"screen-reader-text\"> \"URGENT APPEAL FOR HELP – TONDERAI MAUCHAZA (16)\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        },
        {
            "title": "Why VP Chiwenga Snubbed SONA",
            "url": "https://www.zimeye.net/2025/11/02/why-vp-chiwenga-snubbed-sona/",
            "content": "By A Correspondent-Vice President Constantino Chiwengas conspicuous absence from last weeks State of the Nation Address (SONA) by President Emmerson Mnangagwa has reignited speculation about his health and political future amid renewed succession tensions in ZANU-PF.\n\nAccording toZimLive, Chiwenga missed the key national event due to a medical review in South Africa. Presidential spokesperson George Charamba confirmed the trip, saying only, The vice president had a medical review in South Africa. Chiwenga, 69, is said to have since returned to Zimbabwe.\n\nHis last public appearance was on 25 October during the 75th-anniversary celebrations of St Lukes Mission and Hospital in Lupane, following a tour of development projects in Matabeleland South. Vice President Kembo Mohadi stood in for him at the SONA.\n\nHowever, Chiwengas absence at such a crucial event has fuelled speculation of renewed friction between him and Mnangagwas inner circleparticularly as political manoeuvring intensifies ahead of ZANU-PFs 2028 succession question.\n\nSources within the ruling party suggest that powerful figures aligned with Mnangagwaincluding businessman Kudakwashe Tagwireiare working to sideline Chiwenga from both party and government structures, effectively neutralising him as a future contender.\n\nChiwenga, who played a decisive role in the November 2017 military intervention that brought Mnangagwa to power, has long been viewed as his most likely successor. Yet, his deteriorating health and growing isolation have weakened that position.\n\nOver the years, the vice presidents medical condition has been the subject of intense public concern. He has sought treatment in India, South Africa, and China for undisclosed ailments, spending months out of the country between 2019 and 2020. A court case in 2023 even revealed that he was once unconscious during a hospitalisation in South Africa before being airlifted abroad.\n\nAnalysts say these recurring health issues have become both a personal vulnerability and a political tool within the ruling party. Health in ZANU-PF politics is not just a private matterits leverage, a Harare political commentator noted. When a senior official disappears from public view, speculation immediately turns to whether theyre being pushed aside or simply too weak to fight back.\n\nTensions between Chiwenga and Mnangagwas loyalists reportedly deepened earlier this year after the vice president publicly criticised tenderpreneurs and hinted that the Vision 2030 agenda should benefit ordinary citizens rather than a select elite. The remarks were widely interpreted as a veiled attack on Mnangagwas business allies.\n\nMnangagwas second and final term under the 2013 Constitution ends in 2028, but whispers within ZANU-PF suggest efforts are underway to extend his stay or anoint a loyal successor. Chiwenga is believed to oppose such manoeuvres, insisting on constitutionalisma stance that further isolates him from the presidents faction.\n\nIn this charged environment, Chiwengas absence from the SONA may signal more than just a medical appointment. It reflects three interlinked dynamics shaping ZANU-PFs internal battlefield:\n\nWhether Chiwengas SONA snub was truly about health or strategy remains unclear. But in Zimbabwes high-stakes succession politics, even silenceand absencecan speak volumes\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Vice President Constantino Chiwenga’s conspicuous absence from last week’s State of the Nation Address (SONA) by President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/02/why-vp-chiwenga-snubbed-sona/\">Continue reading<span class=\"screen-reader-text\"> \"Why VP Chiwenga Snubbed SONA\"</span></a></p>",
            "time": "09:32",
            "date": "03 Nov 2025"
        }
    ]
}