{
    "news": [
        {
            "title": "Government to Enforce Payment of ZBC Licences",
            "url": "https://www.zimeye.net/2025/03/06/government-to-enforce-payment-of-zbc-licences/",
            "content": "By A Correspondent\n\nIn a move that has sparked significant debate, the government is set to introduce a new bill in Parliament aimed at compelling motorists to pay for Zimbabwe Broadcasting Corporation (ZBC) licenses.\n\nThis bill is expected to require all vehicle owners to settle their ZBC licenses alongside their vehicle registration, insurance, and other related payments through a unified platform.\n\nA key part of the proposal involves creating a single disc that would serve multiple purposes. According to a ZINARA official, the new initiative is designed to streamline the payment process for motorists, ensuring that they only need to acquire one disc for their vehicle. One Disc for ZBC, ZINARA, & Insurance Paymentsthats the plan, the official stated during a press briefing on Tuesday.\n\nThe proposal has sparked concerns and resistance among Zimbabwes motorists, many of whom have vowed to push back against the enforcement of the radio license payments. Many drivers argue that the current system of licensing is burdensome and unnecessary, particularly given the financial challenges many face in the current economic climate. Critics of the plan are questioning the practicality of adding another layer of payment to the already high costs of vehicle ownership.\n\nWe will not accept paying for a radio license that we dont use, one motorist, who preferred to remain anonymous, expressed during an interview. Its an additional burden on us, and the government should reconsider its stance.\n\nThis new bill is set to be a topic of intense discussion in Parliament, as lawmakers debate its potential impact on Zimbabwean motorists and the countrys media landscape. Supporters argue that the unified disc system will simplify payment procedures and potentially increase revenue for the state-run broadcaster, which has long struggled with funding and operational challenges. ZBC, a key player in the nations media industry, has been calling for increased funding to improve its services.\n\nWhile the bill aims to modernize the payment process, it raises significant concerns about its implementation. Motorists resistance could pose challenges for the government, especially in a country already grappling with high living costs and economic uncertainty.\n\nAs the bill moves closer to Parliament, both the government and citizens will likely engage in further discussions about the feasibility and fairness of this new policy. With motorists vows to resist, the government will need to carefully consider its next steps in enforcing the payment of ZBC licenses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that has sparked significant debate, the government is set to introduce a new bill … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/government-to-enforce-payment-of-zbc-licences/\">Continue reading<span class=\"screen-reader-text\"> \"Government to Enforce Payment of ZBC Licences\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Outrage Over Journalist’s Arrest: Former Harare Mayor Speaks Out",
            "url": "https://www.zimeye.net/2025/03/06/outrage-over-journalists-arrest-former-harare-mayor-speaks-out/",
            "content": "By A Correspondent\n\nMuchadeyi Masunda, former Mayor of Harare, has strongly condemned the arrest of journalist Blessed Mhlanga, calling it a blatant example of selective justice. Masunda believes Mhlanga was simply doing his job, and his arrest raises concerns about the governments commitment to press freedom .\n\nMhlanga, a journalist with Heart and Soul TV, was denied bail by a Harare magistrate after being charged with inciting violence for publishing interviews with war veteran Blessed Geza, a vocal critic of President Emmerson Mnangagwa.\n\nMasunda, an attorney and commercial arbitrator, questioned whether Geza would face similar treatment, highlighting the apparent double standard in the application of the law. Masundas comments come as concerns grow over the erosion of press freedom in Zimbabwe, with many seeing Mhlangas arrest as a clear attempt to silence critical voices .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Muchadeyi Masunda, former Mayor of Harare, has strongly condemned the arrest of journalist Blessed Mhlanga, calling it … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/outrage-over-journalists-arrest-former-harare-mayor-speaks-out/\">Continue reading<span class=\"screen-reader-text\"> \"Outrage Over Journalist’s Arrest: Former Harare Mayor Speaks Out\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Charamba Admits ED Has Buried 2030 Topic",
            "url": "https://www.zimeye.net/2025/03/06/charamba-admits-ed-has-buried-2030-topic/",
            "content": "Mnangagwa Buries 2030 Debate, Government Responds to Catholic Bishops Concerns\n\nHarare, Zimbabwe  Presidential Spokesperson George Charamba has reaffirmed that President Emmerson Mnangagwa has buried the debate over a 2030 presidential term extension, dismissing it as a dead and buried issue.\n\nThis comes after the Zimbabwe Catholic Bishops Conference (ZCBC) released a pastoral letter addressing various national concerns, including presidential term limits, taxation policies, the death penalty, and the countrys debt crisis.\n\nGovernments Response to ZCBC Statement\n\nIn response, Charamba, who also serves as the Deputy Chief Secretary for Presidential Communications, said while the Government appreciates the Churchs role in nation-building and constructive criticism, it finds some of the bishops statements unnecessary, especially regarding the presidential term extension debate.\n\nThe President, some two or so weeks ago, met with editors and made it very clear and in plain language that he has no intention whatsoever of pushing for an extension of his term beyond what is constitutionally provided for, Charamba stated.\n\nHe questioned why the bishops chose to revisit an issue the President has already shut down, emphasizing that even though some party members and citizens may express a desire for an extended term, Mnangagwa himself has rejected the notion.\n\nThe nominee for that extension has to want to have that term extended, isnt it? The President has made it clear that he has no intention of accepting that proposal, Charamba added.\n\nTaxation Reforms Already Underway\n\nBeyond the presidential term extension, Charamba also responded to the bishops concerns about heavy taxation, stating that the Government is already addressing the issue.\n\nThe burden of taxation is receiving attention from the Government. If the Presidents statement at the commencement of the 2025 Cabinet Year did not bring comfort to the bishops, one wonders what would, he said.\n\nHe urged patience, stressing that tax reforms take time due to their impact on national revenue and essential public services.\n\nWe are talking about key basic services which cannot be dispensed with and which have to be funded from the revenues that come from the tax structure, Charamba explained.\n\nHe encouraged the Church to convey a message of hope to citizens rather than focusing on issues already under Government review.\n\nA Call for Collaboration\n\nCharamba acknowledged that institutional reforms are necessary across all sectors but urged the Church to support the ongoing efforts rather than raising concerns about matters already being handled.\n\nSo really, our message to the bishops is to please bear with us, bear with Government as it reforms the tax structure with the ultimate objective of lightening the burden on the citizenry, he concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mnangagwa Buries 2030 Debate, Government Responds to Catholic Bishops’ Concerns Harare, Zimbabwe – Presidential Spokesperson George Charamba has reaffirmed that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/charamba-admits-ed-has-buried-2030-topic/\">Continue reading<span class=\"screen-reader-text\"> \"Charamba Admits ED Has Buried 2030 Topic\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Businessman Arrested Over Petrol Bombing",
            "url": "https://www.zimeye.net/2025/03/06/businessman-arrested-over-petrol-bombing/",
            "content": "Mutare, Zimbabwe  A businessman from Mutare, Edward Muhamba, has been arrested and charged with three counts of attempted murder after allegedly petrol bombing a house in Greenside while three individuals, including two minors, were asleep.\n\nMuhamba, who also faces a malicious damage to property charge for allegedly ramming a haulage truck into the propertys precast wall and gate, appeared in court represented by Mr Chris Ndlovu of Gonese and Ndlovu Legal Practitioners.\n\nPresiding magistrate Mrs Phathekile Msipa denied him bail, citing concerns that he may flee to neighboring countries. He has been remanded in custody until March 20.\n\nBusiness Dispute Turns Violent\n\nAccording to Prosecutor Ms Perseverance Musukuto, the attack stemmed from a business dispute between Muhambas alleged accomplice, Salmon Muzonzini, and the victim, Doreen Muchena.\n\nThe court heard that Muzonzini had provided Muchena with capital for a business venture in December 2024, but when Muchena failed to account for the money, Muzonzini allegedly threatened her life if she did not return the funds.\n\nOn February 20, at around 8:30 PM, Muhamba, along with Muzonzini and two unidentified accomplices, allegedly launched an attack on Muchenas residence.\n\nDetails of the AttackThe suspects used an unregistered yellow Scania truck and a silver Land Cruiser to crash through the gate and wall of the residence.They then broke a window and threw a petrol bomb inside, causing a massive fire.At the time, two children (ages 12 and 8) and a 20-year-old maid, Brenda Mutsonziwa, were trapped inside.A neighbor managed to rescue them by breaking a burglar bar on a lounge window.\n\nThe fire engulfed the house, causing the roof to collapse and destroying all household possessions. The damage is estimated at US$350,000.\n\nEyewitness Identifies Suspects\n\nA witness, Sylvester Marangwanda, who was returning from Macs Shopping Centre, identified the suspects as they fled the scene in the silver Land Cruiser.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare, Zimbabwe – A businessman from Mutare, Edward Muhamba, has been arrested and charged with three counts of attempted murder … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/06/businessman-arrested-over-petrol-bombing/\">Continue reading<span class=\"screen-reader-text\"> \"Businessman Arrested Over Petrol Bombing\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Mnangagwa Tightens Grip: Activists, Journalists Under Heavy Surveillance",
            "url": "https://www.zimeye.net/2025/03/05/mnangagwa-tightens-grip-activists-journalists-under-heavy-surveillance/",
            "content": "By A Correspondent| The Zimbabwean government has ramped up surveillance on opposition figures, activists, and journalists as the battle for the 2030 presidency intensifies. State security agents are reportedly tracking and intimidating dissenting voices, signaling a brutal crackdown ahead.\n\nProminent opposition leaders such as Job Sikhala, Gift Ostallos Siziba, and ex-ZCTU boss Peter Mutasa are under relentless attack from ruling party propagandists. Their crime? Rejecting a constitutional amendment that could pave the way for Mnangagwas third term bid.\n\nMeanwhile, investigative journalist Blessed Mhlanga has been languishing in detention for nine daysa clear warning shot to media professionals daring to expose the regimes excesses.\n\nMinister of Information Jefferson Muswere has doubled down on threats against activists, accusing them of plotting to destabilize the country. However, human rights defenders argue that this is nothing but a desperate attempt to crush dissent and silence the opposition.\n\nAs tension mounts and Zimbabwe inches closer to a full-blown political crisis, all eyes are on the international community. Will they act before its too late?\n\nStay tuned as ZimEye continues to expose the regimes crackdown on democracy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Zimbabwean government has ramped up surveillance on opposition figures, activists, and journalists as the battle for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/05/mnangagwa-tightens-grip-activists-journalists-under-heavy-surveillance/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Tightens Grip: Activists, Journalists Under Heavy Surveillance\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Makandiwa Dives Into Zanu PF Factional Politics",
            "url": "https://www.zimeye.net/2025/03/05/makandiwa-dives-into-zanu-pf-factional-politics/",
            "content": "Religious Reporter-Leader of United Families International Church (UFIC) and Self-styled prophet Emmanuel Makandiwa has dived into Zanu PF factional politics and called on President Emmerson Mnangagwa to pardon G-40 Kingpins ousted by the November 2017 coup.\n\nNotable G40 figures who fled the country include former cabinet ministers Saviour Kasukuwere, Walter Mzembi, Jonathan Moyo, Patrick Zhuwao, and Mandiitawepi Chimene.\n\nManyof themremain in self-imposed exile, fearing persecution fromMnangagwasgovernment.\n\nThe November 2017 coup, orchestrated by the military under the leadership of then-Vice President Mnangagwa and General Constantino Chiwenga, endedMugabes37-year rule.\n\nThe coup, officially dubbedOperation Restore Legacy,was framed as a move to remove so-called criminals around Mugabe, a reference to the G40 faction, whichwas alignedwith the former First Lady, Grace Mugabe, and sought to prevent Mnangagwa from succeeding Mugabe.\n\nAs tanks rolled into Harare, Mugabewas placedunder house arrest, and key G40 figures either went into hiding or fled the country.\n\nSince then, the Mnangagwa administration has pursued G40 members, accusing them of corruption and political subversion.\n\nThose who stayed, such as Ignatius Chombo, have faced arrest, while those in exile, including Moyo and Kasukuwere, have been vocal critics ofMnangagwasgovernment.\n\nDuring a recent sermon at his Chitungwiza basilica, Makandiwa said the remaining G40 members should be allowed to return, arguing that they no longer hold power and pose no threat.He was quoted byNewZimbabwe.comas saying:\n\nIhave so much respect for Walter Mzembi.It is unfortunate thatthey are in a foreign land as we speak. You look at Walter Mzembihe is harmless. He is pure.\n\nIf they can allow them back into their country, it will be a blessing for your nation. There is nothing wrong with that. No one is powerful besides the power that you give them.\n\nMzembi was a regular attendee ofMakandiwaschurch before his exile, raising speculation thatMakandiwasappeal may be an attempt to assist a prominent former church member.\n\nMakandiwa also claimed that he had forewarned Mugabe of his impending removal andMnangagwasrise to power.\n\nAdditionally, he urged Zimbabweans who have emigrated due to economic hardship to return home, stating:\n\nZimbabwe is full of blessings. Bring your children who are in the diaspora. They are blessings that have left.\n\nMakandiwa is one ofZimbabwesmost influential church leaders and has long-standing ties to ZANU PF.\n\nHis proximity to power has benefited him economically, as he has received state backing for various business ventures.\n\nIn 2023, he invited President Mnangagwa to his church and publicly endorsed him, praising his infrastructure development efforts.\n\nHis latest comments have sparked debate, with critics arguing that his intervention could be part of a broader effort to rehabilitate the image of exiled G40 figures or further align himself with the ruling elite.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Religious Reporter-Leader of United Families International Church (UFIC) and Self-styled prophet Emmanuel Makandiwa has dived into Zanu PF factional politics … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/05/makandiwa-dives-into-zanu-pf-factional-politics/\">Continue reading<span class=\"screen-reader-text\"> \"Makandiwa Dives Into Zanu PF Factional Politics\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Warriors, Super Eagles Set for Epic Clash",
            "url": "https://www.zimeye.net/2025/03/05/warriors-super-eagles-set-for-epic-clash/",
            "content": "Sports Correspondent\n\nThe stage is set for a thrilling encounter between Zimbabwes Warriors and Nigerias Super Eagles in the 2026 FIFA World Cup Qualifiers Group C. The Nigerian Football Association has confirmed that the match will take place on March 25th at the Godswill Akpabio International Stadium in Uyo.\n\nThe Warriors will head into the match just five days after facing Benin in South Africa, adding an extra layer of challenge to their preparations. Meanwhile, the Super Eagles will be under the guidance of new coach ric Chelle, who took the reins in January.\n\nWith the venue and date now confirmed, fans can start counting down to what promises to be an electrifying clash between two African football powerhouses. Kick-off times and TV details will be announced in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The stage is set for a thrilling encounter between Zimbabwe’s Warriors and Nigeria’s Super Eagles in the 2026 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/05/warriors-super-eagles-set-for-epic-clash/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors, Super Eagles Set for Epic Clash\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Diaz Steals Show as Real Madrid Edge Atlético in Thrilling Madrid Derby",
            "url": "https://www.zimeye.net/2025/03/05/diaz-steals-show-as-real-madrid-edge-atletico-in-thrilling-madrid-derby/",
            "content": "Sports Correspondent\n\nIn a highly anticipated Champions League last-16 tie, Real Madrid secured a hard-fought 2-1 victory over their arch-rivals Atltico Madrid at the Santiago Bernabu. The win gives the hosts a slender advantage ahead of the second leg.\n\nThe match got off to a blistering start, with Rodrygo opening the scoring for Real Madrid. However, Atltico equalized, setting the stage for a thrilling second half.\n\nIt was Brahim Diaz who stole the show, netting a stunning winner that proved to be the decisive goal.\n\nHis strike sent the Bernabu into raptures and gave Real Madrid a crucial lead heading into the second leg.\n\nThe victory marks a significant boost for Real Madrids Champions League ambitions, but Atltico will be eager to overturn the deficit in the return leg.\n\nWith the Madrid derby always delivering high-stakes drama, the second leg promises to be an unmissable encounter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a highly anticipated Champions League last-16 tie, Real Madrid secured a hard-fought 2-1 victory over their arch-rivals … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/05/diaz-steals-show-as-real-madrid-edge-atletico-in-thrilling-madrid-derby/\">Continue reading<span class=\"screen-reader-text\"> \"Diaz Steals Show as Real Madrid Edge Atlético in Thrilling Madrid Derby\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Fire Extinguisher Storage Tips",
            "url": "https://www.zimeye.net/2025/03/05/fire-extinguisher-storage-tips/",
            "content": "Fire extinguishers are an important safety tool to have in your vehicle, but proper storage and maintenance are crucial to ensuring their effectiveness in an emergency. Here are some key tips to keep your fire extinguisher in top condition and ready for use.\n\nFirst and foremost, never expose your fire extinguisher to direct sunlight.\n\nProlonged exposure to the suns rays can lead to dangerous conditions, potentially causing the extinguisher to explode, which could result in harm or damage to your vehicle.\n\nAlways store it in a cool, dry place to ensure safety.\n\nIt is equally important to store your fire extinguisher in an accessible spot inside your vehicle. Avoid keeping it in the boot, as this could prevent you from accessing it quickly in the event of a fire. During a car fire, the vehicles electronic components may fail, causing the boot to become locked. This would make it difficult or impossible to reach your extinguisher. Instead, store it under your car seat or in the glove compartment where it can be quickly retrieved.\n\nIn addition to proper storage, regular checks are vital. Always verify the expiration date on your fire extinguisher. If the extinguisher is past its expiration date and is refillable, take it to a recognized agent to have it refilled, often at a lower cost than the original purchase price.\n\nRemember, keeping a fire extinguisher in your vehicle is an essential safety measure that can save lives in an emergency. By following these simple tips, you can ensure that your fire extinguisher remains effective when you need it most.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Fire extinguishers are an important safety tool to have in your vehicle, but proper storage and maintenance are crucial to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/05/fire-extinguisher-storage-tips/\">Continue reading<span class=\"screen-reader-text\"> \"Fire Extinguisher Storage Tips\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Chaos in MDC as Mudzuri Pushes for Mwonzora’s Removal",
            "url": "https://www.zimeye.net/2025/03/05/chaos-in-mdc-as-mudzuri-pushes-for-mwonzoras-removal/",
            "content": "By A Correspondent\n\nThe opposition MDC party is embroiled in internal strife as a faction led by former vice president Elias Mudzuri pushes for the removal of the partys current president, Douglas Togarasei Mwonzora.\n\nThis dramatic escalation follows a ruling last week by High Court Judge Justice Happias Zhou, which declared the MDCs 2022 congress, where Mwonzora was elected, as null and void.\n\nThe court has ordered the party to hold a fresh congress within the next six months.\n\nSources within the MDC have indicated that tensions are reaching a boiling point, with calls for Mwonzoras ousting intensifying.\n\nMudhara Mudzuri is now positioning himself to take firm control of things. Mwonzora is finished. He betrayed the peoples struggle, an insider revealed.\n\nThe court ruling has dealt a significant blow to Mwonzoras leadership, throwing the party into a state of uncertainty.\n\nWith the order for a fresh congress, the power struggle within the MDC is now front and center, as factions vie for control over the future direction of the party.\n\nMudzuri, who was once seen as a key figure in the MDCs leadership, has now become a central challenger to Mwonzoras position. The ongoing internal divisions are seen as part of a broader power struggle within the opposition party, which has been plagued by leadership disputes in recent years.\n\nSupporters of Mudzuri believe that his leadership is the key to revitalizing the party, while those loyal to Mwonzora view the challenges as part of a destabilizing plot.\n\nMudzuri is seen as the person who can bring order back to the party, unlike Mwonzora who has been accused of losing the peoples trust, another source close to the situation noted.\n\nWith the clock ticking on the six-month deadline for a new congress, the MDC is facing a pivotal moment in its history. How the party navigates this leadership crisis will have profound implications for its future, both in terms of internal unity and its ability to challenge the ruling party. As the power struggle continues, all eyes will be on the MDCs next move as it seeks to chart a new course in Zimbabwes political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The opposition MDC party is embroiled in internal strife as a faction led by former vice president … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/05/chaos-in-mdc-as-mudzuri-pushes-for-mwonzoras-removal/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos in MDC as Mudzuri Pushes for Mwonzora’s Removal\"</span></a></p>",
            "time": "18:09",
            "date": "06 Mar 2025"
        }
    ]
}