{
    "news": [
        {
            "title": "Warriors Face Desert Foxes In Epic Friendly Tie",
            "url": "https://www.zimeye.net/2025/11/13/warriors-face-desert-foxes-in-epic-friendly-tie/",
            "content": "Sports Correspondent  Zimbabwe will face Algeria this evening in an international friendly match in Saudi Arabia. The encounter will take place at the Prince Abdullah Al-Faisal Sports City Stadium in Jeddah, with kick-off scheduled for 6:30 PM CAT.\n\nWarriors head coach Marian Marinica has made a few adjustments to his squad following a series of injuries in camp. Captain Knowledge Musona has been ruled out after sustaining a hamstring injury and will miss both fixtures. Tymon Machope of Scotland FC is also unavailable after picking up a calf injury. The duo has been replaced by defender Isheanesu Mauchi and midfielder Tivonge Rushesha.\n\nOn the Algerian side, goalkeeper Luca Zidane will miss the match after suffering a groin injury with his Spanish club Granada CF. He has been replaced by Zakaria Bouhalfaia of Al-Falastin SC. Defender Ramy Bensebaini (Borussia Dortmund) and Mohamed Amine Touga are also unavailable due to injury.\n\nMarian Marinica (Zimbabwe): Im very pleased with the players response, the staffs commitment, and the support weve received from officials who are doing their best to assist us in every way possible.\n\nVladimir Petkovi (Algeria): Winning these matches also improves our position in the FIFA rankings I have very clear ideas, and the call-ups reflect a vision for the future. Football moves fast, and you have to adapt.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Zimbabwe will face Algeria this evening in an international friendly match in Saudi Arabia. The encounter will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/warriors-face-desert-foxes-in-epic-friendly-tie/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Face Desert Foxes In Epic Friendly Tie\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "Zimbabwe’s Livestock Sector in Peril as Government Fails to Provide Dip Tank Chemicals and Vaccines",
            "url": "https://www.zimeye.net/2025/11/13/zimbabwes-livestock-sector-in-peril-as-government-fails-to-provide-dip-tank-chemicals-and-vaccines/",
            "content": "By Prosper Tiringindi\n\nMASVINGO  The livestock sector in Zimbabwe is facing a growing crisis as rural farmers continue to lose cattle due to the governments persistent failure to supply dip tank chemicals and vaccines. This neglect has left many communities grappling with preventable livestock diseases, threatening both food security and rural livelihoods.\n\nDuring a discussion held today between myself and Cde Anoziva Muguti, we reflected on the worsening state of farming in the country after Muguti received a troubling phone call from his rural home. His family had reported that one of their cows could no longer walkan incident that vividly exposed the dire situation facing livestock farmers across Zimbabwe.\n\nWe are still relying on the same dip tanks built during Ian Smiths era, said Muguti. There have been no upgrades, no regular maintenance, and no chemicals provided. Its heartbreaking to see farmers watching their cattle die while authorities remain silent.\n\nDipping is essential in controlling tick-borne diseases such as the deadly January disease, which has wiped out thousands of cattle across the nation in recent years. Yet, most rural dip tanks are now either dry or operational only occasionally due to shortages of chemicals.\n\nThe government keeps promising support for farmers, but the reality on the ground tells a different story, I noted during our discussion. Livestock farmers, particularly in rural districts like Masvingo, Bikita, and Chivi, have been left to fend for themselves as dip tanks collapse and veterinary services disappear.\n\nThe shortage of critical vaccines for diseases such as anthrax and foot-and-mouth has made matters worse. Many farmers have lost entire herds, pushing families deeper into poverty.\n\nMuguti lamented the lack of government commitment to addressing the crisis: You cant talk about agricultural revival when there are no vaccines or dipping chemicals. Rural farmers form the backbone of our food system, yet they are being neglected.\n\nBeyond the shortages, there are growing concerns about mismanagement and corruption within the agricultural support system. Resources meant for farmers often fail to reach communities, raising questions about accountability and transparency in government programs.\n\nBoth Muguti and I agreed that urgent action is needed from the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development to restore the livestock sector. This includes restocking dip tanks, ensuring regular supply of veterinary chemicals, and reviving vaccination drives in rural areas.\n\nIf the government does not act now, Muguti warned, we risk losing our national herd and condemning thousands of families to hunger and poverty.\n\nWithout swift intervention, Zimbabwes rural farming communities may soon face a full-blown agricultural disaster  one that could take years to recover from.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Prosper Tiringindi MASVINGO – The livestock sector in Zimbabwe is facing a growing crisis as rural farmers continue to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/zimbabwes-livestock-sector-in-peril-as-government-fails-to-provide-dip-tank-chemicals-and-vaccines/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe’s Livestock Sector in Peril as Government Fails to Provide Dip Tank Chemicals and Vaccines\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "Picture: Badly Damaged Road Leading to Speaker of Parliament Jacob Mudenda’s Home…",
            "url": "https://www.zimeye.net/2025/11/13/picture-badly-damaged-road-leading-to-speaker-of-parliament-jacob-mudendas-home/",
            "content": "Tinashe Sambiri  Transform Zimbabwe leader Jacob Ngarivhume has drawn attention to the poor state of Cross Dete Road leading to the home of Speaker of Parliament Jacob Mudenda.\n\nPosting on Facebook on Wednesday, November 13, 2025, Ngarivhume wrote: This is Cross Dete Road to Bingathe road leading to the home of the Speaker of Parliament, Jacob Mudenda!\n\nGood night.\n\nThe post highlights growing concerns over the neglected infrastructure in the area, raising questions about government priorities and accountability in maintaining public roads.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Transform Zimbabwe leader Jacob Ngarivhume has drawn attention to the poor state of Cross Dete Road leading … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/picture-badly-damaged-road-leading-to-speaker-of-parliament-jacob-mudendas-home/\">Continue reading<span class=\"screen-reader-text\"> \"Picture: Badly Damaged Road Leading to Speaker of Parliament Jacob Mudenda’s Home…\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "BREAKING: Gen Valerio Sibanda Confirms Fatal Accident That’s Killed Own Driver",
            "url": "https://www.zimeye.net/2025/11/13/breaking-gen-valerio-sibanda-confirms-fatal-accident-thats-killed-own-driver/",
            "content": " General Valerio Sibanda himself confirmed the development to ZimEye in a text message\n\nBy Investigations Correspondent | ZimEye | Multiple sources inside the Zimbabwe military have repeated to the ZimEye news network that the ZDF (Zimbabwe Defence Forces) Commander Phillip Valerio Sibandas driver has been involved in a car accident along the Bulawayo-Harare Road.\n\nThe General was not in the car at the time.\n\nTop military sources insist to ZimEye saying Gen Sibandas driver, only identified as Sgt Chiutsi has died.\n\nGeneral Valerio Sibanda himself confirmed the development to ZimEye in an sms, saying Akawonekwa thanks. Gd day.\n\nHe overturned, he overturned,  a top source told ZimEye without elaborating the details.\n\nSGT Chiutsi\n\nAn official public statement from the ZDF was not forthcoming at the time of writing.\n\nMore details to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "… General Valerio Sibanda himself confirmed the development to ZimEye in a text message… By Investigations Correspondent | ZimEye | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/breaking-gen-valerio-sibanda-confirms-fatal-accident-thats-killed-own-driver/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Gen Valerio Sibanda Confirms Fatal Accident That’s Killed Own Driver\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "Opposition Activist Shakespeare Mukoyi Evicts Mwonzora From Harvest House?",
            "url": "https://www.zimeye.net/2025/11/13/opposition-activist-shakespeare-mukoyi-evicts-mwonzora-from-harvest-house/",
            "content": "Tinashe Sambiri  Opposition activist Shakespeare Mukoyi has claimed responsibility for reclaiming control of Harvest House, the historic headquarters of Zimbabwes opposition parties.\n\nSpeaking on Wednesday, Mukoyis close associate said, We have finally taken back Harvest House. It belongs to the people of the opposition, and no one should use force to claim it.\n\nHarvest House has long served as the base for the MDC, MDC-T, MDC Alliance, and currently the Citizens Coalition for Change (CCC). It was previously taken over by Douglas Mwonzora, reportedly with the support of heavily armed security personnel during factional disputes linked to former CCC leader Nelson Chamisa.\n\nA source within Harvest House told reporters, Douglas Mwonzora has effectively lost control of the building. Mukoyi and his team are now in charge.\n\nMwonzora has not publicly responded to Mukoyis claims, leaving the matter unresolved and raising questions about the future management of the iconic opposition landmark.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Opposition activist Shakespeare Mukoyi has claimed responsibility for reclaiming control of Harvest House, the historic headquarters of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/opposition-activist-shakespeare-mukoyi-evicts-mwonzora-from-harvest-house/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition Activist Shakespeare Mukoyi Evicts Mwonzora From Harvest House?\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "The Matrix Paradox: Is Tafadzwa Chidawa Replacing the Police?",
            "url": "https://www.zimeye.net/2025/11/13/the-matrix-paradox-is-tafadzwa-chidawa-replacing-the-police/",
            "content": "By Shelton Muchena | Analysis |  In the corridors of power, a troubling question echoes: Is Tafadzwa Chidawa, the head of Matrix Holdings, effectively stepping into the shoes of the Zimbabwe Republic Police? As Matrix takes on investigative and enforcement roles, the public is left to ponder: Is the police force failing in its duties, leaving Chidawa to fill the gap?\n\nMatrix Holdings, once a modest private security and consultancy firm, has grown into a sprawling empire over the past decade, touching sectors from technology to logistics. But it is Chidawas recent forays into law enforcement that have drawn the most scrutiny. Allegations abound that Matrix personnel have been involved in investigations traditionally reserved for state authorities, raising serious concerns about accountability, legality, and oversight.\n\nThe controversy gained momentum after the disappearance of a prominent Harare businessman, reportedly involved in a multi-million-dollar real estate dispute. Witnesses claim that Matrix personnel were the first on the scene, conducting interviews, interrogations, and even overseeing detentions roles legally reserved for the Zimbabwe Republic Police. One insider at the scene, who requested anonymity, said, Matrix arrived with efficiency that the police never demonstrated. But their methods were opaque. We didnt know who they were accountable to, or under what authority they were operating.\n\nThe businessman was later released without charge, but the incident fueled public speculation: Had Matrix overstepped its mandate? Was this a service to the state or an assertion of corporate power unchecked by law?\n\nMultiple whistleblowers have emerged, reporting intimidation and pressure to stay silent. Some describe a culture of surveillance within Matrix, with encrypted communications and algorithms monitoring employees, clients, and even critics. Its like working for a shadow government, one former employee said. Youre constantly aware that someone is watching, recording, and evaluating your every move. Speak out, and you disappear from the system.\n\nThough these accounts remain difficult to independently verify, their consistency has drawn the attention of local human rights organisations, which warn that private companies should never operate as quasi-police entities.\n\nProfessor Tendai Moyo, political analyst at the University of Zimbabwe, explains, When private entities encroach on public law enforcement, the rule of law is compromised. It creates a parallel system where accountability is opaque, and citizens have little recourse. This can destabilise governance and erode trust in institutions.\n\nLawyer Chipo Mlambo adds, Even if Matrix claims to act in the interest of public safety, the absence of legal oversight is dangerous. The state cannot abdicate its responsibility, nor can private companies assume it without clear legal frameworks.\n\nIn the wake of multiple alleged interventions by Matrix, Zimbabwean social media has become a forum for heated debate. Citizens question whether the police are competent, or whether private interests have begun dictating public safety. Viral hashtags and online campaigns have pressured authorities for clarity, yet official responses remain sparse. The people are confused, says Nyasha Moyo, a civil rights activist. They see Matrix acting, and the police standing by. It gives the impression that private power has eclipsed public duty.\n\nThis investigation raises urgent questions: Who holds Matrix accountable? What legal mechanisms exist to prevent corporate overreach? How can citizens be protected when private companies operate in quasi-policing roles?\n\nAs Tafadzwa Chidawas influence continues to grow, the world watches closely. For journalists, civil society, and government officials, confronting the truth about Matrix Holdings is no longer optional it is essential. Transparency, oversight, and accountability are the only safeguards against the rise of private authority in a realm meant to be public. Every citizen deserves to know who is enforcing the law, and under what authority, concludes Professor Moyo. Until that question is answered, the paradox remains.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena | Analysis | In the corridors of power, a troubling question echoes: Is Tafadzwa Chidawa, the head … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/the-matrix-paradox-is-tafadzwa-chidawa-replacing-the-police/\">Continue reading<span class=\"screen-reader-text\"> \"The Matrix Paradox: Is Tafadzwa Chidawa Replacing the Police?\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "Robert Mugabe Convicted Of Possession Of Unlawful Drugs",
            "url": "https://www.zimeye.net/2025/11/13/robert-mugabe-convicted-of-possession-of-unlawful-drugs/",
            "content": "Tinashe Sambiri  Robert Tinotenda Mugabe Jr., the 33-year-old son of the late former President Robert Mugabe, has been found guilty of possessing illegal drugs.\n\nMugabe appeared before Harare Magistrate Lisa Mutendereki on Thursday, where he entered a guilty plea. During his mitigation, he appealed for a lenient sentence, noting that he is a single father of two and a first-time offender. He told the court: I am a farmer, raising two children on my own, earning US$7,000 a month, and I accepted responsibility for my actions.\n\nThe case stems from an October incident when police stopped Mugabe during a traffic operation in Harare. Officers allegedly discovered two sachets of dagga, a pack of Rizla rolling papers, and a white dagga crusher in his sling bag. He was initially held in custody for two nights before being released on US$300 bail by Magistrate Mutendereki.\n\nCourt documents indicate that Mugabe was apprehended while driving a silver Honda Fit (registration AGY 5850) the wrong way on 2nd Street Extension. Prosecutor Mandirasa Chigumira confirmed that the two grams of dagga, valued at approximately US$30, will be used as evidence.\n\nMugabe, represented by lawyer Ashiel Mugiya, is expected to be sentenced later today.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Robert Tinotenda Mugabe Jr., the 33-year-old son of the late former President Robert Mugabe, has been found … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/robert-mugabe-convicted-of-possession-of-unlawful-drugs/\">Continue reading<span class=\"screen-reader-text\"> \"Robert Mugabe Convicted Of Possession Of Unlawful Drugs\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "Chiwenga Pushes For Reforms Amid Persistent Corruption in Government Contracts",
            "url": "https://www.zimeye.net/2025/11/13/chiwenga-pushes-for-reforms-amid-persistent-corruption-in-government-contracts/",
            "content": "Tinashe Sambiri  Vice President Constantino Chiwenga has once again called for transparency and efficiency in Zimbabwes public procurement system, yet critics say the countrys record suggests otherwise.\n\nAddressing delegates at the Fifth General Assembly of the African Public Procurement Network (APPN) in Victoria Falls on Wednesday, VP Chiwenga insisted that political will was the key to reforming procurement, but many observers remain skeptical.\n\nIt is through the unwavering commitment from our Governments that public procurement is utilised as a vital instrument for economic development, transparency and accountability, Chiwenga said. Yet Zimbabwe has long been plagued by allegations of corruption, inefficiency, and mismanagement in public tenders, raising doubts over whether mere political statements will translate into real change.\n\nChiwenga highlighted that public procurement accounts for around 17 percent of Zimbabwes GDP and called the establishment of the Procurement Regulatory Authority of Zimbabwe (PRAZ) a sign of government commitment. This agency does not just regulate, it actively promotes professionalism within the sector, he said. However, critics argue that PRAZ has so far done little to curb favoritism, opaque tender processes, and widespread patronage.\n\nThe two-day conference, themed Transforming Public Procurement in Africa Through Innovation, Inclusion, Sustainability and Regional Collaboration, drew delegates from across the continent. Chiwenga stressed the need for professionalisation, claiming, We must ensure that procurement professionals are equipped with the knowledge, skills and ethical standards necessary to navigate the complexities of modern procurement. Yet Zimbabwes procurement scandals continue to cast doubt on whether these standards are actually enforced.\n\nVP Chiwenga also called for the use of technology in procurement processes. In todays rapidly evolving landscape, integrating digital technologies, e-procurement systems and sophisticated data analytics is no longer optional, it is absolutely essential, he said. Yet even with e-procurement systems in place, reports of inefficiency and manipulation persist, leaving the public unconvinced.\n\nThe Vice President urged delegates to align procurement strategies with Africas Agenda 2063 and the African Continental Free Trade Area (AfCFTA), claiming, This strategic process will not only benefit our national economies but will promote regional collaboration and mutual growth. Critics argue that Zimbabwes procurement practices are still heavily protectionist and exclusionary, undermining such lofty goals.\n\nChiwenga acknowledged existing problems, noting that public procurement still faced significant challenges, notably corruption, inefficiency, lack of transparency and insufficient institutional capacity. He added, These issues often hinder the effective allocation of resources and tragically undermine public trust. Many say these words have yet to result in meaningful action, with public funds continuing to disappear through poorly monitored contracts and tenders.\n\nTo address these challenges, Chiwenga recommended stronger regulations, professional training, and digital tools. Furthermore, fostering robust collaboration among governments, civil society and the private sector will forge a more inclusive procurement environment, ensuring the benefits of public spending reach all segments of society, he said. Yet critics contend that such collaboration is mostly rhetorical, with little real oversight or accountability.\n\nVP Chiwenga also took the opportunity to praise Zimbabwes role in the APPN, claiming the country had laid the groundwork for a skilled workforce committed to maintaining the integrity and efficiency of procurement systems across the continent. Observers, however, point out that Zimbabwes domestic procurement record falls far short of this claim, with widespread reports of mismanagement and corruption continuing unabated.\n\nThe APPN General Assembly concluded with elections for the next president and executive committee, leaving many to question whether the conference will lead to genuine reform or merely serve as a platform for speeches that fail to match Zimbabwes persistent procurement failures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Vice President Constantino Chiwenga has once again called for “transparency” and “efficiency” in Zimbabwe’s public procurement system, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/chiwenga-pushes-for-reforms-amid-persistent-corruption-in-government-contracts/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Pushes For Reforms Amid Persistent Corruption in Government Contracts\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "Mudenda Challenges Transport Ministry To Increase Tollgates Despite Worsening Economic Turmoil",
            "url": "https://www.zimeye.net/2025/11/13/mudenda-challenges-transport-ministry-to-increase-tollgates-despite-worsening-economic-turmoil/",
            "content": "Tinashe Sambiri  National Assembly Speaker Jacob Mudenda has urged the Transport and Infrastructural Development Ministry to add more tollgates in Matabeleland North, arguing the move would help the government raise revenue despite concerns that it could further burden citizens struggling amid the countrys economic crisis.\n\nSpeaking at a pre-budget seminar in Bulawayo last week, Mudenda praised Transport Minister Felix Mhona, calling him a humble man who listens and consults and saying his ministry was doing a splendid job.\n\nThrough funds from the Zimbabwe National Road Administration, while we sort out National Railways of Zimbabwe, can you immediately make sure that we have got weighbridges, especially at strategic tollgates, either on exit or entry, or somewhere in the middle. You do not have to put them everywhere, Mudenda said.\n\nHe also proposed specific increases in tollgates along key routes. Relatedly, the road to Hwange has three tollgates. Can you increase them to five, and then Cross Dete to Binga, can you have two tollgates there. Its a shorter route. I am being mathematical. From Cross Dete to Binga it is 120km, so it means you have two tollgates between Cross Dete off Victoria Falls to Binga Centre. That will help us to do the fundraising accordingly, he said.\n\nMudenda further suggested raising toll fees for trucks to bolster revenue collection, emphasizing the need for targeted measures to increase funding for road infrastructure projects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – National Assembly Speaker Jacob Mudenda has urged the Transport and Infrastructural Development Ministry to add more tollgates … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/mudenda-challenges-transport-ministry-to-increase-tollgates-despite-worsening-economic-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"Mudenda Challenges Transport Ministry To Increase Tollgates Despite Worsening Economic Turmoil\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        },
        {
            "title": "ZDF Commander Gen Sibanda’s Driver Involved In Fatal Accident | BREAKING",
            "url": "https://www.zimeye.net/2025/11/13/zdf-commander-gen-sibandas-driver-involved-in-fatal-accident-breaking/",
            "content": "By Investigations Correspondent | ZimEye | Multiple sources inside the Zimbabwe military have repeated to the ZimEye news network that the ZDF (Zimbabwe Defence Forces) Commander Phillip Valerio Sibandas driver has been involved in a car accident along the Bulawayo-Harare Road.\n\nThe General was not in the car at the time.\n\nTop military sources insist to ZimEye saying Gen Sibandas driver, only identified as Sgt Chiutsi has died.\n\nThe development was confirmed by other sources which can not be named.\n\nHe overturned, he overturned,  a top source told ZimEye without elaborating the details.\n\nSGT Chiutsi\n\nAn official public statement from the ZDF was not forthcoming at the time of writing.\n\nMore details to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "… General Valerio Sibanda himself confirmed the development to ZimEye in a text message…     By Investigations Correspondent | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/13/zdf-commander-gen-sibandas-driver-involved-in-fatal-accident-breaking/\">Continue reading<span class=\"screen-reader-text\"> \"ZDF Commander Gen Sibanda’s Driver Involved In Fatal Accident | BREAKING\"</span></a></p>",
            "time": "20:42",
            "date": "13 Nov 2025"
        }
    ]
}