{
    "news": [
        {
            "title": "Zimpapers Driver Killed in Hit-and-Run Crash Involving Stolen Vehicle",
            "url": "https://www.zimeye.net/2025/08/05/zimpapers-driver-killed-in-hit-and-run-crash-involving-stolen-vehicle/",
            "content": "By A Correspondent A Zimpapers driver, Silas Bhunu, has died in a tragic road accident after being struck by a stolen vehicle early Sunday morning while reporting for duty in Bulawayo.\n\nBhunu, aged 44, was riding a motorcycle when he was hit by a white Toyota GD6 double cab.\n\nHe died on the spot.\n\nThe vehicle that hit him had reportedly been stolen from a spray-painting workshop where it was undergoing repairs for damage sustained in a previous accident.\n\nThe vehicle was carrying nine passengers at the time of the crash. Following the collision, five of the passengers  including the driver, Melusi Nkomo (20), and his accomplice, Shelton Dube (19)  fled the scene.\n\nFour other passengers, all underage girls, remained at the crash site and assisted police with investigations.\n\nTheir cooperation enabled officers from the Bulawayo Traffic West Police Station to quickly launch a manhunt, leading to the arrest of Nkomo, Dube, and another male passenger.\n\nTwo suspects are still at large.\n\nPolice managed to arrest three of the suspects who fled the scene hours after the accident. A manhunt for the remaining two is ongoing. The suspects in custody will appear in court tomorrow (today), said Bulawayo police spokesperson, Inspector Nomalanga Msebele.\n\nThe late Bhunu is survived by his wife and three children.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A Zimpapers driver, Silas Bhunu, has died in a tragic road accident after being struck by a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/zimpapers-driver-killed-in-hit-and-run-crash-involving-stolen-vehicle/\">Continue reading<span class=\"screen-reader-text\"> \"Zimpapers Driver Killed in Hit-and-Run Crash Involving Stolen Vehicle\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Thomas Partey Granted Bail After Sexual Offence Charges in UK",
            "url": "https://www.zimeye.net/2025/08/05/thomas-partey-granted-bail-after-sexual-offence-charges-in-uk/",
            "content": "By Sports Correspondent\n\nGhanaian international footballer Thomas Partey has been granted conditional bail after appearing in a UK court on Tuesday to face multiple sexual offence charges.\n\nThe 32-year-old midfielder has been charged with five counts of rape and one count of sexual assault. The court proceedings took place in England, where Partey was formally presented with the charges.\n\nAs part of his bail conditions, Partey is prohibited from making any contact with the complainants. He is also required to notify the police of any permanent change of address or any intention to travel abroad.\n\nThe case has attracted widespread public and media attention, with further legal proceedings expected in the coming weeks as investigations continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Ghanaian international footballer Thomas Partey has been granted conditional bail after appearing in a UK court on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/thomas-partey-granted-bail-after-sexual-offence-charges-in-uk/\">Continue reading<span class=\"screen-reader-text\"> \"Thomas Partey Granted Bail After Sexual Offence Charges in UK\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Brighton Chimene Makes History as First Zimbabwean to Officiate at CHAN Tournament",
            "url": "https://www.zimeye.net/2025/08/05/brighton-chimene-makes-history-as-first-zimbabwean-to-officiate-at-chan-tournament/",
            "content": "By Sports Correspondent\n\nZimbabwean referee Brighton Chimene has etched his name into the history books by becoming the first Zimbabwean match official to take charge of a game at the African Nations Championship (CHAN) tournament.\n\nChimene is officiating the Group Stage clash between Congo and Sudan this afternoon, marking a significant milestone for both his personal career and Zimbabwean football.\n\nHis appointment is being celebrated as a breakthrough moment, symbolising the growing recognition of Zimbabwean referees on the continental stage.\n\nFootball fans and local officials have applauded the achievement. Many see it as a positive step for the development of refereeing standards in Zimbabwe and a sign of increased opportunities for officials at international level.\n\nThe CHAN tournament, which features national teams made up of players who play in their countrys domestic leagues, is organised by the Confederation of African Football (CAF) and is currently underway.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Zimbabwean referee Brighton Chimene has etched his name into the history books by becoming the first Zimbabwean … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/brighton-chimene-makes-history-as-first-zimbabwean-to-officiate-at-chan-tournament/\">Continue reading<span class=\"screen-reader-text\"> \"Brighton Chimene Makes History as First Zimbabwean to Officiate at CHAN Tournament\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "About Ringworm In Cattle…",
            "url": "https://www.zimeye.net/2025/08/05/about-ringworm-in-cattle/",
            "content": "By Dr. Trywell Muzerengi\n\nRingworm in cattle  medically referred to as Dermatophytosis  is a contagious fungal skin infection caused by dermatophytes, and not actual worms, despite its misleading name. It primarily affects young calves, especially during the cold winter months when cattle are housed in crowded, poorly ventilated environments.\n\n Causative Agent\n\nThe main culprit in cattle is the fungus Trichophyton verrucosum, which specifically targets bovines.\n\n Transmission\n\nRingworm is highly contagious and can spread through:\n\nDirect contact with infected animals\n\nContaminated objects, including brushes, halters, and fences\n\nEnvironmental spores, which can survive for months\n\nPoor barn conditions, especially overcrowding and lack of ventilation\n\n Clinical Signs\n\nFarmers should look out for:\n\nCircular, greyish-white crusty lesions\n\nPatchy hair loss (alopecia), especially on the head, ears, neck, shoulders, and back\n\nScaly or raised skin that may be mildly itchy\n\nMore severe infections in young, malnourished, or immunosuppressed cattle\n\n Zoonotic Risk\n\nRingworm can also infect humans, particularly farm workers and children, causing red, itchy, ring-shaped rashes on the skin. This highlights the importance of early detection and proper hygiene.\n\n Diagnosis\n\nThough often diagnosed based on appearance, confirmation methods include:\n\nSkin scraping and microscopy (KOH preparation to see fungal hyphae)\n\nFungal culture\n\nWoods lamp test (note: not reliable for T. verrucosum)\n\n Treatment Options\n\nWhile Dermatophytosis often self-cures, treatment is recommended to prevent spread:\n\nIdeal for mild or localized cases:\n\nLime sulfur (1:16) or Enilconazole (1:100) rinse\n\nTwice-a-week applications\n\nOther options: Miconazole, Iodine, or Chlorhexidine washes\n\nRemove crusts with a brush and discard the brush and burn the infective material, advises veterinary guidelines.\n\nFor severe or outbreak scenarios:\n\nGriseofulvin (restricted in food animals in some regions)\n\nIvermectin (some antifungal effect but not first-line)\n\nClean and disinfect barns, feeding troughs, and grooming tools\n\nUse antifungal disinfectants such as bleach (1:10 solution)  though some vets caution that bleach can be irritating and hazardous to humans\n\n Recovery & Immunity\n\nLesions can take weeks to fully heal\n\nImmunity generally develops after infection, making reinfection rare in older animals\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Ringworm in cattle — medically referred to as Dermatophytosis — is a contagious fungal skin infection … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/about-ringworm-in-cattle/\">Continue reading<span class=\"screen-reader-text\"> \"About Ringworm In Cattle…\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Horror As Four Dogs Kill Boy (9) In Darwendale",
            "url": "https://www.zimeye.net/2025/08/05/horror-as-four-dogs-kill-boy-9-in-darwendale-2/",
            "content": "By A Correspondent\n\nA tragic incident has rocked the Darwendale farming community after a nine-year-old boy was mauled to death by four dogs while playing with friends at Bornvalley Farm.\n\nThe Zimbabwe Republic Police (ZRP) confirmed that the fatal dog attack occurred on 17 July 2025, and identified the victim as Shelton Panganai.\n\nIn a statement issued on Monday, August 4, ZRP spokesperson Commissioner Paul Nyathi said Shelton was playing soccer with other children when the dogs  suspected to be Boerboels  escaped from their owners home and chased the group.\n\nThe Zimbabwe Republic Police confirms that Shelton Panganai, aged nine, was mauled to death by four suspected Boer dogs at Bornvalley Farm, Darwendale on 17th July 2025, while playing soccer in the company of other children, said Commissioner Nyathi.\n\nHe added that the dogs broke free from their enclosure and ran after the children, who scattered in different directions.\n\nThe Zimbabwe Republic Police is now conducting full-scale investigations into allegations that the dogs went out of their owners residence and went on to chase the children who ran in different directions. Shelton Panganai was then mauled to death at a nearby gum tree plantation, Nyathi said.\n\nAccording to police, Mark Masendeke Magede, the suspected owner of the dogs, has since been arrested.\n\nCommissioner Nyathi also confirmed that all four dogs involved in the attack have been put down by the relevant authorities under police supervision.\n\nHe dismissed social media speculation that the case was being ignored, saying:\n\nThe Zimbabwe Republic Police reiterates that the case will not be swept under the carpet as alleged on social media posts and everything will be handled in line with the countrys laws.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident has rocked the Darwendale farming community after a nine-year-old boy was mauled to death … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/horror-as-four-dogs-kill-boy-9-in-darwendale-2/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Four Dogs Kill Boy (9) In Darwendale\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Sulu Laughs Off Bizarre Dr Amai Rumors",
            "url": "https://www.zimeye.net/2025/08/05/sulu-laughs-off-bizarre-dr-amai-rumors/",
            "content": "By A Correspondent| Dendera music star Sulumani Chimbetu has dismissed as Netflix content sensational rumors claiming he was recently arrested after allegedly trying to woo former First Lady Grace Mugabe.\n\nThe bizarre claims, which originated from popular gossip pagezimcelebs, quickly went viral on social media, sparking debate over the alleged boldness of the Kwedu hitmaker.\n\nAccording to the rumor, Sulu reportedly approached Grace Mugabe during a visit to the Mugabe family home and asked her outan advance that allegedly angered the widow of the late former President Robert Mugabe to the point of filing a police report. The tale goes further to suggest that the charges were later dropped.\n\nHowever, the award-winning musician has since responded to the allegations on Facebook, clearly amused by the gossip.\n\nIs it for Netflix or what? Mati ndadii futi, wrote Sulu, adding a laughing emoji to underline his disbelief.\n\nGrace Mugabe, who recently celebrated her 60th birthday in style, has not commented on the matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Dendera music star Sulumani Chimbetu has dismissed as “Netflix content” sensational rumors claiming he was recently arrested … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/sulu-laughs-off-bizarre-dr-amai-rumors/\">Continue reading<span class=\"screen-reader-text\"> \"Sulu Laughs Off Bizarre Dr Amai Rumors\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Outcry As Mnangagwa Regime Chases Away Vendors From Streets",
            "url": "https://www.zimeye.net/2025/08/05/outcry-as-mnangagwa-regime-chases-away-vendors-from-streets/",
            "content": "By A Correspondent\n\nHARARE  The governments sweeping crackdown on street vending and second-hand clothing sales has sparked outrage  not just among affected traders, but also from within the ruling Zanu PFs own support base.\n\nOn Monday, Local Government and Public Works Minister Daniel Garwe declared an immediate ban on the importation and sale of mabhero (second-hand clothes), alongside a blanket prohibition on all forms of street and night vending. The announcement came during a meeting with Harare City Councillors at Town House.\n\nI want to make it clear that government has banned the importation and selling of second-hand clothing, Garwe said. As a result, all street vending and night vending activities are now prohibited with immediate effect.\n\nHe directed city authorities to act quickly, stating, The City of Harare is directed to work closely with law enforcement agencies to ensure there is no further vending on the streets or at night. The time to act is now  not tomorrow.\n\nThe sudden directive has ignited backlash from Zanu PF hardliners and online loyalists, with many questioning the logic behind banning vendors soon after they were beneficiaries of a state-sponsored empowerment program.\n\nPosting on the Operation Restore Legacy Facebook page  a platform run by vocal Zanu PF activists  party loyalists lashed out at Garwes decision.\n\nThese guys  are they supporting President Emmerson Dambudzo Mnangagwa or are they sabotaging him quietly by creating silly confusion that could trigger an uprising? one post read.\n\nCritics pointed out the contradiction between the new ban and the Presidential Empowerment Fund recently rolled out to support informal traders aligned with the ruling party under the Vendors for ED banner.\n\nJust a few days ago, the Presidential Empowerment Fund was availed to Vendors for ED. Now those same beneficiaries, many of whom had stockpiled goods for resale, have just been hit with a ban that stops them from trading  courtesy of Minister Garwe, the post continued.\n\nFrustration was summed up in a rhetorical question: Tirikumboenda kupi chaizvo senyika??? (Where are we really going as a country?)\n\nThe enforcement of this ban presents significant challenges, especially in an economy where the informal sector dominates. According to ZimStats latest economic census, 76 percent of economic activity in Zimbabwe happens informally, and 88 percent of the working population is engaged in informal employment  a vast number of them being street vendors.\n\nDespite the widespread disruption the ban is likely to cause, Garwe urged restraint in how it is enforced. There is absolutely no need to be aggressive. Authorities should not use force or heavy-handed tactics, he said.\n\nFor many Zimbabweans, vending is not just a side hustle but a survival mechanism. Second-hand clothing markets have flourished in urban areas, providing low-cost alternatives to expensive retail shops. Items like jeans, jackets, and shoes are often sold for as little as US$2, making mabhero stalls immensely popular.\n\nStreet vending has become entrenched in cities nationwide, while night vending has grown as traders take advantage of lax enforcement after hours.\n\nNow, with fierce criticism emerging from within Zanu PF itself, the pressure is mounting on Minister Garwe and the Mnangagwa administration to justify or reconsider the move  especially as thousands of livelihoods hang in the balance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – The government’s sweeping crackdown on street vending and second-hand clothing sales has sparked outrage — … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/outcry-as-mnangagwa-regime-chases-away-vendors-from-streets/\">Continue reading<span class=\"screen-reader-text\"> \"Outcry As Mnangagwa Regime Chases Away Vendors From Streets\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Ezra Chadzamira’s Ally With Violent Past Eyes Masvingo Ward 7 Council Seat",
            "url": "https://www.zimeye.net/2025/08/05/ezra-chadzamiras-ally-with-violent-past-eyes-masvingo-ward-7-council-seat/",
            "content": "By A Correspondent\n\nEsau Mutanho, a controversial Zanu PF activist and Masvingo Minister of State for Provincial Affairs Ezra Chadzamiras driver, is seeking to win the vacant Masvingo Urban Ward 7 council seat.\n\nMutanho is known for his involvement in violent disruptions at political events and public gatherings, earning a reputation as one of the partys enforcers.\n\nAlthough Zanu PF is yet to announce when its primary elections will be held, Mutanho has already declared his intention to represent the party in the September 13 by-election.\n\nThe by-election was triggered by the recent death of Councillor Tafara Masimba.\n\nIn a statement last week, the Zimbabwe Electoral Commission (ZEC) confirmed that the by-election will take place on Saturday, September 13.\n\nBy-elections for Masvingo Urban Ward 7, Marondera Municipality Ward 9, and Makonde Rural District Council Ward 8 will be held on the same day, ZEC said in an election notice issued in line with the Electoral Act [Chapter 2:13], and signed by Chief Elections Officer Simbarashe Tongayi.\n\nThe Nomination Court will sit on Wednesday, August 14, from 10:00 AM to 4:00 PM, at the respective local authority centres, with the Masvingo court operating from the Civic Centre.\n\nA senior Zanu PF official in Masvingo last week dismissed suggestions that the party condones violence\n\nAs a party, we do not condone violence or intimidation of any form. \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Esau Mutanho, a controversial Zanu PF activist and Masvingo Minister of State for Provincial Affairs Ezra Chadzamira’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/ezra-chadzamiras-ally-with-violent-past-eyes-masvingo-ward-7-council-seat/\">Continue reading<span class=\"screen-reader-text\"> \"Ezra Chadzamira’s Ally With Violent Past Eyes Masvingo Ward 7 Council Seat\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Chinamasa Declares Tagwirei Central Committee Appointment Irreversible",
            "url": "https://www.zimeye.net/2025/08/05/chinamasa-declares-tagwirei-central-committee-appointment-irreversible/",
            "content": "By A Correspondent\n\nHARARE  Zanu PF Secretary for Legal Affairs Patrick Chinamasa has reposted a lengthy statement on X (formerly Twitter) confirming the co-option of controversial businessman Kudakwashe Tagwirei into the partys Central Committee  just hours after taking down the original post.\n\nThe move has stirred speculation over possible internal differences or confusion within the ruling partys senior leadership.\n\nThe decision to briefly remove, then restore the post, has triggered intense speculation online, with many observers questioning whether there were conflicting positions within the party over Tagwireis controversial inclusion.\n\nIn the re-uploaded message  shared without alterations  Chinamasa sought to clarify the process and timeline, while expressing confusion over the public backlash.\n\nBelow is the full and unedited statement posted by Patrick Chinamasa on X:\n\nFull Statement by Patrick Chinamasa, Zanu PF Secretary for Legal Affairs:\n\nThe Zanupf Department of Legal Affairs is relieved and takes note that the furore/controversy/confusion/wrangle/much ado about nothing/social media hype/misinformation/disinformation that surrounded Harare Provincial Coordinating Committee (PCC) cooption of Cde Kudakwashe Tagwirei into the Zanupf Central Committee is now over and irreversibly settled.\n\nFrom the outset, it was difficult to understand the source of the problem.\n\nOur Harare PCC convened on Monday, 31 March 2025, and voted to recommend the cooption of Cde Tagwirei into the Central Committee. The Province addressed the letter of recommendation to the Zanupf Secretary General, Cde Dr. Obert Moses Mpofu. The letter was copied to the Departments of the Commissariat and Legal Affairs, amongst others.\n\nThe National Political Commissar, Cde Munyaradzi Machacha, tabled the recommendation at the 384th Ordinary Session of the Politburo, held at Zanupf Headquarters on Wednesday, 2nd July 2025, and the cooption of Cde Tagwirei into the Zanupf Central Committee was approved, pending reporting to the Central Committee for adoption. There was no objection in the Politburo meeting to the recommendation by Harare Provincial Coordinating Committee.\n\nWhen the 385th Ordinary Session of the Politburo sat on Wednesday, 30th July 2025, at the Zanupf Headquarters, and with Vice President and Second Secretary, General (Rtd) Dr. C.G.D.N. Chiwenga chairing, the Politburo confirmed its Minutes of the 384th Meeting (prepared by the Secretary General, Dr. Mpofu) with minor amendments. Confirmed without amendment on page 22 of the Politburo Minutes was Item 7.1.7, headed:\n\nCo-option by Harare Province\n\nwhich read:\n\nThe NPC indicated that prior to the issuance of the aforementioned co-option correspondences on co-options, some Provinces, including Harare, had already completed the process. In this regard, Cde Kudakwashe Tagwireyi was co-opted by Harare Province and is now a Central Committee Member.\n\nAlso to be noted and confirmed by the Politburo, without amendment, on Wednesday, 30th July 2025, is Politburo Minutes Item 7.1.6 (also on page 22 of the Minutes), titled:\n\nCircular on Co-Options\n\nwhich read as follows:\n\nIt was stated that in the light of the Central Committee vacancies mentioned above, the Department of Legal Affairs had drafted co-options guidelines, outlined in a circular dated 30th June 2025, signed by the Secretary of Legal Affairs, Cde P.A. Chinamasa. This circular superseded the previous circular dated 5th June 2025, signed by the Secretary General, Cde Dr. O.M. Mpofu, which sought to address a similar issue.\n\nSo the controversy surrounding Cde Tagwireis cooption into the Central Committee surprises me and took me completely off guard. Given Cde Tagwireis commitment to Zanupf and his track record in the service of the Party, the somewhat negative publicity and narrative surrounding his cooption into the Central Committee is undeserved.\n\nI have been a member of the Zanupf Central Committee continuously and without break since December 1987, and a member of the Zanupf Politburo since the year 2000 to date, and I can state unequivocally that throughout this long period of nearly 38 years as Central Committee or as Politburo, we have never had to debate, let alone discuss, PCC recommendations of cooptions into the Central Committee. We always treated such recommendations as fait accompli.\n\nThe cooption of Cde Tagwirei is the first ever to be the subject of discussion and social media commentaries. The only explanation why the Tagwirei cooption has attracted such controversy may be because there are people out there who, for reasons best known to themselves, have an axe to grind.\n\nAt its 385th Ordinary Session of the Politburo, the following cooptions were tabled by the National Political Commissar and were approved: Mash West, Cdes Polite Kambamura, Christine Gwati and Joseph Serima; Mat North, Cde Collen Ndebele.\n\nThis means that at the next Zanupf Central Committee meeting, the National Political Commissar will table for noting and adoption five cooptions into the Central Committee, namely Cdes Kudakwashe Tagwirei, Polite Kambamura, Christine Gwati, Joseph Serima and Collen Ndebele.\n\nThose with eyes, let them eye, and those with ears, let them ear. Nokuti hatigoni kurega kutaura izvo takaona neizvo takanzwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Zanu PF Secretary for Legal Affairs Patrick Chinamasa has reposted a lengthy statement on X … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/chinamasa-declares-tagwirei-central-committee-appointment-irreversible/\">Continue reading<span class=\"screen-reader-text\"> \"Chinamasa Declares Tagwirei Central Committee Appointment Irreversible\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        },
        {
            "title": "Two Die In Head-on Collision Along Masvingo–Mbalabala Road",
            "url": "https://www.zimeye.net/2025/08/05/two-die-in-head-on-collision-along-masvingo-mbalabala-road/",
            "content": "By A Correspondent\n\nTwo people have died while two others sustained injuries following a fatal head-on collision along the MasvingoMbalabala Road, the Zimbabwe Republic Police (ZRP) has confirmed.\n\nThe crash occurred at the 130-kilometre peg at around 8:20 PM on Sunday, August 3, 2025.\n\nIn a statement, ZRP said: The crash involved a Volvo truck carrying two passengers and a Toyota LiteAce with one passenger on board.\n\nAccording to police, the two vehicles collided head-on, leading to the death of two individuals at the scene.\n\nThe bodies of the deceased were taken to Zvishavane District Hospital mortuary for post-mortem examinations, added the police.\n\nThe ZRP also confirmed that the two injured passengers were admitted to Mberengwa Hospital for medical attention.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two people have died while two others sustained injuries following a fatal head-on collision along the Masvingo–Mbalabala … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/05/two-die-in-head-on-collision-along-masvingo-mbalabala-road/\">Continue reading<span class=\"screen-reader-text\"> \"Two Die In Head-on Collision Along Masvingo–Mbalabala Road\"</span></a></p>",
            "time": "18:39",
            "date": "06 Aug 2025"
        }
    ]
}