{
    "news": [
        {
            "title": "Mfecane Fails To Pay Rent Despite Gumbooting Mnangagwa GoldMafia Dance",
            "url": "https://www.zimeye.net/2024/12/16/mfecane-fails-to-pay-rent-despite-gumbooting-mnangagwa-goldmafia-dance/",
            "content": "By Dorrothy Moyo |Breaking News: Tendayi Zinyama (Mfecane) Taken to Court Over Unpaid Rentals\n\nBulawayo, Zimbabwe  Tendayi Zinyama, widely known asMfecane, has found himself at the center of controversy after being dragged to court for allegedly failing to pay rental arrears amounting to USD 1,090 or its ZWL equivalent. This development has sent shockwaves across the community, particularly given Zinyamas vocal public displays of loyalty to President Emmerson Mnangagwa, often characterized by symbolic acts such as worshipping the leader with his trademark gumboots.\n\nDetails of the Case\n\nThe Letter of Demand, dated 12 December 2024, was issued by Kavalco Court (Pvt) Ltd, represented by Nondzashe Manjoni. The letter specifies that Zinyama has until 14 days from the date of receipt to settle the outstanding amount. Failure to comply will result in legal summons being issued in the Small Claims Court.\n\nThe arrears, accrued as of 15 November 2024, pertain to Office 1, Suite 5, Kavalco Court at 98 R. Mugabe Way, a central business address in Bulawayo. Despite being served with the notice, Zinyamas response remains unclear as of press time.\n\nPublic Persona vs Financial Troubles\n\nTendayi Zinyama, a figure known for his vocal support of President Mnangagwa, has often garnered attention for his symbolic performances and speeches, where he dons gumboots as a gesture of reverence for Zimbabwes leadership. These actions have made him a prominent figure in political circles and social media.\n\nHowever, this court case reveals a stark contrast to his public image. Critics have begun to question whether Zinyamas performances mask deeper financial struggles or mismanagement.\n\nCommunity Reactions\n\nNews of Zinyamas legal troubles has sparked mixed reactions. Supporters have defended him, blaming economic hardships for the rental arrears, while detractors have seized on the opportunity to call out perceived hypocrisy.\n\nA local observer commented:\n\nFor someone who loudly praises leadership and the economys supposed growth, this is ironic. You cant wear gumboots for Mnangagwa one day and fail to pay rent the next.\n\nOthers have expressed sympathy, highlighting the challenges faced by small businesses and individuals due to Zimbabwes economic instability.\n\nLegal Implications\n\nThe issuance of a demand letter under Section 22 of the Small Claims Court Act [Chapter 7:12] is a serious legal step. Should Zinyama fail to settle the amount, the matter will proceed to court, potentially leading to legal action, including property seizure or enforcement orders.\n\nThe Bigger Picture\n\nThis case underscores growing tensions in Zimbabwes economic and social landscape. While political symbolism continues to dominate public narratives, the reality of unpaid debts and economic struggles remains prevalent, even among outspoken supporters of the government.\n\nAs the deadline looms, all eyes will be on Zinyama to see whether he settles his dues or faces the full weight of the law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Breaking News: Tendayi Zinyama (Mfecane) Taken to Court Over Unpaid Rentals Bulawayo, Zimbabwe — Tendayi Zinyama, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/mfecane-fails-to-pay-rent-despite-gumbooting-mnangagwa-goldmafia-dance/\">Continue reading<span class=\"screen-reader-text\"> \"Mfecane Fails To Pay Rent Despite Gumbooting Mnangagwa GoldMafia Dance\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Was Hwange Accident Driver Careless?",
            "url": "https://www.zimeye.net/2024/12/16/was-hwange-accident-driver-careless/",
            "content": "Did the Driver Intentionally Cause Fatal Accident in Hwange?\n\nBy Farai D Hove |Tragedy struck in Hwange last Thursday when a 29-year-old man, Blessing Tafadzwa Mhlanga, lost his life after being run over by a haulage truck while attempting to cross Ingagula Road. The driver of the truck, 32-year-old Emmanuel Muleya, has since been charged with culpable homicide, raising questions about the circumstances leading to the fatal accident.\n\nThe Incident\n\nThe incident occurred at approximately 11:00 AM near Ash Dam. Muleya, driving a Howo tipper truck registered to Safast Logistics Hwange, allegedly did not see Mhlanga crossing the road. According to police reports, Muleya only realized his truck had hit something after the fact.\n\nMhlanga, who worked for a Chinese company in the Sino Hydro Living Camp, reportedly sustained severe injuries, including broken legs, and died on the spot. His body has been transferred to the Hwange Colliery Hospital Mortuary for a post-mortem examination. The vehicle involved has been taken to the Central Vehicle Department for further inspection.\n\nThe Drivers Account\n\nMuleyas statement to the authorities suggests the accident was unintentional. The driver claims he was unaware of Mhlangas presence and only discovered the impact when alerted. This version of events raises critical questions about visibility, road conditions, and the trucks maintenance.\n\nWas It Avoidable?\n\nAnalysts have begun to dissect the circumstances surrounding the accident, focusing on several key factors:\n\n1.Drivers Awareness: Muleyas claim of not seeing Mhlanga points to possible issues with visibility or negligence. Was the curve along the road a blind spot, or was the driver inattentive?\n\n2.Vehicle Maintenance: The trucks condition is under investigation. Mechanical faults, such as braking or steering issues, could have contributed to the incident.\n\n3.Road Safety Measures: The accident occurred along a curve on Chaba Road. Were adequate road signs or pedestrian crossings in place?\n\nA Troubling Pattern?\n\nThis incident comes in the wake of another fatal accident involving a Chinese construction company truck last week, where two people died, and 52 were injured. The frequency of such accidents raises concerns about safety protocols in the region, particularly involving large vehicles operated by contractors.\n\nWas It Intentional?\n\nWhile there is no evidence to suggest that Muleya intentionally caused the accident, the charge of culpable homicide implies a degree of negligence. Whether this negligence stems from human error, poor vehicle maintenance, or inadequate infrastructure remains to be seen.\n\nWhats Next?\n\nThe post-mortem results and findings from the Central Vehicle Department will be crucial in determining liability. If negligence is proven, it could lead to stricter safety regulations for haulage companies in Hwange.\n\nFor now, the tragic death of Blessing Tafadzwa Mhlanga is a stark reminder of the risks pedestrians face on roads shared with heavy vehicles. Whether this tragedy was preventable will depend on the findings of the ongoing investigation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Did the Driver Intentionally Cause Fatal Accident in Hwange? By Farai D Hove | Tragedy struck in Hwange last Thursday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/was-hwange-accident-driver-careless/\">Continue reading<span class=\"screen-reader-text\"> \"Was Hwange Accident Driver Careless?\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Zuma Is Sucking Out Both Malema And Ramaphosa",
            "url": "https://www.zimeye.net/2024/12/16/zuma-is-sucking-out-both-malema-and-ramaphosa/",
            "content": "Analysis: Could Jacob Zumas MKP End Julius Malemas EFF and Cyril Ramaphosas ANC?\n\nBy Dorrothy Moyo | As South Africa grapples with shifting political allegiances and economic instability, Jacob Zumas Umkhonto WeSizwe Party (MKP) has emerged as a disruptive force that could significantly alter the countrys political landscape. Zumas recent rally marking the MKPs first anniversary, alongside Julius Malemas incendiary comments in the Financial Times, signals a political showdown that could destabilize both the Economic Freedom Fighters (EFF) and the African National Congress (ANC).\n\nZumas Growing Influence\n\nZumas MKP, founded in 2023, has swiftly established itself as a formidable player in South African politics. Positioned as a party of total liberation, its platform emphasizes land redistribution, state-led economic transformation, and decolonized education. With its populist rhetoric and critiques of the ANCs centrist policies, the MKP has attracted disillusioned ANC members and prominent defectors from the EFF, such as Floyd Shivambu and Dali Mpofu.\n\nShivambu recently described the MKP as a superior alternative to the EFF, which he criticized as a small, unviable fiefdom. His statement suggests that Zumas leadership is resonating with factions of the radical left who view Malemas EFF as ineffective or overly centralized.\n\nMalemas Dismissal of Zuma\n\nMalema, however, remains defiant. In an interview with the Financial Times, he rejected any possibility of uniting with the MKP, despite their shared goals of expropriating land without compensation and nationalizing mines and banks.\n\nTo work with President Zuma is to stab yourself in the back because hes not honest, Malema said, accusing Zuma of using political allies only to discard them later. His remarks, which included vulgar and personal attacks, underscored deep animosity between the two leaders.\n\nMalema also implied that defectors like Shivambu and Mpofu were attempting to assassinate the EFF by leaving the party. This rhetoric reflects the strain that the MKPs rise has placed on Malemas party, as internal divisions threaten its cohesion.\n\nThe ANCs Decline\n\nMeanwhile, the ANC under President Cyril Ramaphosa is grappling with its own crisis. Its share of the vote has plummeted to below 40%, forcing the once-dominant party into coalitions with opposition groups like the Democratic Alliance. Ramaphosas centrist policies and focus on economic stability have alienated factions within the party and the broader electorate.\n\nZumas criticism of the ANCs failure to fulfill the promises of 1994particularly on land reform and economic transformationhas struck a chord with many South Africans who feel left behind. By positioning the MKP as a revolutionary alternative, Zuma is challenging both the ANCs centrist policies and the EFFs claim to radical politics.\n\nA Threat to Both the ANC and EFF?\n\nZumas MKP has the potential to disrupt South Africas political equilibrium in several ways:\n\nZumas Legacy and the Road Ahead\n\nDespite Malemas assertion that Zuma cannot be trusted, the former presidents enduring influence cannot be dismissed. His ability to galvanize discontented factions within the ANC and EFF positions him as a critical player in South Africas evolving political landscape.\n\nThe rivalry between Zuma, Malema, and Ramaphosa reflects deeper fractures within South Africas political system. As the MKP gains momentum, the question remains: can Zuma translate his populist appeal into lasting political dominance, or will internal divisions and his controversial past hinder the MKPs rise?\n\nWhat is certain is that Zumas re-entry into frontline politics has already shaken South Africas political order. If his MKP continues to grow, it could spell the end for both the ANC as a dominant party and Malemas EFF as the voice of radical opposition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Analysis: Could Jacob Zuma’s MKP End Julius Malema’s EFF and Cyril Ramaphosa’s ANC? By Dorrothy Moyo | As South Africa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/zuma-is-sucking-out-both-malema-and-ramaphosa/\">Continue reading<span class=\"screen-reader-text\"> \"Zuma Is Sucking Out Both Malema And Ramaphosa\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Mandaza Bus Catches Fire: Passengers Escape Unhurt",
            "url": "https://www.zimeye.net/2024/12/16/mandaza-bus-catches-fire-passengers-escape-unhurt/",
            "content": "By A Correspondent\n\nA devastating fire engulfed a Mandaza Bus Services coach on Sunday morning, destroying it completely.\n\nThe incident occurred at the 195-kilometre mark along the Harare-Masvingo road at approximately 10 AM.\n\nAccording to the Zimbabwe Republic Police (ZRP), the bus was travelling to Harare with 58 passengers on board when it developed a mechanical fault, leading to the blaze.\n\nThe ZRP confirmed the incident in a statement: The ZRP confirms a fire incident involving a Mandaza bus which occurred at the 195-kilometre peg along Harare-Masvingo road on 15/12/24 at around 1000 hours. The bus, which was travelling towards Harare with 58 passengers on board, caught fire after developing a mechanical fault and was burnt to a shell. All passengers escaped unhurt.\n\nFortunately, all passengers managed to escape without injury, thanks to swift evacuation efforts. The cause of the mechanical fault is still under investigation.\n\nThis incident serves as a reminder of the importance of regular vehicle maintenance and safety checks to prevent such accidents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating fire engulfed a Mandaza Bus Services coach on Sunday morning, destroying it completely. The incident … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/mandaza-bus-catches-fire-passengers-escape-unhurt/\">Continue reading<span class=\"screen-reader-text\"> \"Mandaza Bus Catches Fire: Passengers Escape Unhurt\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Controversy Surrounds Mnangagwa’s Commissioning of Harvest House Church",
            "url": "https://www.zimeye.net/2024/12/16/controversy-surrounds-mnangagwas-commissioning-of-harvest-house-church/",
            "content": "By A Correspondent\n\nZimbabwes President Emmerson Mnangagwa has sparked controversy after commissioning the Harvest House International Church and Conference Centre in Bulawayo. Many view Mnangagwas hands as dripping with blood due to his complex and tumultuous past, raising questions about his suitability to officiate at the churchs opening.\n\nMnangagwas involvement in the ceremony has been met with skepticism, given his history of human rights abuses and suppression of opposition. His presidency has been marked by a crackdown on dissent, leading to widespread criticism from human rights groups and opposition parties.\n\nDespite this, Mnangagwa expressed pride in opening the church, stating, I was honoured to officially open the Harvest House International Church and Conference Centre in Bulawayo. This facility is a milestone for the church and enhances Zimbabwes ability to host international conferences. May this centre serve as a beacon of faith, unity, and progress for our nation and beyond.\n\nCritics argue that Mnangagwas presence at the ceremony undermines the churchs values and message. They point to his role in the Gukurahundi massacres, which claimed thousands of lives, and his involvement in suppressing opposition during his tenure as Vice President under Robert Mugabe.\n\nThe controversy surrounding Mnangagwas commissioning of the Harvest House Church highlights the complex and often fraught relationship between politics and religion in Zimbabwe. As the country navigates its turbulent past and uncertain future, the intersection of faith and politics remains a contentious issue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s President Emmerson Mnangagwa has sparked controversy after commissioning the Harvest House International Church and Conference Centre … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/controversy-surrounds-mnangagwas-commissioning-of-harvest-house-church/\">Continue reading<span class=\"screen-reader-text\"> \"Controversy Surrounds Mnangagwa’s Commissioning of Harvest House Church\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Former VP Mphoko Laid to Rest in Bulawayo, Defying National Heroes Acre Tradition",
            "url": "https://www.zimeye.net/2024/12/16/former-vp-mphoko-laid-to-rest-in-bulawayo-defying-national-heroes-acre-tradition/",
            "content": "By A Correspondent\n\nIn a move that has raised eyebrows, national hero and former Vice President Phelekezela Mphoko has been laid to rest at his plot in Douglasdale, just outside Bulawayo, contrary to the traditional burial at the National Heroes Acre.\n\nThis decision was made in accordance with Mphokos wishes, as revealed by his family.\n\nMphoko, who passed away at the age of 84 in India while receiving treatment for an undisclosed ailment, was declared a national hero by the government. However, his family disclosed that he had expressed his desire to be buried at his plot, rather than the national shrine where many of his contemporaries are laid to rest.\n\nThis decision is not unprecedented, as several liberation war heroes have also opted out of being buried at the National Heroes Acre. Notable examples include former President Robert Mugabe, who was ousted in a military coup in 2017, and former ministers Welshman Mabhena and Dumiso Dabengwa, who also chose to be buried elsewhere .\n\nObservers have pointed out that Mphokos decision may be linked to the complex politics surrounding his tenure and the circumstances of his departure from office. Some have suggested that Mphokos reluctance to be buried at the National Heroes Acre may be a reflection of his feelings towards President Emmerson Mnangagwa, who seized power after overthrowing Mugabe.\n\nRegardless of the motivations behind Mphokos decision, his burial in Bulawayo marks a significant departure from tradition.\n\nAs Zimbabwe continues to grapple with its complex history and politics, Mphokos legacy will undoubtedly be remembered as a testament to the countrys ongoing struggle for identity and reconciliation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that has raised eyebrows, national hero and former Vice President Phelekezela Mphoko has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/former-vp-mphoko-laid-to-rest-in-bulawayo-defying-national-heroes-acre-tradition/\">Continue reading<span class=\"screen-reader-text\"> \"Former VP Mphoko Laid to Rest in Bulawayo, Defying National Heroes Acre Tradition\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Tropical Cyclone Chido Threatens Southern Africa",
            "url": "https://www.zimeye.net/2024/12/16/tropical-cyclone-chido-threatens-southern-africa/",
            "content": "Tropical Cyclone Chido is expected to bring severe weather to Southern Africa, affecting approximately 2.5 million people in Mozambique, Malawi and the Comoros. After hitting Mayotte with intense winds, the cyclone is forecasted to make landfall in northern Mozambique.-State Media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tropical Cyclone Chido is expected to bring severe weather to Southern Africa, affecting approximately 2.5 million people in Mozambique, Malawi … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/tropical-cyclone-chido-threatens-southern-africa/\">Continue reading<span class=\"screen-reader-text\"> \"Tropical Cyclone Chido Threatens Southern Africa\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Wolves Dismiss Coach",
            "url": "https://www.zimeye.net/2024/12/16/wolves-dismiss-coach/",
            "content": "Sports Correspondent\n\nWolverhampton Wanderers have parted ways with head coach Gary ONeil following a dismal run of results, including a crushing 2-1 defeat to Ipswich Town at Molineux. This loss left Wolves second from bottom in the Premier League table, a staggering four points from safety.\n\nONeils tenure was marked by significant challenges, including the sale of key players like captain Max Kilman and star winger Pedro Neto. Despite committing 28 million to sign striker Jorgen Strand Larsen and several prospects, the clubs trajectory has been concerning.\n\nKey Factors Leading to ONeils Departure:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Wolverhampton Wanderers have parted ways with head coach Gary O’Neil following a dismal run of results, including a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/wolves-dismiss-coach/\">Continue reading<span class=\"screen-reader-text\"> \"Wolves Dismiss Coach\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "Close to 1,000 People Feared Dead After Cyclone in French Territory of Mayotte",
            "url": "https://www.zimeye.net/2024/12/15/close-to-1000-people-feared-dead-after-cyclone-in-french-territory-of-mayotte/",
            "content": "By Dr Masimba Mavaza | Intense Tropical Cyclone Chidois a small but powerful tropical cyclone currently making landfall in Mozambique. The fourth tropical disturbance, the second tropical cyclone, and the second intense tropical cyclone of the 202425 South-West Indian Ocean cyclone season, Chido formed from a tropical disturbance southeast of Diego Garcia that was first noted on 5 December 2024.\n\nIt continued westward, and steadily intensified before being named Chido on 8 December. After it underwent rapid intensification, Chido made landfall at Agalga in Mauritius on 11 December, peaking in intensity the following day. After passing through northern Madagascar, Chido briefly weakened but quickly regained intensity, before making its second landfall near Bandraboua, Mayotte on 14 December, before slightly weakening again later that day and making a third landfall near Pemba, Mozambique the following day; Chido made all three of its landfalls as a Category 4-equivalent intense tropical cyclone.Cyclone Chido has also caused extensive damage in nearby islands Comoros and Madagascar, as well as Mozambique.\n\nClose to 1,000 people may have been killed after Cyclone Chido hit the French territory of Mayotte in the Indian Ocean, the islands top official has said.\n\nMayotte Prefect Francois-Xavier Bieuville told local TV station la 1ere: I think there are some several hundred dead, maybe well get close to a thousand, even thousands given the violence of this event.He said it was currently extremely difficult to get an exact number.Officials had confirmed at least 11 deaths in Mayotte earlier on Sunday but said that was expected to increase.\n\nCyclone Chido caused extensive damage on Saturday, with nearby islands of Comoros and Madagascar also affected as it blew through the southeastern Indian Ocean.\n\nForecaster Meteo-France said it was the strongest storm in more than 90 years to hit the islands.Winds of more than 136mph ripped roofs off houses and destroyed buildings in Mayotte.\n\nEntire neighbourhoods were flattened, while residents reported many trees had been uprooted and boats had been flipped or sunk.\n\nThe main airport and hospital also suffered major damage, the new French prime minister Francois Bayrou said.He added many people living in precarious shacks in slum areas have faced very serious risks.\n\nOne hospital in Mayotte reported that nine people were in critical condition and another 246 others were injured.But Frances interior ministry said it was proving difficult to get a precise tally of the dead and injured  though interior minister Bruno Retailleau feared the number killed will be high.\n\nThe ministry said 1,600 police and gendarmerie officers have been deployed, alongside rescuers and firefighters from Mayotte and the nearby territory of Reunion. Supplies were also being rushed in on military aircraft and ships.\n\nMayotte has a population of just over 300,000 spread over two main islands about 500 miles off Africas east coast.\n\nIt is Frances poorest region and has struggled with drought, underinvestment, and gang violence for decades.\n\nCyclone Chido has now made landfall in Mozambique on the African mainland, where the United Nations Childrens Fund (UNICEF) said Cabo Delgado province, home to around two million people, had been hit hard.Many homes, schools and health facilities have been partially or completely destroyed and we are working closely with government to ensure continuity of essential basic services, the organisation said.While we are doing everything we can, additional support is urgently needed.\n\nUNICEF Mozambique spokesman Guy Taylor said in a video that communities now face the prospect of being cut off from schools and health facilities for weeks.\n\nMalawi and Zimbabwe have also made emergency plans, with both countries warning they may have to evacuate people from low-lying areas due to flooding.\n\nDecember through March is cyclone season in the southeastern Indian Ocean, and southern Africa has been pummelled by a series of strong ones in recent years.\n\nCyclone Idai in 2019 killed more than 1,300 people in Mozambique, Malawi and Zimbabwe while Cyclone Freddy left more than 1,000 dead across several countries last year.\n\nThe cyclones bring the risk of flooding and landslides, but also stagnant pools of water may later spark deadly outbreaks of the waterborne disease cholera as well as dengue fever and malaria.Studies say the cyclones are getting worse because of climate change. They can leave poor countries in southern Africa, which contribute a tiny amount to global warming, having to deal with large humanitarian crises  underlining their call for more help from rich nations to deal with the impact of climate change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | Intense Tropical Cyclone Chidois a small but powerful tropical cyclone currently making landfall in Mozambique. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/close-to-1000-people-feared-dead-after-cyclone-in-french-territory-of-mayotte/\">Continue reading<span class=\"screen-reader-text\"> \"Close to 1,000 People Feared Dead After Cyclone in French Territory of Mayotte\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        },
        {
            "title": "KG6 Fire Unearths Election Rigging Scam",
            "url": "https://www.zimeye.net/2024/12/15/kg6-fire-sparks-election-rigging-scam/",
            "content": "By Political Reporter A fire at the KG6 Army Headquarters, now Josiah Magama Tongogara Barracks, early Sunday has ignited fears of sabotage linked to Zimbabwes controversial election rigging machinery.\n\nThe blaze, confirmed by Colonel Alphios Makotore, Director of Army Public Relations, broke out at around 2:50 am, damaging several offices.\n\nWe regret to inform the public that a fire has broken out at the Army Headquarters administrative complex, resulting in damage to some offices, Col. Makotore said in a statement.\n\nHowever, insiders allege the fire may have been deliberate, with suspicions pointing to disgruntled personnel within the army.\n\nThe barracks are notorious for their role in election manipulation, with sources revealing that passports, IDs, and ballot papers are secretly printed and administered there by senior army officials closely tied to Zanu PFs election rigging apparatus.\n\nThe fire could have been an inside job by individuals fed up with the regime, one source speculated.\n\nThe incident has triggered a witch hunt, with middle-ranked officers reportedly under investigation for possible involvement in the arson attack.\n\nThis development has further exposed the militarys profoundly entrenched role in securing Zanu PFs grip on power through clandestine operations at KG6.\n\nFor years, Zimbabwes elections have been marred by allegations of military interference, voter suppression, and rigging.\n\nThe fire at the heart of the armys operations raises serious questions about the lengths to which the regime will go to maintain control and the growing discontent within its ranks.\n\nThis is a developing story, and more updates will follow as investigations continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter – A fire at the KG6 Army Headquarters, now Josiah Magama Tongogara Barracks, early Sunday has ignited fears … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/15/kg6-fire-sparks-election-rigging-scam/\">Continue reading<span class=\"screen-reader-text\"> \"KG6 Fire Unearths Election Rigging Scam\"</span></a></p>",
            "time": "08:40",
            "date": "16 Dec 2024"
        }
    ]
}