{
    "news": [
        {
            "title": "CID Boss Bashed at Jongwe Corner Bar",
            "url": "https://www.zimeye.net/2025/06/19/cid-boss-bashed-at-jongwe-corner-bar/",
            "content": "By Crime and Courts Reporter Harare Regional Magistrate Clever Tsikwa has finedUS$300a man convicted of assaultingDetective Superintendent Alexander Jachi, the head of the Criminal Investigations Departments Homicide Division, in a violent attack that also saw the senior officer lose his service pistol and cash.\n\nThe incident occurred onSeptember 30, 2023, outsideJongwe Corner, a popular entertainment venue in Hatfield, Harare.\n\nThe court heard that Det Supt Jachi was driving his gold Toyota Fortuner from Highfield to his home in Chitungwiza when he noticed two suspicious vehicles  a silverVW Poloand a redHonda Fit tailing him.\n\nFearing he was under threat, Det Supt Jachi diverted to Jongwe Corner for safety. As he parked,Sydney RandeandMunyaradzi Chatonzwaexited one of the trailing vehicles and aggressively approached him.\n\nWhen confronted, the detective fired awarning shot into the airwith his9mm Taurus service pistolin an attempt to disperse the group. However, Chatonzwa continued advancing. Det Supt Jachi then shot him once in the left leg, but the assailant persisted and struck the officer with an unidentified object, knocking him to the ground.\n\nThe assault escalated as more attackers joined in, rendering the senior detective unconscious and bleeding. Bystanders who attempted to assist were also reportedly attacked.\n\nDuring the melee, the assailants searched Det Supt Jachi and stolehis wallet containing US$140, personal identification cards, and hisstate-issued service pistol. They also deflated the tyres of his vehicle before fleeing the scene.\n\nIn court, onlySydney Randewas convicted and fined US$300 after his initial 12-month prison sentence was wholly suspended upon payment. His co-accused Munyaradzi Chatonzwa, Mark Tatenda Chingombe, and Simbarashe Steven Ota were acquitted due to lack of evidence linking them directly to the assault.\n\nWhile Det Supt Jachis wallet and ID cards were later recovered from Chatonzwa,the service pistol remains missing, raising serious concerns about the weapons whereabouts and potential misuse.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Harare Regional Magistrate Clever Tsikwa has fined US$300 a man convicted of assaulting Detective Superintendent Alexander Jachi, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/cid-boss-bashed-at-jongwe-corner-bar/\">Continue reading<span class=\"screen-reader-text\"> \"CID Boss Bashed at Jongwe Corner Bar\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "Mudzingwa Announces “Totoputitsa Mari!” to Chop Nyokayemabhunu’s Money While he Languishes in Prison",
            "url": "https://www.zimeye.net/2025/06/19/mudzingwa-announces-totoputitsa-mari-to-chop-nyokayemabhunus-money-while-he-languishes-in-prison/",
            "content": "Mudzingwa announces totoputitsa mari! to chop Nyokayemabhunus money while he languishes in prison.\n\nIn these leaked audios, the jailed South Africa based ZANU PF activist Wellington Masiwa (popularly known as Nyokayemabhunu), is discussed by a group comprising his colleagues.\n\nOne of the men James Mudzingwa speaks saying\n\nCoach her what to say, if youre online. Coach her- va tshune, kana uri online.\n\nShe doesnt have a passport, organise it so she comes to over see her siblings court case-\n\nThe sister is there is she not, we will just coach her in advance.\n\nCoach her up in the group. But I must not be known. I will just cover up everything else, and just say Sister, and then we just throw the account details. And then we chop money!\n\nLater on, in another audio message Mudzingwa sends a new clip to plead while accusing the activists sisters. He says:\n\nChildren of Zimbabwe dont be shocked by these audios. They were circulated by Nyokayemabhunus sisters, while working together with Gambakwe.\n\nThe sisters are the ones circulating these audios. You sisters are the ones circulating these audios. You are now accusing me, when Inalso lost my own money. You will have to give me my money. You must return our money.\n\nRight now youre not talking with your in law Wellington Masiwas wife. The money is being chopped by the sister whos consuming the money together with Gambakwe.\n\nYou are the ones who came to me saying Mudzingwa get involved. You had no money when we started this. Saruwaka and others came only later. We want our money from you-Nyokayemabhunus sister. We want our money, and now youre calling Gambakwe. May you be cursed. We want our money which you chopped. We had our group when you and Saruwaka teamed up together. We are refusing Gambakwes lawyers. The money you chopped in Zimbabwe- you are selling your own brother to Gambakwe. Saruwaka is working with a Chigananda. Gambakwe is a Chigananda. We slant our money from you Nyokayemabhunus sister. We dont want Gambakwes lawyers. I dont have a problem with Saruwaka. I have a problem with Gambakwes lawyers. The audios youre circulating accusing me of chopping money, of course I dont deny them, it is my voice, and thrrr is nothing wrong with me demanding my money. You shall get your sibling killed, you are just shitty people.  Mudzingwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mudzingwa announces “totoputitsa mari!” to chop Nyokayemabhunu’s money while he languishes in prison. In these leaked audios, the jailed South … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/mudzingwa-announces-totoputitsa-mari-to-chop-nyokayemabhunus-money-while-he-languishes-in-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Mudzingwa Announces “Totoputitsa Mari!” to Chop Nyokayemabhunu’s Money While he Languishes in Prison\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "Mujuru Ally David Chapfika Dies in Mysterious Crash",
            "url": "https://www.zimeye.net/2025/06/19/mujuru-ally-david-chapfika-dies-in-mysterious-crash/",
            "content": "By A Correspondent Former Deputy Minister of Finance and long-serving ZANU PF legislator for Mutoko,David Chapfika, died under suspicious circumstances on Thursday morning after his vehicle collided with another car and plunged off a bridge into a waterlogged riverbed, raising questions about the cause of the crash.\n\nThe accident occurred near theMubvinzi River Bridge (Stondon), approximately 30 kilometres north of Harare and about six kilometres past the old Mutoko Road tollgate.\n\nAccording to early reports, ChapfikasMercedes Benz MLcollided with an oncoming vehicle before veering off the bridge and crashing into the river below.\n\nChapfika, aged 68, was a respected veteran of both Zimbabwes banking sector and political landscape.\n\nAlthough best known in recent years for his parliamentary and ministerial roles, he began his career as a banker, working for Barclays Bank before independence, and later for institutions such as First Merchant Bank (now BancABC), ZB Bank, and CalBank in Ghana.\n\nHe also foundedUniversal Merchant Bank (UniBank), which later collapsed in 2002, slightly tarnishing his legacy in finance.\n\nAs a politician, Chapfika representedMutoko North, Mutoko South, and Mutoko Eastat different times and held senior positions in government.\n\nHe served asDeputy Minister of Finance, laterDeputy Minister of Agriculture, chaired theFinance Committee in Parliament, and became thefirst chairman of the National Indigenisation and Economic Empowerment Board.\n\nHe was also a member of the powerfulRules and Orders Committee.Chapfikas death has raised alarm among some of his associates and observers, particularly because of his historical ties to the lateGeneral Solomon Mujuruand his widowJoice Mujuru.\n\nDuring the height of ZANU PFs factional wars in the late 2000s and early 2010s, Chapfika was aligned with the Mujuru-led faction, which sought to challenge then-Vice PresidentEmmerson Mnangagwasascendancy.\n\nFollowing Joice Mujurus ouster at the 2014 ZANU PF Congressengineered by Mnangagwas factionChapfika was sidelined from active politics.\n\nThough he did not publicly campaign for Joice Mujurus post-ZANU PF political ventures, he withdrew into private life and was known to frequent theSAPES Trustin Harare, led by academic and Mnangagwa criticProfessor Ibbo Mandaza.\n\nFriends say he would often join Mandaza and other government critics for informal political discussions over Friday lunches.\n\nSources close to Chapfika say that in recent years, he had become increasingly vocal about his disappointment with Mnangagwas leadership, especially regarding deepening corruption, economic mismanagement, and political repression.\n\nHis growing proximity to critics of the regime has fueled speculation that his fatal car crash may not have been entirely accidental.\n\nThe mysterious circumstances surrounding Chapfikas death have inevitably drawn parallels with thecontroversial death of General Solomon Mujuru, who perished in a suspicious house fire at his Beatrice farm in 2011.\n\nAlthough officially ruled an accident, Mujurus death has long been viewed by many Zimbabweans as an assassination linked to internal power struggles in ZANU PF.\n\nHis widow, Joice Mujuru, later accused some within the ruling party of orchestrating her husbands killing to clear the path for Mnangagwas rise.\n\nCompounding the unease, Chapfikas younger brother, prominent businessman and music promoterMacDonald Chapfika, also died under questionable circumstances in2019, collapsing outside theMunhumutapa Buildingwhich houses the Presidents officesshortly after a meeting with top government officials over a maize import deal. He was 57.\n\nWhile official government channels have attributed David Chapfikas death to a road traffic accident, his sudden demise amid renewed political tension has left many unconvinced.\n\nZimbabweans online have begun to ask whether another prominent figure linked to the Mujuru faction has met a violent end in a political climate where dissenteven if subtleremains dangerous.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former Deputy Minister of Finance and long-serving ZANU PF legislator for Mutoko, David Chapfika, died under suspicious circumstances … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/mujuru-ally-david-chapfika-dies-in-mysterious-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Mujuru Ally David Chapfika Dies in Mysterious Crash\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "Court Dismisses Fraud Accused Businessman Michael Gordon Smith’s Bid for Discharge",
            "url": "https://www.zimeye.net/2025/06/19/court-dismisses-fraud-accused-businessman-michael-gordon-smiths-bid-for-discharge/",
            "content": "By A Correspondent| A Harare magistrate has thrown out an application for discharge filed by embattled businessman Michael Gordon Smith, who is on trial for allegedly defrauding MA Auto Suppliers of over US\\$60,000 and R124,000.\n\nSmith had sought to be cleared at the close of the States case, arguing that prosecutors had failed to present sufficient evidence to justify a trial. His lawyer, Takudzwa Nyambira, filed the application in May after several witnesses had testified and the State, led by prosecutor Anesu Chirenje, closed its case.\n\nHowever, Magistrate Ethel Chichera ruled on Tuesday that the prosecution had established a prima facie case against Smith and that the trial must proceed.\n\nSmith faces a slew of charges12 counts of fraud, 25 counts of concealing transactions from his principal, and two counts of theft of trust property.\n\nSmith is accused of orchestrating a series of fraudulent activities while employed by MA Auto Suppliers. Among the key allegations is that he, in collusion with a South Africa-based accomplice, Tony Oatleynow on the runchanneled company payments through a third-party company, Mant Procurement (Pvt) Ltd, which he co-owned.\n\nCompany director Mike Asher, who testified in court, said that after leaving for Australia in 2019 due to COVID-19 lockdowns, he returned to find that Smith had been using Mant Procurement to pay South African suppliersan arrangement never disclosed to him or the companys Finance Manager, Christine Vellah.\n\nInvestigations revealed that Mant Procurement overcharged MA Auto, resulting in financial prejudice exceeding R100,000.\n\nSmith is also alleged to have used company resources to import goods for personal gain. In one instance, he reportedly sold two imported tents for US\\$1,800, with payment deposited into his offshore account in the Isle of Man. The funds were never recovered.\n\nIn another case, Smith allegedly sold a Toyota Land Cruiser 78 series for US\\$13,000 but only accounted for US\\$5,500 in company records, pocketing the remaining US\\$7,500. He also sold another company vehicle, previously given to his son, for US\\$7,500 without remitting any proceeds.\n\nVellah testified that Smith obstructed accurate record-keeping by failing to submit complete financial data. She said company resources were used to cover personal expenses, including vehicle repairs for Smiths children, which were offset against a personal loan.\n\nShe also accused Smith of arranging barter deals with clients, receiving luxury accommodation instead of cash payments, and inflating transportation costs to cover personal debts.\n\nThe finance manager said Smith took a US\\$10,000 loan from Cruiser Bond (Pvt) Ltd without informing the company, which ended up repaying it without knowing how the funds were used. She also detailed how Smith instructed her to pay ZW\\$295,200 in fees for a jointly owned boat when the companys share was only ZW\\$88,250an excess he never repaid.\n\nSmith also allegedly took company property including chairs worth R5,000 and a 95-liter fridge, all of which remain unreturned.\n\nState witness and IT expert Takudzwa Honye told the court that he downloaded email data from MA Autos Microsoft account and printed emails at the request of the company. He validated the evidence in the presence of Vellah, Asher, and CID Commercial Crimes Division detective assistant inspector Samaneka.\n\nAnother witness, Anthony Norman Bown, testified that Smith instructed him to pay R77,122 for vehicle parts into the Mant Procurement FNB account instead of the official company account. Bown said he collected the ordered parts from MA Auto after being contacted by Smith.\n\nSmith is expected to take the stand to defend himself against the mounting allegations. The case continues.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A Harare magistrate has thrown out an application for discharge filed by embattled businessman Michael Gordon Smith, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/court-dismisses-fraud-accused-businessman-michael-gordon-smiths-bid-for-discharge/\">Continue reading<span class=\"screen-reader-text\"> \"Court Dismisses Fraud Accused Businessman Michael Gordon Smith’s Bid for Discharge\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "President Hichilema Speech On Lungu Mourning Period",
            "url": "https://www.zimeye.net/2025/06/19/president-hichilema-speech-on-lungu-mourning-period/",
            "content": "Fellow citizens, as we mark the 14th day since the demise of our sixth Republican President, Mister Edgar Chagwa Lungu, we reflect on the past two weeks, not only as a period of mourning, but a time for healing and indeed a test of our resolve as a peace, loving and law abiding nation.\n\nWe wish to begin by expressing our gratitude to the church, our traditional leaders and the citizenry for their moral and spiritual guidance during this difficult time. We also wish to thank our envoys, including our former vice president, Mister Enock Kavindele, His Royal Highness, Chief Mumbi, our Foreign Affairs Minister, the secretary to the cabinet and all others involved in the search for a reasonable, inclusive, unamicable resolution over the unfortunate impasse relating to the state funeral, we express sincere gratitude to President Cyril Ramaphosa and the people of South Africa for their exceptional cooperation and indeed, compassion. We acknowledge those citizens, including business owners, whose operations have been affected during this difficult time. We thank you for your resilience, patience, solidarity and calmness during this time. As you are all aware, our government has made numerous efforts to engage the family and representatives of the late president in order to reach consensus in this matter, by last Sunday, the 15th of June, a mutual understanding was achieved and expressed through the joint press briefing held in South Africa. This breakthrough brought relief to the nation, and we were prepared to receive the remains of the late sixth Republican president on Wednesday 18th of June. It was agreed that this was to be followed by programs that would have culminated in a dignified burial on Monday the 23rd of June. By virtue of this positive development, we extended the mourning period by another nine days, and we began to fulfill all of our commitments towards the state funeral with full owners yesterday, yesterday, June 18, the people of Zambia were prepared to receive the remains of our former president, but we are surprised by the familys reversal of the agreed cause of action at our request, the South African government prepared extensively with military owners mounted by the South African Defense Forces, who did so in vain, as the former president body was not about by the family for repatriation to Zambia.\n\nFor this unfortunate situation, we extend our sincere apologies to President Ramaphosa, the government and the people of South Africa, fellow citizens, our country cannot afford a state of indefinite m. Weve done everything possible to engage the family of our departed sixth Republican president, and weve reached a point where a clear decision had to be made, Given these circumstances, I therefore wish to inform the nation that the as of the end of today, the 19th of June, 2025, this particular national mourning period is officially over. This will allow the country to begin to return to some normalcy. Mister Lungu was not only an ordinary citizen, but our sixth Republican president. While we recognize that he belongs to a family, he also belongs to the nation of Zambia, it is therefore correct that our sixth Republican president should be buried in Zambia with full honors, and not in any other nation. In the meantime, we urge our citizens to maintain calm and orderliness, as we have stated before. During this difficult time, no amount of lawlessness will be tolerated. Let us remain united as a nation and maintain the peace we are known for. In this spirit, we say to the Lungu family and indeed the people of Zambia, our hearts remain with you. Our doors as government remain open for further engagement as appropriate. May the soul over a departed, former Republican President, Mister Edgar chavolongo Resting eternal peace. May God bless you all. May God bless, Zambia, I thank you.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Fellow citizens, as we mark the 14th day since the demise of our sixth Republican President, Mister Edgar Chagwa Lungu, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/president-hichilema-speech-on-lungu-mourning-period/\">Continue reading<span class=\"screen-reader-text\"> \"President Hichilema Speech On Lungu Mourning Period\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "Geremi Njitap Slapped with Five-Year Ban by Cameroon FA",
            "url": "https://www.zimeye.net/2025/06/19/geremi-njitap-slapped-with-five-year-ban-by-cameroon-fa/",
            "content": "Sports Correspondent\n\nFormer Cameroon international, ex-Chelsea, and former Real Madrid midfielder Geremi Njitap has been banned from all football-related activities for five years following a disciplinary dispute with a Cameroon Football Association (FECAFOOT) official.\n\nNjitap, who currently serves as president of the Cameroon National Footballers Union (Synafoc), was allegedly involved in a heated altercation inside the Indomitable Lions dressing room during the 2023 Africa Cup of Nations tournament in Cte dIvoire.\n\nThe disciplinary action was handed down after a hearing by FECAFOOTs Ethics Committee, chaired by none other than Njitaps former national teammate, Samuel Etoo, who now serves as FECAFOOT President.\n\nIn a statement released by the committee, the ruling read:\n\nWe declare Geremi Sorel Njitap, president of Synafoc, guilty of violating the behavioral rules of our code of ethics. We sentence him to a five-year ban from all football-related activities and impose a fine of ten million West African CFA francs [approximately $17,500].\n\nNjitap, a veteran of multiple World Cup and AFCON campaigns, has ten days to file a written appeal against the decision.\n\nWhile full details of the incident have not been made public, insiders say tensions flared over player welfare issues, with Njitap allegedly confronting officials over poor conditions and mismanagement.\n\nThe ruling has sent shockwaves through the Cameroonian football community, with some viewing the punishment as excessively harsh, especially given Njitaps longstanding advocacy for player rights.\n\nOne Synafoc member, speaking anonymously, said:\n\nGeremi stood up for the players. He may have gone about it the wrong way, but banning him for five years feels like an attempt to silence dissent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Cameroon international, ex-Chelsea, and former Real Madrid midfielder Geremi Njitap has been banned from all football-related activities … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/geremi-njitap-slapped-with-five-year-ban-by-cameroon-fa/\">Continue reading<span class=\"screen-reader-text\"> \"Geremi Njitap Slapped with Five-Year Ban by Cameroon FA\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "Chamisa Meets Nkosana Moyo",
            "url": "https://www.zimeye.net/2025/06/19/chamisa-meets-nkosana-moyo/",
            "content": "By A Correspondent| Former Citizens Coalition for Change (CCC) leader Nelson Chamisa has confirmed a meeting with former Cabinet Minister and 2018 presidential candidate Dr Nkosana Moyo in Harare, as he continues to engage with key political stakeholders across the country.\n\nPosting on his official X (formerly Twitter) account, Chamisa shared a photograph of himself alongside Dr Moyo, accompanied by a brief caption:\n\nOSMOSIS OF IDEASSharing perspectives and insights with @DrNkosana Moyo at an event in Harare. A New Great Zimbabwe is our collective aspiration and generational desire! #OnePeople.\n\nWhile Chamisa did not disclose the purpose or outcome of the meeting, ZimEye understands that the details of their discussion remain unknown.\n\nThe meeting comes at a time when Chamisa is reportedly consulting widely with various political and civic actors, following his decision to resign from the CCC in January 2024, citing alleged infiltration and loss of the partys original vision.\n\nIn recent weeks, Chamisa has hinted that he is in the final stages of launching a new political movement aimed at delivering what he terms a New Great Zimbabwe, though he has yet to reveal its name or structure.\n\nDr Nkosana Moyo, a former Industry and International Trade Minister, is known for his technocratic approach to politics and previously ran for president under the Alliance for the Peoples Agenda (APA) in the 2018 elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Former Citizens Coalition for Change (CCC) leader Nelson Chamisa has confirmed a meeting with former Cabinet Minister … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/chamisa-meets-nkosana-moyo/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Meets Nkosana Moyo\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "DeMbare Downfall Continues",
            "url": "https://www.zimeye.net/2025/06/19/dembare-downfall-continues/",
            "content": "Sports Correspondent\n\nThe problems tormenting Harare football giants Dynamos FC continue to mount as fresh reports reveal deepening financial troubles and organizational chaos within the club.\n\nOn Wednesday evening, around 18:00, several Dynamos players were seen loitering outside Rufaro Stadiumat a time they were expected to be in full camp ahead of their crucial Castle Lager Premier Soccer League fixture against Yadah.\n\nSources close to the club disclosed that the Glamour Boys, once Zimbabwes most feared football institution, failed to raise the $1,200 needed to secure accommodation for their traditional pre-match camp.\n\nIts embarrassing. The players didnt even know what was going on. They had no place to go, and no communication from the club officials. Imagine, Dynamosof all clubsfailing to secure basic logistics, said a source familiar with the situation.\n\nThis is just the latest sign of turmoil at DeMbare, whose form on the pitch has been as uninspiring as its affairs off it. Once a powerhouse of Zimbabwean football, the club now appears to be in freefall, both financially and competitively.\n\nThe teams inconsistent performances have sparked unrest among fans, with many blaming poor administration and lack of financial planning. Some supporters have called for a complete overhaul of the clubs management.\n\nThis is no longer the Dynamos we grew up supporting. Theres no pride, no structure, and clearly no money, lamented one longtime fan outside the stadium.\n\nWith key league fixtures ahead and morale among players reportedly low, questions are mounting about how long the club can continue to operate under such strainand what the future holds for a team that once ruled Zimbabwean football.\n\nAs the Castle Lager Premier Soccer League season intensifies, all eyes will be on Dynamosnot just for results on the field, but for signs of whether the club can recover from this growing crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The problems tormenting Harare football giants Dynamos FC continue to mount as fresh reports reveal deepening financial troubles … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/dembare-downfall-continues/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Downfall Continues\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "Tatenda Mavetera Slams Same S*x Marriages: Watch",
            "url": "https://www.zimeye.net/2025/06/19/tatenda-mavetera-slams-same-sx-marriages-watch/",
            "content": "By A Correspondent\n\nZimbabwes Minister of ICT and Chikomba West MP, Tatenda Mavetera, has publicly declared her opposition to same-sex marriages, stating they have no place in the countrys cultural or legal framework.\n\nIn a video circulating online, Mavetera says: As Zimbabweans, we are guided by our values, our culture, and our Constitution. Same-sx marriages are not part of who we are.\n\nZimbabwes Constitution explicitly outlaws same-sx marriage, and politicians have historically used the issue to rally conservative support.\n\nWATCH | Zimbabwe's Minister of ICT, Tatenda Mavetera, says there is no place for same-sx marriages in the country.TechMagpic.twitter.com/Ll10iha6CP\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s Minister of ICT and Chikomba West MP, Tatenda Mavetera, has publicly declared her opposition to same-sex … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/tatenda-mavetera-slams-same-sx-marriages-watch/\">Continue reading<span class=\"screen-reader-text\"> \"Tatenda Mavetera Slams Same S*x Marriages: Watch\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        },
        {
            "title": "Mossad Cyber Attack Escalates Israel-Iran Conflict as War Enters New Phase",
            "url": "https://www.zimeye.net/2025/06/19/mossad-cyber-attack-escalates-israel-iran-conflict-as-war-enters-new-phase/",
            "content": "By A Correspondent\n\nIn an extraordinary development amid the escalating conflict between Israel and Iran, multiple reports suggest that Mossad, Israels intelligence agency, has taken control of Iranian state television networks.\n\nThe alleged cyber operation is reportedly broadcasting pro-democracy content across all major TV channels in Iran, encouraging citizens to envision and fight for a free Iran.\n\nAccording to sources on the ground and unverified footage circulating online, Iranian viewers were stunned to see regular programming abruptly replaced by anti-regime messaging, video montages of past uprisings, and digital renderings of what a democratic, secular Iran might look like. The content also included direct appeals for civil disobedience and resistance against the ruling clerics.\n\nImagine a nation where women are free, elections are fair, and the government serves its peoplenot its own power, a voiceover said in one clip, according to translated footage shared on social media.\n\nCyber Warfare in the Age of Conflict\n\nIf confirmed, this would represent one of the most audacious uses of cyberwarfare by an intelligence agency in recent memoryan operation aimed not at disabling systems, but at shaping public sentiment from within a hostile state.\n\nTehran has not yet issued an official statement regarding the alleged broadcast hijack, though internet disruptions and signal scrambling were reported in several cities, suggesting attempts by the regime to regain control.\n\nThe move comes as the Israel-Iran conflict enters its seventh day, with both nations trading military strikes. The Israeli military has confirmed targeting infrastructure in Tehran, while Iran claims to have launched ballistic missiles toward Israeli territory.\n\nGlobal Stakes\n\nMeanwhile, global powers are on edge. In Washington, President Donald Trump held a high-level Situation Room meeting on Wednesday to weigh Americas next steps. Despite earlier declaring his patience with Iran had already run out, Trump has so far refrained from committing U.S. forces to the conflict.\n\nSources close to the administration say the president is deeply conflicted. On one hand, he is under pressure from allies, including Israel, to neutralize Irans nuclear capabilities. On the other, Trump remains wary of entangling the U.S. in another prolonged Middle Eastern conflictespecially one that could spiral into a regional war.\n\nIran must understand that any miscalculation will be met with overwhelming force, Trump warned earlier this week, though he also reiterated, We do not seek war.\n\nTehrans Defiance\n\nIn response to rising tensions, Irans Supreme Leader Ayatollah Ali Khamenei delivered a televised address of his own, vowing defiance. We will not surrender, he said. Any American intervention will result in irreparable damagenot just to Iran, but to the entire region.\n\nStill, the psychological warfare now being waged on Iranian soilpotentially by foreign handsmay represent a new front in the conflict, one aimed at breaking the regimes grip from within.\n\nAs reports continue to develop, one thing is clear: the battle for Iran is no longer just on the battlefieldits on the airwaves, too.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In an extraordinary development amid the escalating conflict between Israel and Iran, multiple reports suggest that Mossad, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/19/mossad-cyber-attack-escalates-israel-iran-conflict-as-war-enters-new-phase/\">Continue reading<span class=\"screen-reader-text\"> \"Mossad Cyber Attack Escalates Israel-Iran Conflict as War Enters New Phase\"</span></a></p>",
            "time": "21:29",
            "date": "20 Jun 2025"
        }
    ]
}