{
    "news": [
        {
            "title": "War Vets In Fierce Anti-Mnangagwa Push",
            "url": "https://www.zimeye.net/2025/03/01/war-vets-in-fierce-anti-mnangagwa-push/",
            "content": "By James Gwati- A faction of disgruntled former liberation war fighters has escalated its campaign demanding President EmmersonMnangagwasresignation, intensifying internal divisions within the ruling Zanu PF party.\n\nDespite Mnangagwa having more than three years remaining in his second and final term, the war veterans insist his departure is necessary to resolve thecountryspolitical and economic crises.\n\nAt a press conference in Harare on Friday, thefactionsleader, Andreas Mathibela, stated that consultations with Zimbabwean citizens had reaffirmed the need for Mnangagwa to step down.\n\nMaybe our presser today is the last. We want to address the elephant in the room as quickly as possible. It may be in a week or two, the pressure will be on,Mathibela declared.\n\nHe emphasized that the warveteransassociation fully backed their frontman, Geza, describing him asour rabble-rouserand reiterating their determination to hold the government accountable.\n\nSo obviously, the government is not serious about addressing the crisis ithas created itself. As citizens of this country, we ask: What is the root cause? Then we deal with the root cause,Mathibela said.\n\nHe further argued that, just as during the liberation struggle, the veterans were engaging with traditional leaders, spirit mediums, and the masses, all of whom were urging them to take decisive action.\n\nWe were quiet while all these other noise makers were trying to be relevant. Guess what? We were busy consulting. Just like during the liberation struggle, we were working with the masses, with the chiefs, with the mass media, and with the spirit mediums. They have told us that all veterans must sort this government out.\n\nMathibela claimed that Zimbabweans had given them a mandate to lead an offensive demandingMnangagwasresignation.\n\nThe nation, which is suffocating under this crisis, has said,We will go with you veterans every step of the way.They have told us, in no uncertain terms, that this time around, we must lead the onslaught, where the President of the Republic of Zimbabwe must step down immediately. We are in agreement, and we have reasons we can explain throughout the night until morning.\n\nThe latest push by war veterans reflects deeper factional tensions that have plagued ZANU PF for decades.\n\nThe party has remained fractured since the removal of former President Robert Mugabe in the 2017 coup, whichwas orchestratedbyMnangagwasLacoste faction with significant backing from the military.\n\nHowever, once in power,Mnangagwasadministration has been marred by growing discontent within the rulingpartysstructures, particularly among war veterans and security elites who feel sidelined.\n\nThe latest developments are reminiscent of past factional wars, including the bitter rivalry between Mnangagwa and former First Lady GraceMugabesG40 faction, which sought to block his rise to power.\n\nWhile Mnangagwa initially consolidated control afterMugabesouster, signs of discontent within the security establishment and party stalwarts have been growing.\n\nVice President Constantino Chiwenga, the former military commander who played a pivotal role inMnangagwasascent, has been at thecenterof speculation regarding a possible leadership challenge.\n\nReports suggest that Chiwenga and his allies within the military and warveteransranks are growing increasingly frustrated withMnangagwasgovernance and failure to manage thecountrysworsening economic situation.\n\nThe ongoing warveteransrebellion could signal a broader realignment of power within ZANU PF, with Mnangagwa facing mounting pressure from various factions.\n\nThe discontent within the partyis further exacerbatedby accusations of corruption, economic mismanagement, and failure to honour promises made to key constituencies, including war veterans.\n\nMathibela also dismissed the recent announcement by Paul Tungwarara, an investment advisor to Mnangagwa, offering war veterans US$1.5 million and housing benefits.\n\nThe faction leader ridiculed the promises, referring to the proposed houses asTungwararasand questioning why only war veterans werebeing targetedwhile other groups that contributed toMnangagwasrise were left out.\n\nWhy should only war veterans benefit? What about the ordinary citizens who fought alongside us to bring this government into power? This is another desperate attempt to buy loyalty, but we see through it,Mathibela scoffed.\n\nThe rejection ofMnangagwasovertures suggests that the faction is determined to pursue its agenda, adding another layer of complexity toZimbabwesalreadyvolatile political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati- A faction of disgruntled former liberation war fighters has escalated its campaign demanding President Emmerson Mnangagwa’s resignation, intensifying internal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/war-vets-in-fierce-anti-mnangagwa-push/\">Continue reading<span class=\"screen-reader-text\"> \"War Vets In Fierce Anti-Mnangagwa Push\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "UK-Based Zim Journalists Unite To Lay Colleague To Rest In London",
            "url": "https://www.zimeye.net/2025/03/01/uk-based-zim-journalists-unite-to-lay-colleague-to-rest-in-london/",
            "content": "By MunachoGwamanada-Ina profound display of unity and solidarity, Zimbabwean journalistsbasedin the United Kingdom came together on Thursday to bid farewell to veteran journalist and long-serving BBC World Service correspondent Lewis Machipisa.\n\nMachipisa, a respected figure in Zimbabwean journalism, passed away in his sleep at his home in Catford, Southeast London, on January 7, 2025. He was 52.\n\nHis funeral became more than just a moment of grief; it was a testament to the deep bonds that exist within the Zimbabwean media fraternity, particularly among those in the diaspora. Journalists, former colleagues, and close friends gathered alongside his family to honor a man widely regarded as a mentor, a friend, and an unwavering voice for truth.\n\nMachipisas journey in journalism began in 1991 at the Harare Polytechnics School of Journalism.\n\nHis passion for storytelling and relentless pursuit of truth quickly propelled him into the field.\n\nIn 1993, he joined Inter Press Service (IPS) in Harare, where his incisive reporting on human rights, governance, and social justice set him apart.\n\nHis work amplified the voices of marginalized communities and held power to account, earning him recognitionbothlocally and internationally.\n\nIt wasthis fearless dedication to journalismthatled him to the BBC World Service, where he became a key figure in reporting on Zimbabwes political and economic developments during a time of increasing state restrictions on the media.\n\nIn the early 2000s, as Zimbabwes political climate became more repressive, Machipisa relocated to London, joining many exiled Zimbabwean journalists who continued to tell their countrys story from afar.\n\nAt the BBC, he remained committed to covering Southern African affairs with depth and integrity, his nuanced analysesmakinghim a trusted voice on Zimbabwean issues.\n\nBeyond his professional accomplishments, Machipisawas deeply admiredfor his humility, generosity, and willingness to guide young journalists.\n\nDespite his high-profile career, he remained approachable and grounded, always ready to support those around him.\n\nHe played an instrumental role in initiativesaimed at empowering Zimbabwean journalists and advocatingfor press freedom, ensuring that the next generation of reporters carried forward his legacy of fearless journalism.\n\nHis funeral reflected the resilience and fraternity of Zimbabwean journalists in exile.\n\nThe gathering of media professionals, many of whom had once shared newsrooms with him orbeen inspiredby his work, underscored the enduring sense of community among Zimbabwean reporters, no matter where they arein the world.\n\nRest in peace, Lewis Machipisa. Though your voiceis silenced, your legacy lives on.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanada-In a profound display of unity and solidarity, Zimbabwean journalists based in the United Kingdom came together on Thursday to bid farewell … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/uk-based-zim-journalists-unite-to-lay-colleague-to-rest-in-london/\">Continue reading<span class=\"screen-reader-text\"> \"UK-Based Zim Journalists Unite To Lay Colleague To Rest In London\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "Surviving 6 Days Underground",
            "url": "https://www.zimeye.net/2025/03/01/surviving-6-days-underground/",
            "content": "Surviving Mine Entrapments: An Analysis of Recent Incidents\n\nThe recent rescue of five miners who endured six days trapped in a Filabusi mine shaft in Matabeleland South Province brings to light the precarious nature of underground mining and the factors influencing survival during such entrapments. While these miners survival is commendable, a review of similar incidents over the past two decades reveals that outcomes vary significantly based on circumstances, response times, and available resources.\n\nNotable Survival Stories\n\nOne of the most remarkable cases is the 2010 Copiap mining accident in Chile, where 33 miners were trapped approximately 700 meters underground for 69 days following a mine collapse. Their survival was attributed to their ability to ration limited resources, maintain group cohesion, and the extensive international rescue operation that ensued. The miners were eventually rescued through a meticulously drilled escape shaft, highlighting the effectiveness of coordinated rescue efforts.\n\nSimilarly, in 2002, nine miners in Pennsylvania, USA, were rescued after being trapped for 77 hours due to accidental flooding in the Quecreek Mine. The successful rescue was facilitated by prompt response, accurate information about the miners location, and the use of specialized drilling equipment to reach the trapped individuals.\n\nTragic Outcomes\n\nConversely, not all entrapments have concluded with successful rescues. In January 2025, at least 400 illegal miners remained trapped underground in South Africa two months after a police raid, with footage revealing dozens of dead bodies and emaciated survivors. The prolonged entrapment, lack of immediate rescue efforts, and the illegal nature of the mining operations contributed to the high fatality rate.\n\nIn another incident in 2019, five illegal miners perished when a tunnel collapsed at Nugget Gold Mine in Matobo, Zimbabwe. The absence of formal rescue operations and the hazardous conditions of illegal mining sites often result in fatal outcomes during such emergencies.\n\nFactors Influencing Survival\n\nThe disparity in outcomes of mine entrapments can be attributed to several critical factors:\n\n1. Immediate Response and Rescue Operations: Timely notification of authorities and the initiation of rescue missions are paramount. Delays, as seen in the Filabusi incident where the mine owner allegedly failed to report the entrapment promptly, can severely diminish survival prospects.\n\n2. Access to Sustenance: Survival duration is heavily influenced by the availability of food and water. In Filabusi, the trapped miners received mahewu, a traditional beverage, which sustained them until their rescue.\n\n3. Environmental Conditions: Factors such as air quality, temperature, and the risk of flooding play significant roles. In the Quecreek incident, rising water levels posed an immediate threat, necessitating swift action.\n\n4. Legal and Operational Status of the Mine: Licensed and regulated mining operations are more likely to have safety protocols and emergency response plans. In contrast, illegal mining sites often lack basic safety measures, and entrapments in such settings frequently result in higher mortality rates.\n\nConclusion\n\nSurvival in mine entrapments is contingent upon a combination of prompt rescue efforts, environmental factors, and the initial response to the incident. The Filabusi miners ordeal underscores the necessity for stringent safety regulations, immediate reporting of accidents, and the implementation of effective emergency response strategies to enhance survival outcomes in future incidents.- Agencies\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Surviving Mine Entrapments: An Analysis of Recent Incidents The recent rescue of five miners who endured six days trapped in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/surviving-6-days-underground/\">Continue reading<span class=\"screen-reader-text\"> \"Surviving 6 Days Underground\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "15 Years In Prison For Attempting To Smuggle Drugs",
            "url": "https://www.zimeye.net/2025/03/01/15-years-in-prison-for-attempting-to-smuggle-drugs/",
            "content": "By A Correspondent\n\nA 27-year-old Latvian man, Vitalis Kudrjasovs, has been sentenced to 15 years in prison after attempting to smuggle 8.35 kilograms of heroin through Robert Gabriel Mugabe International Airport.\n\nThe court was informed that in September 2022, Kudrjasovs arrived at the airport, cleared all customs procedures, and checked in his luggage for baggage screening. However, airport security flagged his luggage after suspicious items were detected during a ground scan.\n\nUpon further inspection, four packages containing heroin were found hidden in compartments of the luggage. In addition to his 15-year sentence, Kudrjasovs was fined US$5,000. Should he fail to pay the fine, he will face an additional five years in prison.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 27-year-old Latvian man, Vitalis Kudrjasovs, has been sentenced to 15 years in prison after attempting to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/15-years-in-prison-for-attempting-to-smuggle-drugs/\">Continue reading<span class=\"screen-reader-text\"> \"15 Years In Prison For Attempting To Smuggle Drugs\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "Is George Charamba Sincere Over Toll Fee for ZANU Cars?",
            "url": "https://www.zimeye.net/2025/03/01/is-george-charamba-sincere-over-toll-fee-for-zanu-cars/",
            "content": "Harare, Zimbabwe  March 1, 2025\n\nPresidential Spokesperson George Charamba recently issued a directive mandating that all Zanu PF vehicles comply with toll fee regulations, emphasizing that no entity, including government departments and the Office of the President, is exempt from paying toll fees. Charamba stated that government departments make annual payments to the Zimbabwe National Road Administration (ZINARA) and receive certificates confirming this arrangement.\n\nIs George Charamba Sincere Over Toll Fee for ZANU Cars?\n\nHowever, this directive has sparked a national conversation about the enforcement of ethical standards within the party, particularly concerning Charambas own adherence to these regulations. Critics point out a lack of transparency regarding whether Charamba has publicly demonstrated his compliance with the toll fee requirements, leading to questions about the practicability and sincerity of his directive.\n\nThis situation highlights a broader issue in the political landscape, where calls for ethical conduct are often undermined by a lack of accountability and transparency among leadership. The effectiveness of Charambas directive may be compromised if leaders do not lead by example, potentially perpetuating a culture of impunity.\n\nThe incident also suggests systemic challenges in enforcing ethical standards within political parties and government institutions. Without mechanisms for public accountability and transparency, directives aimed at curbing misconduct may fail to produce meaningful change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, Zimbabwe – March 1, 2025 Presidential Spokesperson George Charamba recently issued a directive mandating that all Zanu PF vehicles … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/is-george-charamba-sincere-over-toll-fee-for-zanu-cars/\">Continue reading<span class=\"screen-reader-text\"> \"Is George Charamba Sincere Over Toll Fee for ZANU Cars?\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "20 Learners Collapse At Limpopo School",
            "url": "https://www.zimeye.net/2025/03/01/20-learners-collapse-at-limpopo-school/",
            "content": "By A Correspondent\n\nA bizarre incident unfolded at Rivubye High School in Limpopo, South Africa, as 20 learners suddenly collapsed amidst claims of evil spirit attacks. The mass hysteria event occurred yesterday morning, sending shockwaves through the community.\n\nAccording to reports, learners had been complaining about seeing and being attacked by evil spirits, which allegedly triggered the mass collapse. The situation drew a large crowd of local community members, who flocked to the school to witness the unusual event.\n\nThe incident has raised concerns about the well-being and safety of the learners, and an investigation into the matter is likely to follow. The cause of the mass hysteria remains unclear, but it is evident that the incident has left a lasting impact on the school community.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A bizarre incident unfolded at Rivubye High School in Limpopo, South Africa, as 20 learners suddenly collapsed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/20-learners-collapse-at-limpopo-school/\">Continue reading<span class=\"screen-reader-text\"> \"20 Learners Collapse At Limpopo School\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "Mum Watches Own Daughter Being Raped",
            "url": "https://www.zimeye.net/2025/03/01/mum-watches-own-daughter-being-raped/",
            "content": "Mutare Woman Sentenced to 10 Years for Facilitating Daughters Rape\n\nMutare, Zimbabwe  March 1, 2025\n\nA 43-year-old woman from Penhalonga has been sentenced to 10 years in prison by the Mutare Magistrates Court for facilitating the rape of her 6-year-old daughter in 2022. The shocking details of the case have left the community reeling, as the court heard how the mother played an active role in the abuse.\n\nAccording to court records, the woman assisted an unidentified adult male in raping her young daughter. The horrific incident occurred one afternoon shortly after the child returned home from school. The mother reportedly undressed the child while the man sat watching on the bed. She then instructed the child to lie down, allowing the man to carry out the assault while she sat nearby, observing from a chair in the bedroom.\n\nThe crime came to light in April 2024 when the child, now living with her grandmother, began showing signs of urinary incontinence. Concerned for the childs health, the grandmother sought medical attention, leading to the child revealing the traumatic abuse. During this time, the child disclosed the role her mother played in the incident, leading to the mothers arrest and subsequent conviction.\n\nThe sentencing has prompted widespread condemnation from child rights advocates and community leaders, who are calling for greater protection measures for vulnerable children. Meanwhile, authorities are still working to identify the male perpetrator, urging anyone with information to come forward.\n\nThis deeply disturbing case serves as a grim reminder of the dangers some children face within their own homes and underscores the importance of vigilance and intervention to protect innocent lives.\n\nFor support or to report cases of child abuse, community members are\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare Woman Sentenced to 10 Years for Facilitating Daughter’s Rape Mutare, Zimbabwe – March 1, 2025 A 43-year-old woman from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/mum-watches-own-daughter-being-raped/\">Continue reading<span class=\"screen-reader-text\"> \"Mum Watches Own Daughter Being Raped\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "Mnangagwa’s Liberation War Status Under Scrutiny",
            "url": "https://www.zimeye.net/2025/03/01/mnangagwas-liberation-war-status-under-scrutiny/",
            "content": "By A Correspondent\n\nWhile not explicitly naming Joshua Nkomo, Taurai Kandishayas recent comments imply that President Emmerson Mnangagwa is greater than iconic liberation war figures such as the late ZAPU leader, Nkomo. Kandishaya, the Deputy Political Commissar of the Zanu PF Youth League, made these bold statements about Mnangagwa on Thursday while emphasizing the Presidents pivotal role in Zimbabwes liberation struggle.\n\nVery fit and up to date. Ladies and gentlemen, I present to you President Emmerson Dambudzo Mnangagwa, the most senior and experienced veteran of the Struggle for total independence and sovereignty worldwide. He confronted imperialism, fought it, conquered it and collapsed it, Kandishaya declared, elevating Mnangagwas status as a central figure in Zimbabwes fight for independence.\n\nHowever, Kandishayas remarks have sparked controversy as they seem to diminish the contributions of other key liberation leaders such as Joshua Nkomo, Josiah Tongogara, Ndabaningi Sithole, Robert Mugabe, and Rex Nhongo. These leaders are long regarded as foundational figures in the countrys independence movement, and Kandishayas words suggest a revisionist narrative that could overshadow their roles.\n\nAlthough the Deputy Political Commissars comments highlight Mnangagwas significant involvement, particularly in the battle against imperialism, they raise concerns about the broader historical context of Zimbabwes liberation war. The comments have drawn attention to how political figures reinterpret the nations history to serve current agendas, with Mnangagwa being positioned at the forefront.\n\nAs the political landscape continues to evolve, many will be closely watching how these claims are received, especially in relation to the legacies of Zimbabwes revered war heroes. Kandishayas statement further fuels the ongoing debate about the legacy and recognition of key liberation figures in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent While not explicitly naming Joshua Nkomo, Taurai Kandishaya’s recent comments imply that President Emmerson Mnangagwa is greater … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/mnangagwas-liberation-war-status-under-scrutiny/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Liberation War Status Under Scrutiny\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "Chaos As Shortage Of Water Hits Nemamwa Growth Point",
            "url": "https://www.zimeye.net/2025/03/01/chaos-as-shortage-of-water-hits-nemamwa-growth-point/",
            "content": "By A Correspondent\n\nThe water crisis at Nemamwa Growth Point, the largest township in Masvingo rural with approximately 6,000 households, is quickly escalating into a public health concern.\n\nThe area has gone without tap water for over a month, leaving residents to rely on borehole and rainwater.\n\nThe lack of access to clean water has significantly raised the risk of a cholera outbreak, a serious and deadly disease transmitted through contaminated water sources.\n\nThe situation is compounded by the fact that Nemamwa Growth Point, which is only about 3 kilometers from the Great Zimbabwe Ruins, a UNESCO World Heritage site, is seeing its tourism and hospitality sectors suffer.\n\nThe water crisis is not only affecting daily life but is also impacting the local economy, as visitors to the area are now less likely to enjoy their stay without access to reliable water supplies.\n\nThe Zimbabwe National Water Authority (ZINWA) is at the heart of the crisis. According to a ZINWA official, the situation worsened when a transformer that supplies electricity to the water plant was vandalized, further hampering the provision of water to the township.\n\nAlthough there has been vandalism of the ZESA transformer, there is lack of motivation as well, the official explained, highlighting the ongoing challenges that the authority is facing in restoring services to the community.\n\nResidents of Nemamwa are growing increasingly frustrated, as the absence of clean water makes everyday life more difficult. Many fear the impending threat of cholera, which has claimed countless lives in Zimbabwe in the past.\n\nThe situation calls for immediate action from both local and national authorities to address the water crisis and prevent a potential health disaster. Given the proximity to Great Zimbabwe, ensuring a sustainable water supply is not only vital for the well-being of residents but also for preserving the tourism potential of the area.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The water crisis at Nemamwa Growth Point, the largest township in Masvingo rural with approximately 6,000 households, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/chaos-as-shortage-of-water-hits-nemamwa-growth-point/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos As Shortage Of Water Hits Nemamwa Growth Point\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        },
        {
            "title": "EPL Title : Arteta Refuses To Throw In Towel",
            "url": "https://www.zimeye.net/2025/03/01/epl-title-arteta-refuses-to-throw-in-towel/",
            "content": "Sports Correspondent\n\nArsenal manager Mikel Arteta has refused to give up on the English Premier League title race, despite his teams recent slip in form.\n\nThe Gunners, currently second in the Premier League standings, lost valuable ground in the title battle after a goalless draw at Nottingham Forest on Wednesday. The result leaves them 13 points behind leaders Liverpool.\n\nArteta, speaking to ESPN, remained defiant: It was the same a week ago, two weeks ago, three months ago. The only thing we can do is win our matches and see how many points we accumulate. Weve dropped two points in this game, and its painful. It doesnt feel good because were here to win.\n\nHe continued, We showed undeniable character in how much we wanted it and tried. We dominated the game, tried in many different ways, and kept insisting. But we lacked that spark, that final pass to break down a well-organized team. We need to generate more shots on target.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Arsenal manager Mikel Arteta has refused to give up on the English Premier League title race, despite his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/01/epl-title-arteta-refuses-to-throw-in-towel/\">Continue reading<span class=\"screen-reader-text\"> \"EPL Title : Arteta Refuses To Throw In Towel\"</span></a></p>",
            "time": "09:07",
            "date": "02 Mar 2025"
        }
    ]
}