{
    "news": [
        {
            "title": "Saintfloew in Car Crash",
            "url": "https://www.zimeye.net/2025/08/24/saintfloew-in-car-crash/",
            "content": "By Showbiz Reporter Rising Hip Hop star Saintfloew, born Tawanda Mambo, was reportedly involved in a car accident near Greencroft Shopping Centre in Harare on Saturday night.\n\nSeveral witnesses said the 27-year-old musician was driving a white Tesla allegedly belonging to music promoter and businessman Tinashe Mutarisi when the incident occurred. The cause of the crash is still unknown, and details about the artists condition remain unclear.\n\nSaintfloew, who has been making waves in Zimbabwes urban music scene, rose to prominence with hits such asSilas MavendeandGundamwenda, which earned him a loyal following among Hip Hop and Zim-dancehall enthusiasts. His raw storytelling, which often draws from his upbringing and struggles with addiction, has set him apart as a voice of the youth.\n\nThe rapper has also been open about his personal battles and his journey to rehabilitation, an aspect that has resonated with fans who view him as both talented and relatable. His collaboration with Mutarisi and other big names in the industry has further cemented his position as one of Zimbabwes most promising talents.\n\nThe accident has sent shockwaves across social media, with fans expressing concern and sending messages of support as they await official updates on his condition.\n\nAuthorities are yet to release a formal statement on the crash. Further updates will be shared as more information becomes available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Rising Hip Hop star Saintfloew, born Tawanda Mambo, was reportedly involved in a car accident near Greencroft … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/24/saintfloew-in-car-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Saintfloew in Car Crash\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Temba Mliswa Wins Court Battle Against Police, Secures Provisional Order",
            "url": "https://www.zimeye.net/2025/08/24/temba-mliswa-wins-court-battle-against-police-secures-provisional-order/",
            "content": "By Court Reporter | ZimEye | Harare, 24 August 2025  Independent legislator and businessman Temba Mliswa has scored a major legal victory after the High Court of Zimbabwe granted his company, Cubs Den Consolidated (Pvt) Ltd, a provisional order against the Zimbabwe Republic Police and government agencies in Mashonaland West.\n\nThe ruling, handed down by Justice Wamambo on 22 August 2025 under Case No. HCH4111/25, restrains police and state officials from interfering with Mliswas Sanyati River Rehabilitation Prototype Project in Rengwe Conservancy.\n\nThe Courts Interim Relief\n\nThe order compels the Provincial Commissioner of Police (Mashonaland West), the Commissioner General of Police, and the Minister of State for Provincial Affairs to:\n\nShould the police fail to comply, the Deputy Sheriff has been authorized to eject them and hand over vacant possession to Mliswas company.\n\nFinal Order Sought\n\nThe court will later decide whether to confirm the following as a final order:\n\nThe Bigger Picture\n\nThe provisional order marks a significant win for Mliswa, who has long clashed with authorities over land, mining, and conservation projects in Mashonaland West.\n\nLegal analysts say the ruling underscores the limits of police powers when used to frustrate private investment projects without lawful basis.\n\nThe respondents  which include the Environmental Management Agency (EMA) and the Minister of Environment, Climate and Wildlife  have 10 days to file opposing papers. If they fail, the order could be confirmed unopposed.\n\n Case Ref: HCH4111/25  Cubs Den Consolidated (Pvt) Ltd vs Provincial Commissioner of Police & Others\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Court Reporter | ZimEye | Harare, 24 August 2025 — Independent legislator and businessman Temba Mliswa has scored a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/24/temba-mliswa-wins-court-battle-against-police-secures-provisional-order/\">Continue reading<span class=\"screen-reader-text\"> \"Temba Mliswa Wins Court Battle Against Police, Secures Provisional Order\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Hurungwe Council Scandal: Top Officials Jailed for 174 Years Over US$65K Fraud",
            "url": "https://www.zimeye.net/2025/08/24/hurungwe-council-scandal-top-officials-jailed-for-174-years-over-us65k-fraud/",
            "content": "By A Correspondent\n\nIn a dramatic ruling that has sent shockwaves through local governance structures, three senior officials from Hurungwe Rural District Council (RDC) have been sentenced to a combined 174 years behind bars for masterminding a massive fraud scheme that drained more than US$65,000 from public funds earmarked for critical development projects.\n\nHigh Court judges delivered the verdict after finding the officials guilty of multiple counts of fraud, describing their actions as a betrayal of public trust on an unprecedented scale.\n\nHeavy Jail Terms for Top BrassCouncil Chief Executive OfficerLuke Kalavinawill serve36 years, while the councils engineerRomeo Mupamaondeand his assistantAlfred Makamawere each handed52 yearsfor four separate fraud charges.\n\nAccording to court records, the trio manipulated procurement processes and fabricated construction claims to siphon money from infrastructure budgets.\n\nFake Projects and Diversion of MaterialsInvestigations by theZimbabwe Anti-Corruption Commission (ZACC)revealed that the officials authorized fraudulent payments toMarloshac Investments, claiming the company had built theKaspikiri Causeway Bridge. OverUS$18,000was paid, yet the actual work was completed by local contractorKainos Mupiwa, who never received a cent.\n\nThe scam extended toChiedza Clinic, where the officials diverted plumbing materials worthUS$3,889for personal projects and fraudulently claimed the construction of ablution facilities, costing the council anotherUS$6,075.\n\nTo make matters worse, they processed anUS$8,501 purchase orderfor building materials from a company linked to one of the accused  but nothing was delivered. In total, Hurungwe RDC lostUS$47,266.21, none of which has been recovered.\n\nPrivate Company Boss Also JailedMarloshac Investments directorMarvin Matizawas convicted on two counts of fraud and sentenced to36 yearsin prison.\n\nSecond Fraud Scheme UncoveredIn a separate case, Mupamaonde and Makama were also found guilty alongsideAnstand Investments (Pvt) LtddirectorBatsirayi Nyamayarofor defrauding the council ofUS$17,990earmarked for theChehoko Causeway Bridge. The project was eventually completed by Mupiwa with community help, but he received onlyUS$1,450from the diverted funds.\n\nThe trio was jailed for18 years each, with three years suspended on good behavior, and finedUS$5,000each. The company received the same fine, with the court authorizing property seizures if payment is not made.\n\nWhile Kalavina was acquitted in the Chehoko case, he was convicted on charges related to theKaspikiri BridgeandChiedza Clinicprojects.\n\nCouncil Moves to Restore OrderFollowing the scandal, the council has appointedRemigio Makuwerere, its social services officer, as acting CEO. Hurungwe RDC remains Zimbabwes second-largest rural district after Makoni in Manicaland\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a dramatic ruling that has sent shockwaves through local governance structures, three senior officials from Hurungwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/24/hurungwe-council-scandal-top-officials-jailed-for-174-years-over-us65k-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Hurungwe Council Scandal: Top Officials Jailed for 174 Years Over US$65K Fraud\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Mnangagwa Aide Shoots Self At State House",
            "url": "https://www.zimeye.net/2025/08/24/mnangagwa-aide-shoots-self-at-state-house/",
            "content": "By A Correspondent\n\nA bizarre incident unfolded at State House in Bulawayo when a Police Protection Unit (PPU) officer accidentally shot himself in the knee while on duty, sparking a courtroom battle over whether negligence or faulty equipment was to blame.\n\nThe officer, Dubani Munkuli (36), appeared before Bulawayo magistrate Challenge Mahembe facing charges of negligently discharging a firearm. He pleaded not guilty, arguing through his lawyer that the weapon might have fired due to poor maintenance rather than carelessness.\n\nWe do not know the service history of this pistol. It could have misfired on its own, and that should not be considered negligence on my clients part, the defence lawyer told the court.\n\nHowever, a state ballistic expert dismissed that theory, stating: A gun cannot fire by itself. It requires someone to engage the trigger mechanism.\n\nCourt proceedings revealed that the incident occurred on May 15 around 11:20 pm while Munkuli was on duty with colleague Simbarashe Manombe. The officer reportedly stood up to go to the toilet while holding his CZ pistol with both hands. In the process, a round went off, striking him in the knee.\n\nThe defence pressed the expert on whether the weapons maintenance history could have contributed to the mishap. Although the expert admitted he had no record of when the gun was last serviced, he maintained that a trigger pull was necessary for discharge.\n\nMunkuli was remanded out of custody and is expected back in court on August 25 for the continuation of his trial.\n\nThe incident has triggered widespread debate in Bulawayo, with some residents mocking the mishap, saying, Instead of stopping criminals, the cop stopped himself. Others raised concerns about neglected firearms in service, warning that poor maintenance could pose a serious risk to law enforcement officers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A bizarre incident unfolded at State House in Bulawayo when a Police Protection Unit (PPU) officer accidentally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/24/mnangagwa-aide-shoots-self-at-state-house/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Aide Shoots Self At State House\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Chaos Inside Magaya’s Yadah As Club Official Bashes Goalkeeper",
            "url": "https://www.zimeye.net/2025/08/23/chaos-inside-magayas-yadah-as-club-official-bashes-goalkeeper/",
            "content": "By Sports Correspondent\n\nA shocking scene unfolded at Yadah FC when goalkeeper Godknows Gurure was allegedly assaulted by a club board member in the teams changing room after their defeat to Ngezi Platinum Stars.\n\nThe incident has sparked outrage across the football community, with the Footballers Union of Zimbabwe (FUZ) issuing a strongly worded statement condemning the attack.\n\nWe are deeply outraged by the shocking incident in which Yadah FC goalkeeper, Godknows Gurure, was physically assaulted inside the changing room by a board member of his own club, FUZ said in the statement. This cowardly act of violence is utterly unacceptable and brings shame to the game. The changing room is meant to be a safe space for players, not a place where they are attacked by those who should be supporting them.\n\nFUZ called for immediate action from football authorities, urging the Premier Soccer League (PSL) and ZIFA to investigate the matter and take tough measures against the perpetrator.\n\nWe call on the PSL, ZIFA, and all relevant authorities to launch an immediate investigation, hold the perpetrator fully accountable with strong disciplinary action, and enforce measures to protect players safety and welfare across all clubs, the statement added.\n\nThe union emphasized that players are workers who deserve respect and protection, stressing that this incident is not just an attack on Gurure but on the fundamental rights of all footballers.\n\nWe stand firmly in solidarity with Godknows Gurure and with all players who deserve to work in a safe and professional environment, FUZ concluded.\n\nThe Premier Soccer League is yet to comment on the matter, while efforts to get a response from Yadah FC officials were unsuccessful at the time of publishing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent A shocking scene unfolded at Yadah FC when goalkeeper Godknows Gurure was allegedly assaulted by a club … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/chaos-inside-magayas-yadah-as-club-official-bashes-goalkeeper/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos Inside Magaya’s Yadah As Club Official Bashes Goalkeeper\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Jah Prayzah Returns To Military Gear",
            "url": "https://www.zimeye.net/2025/08/23/jah-prayzah-returns-to-military-gear/",
            "content": "By Showbiz Reporter-Afro-fusion superstar Jah Prayzah has reignited debate after making a surprise return to his signature military attire during a family show at Jongwe Corner in Hatfield on August 10.\n\nThe award-winning musician, real name Mukudzeyi Mukombe, stunned fans when he walked onto the stage in full camouflage  a look that once defined his career but later became a source of controversy. His bold fashion comeback immediately set social media alight, with admirers praising his courage while critics questioned his renewed embrace of military symbolism.\n\nJah Prayzahs connection with the army dates back nearly a decade. His band,Third Generation, has long been associated with the military touch  a brand identity inspired by his collaborations with the Zimbabwe Defence Forces. He was even appointed as the official goodwill ambassador of the Zimbabwe National Army, cementing his reputation as a musician whose artistry intersected with state power.\n\nThis partnership reached its peak in 2017 with the release of the chart-topping hitKutonga Kwaro. The song, with its heavy military undertones, became the unofficial anthem of the coup that ousted the late President Robert Mugabe and installed Emmerson Mnangagwa. At rallies and victory celebrations, Zanu PF and the military adopted the track as a soundtrack of the Second Republic.\n\nHowever,Kutonga Kwarosoon turned into a political albatross for Jah Prayzah. While fans initially embraced the anthems infectious rhythm, many later accused him of being co-opted by the junta to legitimise the coup. Reports later emerged that elements within military intelligence had influenced the songs creation, scripting lyrics that glorified Mnangagwa  known by his Shumba totem, celebrated in the track  as the incoming leader.\n\nFor years afterward, Jah Prayzah struggled to shake off the perception that he was the militarys musician of choice. His camouflage attire, once seen as creative branding, became politically loaded, particularly as the army and Zanu PF faced accusations of human rights abuses, brutal crackdowns on dissent, and violent repression of opposition activists. The association cost him part of his urban youth following, who viewed him as a symbol of complicity in state excesses.\n\nIn response, Jah Prayzah deliberately abandoned the camouflage look, adopting a more neutral stage persona while expanding his sound to appeal to broader audiences across Africa. His collaborations with Tanzanian, Nigerian, and South African stars allowed him to rebrand as a continental act, distancing himself from the politics of Harare.\n\nNow, with his return to military gear, questions are once again being asked. Is this merely an artistic throwback to his earlier brand, or does it signal renewed ties with the establishment? For many Zimbabweans, Jah Prayzah remains caught between his musical genius and the political baggage of being remembered as the soundtrack of a coup.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Afro-fusion superstar Jah Prayzah has reignited debate after making a surprise return to his signature military attire during … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/jah-prayzah-returns-to-military-gear/\">Continue reading<span class=\"screen-reader-text\"> \"Jah Prayzah Returns To Military Gear\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Video of Mnangagwa Revealing Own Doubt-Detail Of Bombing A Train",
            "url": "https://www.zimeye.net/2025/08/23/video-of-mnangagwa-revealing-own-doubt-detail-of-bombing-a-train/",
            "content": "video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Real Madrid FC’s Rodrygo Set to Start Against Oviedo ?",
            "url": "https://www.zimeye.net/2025/08/23/real-madrid-fcs-rodrygo-set-to-start-against-oviedo/",
            "content": "Sports Correspondent\n\nAccording to reports from Los Blancos Live, Real Madrid FCs Brazilian winger Rodrygo is set to start against Oviedo on Sunday night. The source claims that Rodrygo has requested to play on the left wing, and coach Xabi Alonso has agreed to his request.\n\nThis development comes after Rodrygo has been facing a dry spell in terms of game time, and it seems the player is eager to break into the starting lineup.\n\nWith his pace, skill, and creativity on the pitch, Rodrygo could be a key player for Real Madrid in their upcoming match against Oviedo.\n\nIf Los Blancos Lives report is accurate, Rodrygos deployment on the left wing could bring a fresh dynamic to Real Madrids attack, potentially creating scoring opportunities and putting pressure on Oviedos defense.\n\nFans will be keeping a close eye on the teams lineup announcement to see if Rodrygo indeed gets the chance to start.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent According to reports from Los Blancos Live, Real Madrid FC’s Brazilian winger Rodrygo is set to start against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/real-madrid-fcs-rodrygo-set-to-start-against-oviedo/\">Continue reading<span class=\"screen-reader-text\"> \"Real Madrid FC’s Rodrygo Set to Start Against Oviedo ?\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "🔴 Journalist Brutally Assaulted by Alick Macheso’s Bodyguard",
            "url": "https://www.zimeye.net/2025/08/23/%f0%9f%94%b4-journalist-brutally-assaulted-by-alick-machesos-bodyguard/",
            "content": ".\n\nGRANARY PARK, HARARE  AUGUST 23, 2025 \n\nBy A Correspondent | ZimEye | Senior political journalist Richard Muponde of The Herald-Zimbabwe has been left severely injured after being violently assaulted by Lloyd Gweshe, a known karate expert and personal bodyguard to sungura music icon Alick Macheso.\n\nThe incident occurred on the night of August 7 at a local bar in Granary Park, where Muponde resides. According to eyewitnesses, the attack was completely unprovoked.\n\nHe struck him with a knuckle-duster and knocked him out cold, one eyewitness said.\n\nMuponde, whose reporting has consistently tackled sensitive political issues, suffered serious injuries to his head and face, including:\n\nDespite reporting the assault at Marimba Police Station, no arrest has been made more than two weeks later, sparking fears of a cover-up or protection of the assailant due to his celebrity connections.\n\nI fear for my safety. This isnt just an assaultits an attempt to silence me, Muponde said in a statement.\n\nHe further alleges that Lloyd Gweshe has a track record of intimidating Granary residents, sometimes patrolling the area in full police riot gearraising concerns about possible access to state security equipment.\n\nKey Details:\n\n Victim: Richard Muponde, veteran political reporter\n\n Suspect: Lloyd Gweshe, Machesos bodyguard and martial artist\n\n Location: Granary Park bar\n\n Report filed at: Marimba Police Station\n\n Police Action: No arrest made as of today\n\n CALL TO ACTION:\n\n IMAGE DESCRIPTION:\n\nMuponde is seen with a thick bandage across his forehead, swelling on his face, and bruised lipsvisible evidence of a brutal and targeted assault on a journalist in the line of duty.\n\nDeveloping story\n\nStay with ZimEye News for updates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": ". GRANARY PARK, HARARE – AUGUST 23, 2025 — By A Correspondent | ZimEye | Senior political journalist Richard Muponde … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/%f0%9f%94%b4-journalist-brutally-assaulted-by-alick-machesos-bodyguard/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 Journalist Brutally Assaulted by Alick Macheso’s Bodyguard\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        },
        {
            "title": "Government Fails To Release Basic Education Assistance Funds…",
            "url": "https://www.zimeye.net/2025/08/23/government-fails-to-release-basic-education-assistance-funds/",
            "content": "By A Correspondent\n\nSchools across Zimbabwe are struggling to keep vulnerable learners in class as the government continues to delay the release of funds under the Basic Education Assistance Module (BEAM).\n\nPublic Service, Labour and Social Welfare Minister Edgar Moyo admitted in Parliament on Wednesday that the Treasury has failed to disburse the necessary funds since the start of 2023, leaving thousands of learners without critical support.\n\nTreasury has not released BEAM funds since the beginning of 2023, Moyo said, acknowledging the depth of the crisis.\n\nHe revealed that the only funds released this year  ZiG40 million  were used to clear part of the arrears for the first and second terms of 2024, and even then, the allocation benefited only a handful of special schools such as Jairos Jiri, St Giles, Sibantubanye and M. Hugo School for the Blind.\n\nMoyo admitted that the situation remains unresolved, saying: We are in discussions with the Ministry of Finance almost weekly to try and address the shortfall.\n\nCritics argue that these delays expose the governments failure to prioritize education, with thousands of disadvantaged learners now at risk of dropping out. Education stakeholders have warned that the continued non-payment threatens to cripple the public school system, calling it a betrayal of the most vulnerable children in society.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Schools across Zimbabwe are struggling to keep vulnerable learners in class as the government continues to delay … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/23/government-fails-to-release-basic-education-assistance-funds/\">Continue reading<span class=\"screen-reader-text\"> \"Government Fails To Release Basic Education Assistance Funds…\"</span></a></p>",
            "time": "18:31",
            "date": "24 Aug 2025"
        }
    ]
}