{
    "news": [
        {
            "title": "Court hears Mpofu and Chimombe only supplied 3 000 goats instead of 600,000",
            "url": "https://www.zimeye.net/2025/05/29/court-hears-mpofu-and-chimombe-only-supplied-3-000-goats-instead-of-600000/",
            "content": "By A Correspondent | ZimEye | Court hears Mpofu and Chimombe only supplied 3 000 goats instead of 600 000, their price for each goat ranged between US$175 and US$250\n\nFormer Agriculture ministry Permanent Secretary John Basera, Thursday took it to the stand to testify against businessmen Mike Chimombe and Moses Mpofu.\n\nThe two are accused of swindling government of US$7,9 million thriugh their companh Blackdeck after they secured a tender to supply 600 000 goats under the Presidential Goat Scheme.\n\nThe state alleges that the company was nonexistent and Basera said they were not aware that forged documents had been used.\n\nBasera told High Court judge Justice Pisirayi Kwenda that the two only managed to supply less than 3 000 goats adding that initially the price for each goat was between US$175 and US$250.\n\nAs the accounting officer going with principle of value for money I realised that US$7 million for 600 000 goats was exorbitant. Together with multiple team we discussed that even if the Procurement Regulatory Authority of Zimbabwe ( Praz) had made these recommendations it was not okay.\n\nI suggested that we had a meeting g to discuss the price of each goatbecause their price range was ranging between US$175 and US$250.\n\nWe engaged the supplier and reduced the prices to US$75 and US$95 per goat depending on the breed and we agreed to proceed with the deal.\n\nBasera also told court that Praz had approved Blackdeck in the bidding process.\n\nHe said all official documents were signed by Mpofu while Tinashe Chimombe witnessed.\n\nHe said Mike Chimombe did not sign any official documents.\n\nWe got a no objection letter from Praz and we signed a contract with the lowest bidder, Blackdeck.\n\nThe tender evaluation committee also stated that the company had met all the requirements, he added.\n\nBlackdeck was then given ZW$1, 9 billion which was equivalent to US$7,9 million.\n\nAfter a while they then said they had managed to secure 32 000 goats which they kept in holding pens.\n\nAccording to Basera, when officials from the Ministry went to confirm, they were shocked to find less than 3 000 goats in the holding pens.\n\nConflict then arose with the Ministry demanding restitution or going for guarantee if the company failed to supply 600 000 goats as signed for.\n\nBasera will be cross examined this Friday and more wit esses are lined up to testify.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Court hears Mpofu and Chimombe only supplied 3 000 goats instead of 600 000, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/court-hears-mpofu-and-chimombe-only-supplied-3-000-goats-instead-of-600000/\">Continue reading<span class=\"screen-reader-text\"> \"Court hears Mpofu and Chimombe only supplied 3 000 goats instead of 600,000\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Several Feared Dead Near Mugabe’s Rural Home",
            "url": "https://www.zimeye.net/2025/05/29/several-feared-dead-near-mugabes-rural-home/",
            "content": "By A Correspondent- At least three people are feared dead following a horrific head-on collision near Uzande Business Centre, which is located approximately 6 kilometres west of Kutama, Murombedzi, along the Chinhoyi-Chegutu Highway in Mashonaland West.\n\nUzande Business Centre lies close to Murombedzi Growth Point, the rural home of the late former President Robert Mugabe.\n\nThe fatal crash, which occurred Thursday afternoon, involved a Toyota Probox and a Lexus SUV.\n\nAccording to eyewitnesses, the driver of the Lexus reportedly encroached into the lane of the oncoming Probox while attempting to overtake another vehicle, resulting in the collision.\n\nVillagers from nearby homesteads rushed to the scene and helped retrieve the injured passengers, who were later ferried to Chinhoyi Provincial Hospital.\n\nThe Lexus was overtaking another car when it suddenly swerved into the Proboxs path. The impact was terrible, said Mr Emmerson Chitehwe, who witnessed the accident.\n\nThe exact number of injured individuals remains unconfirmed, and authorities have yet to release an official statement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- At least three people are feared dead following a horrific head-on collision near Uzande Business Centre, which … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/several-feared-dead-near-mugabes-rural-home/\">Continue reading<span class=\"screen-reader-text\"> \"Several Feared Dead Near Mugabe’s Rural Home\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Breaking News- Daisy has passed on",
            "url": "https://www.zimeye.net/2025/05/29/breaking-news-daisy-has-passed-on/",
            "content": "Kamangeni Phiri a former Editor at Zimpapers announced the death of former Zimpapers and lnternational Journalist Daisy Manyika Mavhumashava in a Media WhatsApp GroupHe wrote Im sorry to announce that Daisy Jeremani Mavhumashava is no more. She passed on this evening at Mater Dei Hospital.More details to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Kamangeni Phiri a former Editor at Zimpapers announced the death of former Zimpapers and lnternational Journalist Daisy Manyika Mavhumashava in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/breaking-news-daisy-has-passed-on/\">Continue reading<span class=\"screen-reader-text\"> \"Breaking News- Daisy has passed on\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Over 66 000 hectares of wheat planted",
            "url": "https://www.zimeye.net/2025/05/29/over-66-000-hectares-of-wheat-planted/",
            "content": "Farmers encouraged to continue planting wheat\n\nThe Acting Chief Director of ARDAS, Mr. Leonard Munamati, today conducted a Winter Wheat planting assessment visit to Mr. Kennedy Shonhiwas Munengwa farm, specifically inspecting his 3-hectare wheat plot in Beatrice. Mr. Kennedy Shonhiwa, the farmer, expressed optimism about his wheat harvest, targeting 8 tonnes per hectare, up from 6.6 tonnes per hectare in the previous season.\n\nThe Acting Chief Director commended Mr. Shonhiwa for following advice from Agriculture Extension Officers as well as Zinwa in terms of how much water is available and the hactares to plant.\n\nNotably, farmers have already planted over 66,000 hectares of wheat, he said.The Chief Director encouraged farmers to continue planting, as the winter planting period is nearing its end.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Farmers encouraged to continue planting wheat The Acting Chief Director of ARDAS, Mr. Leonard Munamati, today conducted a Winter Wheat … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/over-66-000-hectares-of-wheat-planted/\">Continue reading<span class=\"screen-reader-text\"> \"Over 66 000 hectares of wheat planted\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Bajila Condemns Violence",
            "url": "https://www.zimeye.net/2025/05/29/bajila-condemns-violence/",
            "content": "Hon Discent Collins Bajila Condemns Machete Attacks, Calls for Increased Police Visibility\n\nI wish to express my profound condemnation of the brutal machete attack that occurred yesterday, May 28, 2025, in Emakhandeni, leaving three men badly injured. My thoughts and prayers are with the victims and their families during this difficult time, and I wish them a swift and full recovery.\n\nThis heinous act is not an isolated incident but rather a deeply concerning symptom of a disturbing surge in criminal activities plaguing our beloved Emakhandeni-Luveve Constituency. The confidence of these gangs is increasing with each attack. This is synonymous with repeat offenders who successfully evade the arm of the law.\n\nResidents are increasingly living in fear as the safety and security of our community are being severely compromised. We have witnessed a worrying rise in violent crimes in the past months, including house break ins, theft of motor vehicles, robberies and assaults, which threaten the peace and stability that we all strive for.\n\nSuch acts of violence have no place in our society. They undermine the fabric of our community and instill a pervasive sense of insecurity. It is imperative that we address this escalating crisis with urgency and resolve.\n\nI therefore call upon the Zimbabwe Republic Police (ZRP) to significantly improve their visibility and presence within the Emakhandeni-Luveve Constituency. Increased patrols, proactive community engagement, and swift responses to reported incidents are crucial steps to deter criminals and restore public confidence. Our citizens deserve to feel safe in their homes and on our streets.\n\nI further urge all residents to remain vigilant and to report any suspicious activities to the police immediately. Community cooperation has proven to be vital in our collective efforts to combat crime and ensure the safety of our neighborhoods.\n\nAs your elected representative, I am committed to working closely with law enforcement agencies, neighborhood watch committees, community leaders, and residents to develop sustainable solutions to this pressing issue. To that end, I will be convening an all stakeholders conference on crime in the next few weeks. We must collectively ensure that Emakhandeni-Luveve remains a safe and prosperous community for all.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Hon Discent Collins Bajila Condemns Machete Attacks, Calls for Increased Police Visibility I wish to express my profound condemnation of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/bajila-condemns-violence/\">Continue reading<span class=\"screen-reader-text\"> \"Bajila Condemns Violence\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Munetsi Clinches Prestigious Award In UK",
            "url": "https://www.zimeye.net/2025/05/29/munetsi-clinches-prestigious-award-in-uk/",
            "content": "Wolverhampton Wanderers and Zimbabwe national team midfielder Marshall Munetsi has been named the 2025 Zim Achievers Awards (ZAA) UK Sports Personality of the Year.\n\nMunetsi, who made a high-profile move to Wolves in January from French Ligue 1 outfit Stade de Reims, edged out strong competition from fellow Warriors stars Tawanda Chirewahis club teammateand Readings Tivonge Rushesha.\n\nAlso in contention for the honour were versatile athlete Raphael Chiwandire, known for excelling in football, boxing, and athletics, along with Chichi Sabetha.\n\nThis marks Munetsis first major accolade since making the switch to English football six months ago, highlighting a promising start to his Premier League career.\n\nThe award was presented at a glittering ceremony held at the Grand Hotel in Birmingham on May 17, 2025, as the ZAA UK celebrated Zimbabweans making significant contributions in various sectors across the United Kingdom.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Wolverhampton Wanderers and Zimbabwe national team midfielder Marshall Munetsi has been named the 2025 Zim Achievers Awards (ZAA) UK Sports … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/munetsi-clinches-prestigious-award-in-uk/\">Continue reading<span class=\"screen-reader-text\"> \"Munetsi Clinches Prestigious Award In UK\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "FIFA Imposes Transfer Ban on Dynamos FC",
            "url": "https://www.zimeye.net/2025/05/29/fifa-imposes-transfer-ban-on-dynamos-fc/",
            "content": "Sports Correspondent\n\nHarare, Zimbabwe  Zimbabwean football giants Dynamos have been hit with a major setback after FIFA imposed a ban preventing the club from registering new players.\n\nThe sanction comes as a result of the clubs failure to settle outstanding debts owed to two former players, Ghanaian duo Emmanuel Paga and Fredrick Ansa-Botchway.\n\nAccording to sources close to the situation, Paga is owed US$8,500 while Ansa-Botchway is due US$10,000, bringing the total debt to US$18,500. FIFAs ruling now puts the Harare-based club in a difficult position, particularly as they attempt to rebuild during the mid-season window.\n\nThe ban will remain in place until Dynamos have fully paid both players. FIFAs disciplinary action underscores the governing bodys firm stance on financial accountability and player welfare.\n\nDynamos, once a dominant force in Zimbabwean football, have struggled in recent seasons both on and off the pitch. This latest development further dampens the clubs hopes of reclaiming former glory, as they will be unable to bolster their squad ahead of the crucial second half of the season.\n\nHowever, insiders suggest that the club is working to resolve the issue as swiftly as possible to avoid long-term repercussions.\n\nFIFA has increasingly taken a tough approach with clubs that default on player payments, with several teams across Africa facing similar sanctions in recent years.\n\nFans and football analysts alike will be watching closely to see how the Glamour Boys respond to this latest crisis and whether they can navigate the remainder of the season with their current squad.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Harare, Zimbabwe – Zimbabwean football giants Dynamos have been hit with a major setback after FIFA imposed a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/fifa-imposes-transfer-ban-on-dynamos-fc/\">Continue reading<span class=\"screen-reader-text\"> \"FIFA Imposes Transfer Ban on Dynamos FC\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Hwange Council Demands Snooker Tax From Business Operator",
            "url": "https://www.zimeye.net/2025/05/29/hwange-council-demands-snooker-tax-from-business-operator/",
            "content": "By A Correspondent\n\nHwange  In a development that has sparked debate about Zimbabwes growing appetite for taxes, the Hwange Local Board has issued a formal demand for an annual fee of USD 80.50 from a local business owner  for operating a snooker table.\n\nIn a letter dated May 16, 2025, and signed by Town Secretary N. Mdlalose, the council informed the business located at 4 Sandalwood Crescent, Baobab Hill, that payment was required in accordance with Hwange Local Board by-laws and the Urban Councils Act (Chapter 29:15), specifically Sections 269 to 272.\n\nWe wish to inform you that an annual tariff of USD 80.50, inclusive of Value Added Tax, is due for the operation of a snooker table at your premises, reads the letter.\n\nFailure to comply by the set deadline of May 30, 2025, would result in immediate enforcement action.\n\nPlease be advised that failure to make this payment by Monday, 30 May 2025, will leave Council with no option but to prohibit the continued operation of the snooker table(s).\n\nThe move has stirred outrage among small business operators, who say the council is targeting harmless entertainment amenities to raise revenue in a crumbling economy.\n\nThis is getting ridiculous, said one Hwange entrepreneur who runs a bottle store and spoke on condition of anonymity. We pay for licenses, we pay ZIMRA, we pay EMA, and now we have to pay to let someone play a game of snooker? Whats next, a dartboard tax?\n\nAnother small business owner expressed frustration over what they described as a punitive system.\n\nThey should be encouraging small businesses, not bleeding us dry. A snooker table doesnt make that kind of money, he said. This is just another way of milking struggling operators.\n\nSocial commentators say the move reflects a broader national trend, where local authorities are introducing unconventional fees in an attempt to stay afloat.\n\nZimbabwe is slowly becoming a tax country, said one observer.\n\nThe tax regime has reached alarming levels, and its now encroaching into leisure and low-income entertainment.\n\nLocal authorities have been increasingly criticized for targeting informal and micro-level operators rather than addressing corporate compliance or service delivery gaps.\n\nAs the deadline looms, it remains to be seen whether operators will comply or push back against what many now call the snooker tax.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Hwange – In a development that has sparked debate about Zimbabwe’s growing appetite for taxes, the Hwange … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/hwange-council-demands-snooker-tax-from-business-operator/\">Continue reading<span class=\"screen-reader-text\"> \"Hwange Council Demands Snooker Tax From Business Operator\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Nyokayemabhunu Lawyers Speak On Way Forward",
            "url": "https://www.zimeye.net/2025/05/29/nyokayemabhunu-lawyers-speak-on-way-forward/",
            "content": "By A Correspondent\n\nThe legal team representing Wellington Masiwa, widely known by his alias Nyokayemabhunu, has clarified the next steps in the high-profile court case currently unfolding in South Africa.\n\nAccording to information received byZimEye.comon Thursday afternoon, court proceedings are set to resume tomorrow, although the issue of bail is not expected to be addressed during this session.\n\nLawyers have submitted their reply affidavit to the states affidavit. The judge said she is going to hear the matter tomorrow, a source on the ground confirmed.\n\nWhile there has been growing public interest in whether Masiwa will be granted bail, legal sources indicated that further procedural steps are still required.\n\nBail is not going to be tomorrow. There is still going to be an exchange of documents. That magistrate will have to decide on that afterwards, the source explained.\n\nThe case continues to draw attention both in Zimbabwe and South Africa, with many closely monitoring how the legal battle will unfold.\n\nWhen the judge receives the argument after that, she will decide what her verdict is, the source added, signaling that a final decision remains some way off.\n\nMore updates are expected as the court reconvenes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The legal team representing Wellington Masiwa, widely known by his alias Nyokayemabhunu, has clarified the next steps … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/nyokayemabhunu-lawyers-speak-on-way-forward/\">Continue reading<span class=\"screen-reader-text\"> \"Nyokayemabhunu Lawyers Speak On Way Forward\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        },
        {
            "title": "Mnangagwa’s Media Policy Useless, Nelson Chamisa Declares",
            "url": "https://www.zimeye.net/2025/05/29/mnangagwas-media-policy-useless-nelson-chamisa-declares/",
            "content": "By A Correspondent\n\nOpposition leader Advocate Nelson Chamisa has fiercely criticised President Emmerson Mnangagwas newly launched media policy, dismissing it as ineffective and misleading. Speaking in a statement released on Thursday, Chamisa described the policy unveiled in Harare the previous day as a damp squib.\n\nThe recently launched media policy by the Zanu PF administration is yet another hollow gesture, Chamisa said. Lets be clear: the real crisis in Zimbabwes media sector is not a lack of policy, but the continued criminalisation of journalism. No amount of lipstick will beautify a frog.\n\nAccording to Chamisa, instead of creating space for innovation and media freedom, the policy serves to consolidate government control. True reform would have meant breaking the monopoly, not entrenching it; promoting local investment, not stifling it, he said.\n\nHe further argued that a genuine media policy would focus on empowering journalists and ensuring their protection. A real media policy would empower journalists, not threaten them with deregistration under vague rules and standards designed to muzzle dissent, Chamisa stated. It would promote self-regulation, as we see in other respected professions.\n\nChamisa also took aim at the state-run broadcasters, ZBC and Zimpapers, saying they remain mouthpieces of propaganda rather than platforms for public service. It would transform ZBC and Zimpapers into genuine public service platforms, not echo chambers of outdated propaganda.\n\nThe opposition leader was equally critical of the proposed Media Fund, warning it could further strain an already struggling media industry. The so-called proposed Media Fund will burden struggling media houses even further, he said. Our journalists, including those in public media, are earning peanuts, not because of poor work ethic, but because of collapsing revenues aided by a hostile environment.\n\nChamisa accused the government of offering cosmetic changes that fail to address deeper issues. This policy offers no meaningful support for retooling in the digital age. Its not a new dispensation, its a new deception.\n\nCalling for sweeping reforms, Chamisa concluded: We need a complete overhaul. It is time to decriminalise journalism, dismantle media capture, and enable Zimbabwes media to thrive as a job-creating, economy-boosting industry. For the people. For the country. For God. Forever and always.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Advocate Nelson Chamisa has fiercely criticised President Emmerson Mnangagwa’s newly launched media policy, dismissing it … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/29/mnangagwas-media-policy-useless-nelson-chamisa-declares/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Media Policy Useless, Nelson Chamisa Declares\"</span></a></p>",
            "time": "18:34",
            "date": "30 May 2025"
        }
    ]
}