{
    "news": [
        {
            "title": "WATCH LIVE: Chaos After Ziyambi Fires Geza From ZANU PF",
            "url": "https://www.zimeye.net/2025/02/04/watch-live-chaos-after-ziyambi-fires-geza-from-zanu-pf/",
            "content": "ZANU PF HQ Staff Chase Away Justice Minister Ziyambi As Press Conference Expelling Geza Is Cancelledhttps://t.co/fuFilKLUhQ\n\nvideo loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mnangagwa Thugs Attack Chiwenga Top Ally",
            "url": "https://www.zimeye.net/2025/02/04/mnangagwa-thugs-attack-chiwenga-top-ally/",
            "content": "By Munacho Gwamanda- President EmmersonMnangagwasallies are pushing for the expulsion of renegade war veteran and Zanu-PF Central Committee member Blessed Geza,accusing him of undermining the party leadership.\n\nGeza, a key ally of Vice President Constantino Chiwenga, has emerged as one of the few within Zanu-PF openly challengingMnangagwaspush to extend his rule beyond the agreed two terms.\n\nHis stance has put him on a collision course withMnangagwasloyalists, who now seek to silence him through expulsion.\n\nAt the heart of the fallout isthe unresolved power deal struck between Mnangagwa and Chiwengafollowingthe 2017 coup that ousted Robert Mugabe.\n\nAt the time, the agreement was that Mnangagwa would serve two terms and then hand over power to Chiwenga.\n\nHowever, as Mnangagwa consolidates his grip on power, his camp is now working to extend his term beyond the constitutional limit, effectively sidelining Chiwenga.\n\nThis growing rift has fueled tensions within Zanu-PF, with war veterans and other party factions aligning themselves on either side of the divide.\n\nGeza,representing the disgruntled war veterans, has taken a bold stand, arguing that Mnangagwa musthonorthe initial power-sharing agreement and step aside for Chiwenga.\n\nIn Mashonaland West,the recommendation to expel Geza was madeat a meeting held at North Court in Zvimba East Constituency, where thousands of party supporters gathered, from grassroots members to senior officials.\n\nDuring the meeting, Zanu-PF Politburo member and Minister of Justice, Legal, and Parliamentary Affairs Ziyambi Ziyambi led the calls forGezasremoval, accusing him of abusing his position in the party to challengeMnangagwasauthority.\n\nIndividuals are allowed to air their grievances democratically, but using thepartysname to attack our leadership is unacceptable,Ziyambi said.The attack on President Mnangagwa shows that Geza does not respect thepartysconstitution, which requires members to be loyal to the leadership.\n\nHe further warned thatGezasactions would notbe toleratedand insisted that anyone who wished to challenge Mnangagwa should wait until thepartyselective congress in 2027.\n\nGezasrefusal to supportMnangagwasextended rule has deepened existing factional battles within Zanu-PF.\n\nHis absence from crucial party meetings, including the Provincial Coordinating Committee (PCC) and Central Committee sessions, has been interpreted as defiance.\n\nProvincial chairperson Mary Mliswa-Chikoka described his stance as treasonous and insisted that Mashonaland West province wasfullybehind Mnangagwa.\n\nIf Geza wants to attack our President, he should leave Zanu-PF and oppose him from outside. He does not represent the voice of Mashonaland West,she said.\n\nZanu-PFsWomensLeague and Youth League also echoed the calls forGezasexpulsion, with ProvincialYouth Chairperson Tapiwa Masendawarningthat thepartysvanguard would not tolerate any opposition toMnangagwasleadership.\n\nMnangagwascontinued snubbing of Chiwenga and his camp signals a clear intention to eliminate any remaining threats to his leadership within Zanu-PF.\n\nThe move against Geza is just one example of a broader strategy to neutralize opposition within the party, ensuring that Mnangagwa remains unchallenged.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- President Emmerson Mnangagwa’s allies are pushing for the expulsion of renegade war veteran and Zanu-PF Central Committee member Blessed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/mnangagwa-thugs-attack-chiwenga-top-ally/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Thugs Attack Chiwenga Top Ally \"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "Another New University On The Cards",
            "url": "https://www.zimeye.net/2025/02/04/another-new-university-on-the-cards/",
            "content": "ByMunachoGwamanda-Thegovernment has approved a proposal by the Brethren in Christ Church (BICC) to establish the University of Matopo, addingyetanother institution toZimbabwesgrowing list of universities.\n\nThe Higher Education Quality Assurance Committee (HEQAC) of the Zimbabwe Council for Higher Education (ZIMCHE) granted the church permission to proceed with the project.\n\nBICC, which currently runs several mission schools, including Matopo High School, Mtshabezi High School, and Wanezi High School, willnowexpand its footprint into tertiary education.\n\nWith this development, Matabeleland South Province will see its number of universities rise to three, joining Solusi University and Gwanda State University.\n\nIn a letter addressed to Professor Henry Sibanda, chairperson of the University of Matopo Trust (UMT), ZIMCHE Chief Executive Officer Professor Kuzvinetsa Dzvimbo confirmed that the provisional registration for the university is validfrom January 2025 to January 2026.\n\nWe are pleased to inform you that the application by the proposed University of Matopo for registration was approved by HEQAC of ZIMCHE. The proposed University of Matopo is hereby granted provisional registration, which shall be valid for 12 months from January 10, 2025, to January 11, 2026.\n\nThe provisional registration allows the institution to develop physical facilities, assemble academic resources, and submit academic programs forZIMCHEsconsideration and approval.\n\nHowever, Prof. Dzvimboemphasisedthat the university cannotbegin recruitingstudents until it receives further approval.\n\nBefore the provisional registration expires, the University of Matopo must apply for full accreditation by submitting the required documents and paying the prescribed fees.\n\nThe establishment of the University of Matopo comes at a time whenZimbabweshigher education sector is rapidly expanding.\n\nThe countrynowhasmore than 20 universities, including state-owned and private institutions.\n\nPublic universities include the University of Zimbabwe, Midlands State University, and the National University of Science and Technology (NUST), among others.\n\nDespite the growth in the number of universities, the sector faces severe challenges, particularly concerning the welfare of lecturers.\n\nWhile new universities continueto emerge, lecturers at existing institutionsare strugglingunder worsening economic conditions.\n\nMany academicsare forcedto supplement their incomes through side businesses or leave for better-paying jobs abroad.\n\nThe ongoing brain drain has led to shortages of qualified personnel in critical areas, affecting the quality of education.\n\nUniversity staff have repeatedly protested over poor salaries, with some earning wages far below the cost of living.\n\nIn recent years, some institutions have struggled to pay salaries on time, leaving lecturersdemoralized.\n\nHigher education stakeholders have questioned whetherZimbabwesfocus on expanding universities is sustainable, given the financial struggles facing existing institutions.\n\nCritics argue thatresources should be directedtoward improving the quality of education, retaining qualified lecturers, and addressing infrastructure shortages before new universitiesare established.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-The government has approved a proposal by the Brethren in Christ Church (BICC) to establish the University of Matopo, adding yet another institution … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/another-new-university-on-the-cards/\">Continue reading<span class=\"screen-reader-text\"> \"Another New University On The Cards \"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "ZIMRA Officers Nabbed Over Shady Car Importation Deals",
            "url": "https://www.zimeye.net/2025/02/04/zimra-officers-nabbed-over-shady-car-importation-deals/",
            "content": "By A CorrespondentTwo Zimbabwe Revenue Authority (ZIMRA) officers stationed at Victoria Falls have been charged with criminal abuse of office following allegations of facilitating the illegal importation of motor vehicles.\n\nPhilip Kuvenga and Rangariraishe Zingwe, both customs officers at the Victoria Falls Border Post, are accused of unlawfully assisting in the importation of 20 vehicles older than ten years, a violation of Statutory Instrument 54 of 2024. The alleged offenses are said to have taken place between January and December 2024.\n\nAccording to the prosecution, the accused individuals accepted documents from clients both electronically and manually. They then manipulated vehicle valuation processes, altered chassis numbers, and submitted these falsified documents to their supervisor for approval. The manipulation was reportedly aimed at deceiving the supervisor during the vehicle age verification process.\n\nOnce the altered documents were approved, the officers allegedly entered the correct chassis numbers into the ASYCUDA World System. They are also said to have modified physical valuation sheets or replaced the original documents with the corrected ones before finalizing the processing of the vehicles.\n\nAdditionally, the officers are accused of releasing the vehicles without recording them in the release register or ensuring proper registration and insurance, as required by station procedures.\n\nThe fraudulent activities came to light when a vehicle was found to be registered despite not having physically arrived in Zimbabwe. An investigation was launched, leading to the arrest of the two officers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two Zimbabwe Revenue Authority (ZIMRA) officers stationed at Victoria Falls have been charged with criminal abuse of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/zimra-officers-nabbed-over-shady-car-importation-deals/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA Officers Nabbed Over Shady Car Importation Deals\"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "Jenarari Finds Warmth In Church",
            "url": "https://www.zimeye.net/2025/02/04/jenarari-finds-warmth-in-church/",
            "content": "By A Correspondent\n\nVice President General (Retired) Dr. Constantino Chiwenga, a key figure in Zimbabwes political landscape, is finding solace in the church amidst escalating tensions within the ruling party, Zanu PF. As the battle for succession intensifies, Chiwengas position has come under scrutiny, with growing whispers that he may be a stumbling block to President Emmerson Mnangagwas bid for a third term in office. While Mnangagwas supporters push for a 2030 agenda that extends his leadership, Chiwengas influence and loyalty to his principles are raising questions about the future direction of the party.\n\nIn a significant personal moment, Chiwenga was recently inducted into the Roman Catholic Guilds at the Catholic Church of the Immaculate Conception at the House of Nazareth in Harare. This event, marked by his wife Colonel Miniyothabo Chiwenga and children, highlighted the Vice Presidents deep connection to his faith, which has been a guiding force throughout his life.\n\nSpeaking to the media after the ceremony, Chiwenga spoke passionately about the role of the Catholic Church in shaping his character and guiding his service to the nation. I was baptized soon after my birth on the 2nd of July 1956 and I have been a Catholic ever since. Fast forward, when I went to the war of liberation in 1973, I never stopped my Catholicism. I went to war with my rosary and I came back with it, Chiwenga said. His statement is a testament to the enduring strength of his faith, which he says has been integral to both his personal and professional life.\n\nFor Chiwenga, the church has been a steadfast support system through various trials. The guild system within the Catholic Church encourages members to deepen their faith and build a strong sense of community, values which Chiwenga aligns with his approach to leadership. He emphasized that the church plays a key role in promoting national cohesion, unity, and peacevalues he believes are essential to Zimbabwes development.\n\nChiwengas commitment to the church and his strong sense of moral duty appear to guide his approach to governance. His routine, which includes arriving early to work and staying committed to his faith, seems to reflect a man dedicated to both his country and his belief system. This blend of personal conviction and professional dedication is perhaps what sets Chiwenga apart in Zimbabwes increasingly complex political environment.\n\nHowever, as Zanu PFs internal struggles over succession heat up, Chiwenga finds himself at the center of the storm. His supporters argue that his military background, leadership experience, and commitment to Zimbabwes sovereignty make him a natural successor to Mnangagwa. Yet, Mnangagwas allies are pushing for him to extend his rule beyond the constitutional limits, with the 2030 agenda serving as the rallying point for those who wish to see the President remain in power.\n\nAs the nation watches these developments unfold, Chiwengas public return to his religious roots may be an attempt to find balance in the midst of political turbulence. Whether or not the church can provide him with the guidance needed to navigate this volatile situation remains to be seen, but it is clear that Chiwengas faith continues to serve as a cornerstone of his leadership.\n\nIn the coming months, Zimbabwe will likely see an intensification of political maneuvering within Zanu PF, with Chiwengas role in the succession battle likely to remain a pivotal topic of discussion. As the church serves as a source of solace for the Vice President, it may also play an unexpected role in the unfolding political drama.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Vice President General (Retired) Dr. Constantino Chiwenga, a key figure in Zimbabwe’s political landscape, is finding solace … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/jenarari-finds-warmth-in-church/\">Continue reading<span class=\"screen-reader-text\"> \"Jenarari Finds Warmth In Church\"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "Zanu PF Leaves Learners In Limbo After “Stealing” BEAM Funds",
            "url": "https://www.zimeye.net/2025/02/04/zanu-pf-leaves-learners-in-limbo-after-stealing-beam-funds/",
            "content": "By A Correspondent\n\nIn a troubling development, the ruling Zanu PF party has been accused of hijacking the Basic Education Assistance Module (BEAM) in Masvingo Province, with government insiders revealing that well-connected individuals are now benefiting from the programme intended to assist vulnerable students.\n\nThe BEAM programme, which was created to help financially disadvantaged students access education, has long been a lifeline for many families in Zimbabwe.\n\nHowever, sources within the Ministry of Education have disclosed that influential figures are now using their power to redirect the benefits of the programme to their own advantage.\n\nThe BEAM programme has become chaotic. Government is struggling to fund and above all, those associated with Zanu PF are seizing the BEAM Programme. The whole thing is disastrous, said a school head, speaking on condition of anonymity.\n\nEducation in Zimbabwe is among the most expensive in Africa, and as a result, over 500,000 primary and secondary school learners have dropped out due to financial constraints. BEAM was originally intended to alleviate this burden by offering financial assistance to students from poor families.\n\nUnfortunately, the programme has struggled with inadequate funding, and now, with political figures allegedly exploiting it for personal gain, many vulnerable students are being left without the help they desperately need.\n\nDespite promises from the government to improve education access, the constitutional guarantee of free primary education and affordable secondary education remains largely unfulfilled. As the governments ability to fund BEAM continues to wane, the situation grows increasingly dire for families already facing financial hardship.\n\nThe situation in Masvingo Province is just one example of how the political elites involvement is threatening the future of education for Zimbabwes underprivileged students. The misappropriation of resources from programmes meant to help the poor only deepens the divide between the wealthy and those in need, undermining the goal of providing equal access to education for all.\n\nAs the crisis deepens, questions remain about how the government will address this growing scandal and whether real change will ever come for the students who depend on BEAM to stay in school.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a troubling development, the ruling Zanu PF party has been accused of hijacking the Basic Education … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/zanu-pf-leaves-learners-in-limbo-after-stealing-beam-funds/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Leaves Learners In Limbo After “Stealing” BEAM Funds\"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "Geza Says Mnangagwa Is A Korokoza",
            "url": "https://www.zimeye.net/2025/02/04/geza-says-mnangagwa-is-a-korokoza/",
            "content": "By A Correspondent\n\nIn a stunning turn of events, war veterans, led by Blessing Geza, have issued a public apology for their role in helping Emmerson Mnangagwa ascend to power during the 2017 coup that ousted Robert Mugabe. Geza, a Zanu PF Central Committee member, expressed deep regret at a press conference held in Harare on Sunday.\n\nI am deeply sorry and with hindsight, I regret this, Geza said, visibly emotional. We replaced Mugabe with a monster, a korokoza, he added, using the Shona term for a small-scale gold panner, which he used to describe Mnangagwas leadership as opportunistic and destructive.\n\nGeza went on to criticize Mnangagwa for what he sees as a dynastic grab for power, stating that the president has handed over the reins of state power to his wife and children. Mnangagwa is busy building a family empire. We helped in a big way, and today he says we are bad, Geza lamented.\n\nHis remarks have drawn attention to the growing disillusionment among some war veterans who were once strong supporters of Mnangagwas leadership. These comments also suggest that the countrys political landscape is seeing increasing internal divisions, with those who once helped bring Mnangagwa to power now questioning his leadership.\n\nThe war veterans apology adds another layer to the complex and often volatile political situation in Zimbabwe, where many are increasingly disillusioned with the direction in which the country is heading.\n\nVideo credit: HStv. https://www.youtube.com/watch?v=6PutbMrVcqo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a stunning turn of events, war veterans, led by Blessing Geza, have issued a public apology … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/geza-says-mnangagwa-is-a-korokoza/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Says Mnangagwa Is A Korokoza\"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "Wolves Target Zimbabwean Midfielder",
            "url": "https://www.zimeye.net/2025/02/04/wolves-target-zimbabwean-midfielder/",
            "content": "Sports Correspondent\n\nZimbabwean midfielder Marshall Munetsi is reportedly on the verge of joining Premier League club Wolverhampton Wanderers.\n\nThe 28-year-old, hailing from Mabvuku, has been a standout performer for French Ligue 1 side Stade Reims, netting 15 goals since his move from Orlando Pirates in 2020.\n\nWith Wolves currently struggling near the bottom of the Premier League table in 17th place, securing just 19 points from 24 games, the club is looking to strengthen its squad during the ongoing transfer window to boost their chances of avoiding relegation.\n\nFrench outlet Foot Mercato claims that Munetsi is high on Wolves radar, and the club, managed by Vitor Pereira, is reportedly prepared to make a substantial offer to Reims for the Zimbabwean international, whose contract runs through to 2027.\n\nIf the transfer goes through, Munetsi would become the second Zimbabwean player to represent Wolves, following his national teammate Tawanda Chirewa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean midfielder Marshall Munetsi is reportedly on the verge of joining Premier League club Wolverhampton Wanderers. The 28-year-old, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/wolves-target-zimbabwean-midfielder/\">Continue reading<span class=\"screen-reader-text\"> \"Wolves Target Zimbabwean Midfielder\"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "Motsepe Clinches Lucrative CAF Deal",
            "url": "https://www.zimeye.net/2025/02/04/motsepe-clinches-lucrative-caf-deal/",
            "content": "Sports Correspondent\n\nThe Confederation of African Football (CAF) has signed a new sponsorship deal with French energy giant TotalEnergies, extending their partnership until 2029. The agreement, worth $375 million, was concluded after the 2025 Afcon draw in Rabat, Morocco, by CAF President Patrice Motsepe and TotalEnergies Chairman and CEO Patrick Pouyann .\n\nAs part of the deal, TotalEnergies will sponsor 12 major CAF events, including:\n\nCAF President Dr. Motsepe expressed his excitement about the continued partnership, stating that it contributes to the development and global competitiveness of football in Africa . Pouyann added that TotalEnergies is proud to support the rise of African football, with its values of diversity, cohesion, and unity.\n\nThis partnership extension demonstrates the strong relationship between CAF and TotalEnergies, which has been in place since 2016 .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Confederation of African Football (CAF) has signed a new sponsorship deal with French energy giant TotalEnergies, extending … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/motsepe-clinches-lucrative-caf-deal/\">Continue reading<span class=\"screen-reader-text\"> \"Motsepe Clinches Lucrative CAF Deal\"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        },
        {
            "title": "ZIMRA Officials Facilitate Fraudulent Importation Of Cars",
            "url": "https://www.zimeye.net/2025/02/04/zimra-officials-facilitate-fraudulent-importation-of-cars/",
            "content": "By A Correspondent\n\nTwo Zimbabwe Revenue Authority (ZIMRA) officers stationed at Victoria Falls have been charged with criminal abuse of office following allegations of facilitating the illegal importation of motor vehicles.\n\nPhilip Kuvenga and Rangariraishe Zingwe, both customs officers at the Victoria Falls Border Post, are accused of unlawfully assisting in the importation of 20 vehicles older than ten years, a violation of Statutory Instrument 54 of 2024. The alleged offenses are said to have taken place between January and December 2024.\n\nAccording to the prosecution, the accused individuals accepted documents from clients both electronically and manually. They then manipulated vehicle valuation processes, altered chassis numbers, and submitted these falsified documents to their supervisor for approval. The manipulation was reportedly aimed at deceiving the supervisor during the vehicle age verification process.\n\nOnce the altered documents were approved, the officers allegedly entered the correct chassis numbers into the ASYCUDA World System. They are also said to have modified physical valuation sheets or replaced the original documents with the corrected ones before finalizing the processing of the vehicles.\n\nAdditionally, the officers are accused of releasing the vehicles without recording them in the release register or ensuring proper registration and insurance, as required by station procedures.\n\nThe fraudulent activities came to light when a vehicle was found to be registered despite not having physically arrived in Zimbabwe. An investigation was launched, leading to the arrest of the two officers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two Zimbabwe Revenue Authority (ZIMRA) officers stationed at Victoria Falls have been charged with criminal abuse of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/04/zimra-officials-facilitate-fraudulent-importation-of-cars/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA Officials Facilitate Fraudulent Importation Of Cars\"</span></a></p>",
            "time": "09:46",
            "date": "04 Feb 2025"
        }
    ]
}