{
    "news": [
        {
            "title": "Mliswa Drops Another Missile",
            "url": "https://www.zimeye.net/2025/10/04/mliswa-drops-another-missile/",
            "content": "By A Correspondent  Outspoken former legislator Temba Mliswa has launched yet another explosive claim, this time alleging that fuel mogul and ZANU PF Central Committee member Kudakwashe Tagwirei has captured Zimbabwes military and is being prepared to succeed President Emmerson Mnangagwa.\n\nThe claims surfaced in a leaked audio of a private conversation between Mliswa and businessman Agrippa Bopela Masiyakurima, released on Thursday.\n\nThe leak comes just days after Mliswas rural home in Shurugwi was torched by unknown assailants in what police confirmed as a suspected arson attack. Mliswa described it as an assassination attempt linked to his persistent calls for accountability in government.\n\nIn the recording, Mliswa alleges that Mnangagwa has secured the loyalty of the armed forces through Tagwireis financial muscle. He claims that the hundreds of vehicles delivered to the Zimbabwe Defence Forces (ZDF) last week were not government-funded, as Mnangagwa announced, but were supplied by Tagwirei.\n\nMnangagwa will leave someone he trusts to look after his interests, and thats Kuda, Mliswa is heard saying.\n\nThere is no coup that will ever happen in Zimbabwe. Just check, military bosses were given 100 cars. Those are Kudas cars.\n\nMliswa further alleges that ZDF Commander General Philip Valerio Sibanda salutes Tagwirei when he passes by. He claims at least 500 vehicles will be distributed not only to top brass but also to colonels, captains, and majors  a strategy he described as good politics since mid-ranking officers are the backbone of the military.\n\nMliswa also revealed that he has been touring the country distributing bicycles donated by Tagwirei to village heads.\n\nMasiyakurima said he recorded the conversation after rejecting what he described as Mliswas offer to join a campaign backing Tagwirei. He alleged that Mliswa dangled promises of cash, vehicles, and business support in exchange for loyalty.\n\nWhen I realised the money was coming with conditions, I refused. My morals and principles would not allow me to be a sell-out, Masiyakurima said.\n\nI just wanted to show Zimbabweans that Temba goes to the highest bidder. He has been recruited by Tagwirei to do smear campaigns against VP Chiwenga.\n\nIn response, Mliswa accused Masiyakurima of betrayal. Writing on X, he said Masiyakurima had violated the sanctity of a private discussion:\n\nAs for you Bopela, I considered you a brother and friend and tried to help. We ate and took children to school together. Unfortunately, you had other ideas to please who I dont know. Next time, leak the whole conversation, not what you think are favourable portions.\n\nThe fallout adds fuel to tensions already swirling around Vice President Constantino Chiwengas bitter standoff with controversial businessman Wicknell Chivayo.\n\nMliswa has accused Chiwenga of using anti-corruption rhetoric selectively, claiming it stems from Chivayos alleged failure to fully bankroll Chiwengas 2022 wedding to Colonel Miniyothabo Baloyi. According to Mliswa, Chivayo lavished millions in cash, cars, and properties on the wedding but fell short by US$150,000  sparking Chiwengas vendetta.\n\nHe has also criticised Chiwenga for openly challenging Mnangagwa in Politburo meetings, warning that such disputes risk destabilising the party.\n\nMliswas latest claims follow weeks of political turbulence. Earlier, his vehicle was vandalised in what he linked to his attacks on Chiwenga. The arson attack on his Shurugwi homestead marked a sharp escalation.\n\nPolice confirmed the incident on Friday, saying investigations were underway:\n\nThe ZRP confirms that investigations are currently underway in connection with the malicious damage to property incident at Temba Mliswas homestead in Shurugwi on 02/10/25. More details will be released in due course.\n\nMliswa, a former ZANU PF Mashonaland West chairman, has a long history of clashes with party elites. Expelled in 2014 for allegedly undermining leadership, he reinvented himself as an independent legislator but remained deeply involved in factional politics.\n\nDespite repeated setbacks, Mliswa has carved a reputation as a political maverick who exposes corruption and power struggles inside ZANU PF. Following the Shurugwi attack, he reportedly left for Johannesburg, South Africa, raising speculation over whether he is seeking refuge or preparing for another round of political confrontation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Outspoken former legislator Temba Mliswa has launched yet another explosive claim, this time alleging that fuel … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/mliswa-drops-another-missile/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Drops Another Missile\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Fresh Details In Mliswa Foiled Assassination",
            "url": "https://www.zimeye.net/2025/10/04/fresh-details-in-mliswa-foiled-assassination/",
            "content": "By A Correspondent  Police have confirmed a suspected arson attack on the rural home of outspoken former ZANU PF Mashonaland West Provincial Chairman Temba Mliswa in Shurugwi, an incident he described as a foiled assassination attempt.\n\nMliswa revealed on Thursday that his homestead was set ablaze by unknown assailants on Wednesday night, linking the attack to his uncompromising calls for accountability in government.\n\nI have always known that corruption fights back and am prepared for everything. Last night they sneaked and burnt my house in Shurugwi all because I asked for accountability and transparency. Thank God no one was hurt. Mapisa Nyadzonia! he wrote onX, invoking the memory of the 1976 Nyadzonia massacre in Mozambique to frame the incident as a politically motivated act of terror.\n\nIn a brief statement on Friday, the Zimbabwe Republic Police confirmed the incident:\n\nThe ZRP confirms that investigations are currently underway in connection with the malicious damage to property incident at Temba Mliswas homestead in Shurugwi on 02/10/25. More details will be released in due course.\n\nMliswa has long been a polarising figure in Zimbabwean politics. As ZANU PFs Mashonaland West chairman, he frequently clashed with senior party officials, including then-First Lady Grace Mugabe, during the factional wars that preceded Robert Mugabes ouster in 2017. He was expelled from the party in 2014 for allegedly undermining the leadership but reinvented himself as an independent legislator.\n\nDespite being outside formal ZANU PF structures, Mliswa has remained influential, often inserting himself into factional disputes and acting as a political broker. His blunt criticism of senior officials, coupled with his grassroots networks, has kept him relevant while also making him a target of powerful rivals.\n\nThe attack on Mliswas home comes in the wake of escalating tensions linked to Vice President Constantino Chiwengas feud with controversial businessman Wicknell Chivayo.\n\nMliswa has accused Chiwenga of weaponising anti-corruption rhetoric to settle personal scores, claiming the fallout stemmed from Chivayos alleged failure to fully bankroll Chiwengas lavish 2022 wedding to Colonel Miniyothabo Baloyi.\n\nAccording to Mliswa, Chivayo provided millions of dollars in cash, luxury cars, and properties for the wedding and honeymoon but reportedly fell short by US$150,000. Mliswa alleges that this unpaid balance triggered Chiwengas campaign to have Chivayo arrested.\n\nHe has further criticised Chiwenga for publicly challenging President Emmerson Mnangagwa in Politburo meetings, warning that such disputes should be handled discreetly rather than destabilising the ruling party.\n\nEarlier this week, Mliswas vehicle was vandalised in an incident he also linked to his outspoken attacks on Chiwenga. The suspected arson attack on his homestead appears to have escalated the hostility.\n\nDespite a history of clashes with ruling party elites, Mliswa has consistently survived politically, carving a reputation as a maverick who exposes corruption and factionalism within ZANU PF.\n\nFollowing the Shurugwi attack, he reportedly left Zimbabwe for Johannesburg, South Africa, on Thursday afternoon, raising speculation over whether he is seeking temporary refuge or regrouping for another round of political confrontation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Police have confirmed a suspected arson attack on the rural home of outspoken former ZANU PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/fresh-details-in-mliswa-foiled-assassination/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh Details In Mliswa Foiled Assassination\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Zim Musicians Win Big",
            "url": "https://www.zimeye.net/2025/10/04/zim-musicians-win-big/",
            "content": "By Showbiz Reporter  A leading fast-food outlet has lost a landmark case after the High Court ruled that it illegally played songs by local musicians without securing the proper rights.\n\nThe ruling, delivered this week, is expected to reshape the way Zimbabwes biggest brands pay musicians for the commercial use of their music.\n\nAt the centre of the case was the fast-food giant accused of playing hits by top stars such as Alick Macheso, Jah Prayzah, Winky D, Nutty O, and Killer T without paying royalties to the Zimbabwe Music Rights Association (ZIMURA).\n\nZIMURA, which represents more than 4,500 Zimbabwean musicians and works with international artists through the CISAC network, argued that the companys outlets routinely used music to entertain customers but had failed to obtain a licence.\n\nThe court agreed with ZIMURA, confirming that the company had indeed used copyrighted works belonging to its members without authorisation. However, ZIMURAs US$86,719 damages claim was dismissed after it failed to provide proof of actual financial losses, instead basing the figure on a standard licence fee.\n\nDespite that setback, the judgment was hailed as a significant victory for musicians. Justice Mafusire ruled that ZIMURA  and not its rival, the Zimbabwe Council of Copyright Owners (ZCCO)  is the sole authority empowered to license works by artists registered under it.\n\nFor celebrated musicians like Macheso, Jah Prayzah, and the late Oliver Mtukudzi, the ruling reinforces a vital principle: their art cannot be used freely without proper royalties being paid.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – A leading fast-food outlet has lost a landmark case after the High Court ruled that it … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/zim-musicians-win-big/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Musicians Win Big \"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Mnangagwa Minister Escapes Jail",
            "url": "https://www.zimeye.net/2025/10/04/mnangagwa-minister-escapes-jail/",
            "content": "By A Correspondent Former Agriculture Deputy MinisterDouglas Karorohas been acquitted.\n\nKaroro, who was accused of siphoning farming inputs from the Grain Marketing Board (GMB) to distribute in Mbire district, was cleared of fraud charges by Regional Magistrate Taurai Manuwere.\n\nHe was jointly charged with GMB assistant managerLovejoy Ngowe, who was also found not guilty.\n\nRepresented by lawyers Admire Rubaya and Malvern Mapako, Karoro argued that the State failed to link him to the alleged offence. He maintained that he was never involved in the release or collection of maize seed at GMB Mushumbi, and that the depot manager himself had exonerated him.\n\nKaroro further claimed the charges were politically motivated, alleging his rivals fabricated the case to push him out of the race to represent Mbire in the 2023 harmonised elections.\n\nThere is no indication whatsoever of what the alleged misrepresentation is, how it was allegedly made by the accused persons, or to whom it was made, his lawyer argued in court.\n\nThe defence also challenged the credibility of the States key witness, Honest Nyathi, describing him as unreliable and pointing out that he admitted completing paperwork in Karoros absence. The paperwork created the impression that Karoro was present, yet he was not, the defence submitted.\n\nIt was further alleged that Karoro received 5,000 vegetable combo kits from Valley Seed Private Limited under the Presidential Input Programme and converted them for personal use. Karoro denied this, insisting he was a victim of name-dropping by the real culprits.\n\nThe State alleged that the person who collected the combo kits signed for them, yet there is no evidence that the person who signed was the accused. No handwriting expert confirmed that the signature belonged to Karoro, and no witness saw him sign the documents, his lawyer added.\n\nWith these inconsistencies, the court ruled that the State had failed to prove its case beyond reasonable doubt, leading to Karoros acquittal.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former Agriculture Deputy Minister Douglas Karoro has been acquitted. Karoro, who was accused of siphoning farming inputs from the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/mnangagwa-minister-escapes-jail/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister Escapes Jail\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Top Educationist Dies",
            "url": "https://www.zimeye.net/2025/10/04/top-educationist-dies/",
            "content": "By A Correspondent Respected educationist and former Zimbabwe Anti-Corruption Commission (ZACC) commissioner,Mr Lakayana Keith Chabaka Duve, popularly known asThe Duke of Chibi, has died.\n\nHe was 81.\n\nBorn on 23 August 1944 in Chivi, Mr Duve dedicated his life to education, public service, and community development.\n\nHe attended Mukotosi Primary, Dadaya, and Goromonzi High Schools before pursuing higher education, which laid the foundation for his distinguished career in leadership.\n\nHe began his career as a teacher and later rose to head several schools, among them Glen Norah 1 High in Harare, where he spearheaded the construction of a protective durawall, and Victoria High in Masvingo. He eventually became Regional Director of Education for Mashonaland Central.\n\nAt national level, Mr Duve held senior posts, includingPrincipal Inspector General in the Public Service,Press Secretary to the late Vice President Dr Simon Muzenda, andActing Permanent Secretary. He also served as a commissioner with ZACC, sat on the Mlezu Agricultural College Board, and lectured at the Zimbabwe Open University.\n\nA philanthropist at heart, Mr Duve invested in education, families, and community upliftment, leaving behind a lasting legacy of service and empowerment.\n\nHe is survived by five children and six grandchildren. Burial will take place onSunday, 5 October 2025, at the Duve Homestead in Mukotosi, Chivi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Respected educationist and former Zimbabwe Anti-Corruption Commission (ZACC) commissioner, Mr Lakayana Keith Chabaka Duve, popularly known as The Duke … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/top-educationist-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Educationist Dies\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Municipal Police Beaten Up By Angry Motorists",
            "url": "https://www.zimeye.net/2025/10/04/municipal-police-beaten-up-by-angry-motorists/",
            "content": "By A Correspondent Chaos erupted in Bulawayos Central Business District after angry motorists attacked municipal police officers accused of harassing drivers with heavy-handed tactics.\n\nBulawayo Mayor David Coltart confirmed the violent incident, revealing that one municipal officer was badly injured, losing a tooth and requiring hospitalisation, while four municipal vehicles were stoned, leaving windows shattered and panels dented.\n\nI am deeply concerned about the assault on our municipal police and vehicles in the early hours of yesterday, Coltart posted onX. They were involved in clean-up operations in the city centre when they were set upon by a lawless mob. This is unacceptable behaviour as we seek to clean up Bulawayo and restore order.\n\nThe incident highlights growing public anger across Zimbabwes towns and cities, where municipal police have become notorious for waging an undeclared war on motorists and cyclists.\n\nFrom Harare to Bulawayo, Gweru, Mutare, and Masvingo, municipal police have adopted aggressive tactics that include laying ambushes, clamping cars and even bicycles, and issuing exorbitant fines for minor parking offences. Many motorists complain of being penalised for trivial violations such as stopping briefly to pick up a passenger or parking slightly outside designated bays.\n\nMotorists say these operations are less about restoring order and more about revenue collection, as local authorities struggling with shrinking budgets increasingly view motorists as cash cows. In many instances, drivers are forced to pay spot fines on the roadside to avoid having their vehicles towed, a practice that has fuelled accusations of corruption and extortion.\n\nTensions have escalated in recent years, with several clashes reported between municipal police and members of the public. Social media is flooded with videos showing municipal officers dragging motorists out of vehicles, fighting with kombi (minibus) drivers, or piling onto bicycles to clamp them.\n\nCivil society groups and transport associations have repeatedly called for the government to intervene, warning that the confrontations could spiral into more violent episodes as public resentment grows.\n\nWhile condemning the mob attack, Mayor Coltart urged residents to work with the local authority to restore order and transform Bulawayo into a clean, orderly, world-class city attractive to investors. He also called on the Zimbabwe Republic Police (ZRP) to investigate and bring those responsible for the assault to justice.\n\nHowever, motorists insist that unless municipal police abandon their predatory methods and focus on fair law enforcement, clashes like these will continue to flare up in urban centres across the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Chaos erupted in Bulawayo’s Central Business District after angry motorists attacked municipal police officers accused of harassing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/municipal-police-beaten-up-by-angry-motorists/\">Continue reading<span class=\"screen-reader-text\"> \"Municipal Police Beaten Up By Angry Motorists\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Top Restaurant Loses Music Rights Case",
            "url": "https://www.zimeye.net/2025/10/04/top-restaurant-loses-music-rights-case/",
            "content": "By Showbiz Reporter A leading fast-food outlet has lost a landmark case after the High Court ruled that it illegally played songs by local musicians without securing the proper rights.\n\nThe ruling, delivered this week, is expected to reshape the way Zimbabwes biggest brands pay musicians for the commercial use of their music.\n\nAt the centre of the case was the fast-food giant accused of playing hits by top stars such as Alick Macheso, Jah Prayzah, Winky D, Nutty O, and Killer T without paying royalties to the Zimbabwe Music Rights Association (ZIMURA).\n\nZIMURA, which represents more than 4,500 Zimbabwean musicians and works with international artists through the CISAC network, argued that the companys outlets routinely used music to entertain customers but had failed to obtain a licence.\n\nThe court agreed with ZIMURA, confirming that the company had indeed used copyrighted works belonging to its members without authorisation. However, ZIMURAs US$86,719 damages claim was dismissed after it failed to provide proof of actual financial losses, instead basing the figure on a standard licence fee.\n\nDespite that setback, the judgment was hailed as a significant victory for musicians. Justice Mafusire ruled that ZIMURA  and not its rival, the Zimbabwe Council of Copyright Owners (ZCCO)  is the sole authority empowered to license works by artists registered under it.\n\nFor celebrated musicians like Macheso, Jah Prayzah, and the late Oliver Mtukudzi, the ruling reinforces a vital principle: their art cannot be used freely without proper royalties being paid.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – A leading fast-food outlet has lost a landmark case after the High Court ruled that it illegally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/top-restaurant-loses-music-rights-case/\">Continue reading<span class=\"screen-reader-text\"> \"Top Restaurant Loses Music Rights Case\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Police Vow To Deal With Unruly Motorists",
            "url": "https://www.zimeye.net/2025/10/04/police-vow-to-deal-with-unruly-motorists/",
            "content": "The Zimbabwe Republic Police (ZRP) has released registration numbers of vehicles caught on camera flouting red traffic lights in Harares Central Business District.\n\nPolice Spokesperson Commissioner Paul Nyathi said the violations were captured through the Electronic Traffic Management System and warned that all implicated vehicle owners must cooperate with authorities.\n\nAll the vehicle owners with registration numbers on the attached list are advised to report at any nearest police station to assist in the ongoing investigations within the next seven days, Nyathi said.\n\nHe stressed the importance of compliance, adding: Vehicle owners and those in possession of the vehicles are urged to cooperate with the police to assist in the maintenance of law and order in the country.\n\nNyathi also urged drivers to respect traffic laws to improve road safety. The Zimbabwe Republic Police implores motorists to observe road rules and regulations to enhance the smooth flow of traffic and curb road traffic accidents, he said.\n\nAuthorities say the clampdown is part of a broader push to restore discipline among motorists and reduce accidents in the capital.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Zimbabwe Republic Police (ZRP) has released registration numbers of vehicles caught on camera flouting red traffic lights in Harare’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/police-vow-to-deal-with-unruly-motorists/\">Continue reading<span class=\"screen-reader-text\"> \"Police Vow To Deal With Unruly Motorists\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "Has Zimbabwe Been Taken Over by Criminals?",
            "url": "https://www.zimeye.net/2025/10/04/has-zimbabwe-been-taken-over-by-criminals/",
            "content": "By A Engineer Jacob Kudzayi Mutisi |  A simple question on every Zimbabweans mind is, has our country been taken over by criminals?\n\nThe evidence is there for all to see. The Gold Mafia scandal revealed billions siphoned out of the nation through illicit gold deals, while Parliament itself heard claims that senior government officials demand a five per cent cut on contracts, earning one of them the nickname Mr 5%. Former Mines Minister Obert Mpofu has long been accused of demanding payments for diamond concessions, with little accountability ever shown.\n\nAt the same time, those who dare expose wrongdoing face harassment and intimidation. Former MP Eddie Cross was summoned to State House for raising uncomfortable truths, where Information Minister Jenfan Muswere went so far as to insult him as a Rhodesian.\n\nThe pattern is depressingly familiar. From Willowgate in the 1980s to the War Victims Compensation Fund scandal of the 1990s, from the collapse of Zisco Steel to the missing billions in Command Agriculture and the Covid-19 procurement scandal, the story repeats itself, money vanishes, ordinary Zimbabweans pay the price and those in power walk free.\n\nMeanwhile, hospitals struggle, industries collapse and schools deteriorate. Ordinary citizens are left in poverty while those in government circles flaunt ill-gotten wealth.\n\nIf the state protects thieves and punishes truth-tellers, then who really governs Zimbabwe? Are we still a nation with laws, or a territory run by criminals in suits? Until there is accountability real arrests, real convictions, and real transparency the suspicion will remain that our beloved country has indeed been captured by criminals.\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Engineer Jacob Kudzayi Mutisi | A simple question on every Zimbabwean’s mind is, “has our country been taken … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/has-zimbabwe-been-taken-over-by-criminals/\">Continue reading<span class=\"screen-reader-text\"> \"Has Zimbabwe Been Taken Over by Criminals?\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        },
        {
            "title": "‘Stop Misleading Nation’: Zivhu Attacks Vapositori Over 2030 Agenda",
            "url": "https://www.zimeye.net/2025/10/04/stop-misleading-nation-zivhu-attacks-vapositori-over-2030-agenda/",
            "content": "By A Correspondent\n\nControversial Zanu PF official Killer Zivhu has taken aim at members of the Apostolic sect, accusing them of misleading Zimbabweans by endorsing President Emmerson Mnangagwas 2030 agenda.\n\nOn Monday, Zivhu took to X, targeting Vapositori and their prophetic claims. He said, Mapositori anoda shamhu, ndivo vachatiurayira Nyika, ne zviporofita zvavo zvokum*ma, hanzi Mwari vati darikirai 2028 ndizvo zvataura Gabireri mutumwa muzvirege zvinhu zvenyu izvozvo.\n\nHis remarks come amid escalating tensions within Zanu PF, as Mnangagwa continues to contend with his deputy, Constantino Chiwenga, in a protracted power struggle. Zivhus comments suggest that some religious leaders are taking sides, lending spiritual endorsement to political agendas.\n\nIt is unacceptable that religious figures are being used to justify political agendas that threaten the sovereignty of our country, Zivhu added. Zimbabweans must not be misled by prophets who serve political interests instead of God.\n\nThe confrontation highlights the growing entanglement of religion and politics in Zimbabwe, particularly as factions within Zanu PF position themselves ahead of Mnangagwas 2030 roadmap.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF official Killer Zivhu has taken aim at members of the Apostolic sect, accusing them … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/04/stop-misleading-nation-zivhu-attacks-vapositori-over-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"‘Stop Misleading Nation’: Zivhu Attacks Vapositori Over 2030 Agenda\"</span></a></p>",
            "time": "21:05",
            "date": "04 Oct 2025"
        }
    ]
}