{
    "news": [
        {
            "title": "Headmaster Arrested, Students’ Grades to Be ‘Augmented’ After Haircut Humiliation",
            "url": "https://www.zimeye.net/2025/12/02/headmaster-arrested-students-grades-to-be-augmented-after-haircut-humiliation/",
            "content": "By Dorrothy Moyo | Harare, Zimbabwe  December 2, 2025 In a tense post-Cabinet briefing that has ignited nationwide debate on student rights and school discipline, Zimbabwes Minister of Primary and Secondary Education, Torerai Moyo, revealed the arrest of a Harare high school headmaster and director over a controversial incident where nine Ordinary Level candidates were barred from a crucial ZIMSEC exam due to inappropriate haircuts. The minister outlined emergency measures, including an unprecedented augmentation policy to salvage the students grades, while vowing to prevent future violations of learners fundamental rights.\n\nMinister Torerai Moyo making the announcement.\n\nThe scandal erupted last week at an unnamed institution in Harare during the Zimbabwe School Examinations Council (ZIMSEC) Family and Religious Studies (FRS) Ordinary Level paper. According to Moyos account, the nine male students  all candidates for the national exams  were denied entry to the examination hall by school authorities who deemed their hairstyles non-compliant with an informal grooming code. We do not have an explicit, clear-cut policy, but we want our students to be smartly dressed. Haircuts must resemble that they are students, Moyo stated, emphasizing the governments one-size-fits-all head hat policy on appearance without delving into specifics on what constitutes appropriate.\n\nForced to comply under duress, the students rushed off-site for hasty haircuts, only to return 55 minutes into the 3-hour exam. ZIMSEC regulations strictly prohibit late entries after the first 50 minutes to prevent cheating, leaving the group locked out and their FRS paper effectively missed. In a partial reprieve, the students were allowed to sit a subsequent FRS component, but the core damage was done. The incident, which Moyo described as a blatant infringement on access to education, has drawn sharp criticism from educators, parents, and rights advocates who argue it exposes deeper systemic flaws in Zimbabwes education sector, including subjective decency codes that disproportionately target Afro-textured hair and modern youth styles.\n\nSwift Justice: Arrests and Court Drama\n\nMoyo wasted no time in condemning the schools actions as inconsistent with ministry guidelines. This was a violation of the fundamental rights of todays education and access to examination, he declared. The headmaster and the schools director were arrested two weeks ago and hauled before the Mbare Magistrates Court last Friday. Bail was granted, with the duo scheduled to reappear before the very masters of the ninth or the seventh  a reference to the courts divisions  in the coming days. While specifics on charges remain under wraps, sources close to the ministry suggest they include assault, unlawful detention, and undermining constitutional rights to education under Section 75 of Zimbabwes Constitution.\n\nThe arrests mark a rare escalation in accountability for school administrators, who have long wielded unchecked authority over grooming policies. Critics, including Harare-based education consultant Derek Tafuma, hailed the move but warned it barely scratches the surface. This isnt just about haircuts; its a tragic expose of a deeper systemic issue in Zimbabwean education: the absence of a nationally codified, transparent school-grooming policy, Tafuma posted on X (formerly Twitter) earlier today. When smartness is undefined and cultural  especially around Afro-textured hair and modern youth styles  it inevitably becomes a proxy for broader disciplinary anxieties rather than pedagogy.\n\nAugmentation Policy: A Lifeline or a Band-Aid?\n\nIn a bid to mitigate the fallout, Moyo announced the governments invocation of ZIMSECs augmentation policy  a rarely used statistical remedy designed for exam disruptions. Under the plan, the affected students grades for the missed FRS segment will not be zeroed out. Instead, examiners will analyze the top and bottom performers in the subject nationwide, then match the scripts from the students completed FRS paper against these benchmarks. We are going to apply the augmentation policy where we give an augmentation policy to the student. They are going to look at the top four students in the how they perform in the stress paper and the last four. Then we are going to match the scripts and give a grade to those students who affect the soul, Moyo explained, his words occasionally stumbling amid the briefings intensity.\n\nThis approach, Moyo stressed, ensures the students will not be decided on it but we use the augmentation policy to keep it great to align with candidates who are back from the right to the examination. While intended as compassionate, the policy has sparked concerns over fairness. Education rights group ZimRights called it a quiet normalization of statistical imputation rather than the students own demonstrated paper, warning of far-reaching implications for exam integrity in future disputes. Whats rarely discussed is that ZIMSECs aggregation remedy, while compassionate, quietly normalises the idea that a learners final grade can be determined without their own work, Tafuma added in his viral thread.\n\nThe minister ruled out rescheduling the exam entirely, citing logistical nightmares for the ongoing November 2025 O-Level series. However, he pledged broader reforms: co-drafting evidence-based uniform and grooming regulations with students, parents, and psychological experts to ensure no child again trades dignity for the right to sit an exam.\n\nPublic Outrage and Broader ImplicationsThe incident has exploded across social media, with hashtags like #HaircutExamScandal and #ZIMSECBarred trending in Zimbabwe. X users from across the spectrum weighed in: Are the children allowed to hold rallies and meetings? I hear only ZANU PF can do that, quipped one satirical post, drawing parallels to political double standards. Another, from user @SiphoNkosi22, fumed: These guys wrote Paper 1 now thats weak and useless at the same time by the minister. The culprits must be sacked, finish and klaar.\n\nEng Gandalf the Zimbabwean (@EngGandalfZW) posed a poignant question: How did they write the paper when they were barred? Do you read what you type? Meanwhile, Darlington Gombingo (@DarlingtonGombingo) lamented the ministrys initial silence: Minister vane O level here  a jab at perceived elite disconnect.\n\nThis isnt Zimbabwes first brush with grooming controversies; similar incidents in 2023 led to protests over dreadlocks bans. With O-Levels underway for over 200,000 candidates, the episode underscores urgent needs for codified policies amid economic strains that already burden families with exam fees (recently extended to May 2026 for relief).\n\nAs the accused educators face the bench, all eyes are on whether Moyos promises translate to action  or if this haircut fiasco becomes another scar on an education system fighting for equity. ZIMSEC has yet to issue a formal statement, but ministry insiders hint at a full review of school conduct codes by terms end.\n\n-This is a developing story. ZimEye will provide updates as court proceedings unfold.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Harare, Zimbabwe – December 2, 2025– In a tense post-Cabinet briefing that has ignited nationwide debate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/headmaster-arrested-students-grades-to-be-augmented-after-haircut-humiliation/\">Continue reading<span class=\"screen-reader-text\"> \"Headmaster Arrested, Students’ Grades to Be ‘Augmented’ After Haircut Humiliation\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "Joe Luphahla Joins FC Platinum?",
            "url": "https://www.zimeye.net/2025/12/02/joe-luphahla-joins-fc-platinum/",
            "content": "Sports Correspondent  Joel Luphahla has reportedly completed his move to FC Platinum, a club source confirmed on Tuesday, signalling a major technical shift for the Zvishavane-based giants.\n\nAccording to the insider, Luphahla will take over the reins from long-serving coach Norman Mapeza, who parted ways with the club at the end of the season after an eventful tenure marked by championship success and continental ambitions.\n\nLuphahla, a former Warriors winger known for his tactical sharpness and calm leadership, is expected to bring fresh ideas as FC Platinum rebuilds and seeks to reclaim dominance in the Castle Lager Premier Soccer League.\n\nThe club is yet to issue an official statement, but the development has already sparked wide discussion among supporters eager to see how Luphahla will shape the squad ahead of the new campaign.\n\nJoe Luphahla\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Joel Luphahla has reportedly completed his move to FC Platinum, a club source confirmed on Tuesday, signalling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/joe-luphahla-joins-fc-platinum/\">Continue reading<span class=\"screen-reader-text\"> \"Joe Luphahla Joins FC Platinum?\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "Chinhoyi Man Donaty Sibanda Dies Hours Before Fundraising Campaign Fully Launches",
            "url": "https://www.zimeye.net/2025/12/02/chinhoyi-man-donaty-sibanda-dies-hours-before-fundraising-campaign-fully-launches/",
            "content": "By A Correspondent |The news was confirmed Monday evening by close friends and community members who had spent the past 48 hours frantically mobilising resources under the hashtag #ADollarForDonaty and a widely circulated crowdfunding poster calling for financial assistance to cover emergency medical bills and a possible airlift for specialised neurosurgery.\n\nAccording to sources close to the family, Donaty was involved in a single-vehicle accident late Saturday night. He was rushed to Chinhoyi Provincial Hospital in critical condition and later transferred to a private health facility in Harare where he fought for his life in the intensive care unit. Despite the efforts of medical staff and the outpouring of public support, he succumbed to his injuries on Monday afternoon.\n\nDonaty Sibanda has passed away. He died from complications related to the head injuries he suffered after a car accident on Saturday in Chinhoyi, read a statement posted on Facebook by the Chinhoyi Talker page. The community was just about to launch a fundraising project to assist with his medical bills, but he passed away before the project could fully take off. May his soul rest in peace.\n\nThe fundraising appeal, which asked for even a single dollar to help save the young mans life, had already gained significant traction across WhatsApp groups, Facebook, and X (formerly Twitter), with many Zimbabweans inside and outside the country pledging contributions. The designated EcoCash number (+263778256462) had started receiving donations moments before news of his death broke.\n\nSocial media is now flooded with messages of grief and disbelief. Many are questioning the rising number of fatal accidents involving young people on Zimbabwes roads.\n\nMHSRIP. So this accident claimed how many? one commenter asked, hinting at reports that the crash may have involved multiple victims.\n\nTributes describe Donaty as a vibrant, ambitious, and kind-hearted individual who was well-known and loved in the Chinhoyi community.\n\nThe family has not yet released official funeral arrangements.\n\nRest in peace, Donaty Sibanda.#ADollarForDonaty #RIPDonatySibanda #Chinhoyi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent |  The news was confirmed Monday evening by close friends and community members who had spent the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/chinhoyi-man-donaty-sibanda-dies-hours-before-fundraising-campaign-fully-launches/\">Continue reading<span class=\"screen-reader-text\"> \"Chinhoyi Man Donaty Sibanda Dies Hours Before Fundraising Campaign Fully Launches\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "Rogue “Camera Car” Slammed for Ticketing Motorists Standing Beside Their Vehicles",
            "url": "https://www.zimeye.net/2025/12/02/rogue-camera-car-slammed-for-ticketing-motorists-standing-beside-their-vehicles/",
            "content": "Harare Motorists Outraged as City Parkings Drive-By Camera Car Issues Instant Tickets  Even When Drivers Are Standing Next to Their Vehicles\n\nHarare, 02 December 2025 A new automated enforcement vehicle operated by City Parking Harare, equipped with roof-mounted cameras, is sparking widespread anger among motorists after it issued a US$46 penalty to a driver who was literally standing next to his parked car waiting for a parking marshal.\n\nThe incident occurred this afternoon in the Avenues area when the white City Parking Toyota Aqua (registration visible in photos) drove past the motorists vehicle and instantly generated a digital ticket via its camera system. Moments later, a clamping team arrived on foot and locked the car, claiming the mandatory 15-minute grace period had already expired.\n\nI was waiting right there for the marshal so I could pay immediately, the affected driver told reporters. Before the marshal even reached me, the camera car had already photographed my plate and sent the ticket. When the marshal arrived with the clamper, he showed me a WhatsApp message from their office confirming the fine had already been issued.\n\nWhen the driver challenged the penalty at City Parkings head office on Julius Nyerere Way, he says he was told by a woman identifying herself as the Head of Public Relations that the rules are absolute: **The moment you park, you must actively search for a marshal. Even if you remain next to your vehicle, the system will still fine and clamp you after 15 minutes.** Motorists are reportedly not allowed to wait for marshals to come to them.\n\nThe driver was forced to pay US$46 in cash on the spot to have the clamp removed and was denied access to any senior manager to lodge a formal complaint.\n\nThis is not an isolated case. The same motorist revealed this was the second time he had been clamped while actively trying to comply  the previous occasion occurred while he was walking around the block looking for a marshal, only to return and find his wheel already locked.\n\nSocial media is exploding with similar stories, with dozens of motorists posting photographs of the distinctive camera-equipped City Parking vehicle and receipts showing fines issued within minutes of parking, even in areas where marshals are nowhere to be seen.\n\nCritics are calling the system a revenue trap rather than a parking management tool, arguing that:\n\n The 15-minute grace period is meaningless if the camera car can issue tickets in seconds Motorists are being punished for the chronic shortage of visible parking marshals The policy of clamping even when drivers are present and willing to pay is punitive and extortionate\n\nCity Parking Harare has so far not released an official statement on the new camera vehicle or responded to questions about whether the 15-minute rule still applies when automated enforcement is used.\n\nAs rush hour continues this evening, motorists across central Harare are sharing a new survival tip circulating on WhatsApp groups: **If you see the white Aqua with the cameras on the roof, dont even think about parking  just keep driving.**\n\nMore updates as this story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare Motorists Outraged as City Parking’s “Drive-By Camera Car” Issues Instant Tickets — Even When Drivers Are Standing Next to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/rogue-camera-car-slammed-for-ticketing-motorists-standing-beside-their-vehicles/\">Continue reading<span class=\"screen-reader-text\"> \"Rogue “Camera Car” Slammed for Ticketing Motorists Standing Beside Their Vehicles\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "ZRP Calls For Maximum Caution As Two Toddlers Drown…",
            "url": "https://www.zimeye.net/2025/12/02/zrp-calls-for-maximum-caution-as-two-toddlers-drown/",
            "content": "By A Correspondent  The Zimbabwe Republic Police (ZRP) has issued a strong warning to parents and guardians following two tragic drowning incidents reported on 28 November 2025 in Bulawayo and Harare.\n\nIn the first incident, a three-year-old girl drowned after falling into a toilet pit filled with water, approximately 2.5 metres deep, while playing at a house in Cowdray Park, Bulawayo. In the second tragedy, a two-year-old boy died after falling into a well around six metres deep at a residence along Gurudzi Street, New Mabvuku, Harare.\n\nSpeaking on Monday, the ZRP urged the public to exercise caution, saying: Parents and guardians are strongly encouraged to closely supervise minors at all times. Open water sources, pits, wells and other hazards must be properly secured to prevent similar accidents.\n\nThe police added: Young children are naturally curious and often unaware of potential dangers. It is the responsibility of caregivers to ensure their safety by eliminating hazards within and around the home.\n\nAuthorities stressed that these tragedies serve as a reminder of the need for constant vigilance, especially around open water bodies and deep pits, to protect children from preventable accidents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Republic Police (ZRP) has issued a strong warning to parents and guardians following two … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/zrp-calls-for-maximum-caution-as-two-toddlers-drown/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Calls For Maximum Caution As Two Toddlers Drown…\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "Teen tycoon or legal lacuna? How did a 17-year-old come to run a company in plain sight of Zimbabwe’s laws",
            "url": "https://www.zimeye.net/2025/12/02/teen-tycoon-or-legal-lacuna-how-did-a-17-year-old-come-to-run-a-company-in-plain-sight-of-zimbabwes-laws/",
            "content": "By Shelton Muchena, investigative journalist\n\nThey call her a wunderkind. They call her an inspiration. They call her a chairlady and a founder before she has reached the age most nations regard as adulthood. Tinotenda Tino Tungwarara has been celebrated across social media and lifestyle platforms as the face of Tap and Go Taxi and as the public launch figure for Prevail Mart. Photographs from launch events show her confidently addressing audiences, flanked by business figures, in scenes that project success, ambition and youthful brilliance. Yet beneath the glossy imagery and congratulatory posts lies a question that ought to trouble every regulator, parent and citizen in Zimbabwe: how did a 17-year-old come to be publicly presented as the driving force behind multi-million-dollar ventures when Zimbabwean law places legal adulthood, and many associated corporate rights, at 18 years?\n\nZimbabwes law is unambiguous on the question of majority. The General Law Amendment Act confirms that a person attains full legal capacity at the age of 18. This threshold is not symbolic; it is the point at which an individual acquires the legal competence to enter binding contracts, assume unrestricted civil liability and independently conduct complex commercial transactions. Company law reinforces this framework. The Companies and Other Business Entities Act governs the incorporation of businesses, the appointment of directors and officers, and the filing of documents with the Registrar of Companies. Its purpose is to ensure that those who control companies are legally qualified, identifiable and accountable, and that businesses operate within transparent and lawful structures.\n\nChild protection laws add another layer of gravity to the matter. Zimbabwes Childrens Act and recent criminal law amendments strengthen protections for minors and criminalise their exploitation in economic and other activities. These statutes recognise that children require heightened safeguards and that parents, guardians and other adults have affirmative obligations to act in a childs best interests. Where a minor is placed at the centre of significant commercial activity, particularly in ways that may expose them to legal or financial liability, the law demands scrutiny of who is exercising real control and for whose benefit.\n\nThis raises an unavoidable question: in what lawful manner could a 17-year-old open corporate bank accounts, sign leases, hire staff, contract suppliers and be presented as a chairperson of an incorporated enterprise? One possibility is the use of adult proxies. Parents or guardians may establish companies on behalf of minors, with trusts, nominee directors or other legal mechanisms used to manage assets until the child attains majority. Such arrangements are not inherently unlawful. However, they are only legitimate if they comply with disclosure requirements, if the source of funds is transparent and lawful, and if the arrangement demonstrably protects the child rather than using the child as a public shield for adult interests.\n\nEnforcement concerns inevitably follow. Zimbabwe has institutions tasked with oversight, including the Registrar of Companies, the banking sectors know-your-customer and anti-money laundering systems, child protection services and the Zimbabwe Anti-Corruption Commission, which has statutory authority to investigate economic crime and irregular financial conduct. If a minor is fronting businesses financed through opaque means, or if incorporation documents obscure the true controllers of assets, multiple regulatory alarms ought to sound. The issue is not ambition or youth, but accountability and legality.\n\nPublicly available information has so far raised more questions than answers. Who provided the start-up capital for the taxi service and the supermarket project? Were standard antimoney laundering checks completed before bank accounts were opened? Which adults are listed as directors, company secretaries or beneficial owners in the documents filed with the Registrar of Companies? If a parent or guardian exercises de facto control while the child serves as the public face, does that arrangement comply with company law requirements and child protection obligations? These are not academic questions. They go to the heart of financial transparency, corporate governance and the protection of minors.\n\nAs part of efforts to obtain comment, this reporter contacted Ms Josephine (also known as Josey or Jostrine) Mahachi, who has been publicly associated with the launch of the company involving the minor. In a written response, Mahachi rejected any suggestion that she was involved in the companys operations or able to speak on its behalf. From one journalist to another, you are talking or asking the wrong person all these questions, she said. I am not Prevail Group and Im invited to over a million events all over the world as a guest that does not mean Im part of the organisation to speak on their behalf. Therefore I direct you to the Prevail Group Public Relations for answers. Shortly after sending this message, Mahachi blocked this reporter on WhatsApp, making it impossible to seek further clarification or to follow up via phone calls.\n\nThe matter therefore returns to institutions rather than individuals. Zimbabwe has laws designed to govern company formation, protect children and prevent economic crime. The critical question is whether those laws are being enforced consistently and fearlessly. If everything surrounding these ventures is lawful, publicly verifiable documents should readily demonstrate compliance. If not, regulators, banks and oversight bodies have a duty to explain how a minor could occupy such a prominent commercial position without triggering intervention.\n\nPublic admiration should never substitute for due process. To celebrate a child as a business figure while providing little clarity on capital, governance and legal responsibility invites not only applause but suspicion. This case forces a broader national conversation about transparency, parental responsibility and the integrity of regulatory enforcement in Zimbabwe. If Tinotenda Tungwararas ventures are lawful and genuinely structured in her best interests, the records will speak for themselves. If they are not, the same records will expose where the system failed and who must answer for it.\n\nShelton Muchena is an investigative journalist.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena, investigative journalist They call her a wunderkind. They call her an inspiration. They call her a chairlady … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/teen-tycoon-or-legal-lacuna-how-did-a-17-year-old-come-to-run-a-company-in-plain-sight-of-zimbabwes-laws/\">Continue reading<span class=\"screen-reader-text\"> \"Teen tycoon or legal lacuna? How did a 17-year-old come to run a company in plain sight of Zimbabwe’s laws\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "Chaos In Schools As Zanu PF Councillors “Refuse to Leave Classrooms” While Neglecting Teaching Duties",
            "url": "https://www.zimeye.net/2025/12/02/chaos-in-schools-as-zanu-pf-councillors-refuse-to-leave-classrooms-while-neglecting-teaching-duties/",
            "content": "Tinashe Sambiri  A shocking revelation has exposed how the education of children in Masvingo is being compromised, with several Zanu PF councillors, including Euphrasia Ruvai, the wife of Minister of State for Provincial Affairs and Devolution Ezra Chadzamira, continuing to serve as school teachers while holding political portfolios.\n\nAt the centre of the controversy is Euphrasia Ruvai, a councillor who remains active as a teacher at Gaths Mine Primary School in Mashava, despite legal requirements for civil servants to resign once they take up elected positions. Education experts warn that this dual role directly violates learners right to uninterrupted education.\n\nThe matter forms part of a broader scandal in which the Public Service Commission (PSC) is alleged to have quietly reinstated 66 councillors  most of them teachers  to their civil service positions after the 2023 elections, a move critics say undermines both the Constitution and education standards.\n\nA senior official in the Ministry of Primary and Secondary Education revealed that many reinstated councillors are not reporting for duty but continue to receive full salaries, leaving their students without proper supervision and overburdening the remaining teachers.\n\nThe Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) condemned the practice, arguing that children are being short-changed while public funds are wasted on ghost workers. The union said, Learners cannot be expected to thrive when their teachers are absent or distracted by political duties. This is highly irresponsible.\n\nThe controversy stems from a memo issued by then PSC Secretary Tsitsi Choruma on 23 November 2023, which instructed the Ministry of Education to reinstate 66 teachers who had resigned to contest as councillors and record their absent days as unpaid leave.\n\nThe situation only came to light when 15 councillors, who had not been reinstated, sought similar returns to the civil service. Their appeal, submitted on 7 October 2025 through Presidential Adviser Joram Gumbo, was rejected by PSC Chairperson Vincent Hungwe, who argued that reinstating elected officials would be unconstitutional. In a confidential memo, Hungwe stated:According to the provisions of Section 200 (3) and (4) of the Constitution of Zimbabwe Amendment (No. 20) Act, 2013, all members of the Public Service who were duly elected to office in the 2023 harmonised elections relinquished their pre-election positions in Government.\n\nLegal experts also point to Circular Number 10 of 2018, which mandates civil servants to resign within 30 days of winning public office. Hungwe reminded the affected councillors:In the absence of your resignation letter, you are deemed to have elected to remain a member of the civil service.\n\nOther notable councillors reinstated include:\n\nLyllett Makomeke, Masvingo Province Teachers 4ED chairperson and Bikita Schools Inspector\n\nBenjamin Masakadze, former Bikita RDC chairperson and teacher at Zindove Primary\n\nAdmire Matutu, teacher at Zvomupungu Primary in Mwenezi\n\nRhoda Makhaza, headteacher at Odzi Secondary in Bikita\n\nMakomeke admitted she was unaware of the legal requirement, saying, I was not aware that civil servants are required to resign after being elected to public office.\n\nEducation advocates warn that such arrangements compromise learners rights to quality and consistent education, leaving schools understaffed and children shortchanged. Euphrasia Ruvai, Chadzamiras wife, now stands as the most prominent example of a system in which political favoritism trumps constitutional obligations and the needs of learners.\n\nChadzamira did not respond to questions regarding his wifes dual roles. An official at Benjamin Burombo Building, where the Ministers office is based, said he was not in a position to comment on the matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – A shocking revelation has exposed how the education of children in Masvingo is being compromised, with several … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/chaos-in-schools-as-zanu-pf-councillors-refuse-to-leave-classrooms-while-neglecting-teaching-duties/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos In Schools As Zanu PF Councillors “Refuse to Leave Classrooms” While Neglecting Teaching Duties\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "Zambia Opposition Parties Report They’re Saddened By Constitution Making Process",
            "url": "https://www.zimeye.net/2025/12/02/zambia-opposition-parties-report-theyre-saddened-by-constitution-making-process/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "High Court Denies Walter Mzembi Bail",
            "url": "https://www.zimeye.net/2025/12/02/high-court-denies-walter-mzembi-bail/",
            "content": "Tinashe SambiriFormer Tourism Minister Walter Mzembi will remain behind bars after the High Court rejected his application for bail.\n\nOn Monday, Justice Dembure ruled that Mzembis history of absconding and the seriousness of the allegations against him made his release too risky.\n\nThe judge noted that Mzembi previously fled the country in 2018 and spent several years outside Zimbabwe, a pattern the court said raises concerns over whether he would stand trial if released.\n\nMzembi is accused of unlawfully disposing of public property worth almost one million US dollars during his time in government. The court stressed that his past behaviour showed disregard for legal proceedings, making bail inappropriate under the circumstances.\n\nThe ruling reflects the judiciarys stance on holding former officials accountable when facing corruption-related charges, meaning Mzembi will continue to be held in custody as his case moves forward.\n\nSome observers argue that the decision may also carry political undertones, claiming President Emmerson Mnangagwa is punishing Mzembi for backing the G40 faction during Zanu PFs internal power struggles against the then Team Lacoste group.\n\nWalter Mzembi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri–Former Tourism Minister Walter Mzembi will remain behind bars after the High Court rejected his application for bail. On … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/high-court-denies-walter-mzembi-bail/\">Continue reading<span class=\"screen-reader-text\"> \"High Court Denies Walter Mzembi Bail\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        },
        {
            "title": "Zim Cultural Icon Sekuru Banda Attends UAE National Day Celebrations",
            "url": "https://www.zimeye.net/2025/12/02/zim-cultural-icon-sekuru-banda-attends-uae-national-day-celebrations/",
            "content": "By A Correspondent| Zimbabwean traditional healer and cultural ambassador Sekuru Banda was among prominent guests who attended the United Arab Emirates 54th National Day celebrations in Harare, adding a distinctly Zimbabwean cultural presence to the diplomatic event.\n\nSekuru Banda was personally invited by UAE Ambassador to Zimbabwe Dr. Jassim AlQasimi, who welcomed him warmly upon arrival at the Rainbow Towers Hotel.\n\nTheir brief exchange  punctuated by smiles and photo moments  drew attention from guests and highlighted an unexpected cultural dimension to the otherwise formal ceremony.\n\nThe event was part of global commemorations of Eid Al Etihad, with celebrations across the UAE marked by vibrant displays of national pride, public festivities and cultural showcases.\n\nHarares ceremony mirrored this spirit, bringing together diplomats, senior government officials, business leaders and members of the Emirati community.\n\nIn his remarks, Ambassador AlQasimi stressed the UAEs commitment to deepening economic cooperation with Zimbabwe, noting expanding opportunities between the two nations.\n\nGuest of honour Professor Amon Murwira, Zimbabwes Minister of Foreign Affairs and International Trade, said Zimbabwe is considering the proposed Comprehensive Economic Partnership Agreement (CEPA), a framework that could boost investment and trade ties.\n\nWhile the evening focused on strengthening bilateral relations, Sekuru Bandas attendance introduced a human and cultural touch, symbolising how people-to-people engagement is increasingly shaping modern diplomacy.\n\nHis presence underscored the growing appreciation of Zimbabwean cultural figures within international spaces, and the role they can play in fostering goodwill between nations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Zimbabwean traditional healer and cultural ambassador Sekuru Banda was among prominent guests who attended the United Arab … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/02/zim-cultural-icon-sekuru-banda-attends-uae-national-day-celebrations/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Cultural Icon Sekuru Banda Attends UAE National Day Celebrations\"</span></a></p>",
            "time": "08:46",
            "date": "03 Dec 2025"
        }
    ]
}