{
    "news": [
        {
            "title": "Gas Tank Explosions Rock Mpandawana Growth Point",
            "url": "https://www.zimeye.net/2025/09/16/gas-tank-explosions-rock-mpandawana-growth-point/",
            "content": "By A Correspondent| Panic gripped Mpandawana Growth Point yesterday after 20 gas tanks exploded at Chipopera, leaving one attendant seriously injured.\n\nThe incident occurred about 30 minutes before press time when the gas tanks reportedly went off one after another, sending terrified residents and shoppers fleeing in all directions.\n\nWitnesses described the scene as chaotic, with thick plumes of smoke and loud bangs echoing across the busy growth point.\n\nThe injured attendant, who was manning the gas filling station, was rushed to a nearby medical facility for emergency treatment. His condition is reported to be critical.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Panic gripped Mpandawana Growth Point yesterday after 20 gas tanks exploded at Chipopera, leaving one attendant seriously … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/gas-tank-explosions-rock-mpandawana-growth-point/\">Continue reading<span class=\"screen-reader-text\"> \"Gas Tank Explosions Rock Mpandawana Growth Point\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "‘VP Chiwenga Slapped In The Face’ As Chivayo Pops Out Performing Presidential Duties",
            "url": "https://www.zimeye.net/2025/09/16/vp-chiwenga-slapped-in-the-face-as-chivayo-pops-out-performing-presidential-duties/",
            "content": "VIDEO LOADING BELOW\n\nThe convicted fraudster@wicknellchivayoyesterday came out fronting the Head Of State, and even performing presidential assignments, contrary to claims by Emmerson Mnangagwa that he isnt his front. Footage Credit@CMukungunugwahttps://t.co/Hn8KhXTdq5pic.twitter.com/ufV4bKkANr\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Air Zimbabwe Dumps Passengers",
            "url": "https://www.zimeye.net/2025/09/16/air-zimbabwe-dumps-passengers/",
            "content": "By Business Reporter  Hundreds of passengers were left stranded at Harare and OR Tambo International Airports this week after Air Zimbabwe abruptly cancelled flights on its flagship HarareJohannesburg route, dealing another blow to the struggling national airline.\n\nThe cancellations, which came without prior warning, disrupted urgent travel plans for many, forcing some passengers to seek expensive alternative carriers while others endured long waits for rescheduled connections.\n\nFor travellers who had hoped for smooth connections between Zimbabwe and South Africa, the disruptions were a painful reminder of the airlines steady decline.\n\nAir Zimbabwe has long been beset by problems. Once a respected regional carrier, the airline has, over the years, been grounded by a toxic cocktail of mismanagement, corruption, mounting debts, and an ageing fleet.\n\nAt its peak in the 1980s and early 1990s, Air Zimbabwe operated intercontinental flights to London, Beijing, and Dubai.\n\nToday, however, its network has shrunk drastically, with the HarareJohannesburg route being one of the few regular services it attempts to maintain.\n\nBut even those few flights are plagued with cancellations, late departures, and technical issues.\n\nThe carriers fleet of just a handful of serviceable planes  including ageing Boeing 767s and 737s  has struggled to meet demand, with spare parts shortages and poor maintenance capacity often grounding aircraft at short notice.\n\nEfforts to revive the airline have repeatedly stalled. In 2018, the government placed Air Zimbabwe under administration and promised restructuring, but little progress has been made.\n\nSuccessive attempts to find strategic partners have also failed, with potential investors put off by the airlines US$300 million debt burden.\n\nFor passengers like those stranded this week at OR Tambo and Harare International, the experience underscores how far Air Zimbabwe has fallen from its former glory.\n\nWhat should have been a routine one-hour regional connection has instead turned into a test of endurance and patience.\n\nAviation analysts say that unless there is genuine political will to reform the airline, Air Zimbabwe risks total collapse. The cancellations are not isolated incidents  they are part of a broader pattern of systemic failure, one aviation expert told this publication.\n\nMeanwhile, passengers continue to bear the brunt of the chaos. Many say they are losing confidence in the airline, turning instead to private regional carriers such as South African Airways, Fastjet, and Ethiopian Airlines, which now dominate the southern African skies once confidently patrolled by Air Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – Hundreds of passengers were left stranded at Harare and OR Tambo International Airports this week after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/air-zimbabwe-dumps-passengers/\">Continue reading<span class=\"screen-reader-text\"> \"Air Zimbabwe Dumps Passengers\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "For Over 6 Years, Marry Mubaiwa’s Kids Remain Banned from Seeing Their Biological Mum Since 2019",
            "url": "https://www.zimeye.net/2025/09/16/for-over-6-years-marry-mubaiwas-kids-remain-banned-from-seeing-their-biological-mum-since-2019/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Video loading below",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Passengers Stranded at OR Tambo as Air Zimbabwe Crumbles",
            "url": "https://www.zimeye.net/2025/09/16/passengers-stranded-at-or-tambo-as-air-zimbabwe-crumbles/",
            "content": "By Business Reporter Scores of passengers were left stranded at Harare and OR Tambo International Airports this week after Air Zimbabwe abruptly cancelled flights on its flagship HarareJohannesburg route, dealing another blow to the struggling national airline.\n\nThe cancellations, which came without prior warning, disrupted urgent travel plans for many, forcing some passengers to seek expensive alternative carriers while others endured long waits for rescheduled connections.\n\nFor travellers who had hoped for smooth connections between Zimbabwe and South Africa, the disruptions were a painful reminder of the airlines steady decline.\n\nAir Zimbabwe has long been beset by problems. Once a respected regional carrier, the airline has over the years been grounded by a toxic cocktail of mismanagement, corruption, mounting debts, and an ageing fleet.\n\nAt its peak in the 1980s and early 1990s, Air Zimbabwe operated intercontinental flights to London, Beijing, and Dubai.\n\nToday, however, its network has shrunk drastically, with the HarareJohannesburg route being one of the few regular services it attempts to maintain.\n\nBut even those few flights are plagued with cancellations, late departures, and technical issues.\n\nThe carriers fleet of just a handful of serviceable planes  including ageing Boeing 767s and 737s  has struggled to meet demand, with spare parts shortages and poor maintenance capacity often grounding aircraft at short notice.\n\nEfforts to revive the airline have repeatedly stalled. In 2018, the government placed Air Zimbabwe under administration and promised restructuring, but little progress has been made.\n\nSuccessive attempts to find strategic partners have also failed, with potential investors put off by the airlines US$300 million debt burden.\n\nFor passengers like those stranded this week at OR Tambo and Harare International, the experience underscores how far Air Zimbabwe has fallen from its former glory.\n\nWhat should have been a routine one-hour regional connection has instead turned into a test of endurance and patience.\n\nAviation analysts say that unless there is genuine political will to reform the airline, Air Zimbabwe risks total collapse. The cancellations are not isolated incidents  they are part of a broader pattern of systemic failure, one aviation expert told this publication.\n\nMeanwhile, passengers continue to bear the brunt of the chaos. Many say they are losing confidence in the airline, turning instead to private regional carriers such as South African Airways, Fastjet, and Ethiopian Airlines, which now dominate the southern African skies once confidently patrolled by Air Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – Scores of passengers were left stranded at Harare and OR Tambo International Airports this week after Air … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/passengers-stranded-at-or-tambo-as-air-zimbabwe-crumbles/\">Continue reading<span class=\"screen-reader-text\"> \"Passengers Stranded at OR Tambo as Air Zimbabwe Crumbles\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Fireworks Expected in Zanu PF’s Urgent Double Meetings",
            "url": "https://www.zimeye.net/2025/09/16/fireworks-expected-in-zanu-pfs-urgent-double-meetings/",
            "content": "By A Correspondent Fireworks are expected in Zanu PF this week after the ruling party urgently summoned its two most powerful organs, the Politburo and Central Committee, to back-to-back meetings in Harare  a move insiders say signals deepening factional tensions ahead of the partys annual conference in Mutare.\n\nAccording to a statement issued on Monday, the Secretary-General, Obert Mpofu, directed members of the Politburo to convene at the partys headquarters on Wednesday, 17 September 2025, at 12:00hrs, followed by a Central Committee meeting scheduled for Thursday, 18 September 2025, at 10:00hrs. Members are expected to be seated by 11:45hrs and 09:45hrs, respectively.\n\nWhile the official notice did not outline the agenda, party sources suggest the meetings are likely to focus on the escalating power struggles within Zanu PF, where President Emmerson Mnangagwa faces growing unease from factions aligned to his deputy, Vice President Constantino Chiwenga.\n\nThe shadow of succession politics continues to loom large, with reports of renewed tensions between the two camps as the Mutare conference draws closer. The hurried convening of both the Politburo and Central Committee reflects Mnangagwas desire to consolidate control and silence dissent ahead of the crucial conference, where policy direction and leadership legitimacy are expected to dominate proceedings.\n\nOver the years, Zanu PF conferences have often been used as battlegrounds for internal power plays  from Robert Mugabes final years, when Mnangagwa himself survived purges, to the 2017 coup that catapulted him into power.\n\nNow, history appears to be repeating itself, with Mnangagwa under pressure to manage factional fissures that threaten to destabilize his grip on the party. Analysts note that the rushed meetings could also be a platform to discipline wayward members, rally loyalty, and project a semblance of unity ahead of Mutare.\n\nWith speculation rife about Mnangagwas succession and Chiwengas rising influence within the military-backed faction, this weeks double meetings could prove decisive in shaping the narrative that will define Zanu PFs Mutare conference and, ultimately, Zimbabwes political trajectory.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Fireworks are expected in Zanu PF this week after the ruling party urgently summoned its two most … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/fireworks-expected-in-zanu-pfs-urgent-double-meetings/\">Continue reading<span class=\"screen-reader-text\"> \"Fireworks Expected in Zanu PF’s Urgent Double Meetings\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zanu PF In Urgent Politburo, Central Committee Meetings",
            "url": "https://www.zimeye.net/2025/09/16/zanu-pf-in-urgent-politburo-central-committee-meetings/",
            "content": "By A Correspondent  Zanu PF has summoned its top decision-making organs, the Politburo and Central Committee, to back-to-back meetings this week in Harare, in what insiders describe as part of frantic preparations ahead of the partys annual conference set for Mutare later this year.\n\nAccording to a statement issued on Monday, the Secretary-General, Obert Mpofu, directed members of the Politburo to convene at the partys headquarters onWednesday, 17 September 2025 at 12:00hrs, followed by a Central Committee meeting scheduled forThursday, 18 September 2025 at 10:00hrs.\n\nMembers are expected to be seated by 11:45hrs and 09:45hrs, respectively.\n\nWhile the official notice did not outline the agenda, party sources suggest the meetings are likely to focus on the escalating power struggles within Zanu PF, where President Emmerson Mnangagwa faces growing unease from factions aligned to his deputy, Vice President Constantino Chiwenga.\n\nThe shadow of succession politics continues to loom large, with reports of renewed tensions between the two camps as the Mutare conference draws closer.\n\nThe hurried convening of both the Politburo and Central Committee reflects Mnangagwas desire to consolidate control and silence dissent ahead of the crucial conference, where policy direction and leadership legitimacy are expected to dominate proceedings.\n\nOver the years, Zanu PF conferences have often been used as battlegrounds for internal power plays from Robert Mugabes final years, when Mnangagwa himself survived purges, to the 2017 coup that catapulted him into power.\n\nNow, history appears to be repeating itself, with Mnangagwa under pressure to manage factional fissures that threaten to destabilize his hold on the party.\n\nAnalysts note that the rushed meetings could also be a platform to discipline wayward members, rally loyalty, and project a semblance of unity ahead of Mutare.\n\nWith speculation rife about Mnangagwas succession and Chiwengas rising influence within the military-backed faction, the meetings this week could prove decisive in shaping the narrative that will define Zanu PFs Mutare conference and, ultimately, Zimbabwes political trajectory.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF has summoned its top decision-making organs, the Politburo and Central Committee, to back-to-back meetings … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/zanu-pf-in-urgent-politburo-central-committee-meetings/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF In Urgent Politburo, Central Committee Meetings\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Blessed Geza To Address Nation On Tuesday Night As Tension Rises In Zanu PF",
            "url": "https://www.zimeye.net/2025/09/16/blessed-geza-to-address-nation-on-tuesday-night-as-tension-rises-in-zanu-pf/",
            "content": "By A Correspondent\n\nWar veteran and outspoken political figure Blessed Geza is set to address the nation on Tuesday night, amid growing unease within Zanu PF over succession battles and alleged attempts to extend President Emmerson Mnangagwas rule beyond constitutional limits.\n\nGeza, who has become a prominent voice of dissent, previously addressed the nation onFriday, where he openly accused Mnangagwa of plotting to overstay his mandate in violation of the Constitution. His remarks sparked heated debate, with many describing them as a bold challenge to entrenched power.\n\nConfirming the latest address, Geza announced:We meet tomorrow (today), 16 Sept, at 2030hrs. The political temperatures are rising.\n\nAnalysts say Gezas growing defiance could signal widening cracks within Zanu PF, as factional battles intensify ahead of the partys 2030 succession roadmap. His speeches are being closely watched both by party insiders and the wider public, with speculation mounting about how his stance may reshape Zimbabwes political landscape.\n\nWe meet tomorrow, 16 Sept at 2030hrs.pic.twitter.com/ejw1e4k18x\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran and outspoken political figure Blessed Geza is set to address the nation on Tuesday night, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/blessed-geza-to-address-nation-on-tuesday-night-as-tension-rises-in-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza To Address Nation On Tuesday Night As Tension Rises In Zanu PF\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "High Court Says Mjolorits Don’t Get Any Inheritence",
            "url": "https://www.zimeye.net/2025/09/16/high-court-says-mjolorits-dont-get-any-inheritence/",
            "content": "Harare  16 September 2025\n\nIn a major clarification of Zimbabwes inheritance laws, the High Court has ruled that Mjolorists  people living in informal Mapoto/Umasihlalisane arrangements  are not automatically entitled to inherit from a deceased partners estate.\n\nThe ruling, reinforced by the Office of the Master of the High Court, dismantles a widespread misconception that the countrys new Marriages Act puts cohabiting partners on the same legal footing as married spouses.\n\nMjolorists Are Not Surviving Spouses\n\nMr. Eldard Mutasa, speaking for the Master of the High Court, said Section 41 of the Marriages Act (Chapter 5:17)  which introduced civil partnerships  is being dangerously misinterpreted on social media.\n\nMjolorists are not entitled to inheritance at all, Mutasa stressed. Nothing in our laws accords them the status of a surviving spouse.\n\nHe explained that while the Act recognises civil partnerships as relationships between two unmarried adults who live together on a genuine domestic basis, their rights at separation or death are limited strictly to property acquired jointly  not the deceaseds full estate.\n\nCourt Recognition Still Needed\n\nMutasa added that a persons status as a civil partner is not automatic and only becomes legally relevant when a relationship ends.\n\nThey have to be declared a civil partner by the court, he said. This only comes into play when the relationship dissolves. The court is not there to confer inheritance status.\n\nMarriage Certificates Still Carry Legal Weight\n\nThe clarification comes amid a surge of online claims that simply living with someone makes you a wife or husband.\n\nThat is not correct, far from it, Mutasa said. Our laws still protect the institution of marriage, and a marriage certificate continues to carry legal weight for inheritance purposes.\n\nPublic Urged to Get Legal Advice\n\nThe Master of the High Court urged Zimbabweans to seek advice from qualified legal practitioners or estate administrators instead of relying on social media speculation.\n\nThere is nothing like a Mjolorist being entitled to inheritance, Mutasa said. We are here to clear these misconceptions and uphold the countrys laws.\n\nWhy This Matters\n\nThis ruling affects thousands of Zimbabweans who live in informal unions. While it protects the rights of legally married spouses, it underscores the vulnerability of Mjolorists who wrongly believe they have automatic inheritance rights.\n\nThe Master of the High Court  which handles deceased estates, liquidations, trusts, guardianships and the Guardians Fund  has pledged to step up public education to end misinformation and protect citizens from costly mistakes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 16 September 2025 In a major clarification of Zimbabwe’s inheritance laws, the High Court has ruled that Mjolorists … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/high-court-says-mjolorits-dont-get-any-inheritence/\">Continue reading<span class=\"screen-reader-text\"> \"High Court Says Mjolorits Don’t Get Any Inheritence\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Mthuli Ncube “Plays Santa” As Education System Collapses",
            "url": "https://www.zimeye.net/2025/09/16/mthuli-ncube-plays-santa-as-education-system-collapses/",
            "content": "By A Correspondent\n\nThe much-publicised donation of textbooks, computers, internet access, and food aid to Cowdray Park Primary School in Bulawayo by the Mthuli Foundation over the weekend has sparked outrage, with critics arguing it only highlights the governments long-standing neglect of public education.\n\nFinance Minister Professor Mthuli Ncube, through his foundation, handed over mealie meal for the school feeding programme and a few textbooks to ease shortages. But instead of being celebrated, many have questioned why the state of Zimbabwes schools has been left to depend on personal charity from cabinet ministers.\n\nFor years we have been forced to share one textbook between five or more children. Some of us were failing to understand lessons because we had no reference material. Yes, this donation helps, but it should never have come to this. Where has government been all along? a frustrated pupil asked.\n\nParents echoed the same anger, with one noting, This gesture is welcome, but its also embarrassing. Why must an entire school depend on handouts from a minister when it is the governments constitutional duty to provide education? It shows the system has completely collapsed.\n\nEven school authorities admitted that the donation, while helpful, underscored how dire the situation had become. Deputy Head Mrs. Zanele Haruzivishe said, We are excited, but the truth is that for years our learners have been abandoned. This is just a drop in the ocean compared to what is really needed to fix our school.\n\nCritics also dismissed Ncubes claim that the donation was part of efforts to prepare children for the digital era. The only government school in this area is being turned into a photo opportunity for political mileage, one parent said. They talk of Vision 2030, yet our children are hungry and without basic books. How can you speak of digital literacy when the basics are missing?\n\nThe episode has reignited debate about the collapse of Zimbabwes education system, where schools survive on donations while government officials issue lofty promises.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The much-publicised donation of textbooks, computers, internet access, and food aid to Cowdray Park Primary School in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/16/mthuli-ncube-plays-santa-as-education-system-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Ncube “Plays Santa” As Education System Collapses\"</span></a></p>",
            "time": "09:46",
            "date": "17 Sep 2025"
        }
    ]
}