{
    "news": [
        {
            "title": "Welshman Ncube Uses Tsvangirai Memorial To Slam Chamisa",
            "url": "https://www.zimeye.net/2025/03/08/welshman-ncube-uses-tsvangirai-memorial-to-slam-chamisa/",
            "content": "Welshman Ncube uses his Tsvangirai Memorial function to talk anti-Chamisa structures talk.pic.twitter.com/NDqBCLKCXw\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Chiwenga Prepares Battle",
            "url": "https://www.zimeye.net/2025/03/08/chiwenga-prepares-battle/",
            "content": "By Munacho Gwamanda-Vice, President Constantino Chiwenga emotionally returned to his childhood school on Saturday, a place rich in history for hispersonaljourney andZimbabwesliberation struggle.\n\nThe visit to Mount StMarysMission School in Hwedza, where he and his late coup ally, Air Chief Marshal Perrance Shiri, once studied, came against the backdrop of intensifying political tensions between Chiwenga and President Emmerson Mnangagwa.\n\nChiwenga attended a Thanksgiving Mass in honour of Father Cellestino Magwenzi, a formerstudent of the mission school, who was celebrating his ordination as a Roman Catholic priest.\n\nFor the Vice President, however, the occasion was more than a religious gatheringit was a symbolic homecoming to the site where he and his comradesmade the fateful decisionto abandon their studies and join the liberation war.\n\nIn 1973, during a tea break, Chiwenga and three of his Form Three classmatesAir Chief Marshal Perrance Shiri, Brigadier-General (Retired) Richard Huchu, and Ernest Mandizvidzachose to leave school and take up arms in the fight forZimbabwesindependence.\n\nTheir decision wasfraught with danger, but it ultimately shaped thecountryspolitical and military landscape.\n\nWhile Chiwenga, Shiri, and Huchu survived the war and later occupied high-rankingpositions ingovernment andthemilitary, Mandizvidzais believedto have perished in the struggle.\n\nThe nostalgia of the visit, however,was overshadowed by the deepening rift between Chiwenga and Mnangagwa.\n\nThe two had been allies in the 2017 military coup that toppled Robert Mugabe, with Chiwenga playing a decisive role in installing Mnangagwa as President.\n\nIn theaftermath of the coup, agentlemansagreementwas reportedly struck: Mnangagwa would serve two terms and then hand over power to Chiwenga.\n\nHowever, Mnangagwa has since moved to consolidate his grip on power and is now manoeuvring to extend his rule beyond his constitutional limits.\n\nAs tensions rise, Chiwenga has found himself increasingly isolated.\n\nA series of unexplained deaths among his key allies has fueled speculation about internal purges.\n\nAir Chief Marshal Perrance Shiri, a close confidant of Chiwenga and the former Minister of Agriculture, died in 2020 under circumstances shrouded in mystery, officially attributed to COVID-19.\n\nHowever, insiders suggest foul play, givenShirisinfluential position and proximity to Chiwenga.\n\nOther figures inChiwengascamp, including high-ranking military officials, have also faced sudden and unexplained deaths or political sidelining.\n\nWith Mnangagwa tightening his grip on power through security agencies and a network of loyalists in the ruling Zanu PF party, Chiwenga is under mounting pressure.\n\nHis visit to Mount StMarysMission School, therefore,takes on a symbolic significanceit is not just a personal reflection on the past but also a rekindling of the fighting spirit that once propelled him into the liberation struggle.\n\nWhether he can muster enough political and military leverage to challenge Mnangagwa remains to be seen, but the battle lines withinZimbabwespower corridorsareclearlydrawn.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Vice, President Constantino Chiwenga emotionally returned to his childhood school on Saturday, a place rich in history for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/chiwenga-prepares-battle/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Prepares Battle\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Job Vacancy: Mining Engineer Mash Central",
            "url": "https://www.zimeye.net/2025/03/08/job-vacancy-mining-engineer-mash-central/",
            "content": "Job Title: Mining Engineer\n\nCompany: Wealth Well Mining Shaft Pvt Limited\n\nLocation: Bindura\n\nJob Type: Full-time\n\nAbout Us:\n\nWealth Well Mining Shaft Pvt Limited is a leading mining company seeking an experienced Mining Engineer to join our team. Our company is committed to delivering exceptional results in the mining industry, and were looking for a talented professional to help us achieve our goals.\n\nJob Summary:\n\nWere seeking a highly skilled and experienced Mining Engineer to lead our international mining projects. The successful candidate will have a strong background in mining engineering, excellent leadership skills, and experience in managing international projects.\n\nResponsibilities:\n\nRequirements:\n\nWhat We Offer:\n\nHow to Apply:\n\nIf youre a motivated and experienced Mining Engineer looking for a new challenge, please submit your application, including your resume and cover letter, to[emailprotected].\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Job Title: Mining Engineer Company: Wealth Well Mining Shaft Pvt Limited Location: Bindura Job Type: Full-time About Us: Wealth Well … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/job-vacancy-mining-engineer-mash-central/\">Continue reading<span class=\"screen-reader-text\"> \"Job Vacancy: Mining Engineer Mash Central\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Bosso Players Receive Outstanding Salaries",
            "url": "https://www.zimeye.net/2025/03/08/bosso-players-receive-outstanding-salaries/",
            "content": "Sports Correspondent\n\nIn a welcome development, Highlanders Football Club, also known as Bosso, has paid its players their outstanding salaries for January. The players confirmed receiving their dues earlier today, Friday.\n\nThis payment comes as a relief to the players, who had been owed salaries since December 2024.\n\nThe clubs management had been working to resolve the issue, and todays payment is a significant step towards stabilizing the teams finances.\n\nThe payment of salaries is expected to boost the morale of the players, who have been performing well on the field despite the financial challenges. With their outstanding dues now settled, the players can focus on their game, and fans can look forward to exciting matches from the Bulawayo giants.\n\nHighlanders Football Club has a rich history and a loyal fan base, and this development is a positive step towards restoring the clubs stability and success.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a welcome development, Highlanders Football Club, also known as Bosso, has paid its players their outstanding salaries … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/bosso-players-receive-outstanding-salaries/\">Continue reading<span class=\"screen-reader-text\"> \"Bosso Players Receive Outstanding Salaries\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "About Safety Of Pedestrians…",
            "url": "https://www.zimeye.net/2025/03/08/about-safety-of-pedestrians/",
            "content": "When we think about roads, its easy to focus on the vehicles that use them. But roads arent just meant for cars, trucks, and bikes; they are shared spaces where pedestrians also have the right to walk.\n\nAs drivers, we have a responsibility to ensure the safety of everyone using the road, including those on foot.\n\nPedestrians are vulnerable road users. Whether they are crossing at a designated crosswalk or walking along the roadside, they deserve the same respect and attention that drivers give to other vehicles.\n\nSlowing down when approaching a pedestrian crossing isnt just a courtesyits a critical safety measure. Pedestrians have the right of way, and as drivers, its our job to make sure they can cross the road safely.\n\nIf you spot a pedestrian already in the crosswalk, dont hesitate to stop and allow them to finish crossing before proceeding. Its essential to give them the time they need to move safely without rushing or creating a dangerous situation. It only takes a few seconds, but it can make all the difference in ensuring that no one gets hurt.\n\nPracticing road courtesy doesnt only apply to pedestrians. As a responsible driver, your actions behind the wheel should always prioritize safety, not just for yourself but for everyone around you. Being aware of pedestrians, staying alert to crossing signals, and yielding when necessary are all parts of safe defensive driving.\n\nUltimately, safety begins with us. Its not enough to drive safely in terms of speed limits and traffic signals; we must also be vigilant and empathetic toward those who might be at greater risk on the roads. So, lets share the road and respect pedestrian rightsby doing so, we can help create a safer, more considerate environment for everyone.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When we think about roads, it’s easy to focus on the vehicles that use them. But roads aren’t just meant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/about-safety-of-pedestrians/\">Continue reading<span class=\"screen-reader-text\"> \"About Safety Of Pedestrians…\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Mugabe Turning In His Grave As Zvigananda Flock To State House",
            "url": "https://www.zimeye.net/2025/03/08/mugabe-turning-in-his-grave-as-zvigananda-flock-to-state-house/",
            "content": "By James Gwati-The late President Robert Mugabe must be turning in his grave as Emmerson Mnangagwa welcomes criminals, fraudsters, and economic saboteurs into the State Houseonce the symbolic seat of power and governance.\n\nOnce hailed as a liberator from Mugabes long rule, Mnangagwa has instead entrenched corruption, surrounded himself with controversial business figures, and allowed his family to capture the nations wealth.\n\nThe so-called New Dispensation has becomenothing more thana front for organized looting.\n\nToday,StateHouse is no longer a place of statesmanship but a meeting ground for looters, cartels, and dubiousbusinessmenwith deep pockets and political connections.\n\nAmong Mnangagwas closest allies are convicted fraudsters, questionablebusinessmen, and tenderpreneurs who have used state contracts to enrich themselves at the expense of the suffering masses.\n\nSome of the most controversial figures who now enjoy direct access to the presidency include:\n\nMnangagwas sons have also become kingpins in Zimbabwes illicit economy, monopolizing the mining sector and extending their influence over key industries.\n\nThis new elite, born out of corruption and state patronage, is bleeding the country dry while the ordinary citizen struggles to make ends meet.\n\nYet, Zimbabwes history tells a different storyone of a struggle against oppression, of ideals that once inspired hope.\n\nIn the 1970s, Robert Mugabe and Edgar Tekere walked side by side, symbols of the liberation movement.\n\nTekere, ever the loyal revolutionary, carried Mugabes briefcaseperhaps filled with speeches, strategy papers, and the blueprints for a free Zimbabwe.\n\nTheir mission was clear: to dismantle white minority rule and establish an independent nation.\n\nMugabes early years in power reflected this revolutionary zeal.\n\nHis government expanded education, health care, and infrastructure, making Zimbabwe one of Africas most literate nations.\n\nHowever, power consumed him.\n\nOver time, his hunger for control led to dictatorship, economic collapse, and political violence.\n\nHyperinflation ravaged the country, millions fled, andopposition voices were brutally silenced.\n\nMnangagwa, once Mugabes enforcer, promised a new era of democracy and prosperity when he seized power in 2017.\n\nInstead, he has embraced an even darker pathone defined by blatant militarization, deepening corruption, and the outright looting of state resources.\n\nUnlike Mugabe, who at least sought to maintain a semblance of legitimacy, Mnangagwas Zimbabwe operates like a mafia state.\n\nThe revolutionary ideals that once united Zimbabwes freedom fighters havebeen replacedby greed, betrayal, and self-enrichment.\n\nThe image of Tekere carrying Mugabes briefcase once symbolized hope for a better Zimbabwe.\n\nToday, that hope is long gone.\n\nThe State House, which once represented leadership and governance, hasbeen turned intoa playground for the corrupt.\n\nMnangagwas Zimbabwe is no longer a nation built on the principles of liberationit is a fiefdom for thugs, where loyalty to the ruling eliteis rewarded, and the suffering massesare ignored.\n\nThe struggle for Zimbabwes freedom is far from over.\n\nBut this time, it is not against colonial ruleit is against a new class of oppressors who have hijacked the revolution for theirowngain.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati-The late President Robert Mugabe must be turning in his grave as Emmerson Mnangagwa welcomes criminals, fraudsters, and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/mugabe-turning-in-his-grave-as-zvigananda-flock-to-state-house/\">Continue reading<span class=\"screen-reader-text\"> \"Mugabe Turning In His Grave As Zvigananda Flock To State House\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Clear Video of Mnangagwa Inviting Trump To Take Over Victoria Falls Land",
            "url": "https://www.zimeye.net/2025/03/08/clear-video-of-mnangagwa-inviting-trump-to-take-over-victoria-falls-land/",
            "content": "The following is video footage of President Emmerson Mnangagwa inviting US President Donald Trump to come and take over Victoria Falls.\n\nIn the footage now contrasted with that of Ukraines Volodymyr Zelenskyys recent meeting with Trump, Mnangagwa is the one pushing for Trump to take over his countrys ancestral property.\n\nMnangagwa says: If President Trump came here today, when Im still around, Ill be able to talk to him.\n\nIll be able to make requests from him and say, Oh, Mister President, Zimbabwe is open for business.\n\nI know Americans like to play golf. Come and build golf courses at Victoria Falls. Bring American Airlines [to] Victoria Falls; build hotels and there well give incentives, 5 year incentives for you to do all those things where open you.\n\nHas this meeting with Mnangagwahappened yet@realDonaldTrump?If President Trump came here today, when I'm still around, I'll be able to talk to him. I'll be able to make requests from him and say, Oh, Mister President, Zimbabwe is open for business. I know Americans likehttps://t.co/0BEJFISG7Rpic.twitter.com/8b4iJ8Y82z\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The following is video footage of President Emmerson Mnangagwa inviting US President Donald Trump to come and take over Victoria … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/clear-video-of-mnangagwa-inviting-trump-to-take-over-victoria-falls-land/\">Continue reading<span class=\"screen-reader-text\"> \"Clear Video of Mnangagwa Inviting Trump To Take Over Victoria Falls Land\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Is Mnangagwa Planning To Lure Zimbabweans In The Diaspora Back Home?",
            "url": "https://www.zimeye.net/2025/03/08/is-mnangagwa-planning-to-lure-zimbabweans-in-the-diaspora-back-home/",
            "content": "By A Correspondent\n\nHARARE, ZIMBABWE  Amid mounting economic turmoil, widespread unemployment, and the governments desperate need for external support, President Emmerson Mnangagwas administration is ramping up efforts to entice Zimbabweans in the diaspora to return home.\n\nHowever, given the countrys current economic struggles, it remains uncertain whether the diaspora community will respond positively to these overtures.\n\nThe government is preparing for the 3rd Zimbabwe Annual Diaspora Conference (ZADC), scheduled for April 10-12, 2025, in the scenic Manicaland Province.\n\nThe event is billed as a major platform for Zimbabweans abroad to reconnect with their homeland, explore investment opportunities, and contribute to national development.\n\nThe ZADC will also serve as a space for Zimbabweans to evaluate how they might help alleviate the countrys economic woes by supporting key sectors such as trade, agriculture, and infrastructure.\n\nHowever, the question remains: Will the diaspora, many of whom fled the country due to economic instability, political repression, and a lack of opportunities, be willing to return under the current conditions?\n\nAccording to numerous sources, many Zimbabweans in the diaspora are skeptical of the governments ability to deliver lasting change.\n\nWhile the government keeps pushing these initiatives, there are still deep-rooted issues like inflation, a struggling healthcare system, and a lack of jobs, said a Zimbabwean entrepreneur based in the UK.\n\nMany of us left because of these problems. I want to invest in Zimbabwe, but I need to see real change first.\n\nThe government, however, seems intent on proving that it can turn things around. President Mnangagwas administration has emphasized the crucial role the diaspora could play in driving Zimbabwes economic revival, particularly through investment and remittances.\n\nThe diaspora is a key pillar in achieving our Vision 2030 goals, said a government spokesperson. Their expertise, investments, and remittances are essential to stimulating growth and rebuilding our country.\n\nTo facilitate this, the government has launched several initiatives, including the Know Your Diaspora program, aimed at fostering stronger ties between Zimbabweans abroad and their home country.\n\nPrevious diaspora-focused conferences in provinces such as Matabeleland North and South, as well as national events in Bulawayo and Masvingo, have seen mixed results. While some diaspora members have shown interest in contributing to national development, many remain disillusioned by ongoing political and economic instability.\n\nThe 3rd ZADC will focus on themes such as Engaging, Enabling, and Empowering the Diaspora: Catalyzing Investment, Trade, and Philanthropy for National Development, but many within the diaspora remain wary of the governments long-term commitment to reform. We hear these promises, but until we see real, tangible changes in the economy and governance, its hard to justify coming back, said another Zimbabwean professional living in South Africa.\n\nWith unemployment at record highs and inflation eroding the value of local currency, the diaspora community is not convinced that simply offering investment opportunities will be enough to lure them back.\n\nHowever, the government is determined to demonstrate that it can offer more than just promises.\n\nIn the coming months, it will be crucial to see if the 3rd ZADC and other government efforts can address the genuine concerns of Zimbabweans abroad or whether they will remain unconvinced, staying in their adopted countries where opportunities seem more promising.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE, ZIMBABWE – Amid mounting economic turmoil, widespread unemployment, and the government’s desperate need for external support, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/is-mnangagwa-planning-to-lure-zimbabweans-in-the-diaspora-back-home/\">Continue reading<span class=\"screen-reader-text\"> \"Is Mnangagwa Planning To Lure Zimbabweans In The Diaspora Back Home?\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Two Zim Inmates Escape From Prison",
            "url": "https://www.zimeye.net/2025/03/08/two-zim-inmates-escape-from-prison/",
            "content": "By A Correspondent\n\nIn a statement released on Wednesday, March 5, 2025, the Zimbabwe Prisons and Correctional Service (ZPCS) informed the public of a serious incident at Mutimurefu Prison in Masvingo. Two inmates, Feliciano Simango, also known as Fidelis Jorum Mauyangwe, and Never Matoma, escaped from lawful custody.\n\nThe ZPCS clarified that the escape occurred while the inmates were engaged in a supervised work assignment outside the prison. The escapees took advantage of the situation and unlawfully gained access to a ZPCS vehicle, according to the statement. The vehicle was initially used in their attempt to flee the area, but it was involved in an accident about 2.5 kilometers from the location, leaving it inoperable. After the crash, the inmates fled on foot, evading further capture.\n\nThe ZPCS is actively investigating the incident, with heightened security measures being implemented to prevent similar occurrences in the future. The statement urged the public to be vigilant and report any sightings or relevant information regarding the escapees to local police stations or correctional facilities.\n\nFor further details or tips, individuals are encouraged to contact Assistant Commissioner Meya Khanyezi, the National Public Relations Officer, at 0773418132 or 0714239142.\n\nThe ZPCS emphasized that it remains committed to public safety and the secure custody of all inmates and assured the public that additional updates would be provided as necessary.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a statement released on Wednesday, March 5, 2025, the Zimbabwe Prisons and Correctional Service (ZPCS) informed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/two-zim-inmates-escape-from-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Two Zim Inmates Escape From Prison\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        },
        {
            "title": "Mnangagwa Throws Own Ally Under The Bus?",
            "url": "https://www.zimeye.net/2025/03/08/mnangagwa-throws-own-ally-under-the-bus/",
            "content": "By A Correspondent\n\nIt has emerged that Zimbabwes President, Emmerson Mnangagwa, has distanced himself from his own ally, Calisto Bangu, a prominent figure from Masvingo Province.\n\nAccording to reports, Bangu is now facing serious accusations within his own party, Zanu PF.\n\nIn a surprising move, another Zanu PF stalwart from Masvingo, Kudakwashe Gopo, reportedly caused disruption during District Coordinating Committee (DCC) meetings and even created a WhatsApp group that undermined the Party.\n\nThis led to the Politburos decision to expel him from the Party. Sources close to the matter revealed that, as part of ongoing party efforts to address internal discord, Bangu will soon be summoned to the Partys Headquarters to respond to charges brought against him by Masvingo Province, which accuse him of undermining the Party.\n\nA source within Zanu PF stated, Mnangagwa is taking stern measures to maintain control and stay in power beyond 2028.\n\nHe is targeting those who oppose his leadership and his quest for political longevity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent It has emerged that Zimbabwe’s President, Emmerson Mnangagwa, has distanced himself from his own ally, Calisto Bangu, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/08/mnangagwa-throws-own-ally-under-the-bus/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Throws Own Ally Under The Bus?\"</span></a></p>",
            "time": "08:21",
            "date": "09 Mar 2025"
        }
    ]
}