{
    "news": [
        {
            "title": "Tagwirei Says Army And Wealth Are One And The Same Thing",
            "url": "https://www.zimeye.net/2025/05/24/tagwirei-says-army-and-wealth-are-one-and-the-same-thing/",
            "content": "Speaking at a Women for ED fiction in Masvingo today, the tenderpreneur, Kuda Tagwirei says wealth and army are one and the same thing.\n\nHe says:I want to ask is there a child here Who is 18 years old? May they stand up? Is there anyone who is 20 years old? Is there anyone who is 30 years old? Very good sit down.\n\nExactly what I wanted because you are expecting to be given something  that is the story Im going to narrate . Verse 18 of the chapter says, thou shalt remember the Lord thy God for it is He will giveth thee power to get wealth. God is the one who gives you power to get wealth. God is the one who gives you power to get wealth. Now this word, wealth is the one that I want to explain so that I tell you the president wants to give you what exactly when he says he wants to give you wealth.\n\nThis word that has been used can be interchanged with the word army. So we can juxtapose it to say it is God who gives power to get wealth so when you have wealth, you have an army do you understand? When you have wealth, you have an army you are able to fight.\n\nYou are able to protect yourself so the president wants to give us army that can protect us. an army that is able to fight for us because if we dont have wealth, we will not be able to fight other people will fight for us\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Speaking at a Women for ED fiction in Masvingo today, the tenderpreneur, Kuda Tagwirei says wealth and army are one … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/tagwirei-says-army-and-wealth-are-one-and-the-same-thing/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Says Army And Wealth Are One And The Same Thing\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Top Masvingo School Head In Sex Scandal",
            "url": "https://www.zimeye.net/2025/05/24/top-masvingo-school-head-in-sex-scandal/",
            "content": "By Crime and Courts Reporter- The head of Rujeko Primary School in Masvingo has been implicated in a sex scandal involving the School Development Committee (SDC) chairperson.\n\nPatience Mapfumo stands accused of having an intimate relationship with the school head, with allegations that the two engaged in sexual activities in the school heads office. The matter is now before the courts and is set for a pre-trial hearing at the Masvingo Magistrates Court next Friday.\n\nMapfumos legal representative, Knowledge Mabvure of Chihambakwe Law Chambers, appeared before Magistrate Isaac Chikura on Tuesday and requested a postponement of the pre-trial hearing, citing the absence of the respondents lawyer, Martin Mureri, who was reportedly attending to other commitments.\n\nIn her court application, Mapfumo claims that several parents on a school WhatsApp group have falsely accused her of turning the school heads office into a bedroom. She is suing one of the parents, Joshua Mboko, for US$15,000 in a defamation lawsuit. The name of the school head has not been disclosed in the court papers.\n\nMapfumo was accompanied to the court by SDC treasurer Loice Mapurisa. According to chat messages presented in court, Mapfumo is frequently present at the school, which has raised suspicions among parents. Some accuse her and the school head of conspiring to embezzle school funds.\n\nMasvingo Mirror\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- The head of Rujeko Primary School in Masvingo has been implicated in a sex scandal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/top-masvingo-school-head-in-sex-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Top Masvingo School Head In Sex Scandal\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Chaos At Rufaro Stadium As Zvigananda Team Gets Controversial Penalty",
            "url": "https://www.zimeye.net/2025/05/24/chaos-at-rufaro-stadium-as-zvigananda-team-gets-controversial-penalty/",
            "content": "Sports Correspondent\n\nThe Premier Soccer League (PSL) has issued a strong statement following the dramatic abandonment of the Castle Lager Premier Soccer League match between Scottland FC and Chicken Inn FC. The encounter, played at Rufaro Stadium on Friday, 23 May 2025, was halted in the 90th minute amid crowd trouble, shortly after Scottland were awarded a controversial penalty.\n\nWith the match locked at 00, tensions escalated when the referee pointed to the spot, awarding Scottland a penalty that Chicken Inn vehemently contested. The Chicken Inn players refused to continue with the match, prompting chaos in the stands and ultimately leading to the game being abandoned.\n\nIn response, PSL Communications and Media Liaison Officer Kudzai Bare confirmed the abandonment and expressed the leagues disappointment over the incident.\n\nThe Premier Soccer League wishes to advise its stakeholders that the Castle Lager Premier Soccer League match between Scottland FC and Chicken Inn FC, which was played on Friday, 23 May 2025, at Rufaro Stadium was abandoned, said Bare in an official statement.\n\nBare also confirmed that investigations are underway: We await the Match Commissioner and Referees reports on this matter for determination in accordance with the PSL Rules and Regulations. Furthermore, both Clubs will be requested to submit written reports on the events that transpired.\n\nShe added, The PSL regrets any inconvenience caused to its members, stakeholders, and partners.\n\nThe league has stated that no further comments will be made until all match reports and statements from the involved clubs have been received and reviewed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Premier Soccer League (PSL) has issued a strong statement following the dramatic abandonment of the Castle Lager … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/chaos-at-rufaro-stadium-as-zvigananda-team-gets-controversial-penalty/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos At Rufaro Stadium As Zvigananda Team Gets Controversial Penalty\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Advocate Nelson Chamisa Pays Tribute To Former Morgan Tsvangirai Aide",
            "url": "https://www.zimeye.net/2025/05/24/advocate-nelson-chamisa-pays-tribute-to-former-morgan-tsvangirai-aide/",
            "content": "By Tinashe Sambiri\n\nCitizens leader Advocate Nelson Chamisa on Friday paid heartfelt tribute to the late Spencer Ndemera, a former security aide to the late MDC President Morgan Tsvangirai, who was brutally murdered last week in Harare.\n\nSpeaking at Ndemeras funeral in Glen View South, Chamisa described the slain activist as a dedicated servant of the people and a steadfast contributor to Zimbabwes democratic struggle.\n\nSpencer was a true hero of the peoples struggle, Chamisa said. We worked with him since the days of President Morgan Tsvangirai. He was loyal, disciplined, and committed to the cause of freedom.\n\nChamisa used the solemn occasion to reflect on the current state of the nation, expressing concern over the worsening economic conditions under President Emmerson Mnangagwas leadership. He criticised the governments failure to address the countrys deepening crisis and accused the regime of fearing popular resistance.\n\nNaiye wamunofunga kuti akatiremedza, naye akatoremerwawo, he said. Ukanomubvunza kuti akakuremera ndiani, anogona kuti ndakaremerwa nemukomana.\n\nChamisa went on: Of course, we all know that we are grappling with a deepening economic crisis. Thats our main challenge. You all know who is behind the crisis.\n\nNdemera, who was also a local entrepreneur and community caretaker, was found dead in his Glen View home following an alleged assault by tenants. His murder has sparked outrage and calls for justice from across the political spectrum and wider community.\n\n\"Naiye wamunofunga kut akatiremedza naye akatoremerwawo. Ukanomubvunza kuti akakuremera ndiani anogona kut ndakaremerwa nemukomana\"  President Chamisa at Spencer Ndemeras funeral in Glenview Southpic.twitter.com/R4SzDsnNaR\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Citizens’ leader Advocate Nelson Chamisa on Friday paid heartfelt tribute to the late Spencer Ndemera, a former … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/advocate-nelson-chamisa-pays-tribute-to-former-morgan-tsvangirai-aide/\">Continue reading<span class=\"screen-reader-text\"> \"Advocate Nelson Chamisa Pays Tribute To Former Morgan Tsvangirai Aide\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Do you think Traore is Gaddafi-Magufuli level of a revolutionary?",
            "url": "https://www.zimeye.net/2025/05/24/do-you-think-traore-is-gaddafi-magufuli-level-of-a-revolutionary/",
            "content": "Do you think Traore is Gaddafi/Magufuli level of a revolutionary?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "People Power Is Giving Mnangagwa Sleepless Nights, Declares Chamisa",
            "url": "https://www.zimeye.net/2025/05/24/people-power-is-giving-mnangagwa-sleepless-nights-declares-chamisa/",
            "content": "By Tinashe Sambiri\n\nCitizens leader Advocate Nelson Chamisa on Friday paid heartfelt tribute to the late Spencer Ndemera, a former security aide to the late MDC President Morgan Tsvangirai, who was brutally murdered last week in Harare.\n\nSpeaking at Ndemeras funeral in Glen View South, Chamisa described the slain activist as a dedicated servant of the people and a steadfast contributor to Zimbabwes democratic struggle.\n\nSpencer was a true hero of the peoples struggle, Chamisa said. We worked with him since the days of President Morgan Tsvangirai. He was loyal, disciplined, and committed to the cause of freedom.\n\nChamisa used the solemn occasion to reflect on the current state of the nation, expressing concern over the worsening economic conditions under President Emmerson Mnangagwas leadership. He criticised the governments failure to address the countrys deepening crisis and accused the regime of fearing popular resistance.\n\nNaiye wamunofunga kuti akatiremedza, naye akatoremerwawo, he said. Ukanomubvunza kuti akakuremera ndiani, anogona kuti ndakaremerwa nemukomana.\n\nChamisa went on: Of course, we all know that we are grappling with a deepening economic crisis. Thats our main challenge. You all know who is behind the crisis.\n\nNdemera, who was also a local entrepreneur and community caretaker, was found dead in his Glen View home following an alleged assault by tenants. His murder has sparked outrage and calls for justice from across the political spectrum and wider community.\n\n\"Naiye wamunofunga kut akatiremedza naye akatoremerwawo. Ukanomubvunza kuti akakuremera ndiani anogona kut ndakaremerwa nemukomana\"  President Chamisa at Spencer Ndemeras funeral in Glenview Southpic.twitter.com/R4SzDsnNaR\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Citizens’ leader Advocate Nelson Chamisa on Friday paid heartfelt tribute to the late Spencer Ndemera, a former … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/people-power-is-giving-mnangagwa-sleepless-nights-declares-chamisa/\">Continue reading<span class=\"screen-reader-text\"> \"People Power Is Giving Mnangagwa Sleepless Nights, Declares Chamisa\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Mnangagwa Unleashes Violent Crackdown Over Military Petition Demanding His Resignation",
            "url": "https://www.zimeye.net/2025/05/24/mnangagwa-unleashes-violent-crackdown-over-military-petition-demanding-his-resignation/",
            "content": "By A Correspondent | ZimEye | Harare  23 May 2025  President Emmerson Mnangagwa has been accused of unleashing a violent crackdown against citizens linked to a petition calling for his resignation, in what critics describe as a growing campaign of repression against dissent.\n\nThis is now a clear abduction case that is being arranged by a small group in the ruling upper class, said Gifford Gomwe, one of the main petitioners, in an interview with ZimEye.\n\nHis mother, 72-year-old Edna Musarurwa, was reportedly abducted on Friday evening from her home in Budiriro, Harare, by a group of armed men believed to be state operatives. She was later dumped near a police checkpoint in Norton.\n\nThe petition, submitted earlier this week to the Zimbabwe Defence Forces (ZDF), cites President Mnangagwas alleged incapacitation and corruption and demands his immediate retirement. The document was officially acknowledged by military officials, and sources say its reception has provoked anxiety within the presidency.\n\nZDF insiders confirmed the petition invoked Section 212 of the Constitution, which mandates the military to defend the Constitution, peace, and the rule of law. Its being treated internally as a quasi-legal instrument  almost like a lawsuit against the President, a military source revealed. The document is reportedly gaining support among mid- and lower-ranking officers.\n\nThe petitions signatories include Gomwe, Tawanda Jena, Rose Chirenje, and Sarudzai Rushwaya  all of whom are now reportedly being targeted in an aggressive manhunt.\n\nPresident Mnangagwa has not issued an official response, but his spokesperson George Charamba appeared to allude to the issue on social media, taking a veiled swipe at ZimEye editor Simba Chikanza. Hauneti here nhai Simba  WHEN DO YOU GET TIRED? he tweeted.\n\nMnangagwa has previously warned that anyone opposing the extension of his presidency will have their days on earth reduced, reinforcing concerns about his administrations intolerance of opposition voices.\n\nThe current crackdown mirrors a similar incident in March when activist Blessed Geza was allegedly targeted by state agents. Analysts see these actions as part of a broader strategy to neutralize political threats, particularly within the security establishment.\n\nWhile Gomwe briefly contacted ZimEye to confirm his safety, his exact location remains unknown. The Ministry of Defence and President Mnangagwas office were contacted for comment but had not responded by the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Harare – 23 May 2025 — President Emmerson Mnangagwa has been accused of unleashing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/mnangagwa-unleashes-violent-crackdown-over-military-petition-demanding-his-resignation/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Unleashes Violent Crackdown Over Military Petition Demanding His Resignation\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Malema Mocks Trump and Ramaphosa: “Old Men Gossiping About Me”",
            "url": "https://www.zimeye.net/2025/05/24/malema-mocks-trump-and-ramaphosa-old-men-gossiping-about-me/",
            "content": "By A Correspondent\n\nSouth African opposition leader Julius Malema has hit back at a high-profile meeting between U.S. former President Donald Trump and President Cyril Ramaphosa, calling it nothing more than a group of old men gossiping about me.\n\nThe Economic Freedom Fighters (EFF) leader made the sharp remark after reports emerged that Trump paused the meeting at the White House to show a video clip of Malema chanting the controversial slogan Kill the Boer, a chant that has drawn international attention.\n\nTrump reportedly used the moment to raise concerns over what he described as the ongoing killing and displacement of white farmers in South Africa, echoing long-standing claims of so-called white genocide  a narrative Malema forcefully rejects.\n\nThere is no significant amount of intelligence evidence about white genocide, Malema wrote on X (formerly Twitter). A group of older men meet in Washington to gossip about me.\n\nHe added: We will not agree to compromise our political principles on land expropriation without compensation for political expediency.\n\nMalema and his party have consistently championed the expropriation of land without compensation as a key policy to address historical injustices in land ownership.\n\nEarlier this year, President Ramaphosa signed into law a contentious land reform bill allowing the government to expropriate land in specific circumstances without payment. While the law has sparked fierce debate domestically and abroad, the government maintains that no land has yet been seized under the new legislation.\n\nMalemas defiant stance underscores deep political divisions in South Africa and highlights how the land question remains a lightning rod issue  both at home and in global politics.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent South African opposition leader Julius Malema has hit back at a high-profile meeting between U.S. former President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/malema-mocks-trump-and-ramaphosa-old-men-gossiping-about-me/\">Continue reading<span class=\"screen-reader-text\"> \"Malema Mocks Trump and Ramaphosa: “Old Men Gossiping About Me”\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Former Morgan Tsvangirai Aide Brutally Murdered In Harare",
            "url": "https://www.zimeye.net/2025/05/24/former-morgan-tsvangirai-aide-brutally-murdered-in-harare/",
            "content": "By A Correspondent\n\nRangarirai Spencer Ndemera, a former security aide to the late MDC leader Morgan Tsvangirai, has been brutally murdered under disturbing circumstances at his home in Glen View, Harare.\n\nNdemera, who ran a catering business and also served as a caretaker at a local property, was reportedly assaulted by tenants last week. His body was later discovered by neighbours after he had gone missing for several days.\n\nHe was last seen on Friday, said one neighbour. We started getting worried when he didnt answer calls or come out of the house. Thats when we alerted the police.\n\nPolice have since launched an investigation into the incident, with the circumstances surrounding Ndemeras death still unclear. Local residents suspect foul play and are calling for a swift response from authorities.\n\nVictor Chifodya, a former Ward 30 councillor in Glen View and a lifelong acquaintance of Ndemera, expressed shock and demanded justice. I knew Spencer since we were boys. He was quiet and hardworking. Whoever did this must be brought to book, he said.\n\nThe community is now rallying around Ndemeras elderly mother and young daughter, who are reportedly in distress. His wife passed away in 2018, leaving the two as his only immediate family.\n\nHe was the only breadwinner, a concerned neighbour noted. We are worried about what will happen to his mother and child now.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Rangarirai Spencer Ndemera, a former security aide to the late MDC leader Morgan Tsvangirai, has been brutally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/former-morgan-tsvangirai-aide-brutally-murdered-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Former Morgan Tsvangirai Aide Brutally Murdered In Harare\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        },
        {
            "title": "Starlink “Gets SA Licence” Days After Ramaphosa Humiliated By Trump",
            "url": "https://www.zimeye.net/2025/05/24/starlink-gets-sa-licence-days-after-ramaphosa-humiliated-by-trump/",
            "content": "Pretoria  Days after President Cyril Ramaphosa faced a public snub from former U.S. President Donald Trump, the South African government has announced draft changes to ICT legislation that could pave the way for Elon Musks Starlink to legally operate in the country. The move has reignited tensions over racial justice, economic sovereignty, and geopolitical interference.\n\nCommunications and Digital Technologies Minister Solly Malatsi on Friday gazetted a proposed amendment to ICT sector regulations. The changes would relax the 30% equity requirement for previously disadvantaged individuals (PDIs) in new ICT investmentsan obligation that had effectively blocked the South African-born Musks satellite internet company from entering the local market.\n\nMusk, the worlds richest man and CEO of SpaceX, has repeatedly lashed out at South African regulations, claiming he was being excluded from the local telecommunications sector because he is white. In a widely criticized post earlier this year, Musk accused the ANC government of anti-white racism and promoting reverse apartheid, echoing long-standing right-wing narratives used to undermine Black economic empowerment in post-apartheid South Africa.\n\nCritics argue that Musks public statements are part of a broader disinformation campaign, particularly his amplification of the debunked white genocide mytha claim that white farmers in South Africa are being systematically targeted and killed. This conspiracy theory, often promoted by far-right groups in the United States, has been condemned by South African civil society, researchers, and human rights groups as both inaccurate and inflammatory.\n\nMusks remarks have drawn outrage not only for their racial insensitivity but also for their geopolitical implications. His social media megaphone has emboldened calls within U.S. conservative circles for sanctions against South Africa, accusing the government of violating white minority rightsa narrative that many in Pretoria view as a form of neocolonial interference.\n\nThe timing of the Starlink announcement is politically charged. It comes just days after former U.S. President Donald Trump, now back in office following his re-election in January, publicly criticized President Ramaphosa for failing to protect white farmers, referencing the same false genocide claims Musk has propagated.\n\nTrumps administration previously flirted with the idea of sanctioning South Africa over land reform policies, and his renewed remarks have once again strained diplomatic relations between the two countries. Earlier this week, Ramaphosa was noticeably absent from a group of African leaders invited to a high-level investment summit hosted by Trump in Washingtona move widely interpreted as a political slight.\n\nInsiders in the Department of International Relations say the South African government is walking a diplomatic tightrope: attempting to maintain relations with the United States while resisting external pressure that undermines the countrys sovereignty and transformation agenda.\n\nThe proposed amendments to the ICT regulations are framed as part of a broader investment drive. According to Malatsi, the changes would allow multinational companies to fulfill Broad-Based Black Economic Empowerment (B-BBEE) requirements through equity equivalent investment programmes instead of direct ownership.\n\nCurrently, the rules around who can acquire a license in the ICT sector require a minimum of 30% ownership in the hands of historically disadvantaged individuals. The equity equivalent programme allows multinationals to meet empowerment obligations through alternatives like investing in local suppliers, enterprise development, job creation, and skills development, Malatsi said in a statement.\n\nThe Economic Freedom Fighters (EFF) have strongly rejected the policy shift and any deal involving Starlink, accusing Musk of racial provocation and economic imperialism.\n\nStarlink represents a threat to local industry and national security. It is owned by an individual who has peddled lies about a genocide in South Africa in an attempt to gain unregulated access to our market, the EFF said in a fiery statement.\n\nThe party also questioned Musks motivations, stating: One wonders why Elon Musk is so desperate to invest in a country he claims is committing genocide. A genuine humanitarian would see genocide as a reasonnotto invest.\n\nThe EFF vowed to fight the deal in Parliament, in the courts, and in the streets if necessary, warning that South Africas sovereignty is not for sale to billionaires.\n\nDespite public controversy, Starlink has been quietly lobbying behind the scenes for regulatory changes. Sources within the Department of Communications confirmed that high-level talks between government officials and Starlink representatives have been ongoing for months, intensified by growing demand for rural internet access.\n\nSouth Africa remains one of the few major African economies yet to grant Starlink full operational rights, even as the service expands across the continent, including in Nigeria, Kenya, and Mozambique.\n\nWhile the policy changes are being sold as a pragmatic move to unlock investment and expand internet access, critics warn that they may set a dangerous precedentallowing foreign billionaires who undermine South African sovereignty and racial justice to do business on their own terms.\n\nAs the battle lines are drawn in Parliament and the courts, the Starlink saga is becoming more than just a telecoms storyit is now a lightning rod for race, power, and post-colonial sovereignty in South Africas fragile democracy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Pretoria – Days after President Cyril Ramaphosa faced a public snub from former U.S. President Donald Trump, the South African … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/24/starlink-gets-sa-licence-days-after-ramaphosa-humiliated-by-trump/\">Continue reading<span class=\"screen-reader-text\"> \"Starlink “Gets SA Licence” Days After Ramaphosa Humiliated By Trump\"</span></a></p>",
            "time": "08:28",
            "date": "25 May 2025"
        }
    ]
}