{
    "news": [
        {
            "title": "Chiwenga Pulls Out The Gun",
            "url": "https://www.zimeye.net/2025/01/28/chiwenga-pulls-out-the-gun/",
            "content": "By Munacho Gwamanda- Acting President Constantino Chiwenga has launched a scathing attack on President Emmerson Mnangagwas loyalists, including politically connected businessmen accused of exploiting their ties to the presidency to amass wealth at the expense of the nation.\n\nSpeaking at the burial of Justin Mupamhanga at the National Heroes Acre on Monday, a visibly enraged Chiwenga lambasted what he called zvigananda (leeches)  individuals who have become synonymous with corruption and greed.\n\nHis fiery remarks were widely interpreted without naming names as a veiled swipe at flamboyant businessman Wicknell Chivhayo, whose controversial government contracts and ostentatious lifestyle have long sparked public outrage.\n\nWe all swore to a shared future where everyone has a seat at the table, a culture of equal opportunity where every Zimbabwean serves equally, Chiwenga declared. But this culture of selfishness, greed, and corruption, where a few get rich through ill-gotten wealth, must end. Vision 2030 is for all Zimbabweans, not just for these so-called mbingas  those we used to call zvigananda during the war.\n\nThe term mbingas has come to symbolize individuals who flaunt wealth acquired through questionable means, often leveraging political connections.\n\nChivhayo, infamous for failed multi-million-dollar energy projects and his penchant for gifting luxury cars to politicians and celebrities, has become a poster child for this phenomenon.\n\nHis extravagant loyalty to Mnangagwa has only fueled speculation about the growing factionalism within Zanu PF.\n\nChiwengas denunciation of these figures marks a clear rebuke of the culture of patronage and excess that has deepened inequality in Zimbabwe.\n\nHis comments come amid whispers of intensifying rivalry between Mnangagwa and Chiwengas factions as Zanu PF manoeuvres for control ahead of the 2028 elections.\n\nCritics suggest that Chiwengas remarks are not only a critique of corruption but also a strategic move to assert his authority as internal power struggles escalate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Acting President Constantino Chiwenga has launched a scathing attack on President Emmerson Mnangagwa’s loyalists, including politically connected … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/chiwenga-pulls-out-the-gun/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Pulls Out The Gun\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zimdaily Cartoon Of Chigananda Wicknell Chivayo",
            "url": "https://www.zimeye.net/2025/01/28/zimdaily-cartoon-of-chigananda-wicknell-chivayo/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "VP Chiwenga’s “Zvigananda” Speech Talk Explained",
            "url": "https://www.zimeye.net/2025/01/28/vp-chiwengas-zvigananda-speech-talk-explained/",
            "content": "By Jonathan Chando | In 1976, we maintained the military code and upheld the Ten Commandments Nzira dzemasoja. We had a slogan which said Pasi nezvigananda! literally translated to down with bourgeoisies. We also maintained a code never to praise or worship a commander or leader through slogans like pamberi nanhingi. We were steadily prosecuting the war of liberation under the command of the military committee of ZIPA, a unified force of ZANLA and ZIPRA.\n\nWhen the nationalists came and hijacked the liberation struggle in 1977, they banned the slogan Pasi nezvigananda, introduced the praise slogan Pamberi na Cde Robert Mugabe, and they trashed Nzira dzemasoja. The nationalists disbanded the unified force of ZIPRA and ZANLA and caused division between ZANU and ZAPU.\n\nThat was the beginning of a neocolonial puppet regime transformation disguised as independence, led by nationalists who had been turned by the Rhodesian Special Branch and the British MI6.\n\nThey arrested the members of the military committee and intended to assassinate them all, save for Samora Machel, who told them that no cdes would be killed on his territory for disagreeing with each other. These commanders were incarcerated until 1980. They wanted to execute them like Tongogara and others had done to the Nhari and Badza group!- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Jonathan Chando | In 1976, we maintained the military code and upheld the Ten Commandments “Nzira dzemasoja.” We had … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/vp-chiwengas-zvigananda-speech-talk-explained/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga’s “Zvigananda” Speech Talk Explained\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "The Chitepo Death Untold",
            "url": "https://www.zimeye.net/2025/01/28/the-chitepo-death-untold/",
            "content": "The Chitepo Death Quandary:\n\nBy Reason Wafawarova | Everyone is arrested in 1964 on different charges, Ndabaningi Sithole, Robert Mugabe, Maurice Nyagumbo, Edgar Tekere, Kembo Mohadi, Emmerson Mnangagwa and others.\n\nThis was after the Gweru Congress where Sithole was elected First Secretary of ZANU and he personally appointed Robert Mugabe his Secretary General.\n\nFrom jail Ndabaningi Sithole asked Herbert Chitepo to lead the ZANLA WAR COUNCIL fron Zambia.\n\nMnangagwa is transfered to Khami Prison in 1965 at the request of Ken Flower, Ian Smiths Chief Intelligence Officer, where he is not allowed to meet with others thrre like Mohadi because he was classified D Class. It has never been established what Flowers motive for the transfer was.\n\nThis is where rumors of secret meetings with officers from Ken Flowers Special Branch emanate from.\n\nIn 1972, Mnangagwa is transfered back to Salisbury where he hooks up with Mugabe, Tekere and others. Mugabe entices him to enrol for an LlB Degree with the University of London so they could study together. They did their essays together for the law degree, and Mnangagwa was released in November 1974 alongside Mugabe and Tekere but had to wait until late December for his deportation to Zambia since his lawyers were claiming he was Zambian to minimise chances of being re-arrested.\n\nSithole too was released in 1974 November, but Mugabe claimed he had sold out to Ken Flower and Ian Smith so his three friends in jail had ousted him and chosen Mugabe instead.\n\nChitepo argued three people were not a Congress so that wasnt binding.\n\nMnangagwa frequented Josiah Tongogaras house in Zambia but never visited Chitepo.\n\nMugabe then visited Mnangagwa in Mumbwa in Zambia in January 1975.\n\nMnangagwa by that time was completing his LLB with the Unoversity of Zambia .\n\nA meeting between Mnangagwa, Mugabe and Tongogara happened but no details of the meeting were made public.\n\nMnangagwa then developed a romantic relationship with Tongogaras sister Jayne, whom he then went on to marry.\n\nOn March 18 in 1975, Herbert Chitepo was assassinated through a bomb planted in his car, barely 3 months after his encounter with Mugabe.\n\nZambian police responded by rounding up Zanu leaders and Keneth Kaunda in particular fingered Tingogara.\n\nZanu then left Zambia to go and fight from newly independent Mozambique, and Kaunda told Samora Machel the guys were a bunch of murderers and should not be trusted. It took very long for Samora to trust Tongogara and Robert Mugabe.\n\nZanu claimed Kaunda had sold out through Detente with Vorster so they had to leave Zambia.\n\nIn April 1975, Robert Mugabe and Tekere fled to Mozambique and Mugabe was then made caretaker First Secretray.\n\nMnangagwa started working as a lawyer in 1975. He was persuaded to pay Tongogara a family visit in Maputo in 1976. He did come on holiday with his family, then Mugabe and Tongogara persuaded him to leave his job and join them. He went back to Zambia, and returned in 1977 to become Robert Mugabes personal assistant.\n\nRumors of him being a spy were spread, and the conspiracies pointing to Mugabe, Mnangagwa and Tongo as the people behind Chitepos assassination swelled.\n\nRW\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Chitepo Death Quandary: By Reason Wafawarova | Everyone is arrested in 1964 on different charges, Ndabaningi Sithole, Robert Mugabe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/the-chitepo-death-untold/\">Continue reading<span class=\"screen-reader-text\"> \"The Chitepo Death Untold\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Leaked PCC Minutes: Govt Starts Issuing Title Deeds for 2030 Mnangagwa Presidency",
            "url": "https://www.zimeye.net/2025/01/28/leaked-pcc-minutes-govt-starts-issuing-title-deeds-for-2030-mnangagwa-presidency/",
            "content": "By Farai D Hove | ZimEye | Harare, Zimbabwe  Leaked minutes from a recent Provincial Coordinating Committee (PCC) meeting have revealed that President Emmerson Mnangagwas initiative to issue title deeds to beneficiaries of the land reform programme may have a deeper political agenda. While publicly presented as an economic empowerment programme, the leaked documents suggest that the move could be aimed at consolidating political power and advancing the ruling partys interests ahead of the 2025 elections.\n\nThe state media recently reported that 2,500 title deeds will be issued by March 2025 as part of the governments efforts to streamline land ownership and improve access to capital. However, the leaked minutes raise questions about the motivations behind this initiative, as they outline a strategy that intertwines economic reforms with political objectives.\n\nLeaked Details\n\nKey points from the leaked PCC minutes include:1. Issuance of Title Deeds Nationwide: The minutes highlight plans for President Mnangagwa to extend the issuance of title deeds to both agricultural and urban land, with landowners required to pay between 2 and 8 cents per square meter. The payments would be spread over 20 years at an interest rate of 7.5%, raising concerns over the financial burden this could place on beneficiaries.2. Focus on Underperforming Districts: Makonde district was flagged in the minutes for having the lowest registration figures in the province, with only 69,000 names submitted on cell registers, compared to over 100,000 in other districts. This has led to directives to improve registration efforts in areas deemed underperforming.3. Party Discipline and Loyalty: The minutes emphasize the need for ZANU-PF members to remain disciplined and avoid engaging in anti-leadership discourse, particularly on social media, signaling a crackdown on internal dissent.4. Presidential Term Extension: Perhaps the most controversial point in the minutes is the resolution to push for the extension of Mnangagwas presidential term to 2030. The document indicates that legal processes are being prepared to facilitate this extension, which would effectively delay leadership change for another five years.\n\nConcerns Over Political Motives\n\nThe issuance of title deeds has been framed as a measure to secure property rights and enable beneficiaries to access financing for agricultural activities. However, the timing and structure of the programme have raised suspicions that it is designed to secure political loyalty by tying landowners to the government through long-term financial obligations.\n\nThe term extension resolution adds further weight to these concerns, with critics questioning whether the programme is being used to manipulate beneficiaries into supporting Mnangagwas continued leadership.\n\nImplications for Zimbabwe\n\nWhile the issuance of title deeds could address longstanding issues in land tenure and improve economic opportunities, the revelations in the leaked minutes suggest that the initiative may be serving dual purposes: addressing economic challenges while simultaneously advancing the political goals of the ruling party.\n\nThe government has not yet responded to the leaked minutes, but the revelations are likely to spark debate over the role of land reform in Zimbabwes political landscape. As the country approaches the 2025 elections, the intersection of land ownership and political power is once again under scrutiny, with significant implications for the nations future.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | Harare, Zimbabwe — Leaked minutes from a recent Provincial Coordinating Committee (PCC) meeting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/leaked-pcc-minutes-govt-starts-issuing-title-deeds-for-2030-mnangagwa-presidency/\">Continue reading<span class=\"screen-reader-text\"> \"Leaked PCC Minutes: Govt Starts Issuing Title Deeds for 2030 Mnangagwa Presidency\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Will Warriors Make An Impact At AFCON 2025 ?",
            "url": "https://www.zimeye.net/2025/01/28/will-warriors-make-an-impact-at-afcon-2025/",
            "content": "Sports Correspondent\n\nThe Confederation of African Football (CAF) has unveiled the official logo for the 2025 Africa Cup of Nations (AFCON), which will take place in Morocco from December 21, 2025, to January 18, 2026.\n\nThe logo draws inspiration from the intricate designs of Moroccan Zellij tilework.\n\nA total of 24 teams have qualified for the tournament, including the host nation Morocco, as well as Burkina Faso, Cameroon, Algeria, DR Congo, Senegal, Egypt, Angola, Equatorial Guinea, Ivory Coast, Uganda, South Africa, Gabon, Tunisia, Nigeria, Zambia, Mali, Zimbabwe, Comoros, Sudan, Benin, Tanzania, Botswana, and Mozambique.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Confederation of African Football (CAF) has unveiled the official logo for the 2025 Africa Cup of Nations … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/will-warriors-make-an-impact-at-afcon-2025/\">Continue reading<span class=\"screen-reader-text\"> \"Will Warriors Make An Impact At AFCON 2025 ?\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Muchinguri- Kashiri Aide In Serious Road Accident",
            "url": "https://www.zimeye.net/2025/01/28/muchinguri-kashiri-aide-in-serious-road-accident/",
            "content": "By A Correspondent\n\nTatenda Chinoda Dhege, a senior official in the office of Zanu PF National Party Chairperson Oppah Muchinguri-Kashiri, narrowly escaped death on Friday night after being involved in a horrific road accident.\n\nDhege, who serves as the partys director at the headquarters in Harare, was driving a white Toyota Hilux Revo when the incident occurred.\n\nAccording to sources within Zanu PF, Dhege was returning home from the Buhera office when the accident took place. He failed to stop at the T-junction where the road intersects with the Murambinda-Chivhu Highway. He was supposed to turn right onto the highway towards Mashaka Village in Chief Nerutangas area, Buhera, but instead, he veered off the road and crashed into a tree, a Zanu PF insider explained.\n\nThe vehicle rolled multiple times and eventually landed on its roof. The source further speculated, It is suspected that the vehicles brakes failed, which may have contributed to the accident. Fortunately, Dhege was not injured in the crash, although his car sustained severe damage.\n\nNo official comment could be obtained from the police.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tatenda Chinoda Dhege, a senior official in the office of Zanu PF National Party Chairperson Oppah Muchinguri-Kashiri, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/muchinguri-kashiri-aide-in-serious-road-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Muchinguri- Kashiri Aide In Serious Road Accident\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Tshabangu Rally Flops",
            "url": "https://www.zimeye.net/2025/01/28/tshabangu-rally-flops/",
            "content": "By A Correspondent\n\nSengezo Tshabangu, the controversial Secretary of the Citizens Coalition for Change (CCC), controversially skipped his own rally in Masvingo on Saturday.\n\nTshabangu, often seen as a figure with close ties to Zanu PF, failed to attend the event at Mucheke Hall in Masvingo Urban, reportedly due to a disappointing turnout.\n\nHis aides advised him against attending after assessing the situation, said a source familiar with the matter. This was supposed to be Tshabangus first provincial rally after he allegedly took over the CCC party with the help of Zanu PF.\n\nThe rally, which was meant to galvanize support in Masvingo, a region considered to be a stronghold of CCC leader Nelson Chamisa, was left in disarray after Tshabangus sudden change of plans. Masvingo is highly disappointed by Tshabangus failure to attend the provincial rally, a local observer commented. He knew that Masvingo is Chamisas stronghold but cancelled his visit at the last minute. I am angry.\n\nThe event, described as poorly organized, saw a mere 10 members of parliament and senators in attendance. Key figures included Chief Whip Nonhlanhla Mlotshwa, Chief Whip of the National Assembly Charles Moyo, Senators Linda Sibanda, Bvumo, Phulu, and Maxwell Mdluri. However, the absence of Masvingos councillors, mayors, MPs, senators, and provincial council members was a stark sign of discontent within the party.\n\nThe lack of support from prominent local officials and the absence of Tshabangu himself has sent a clear message of dissatisfaction among CCC members in the province.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Sengezo Tshabangu, the controversial Secretary of the Citizens Coalition for Change (CCC), controversially skipped his own rally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/tshabangu-rally-flops/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Rally Flops\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zanu PF Activist Claims Winky D Is Bitter About Not Getting A Car From Chivayo",
            "url": "https://www.zimeye.net/2025/01/28/zanu-pf-activist-claims-winky-d-is-bitter-about-not-getting-a-car-from-chivayo/",
            "content": "By A Correspondent\n\nZanu PF social media activist Cleopas H Mukungunugwa stirred controversy on Sunday by claiming that popular musician Winky D is harbouring bitterness because he hasnt received a car from controversial businessman Wicknell Chivayo.\n\nIn a post on social media, Mukungunugwa pointed to Winky Ds alleged resentment, stating, Winky D is simply bitter because Sir Wicknell Chivayo @wicknellchivayo has never given him a cent or a car. Mukungunugwa went on to suggest that the artist had relied on donations from the US Embassy, claiming, He used to survive on the dirty coins from the US Embassy until Donald Trump wisely halted the aid.\n\nMukungunugwa continued by urging Winky D to stay away from politics, adding, Winky D should stay away from politics.\n\nThe social media activist also took aim at the musicians fashion choices, quipping, Apa Akapfeka Mucheka WeMaCurtain zvakea derogatory comment aimed at the artists style.\n\nWinky D, known for his outspoken views, has often found himself at odds with the government, making him a target of Zanu PF supporters like Mukungunugwa.\n\nWhile Mukungunugwas remarks were aimed at discrediting Winky D, it remains to be seen how the musician will respond to these accusations and whether they will spark further political tensions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF social media activist Cleopas H Mukungunugwa stirred controversy on Sunday by claiming that popular musician … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/zanu-pf-activist-claims-winky-d-is-bitter-about-not-getting-a-car-from-chivayo/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Activist Claims Winky D Is Bitter About Not Getting A Car From Chivayo\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Scottland FC Unveils Star-Studded Technical Team",
            "url": "https://www.zimeye.net/2025/01/28/scottland-fc-unveils-star-studded-technical-team/",
            "content": "By A Correspondent\n\nIn a bold move to bolster their Premier Soccer League ambitions, Scottland FC has announced a powerful technical team. The newly-assembled squad of experts is set to propel the team to new heights.\n\nAt the helm is Head Coach Tonderai Ndiraya, a seasoned tactician with a proven track record. He is ably supported by 1st Assistant Coach Naison Muchekela and 2nd Assistant Coach William Nyasulu.\n\nThe technical team is further bolstered by:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold move to bolster their Premier Soccer League ambitions, Scottland FC has announced a powerful … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/28/scottland-fc-unveils-star-studded-technical-team/\">Continue reading<span class=\"screen-reader-text\"> \"Scottland FC Unveils Star-Studded Technical Team\"</span></a></p>",
            "time": "08:25",
            "date": "29 Jan 2025"
        }
    ]
}