{
    "news": [
        {
            "title": "Bosso Coach Speaks On Lifting Of Ban",
            "url": "https://www.zimeye.net/2025/03/28/bosso-coach-speaks-on-lifting-of-ban/",
            "content": "Sports Correspondent\n\nHighlanders coach Kelvin Kaindu has expressed relief after the club successfully registered all its players following the lifting of the FIFA transfer ban. The ban was imposed due to unpaid salaries of former coach Baltemar Brito and his assistant Antonio Joao Torres, totaling $26,500. Businessman Wicknell Chivayo intervened to settle the debt.\n\nWith the ban lifted, Highlanders was able to register new players ahead of the international break. Coach Kaindu acknowledged the challenges faced by the team, stating, Weve had challenges with registering a full-strength squad, but we are hopeful that this week we may have a full squad and also have more options.\n\nKaindu also provided an update on the teams medical situation, saying, We are happy that most of our players are almost back to 100 percent in terms of their match fitness.\n\nHighlanders will face Scottland FC this Sunday at Barbourfields Stadium in Bulawayo, with kick-off at 3 pm.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Highlanders coach Kelvin Kaindu has expressed relief after the club successfully registered all its players following the lifting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/bosso-coach-speaks-on-lifting-of-ban/\">Continue reading<span class=\"screen-reader-text\"> \"Bosso Coach Speaks On Lifting Of Ban\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Walter Magaya’s Church Property Auctioned To Pay Back Debts At Time He’s Saying He’s Donating Millions Of Dollars To National Football",
            "url": "https://www.zimeye.net/2025/03/28/walter-magayas-church-property-auctioned-to-pay-back-debts-at-time-hes-saying-hes-donating-millions-of-dollars-to-national-football/",
            "content": "Harare  28 March 2025\n\nBy A Correspondent | ZimEye | A major property owned by controversial preacher and businessman Walter Magaya is being auctioned by the Sheriff of the High Court of Zimbabwe today, following a lawsuit brought by GetBucks Microfinance against Magayas company, Planet Africa.\n\nThe auction, confirmed in an official notice, is taking  place at Raylton Sports Club, corner of Fifth Street and George Silundika Avenue in Harare, on Friday, 28 March 2025, starting at 10:00 AM, with bidder registration from 9:00 AM.\n\nThe property going under the hammer is located at 166 Smuts Road, Prospect Waterfalls, Hararea prime piece of land measuring over 3.2 hectares. It is listed in court records as the remainder of Stand 166 of Prospect, and is registered in the name of Magayas Planet Africa, which is cited as the defendant in the case (GetBucks Microfinance v Planet Africa & 2 Others, High Court Case No: HCHC657/24).\n\nThough access was denied to valuers, the Sheriffs office was informed that the property was previously used as a medical facility, and contains multiple structures including a reception area, two kitchens, a dining area, six single rooms, various toilets and bathrooms, and a large yard with male and female ablution blocks. The cottage alone has three toilets and several rooms.\n\nThis public auction marks a significant blow to Magayas vast business empire, which has included real estate, agriculture, pharmaceuticals, and religious tourism. Planet Africa, once presented as a key pillar in Magayas vision for economic empowerment, now finds itself at the centre of financial distress.\n\nMagaya, founder of Prophetic Healing and Deliverance (PHD) Ministries, has not publicly commented on the pending sale. His ministry and affiliated companies have faced growing scrutiny in recent years over allegations of financial mismanagement and unfulfilled business promises.\n\nThis development adds to the rising number of legal and financial challenges facing the charismatic preacher, whose influence in religious and business circles has been considerable.\n\nMore updates to follow as the story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 28 March 2025 By A Correspondent | ZimEye | A major property owned by controversial preacher and businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/walter-magayas-church-property-auctioned-to-pay-back-debts-at-time-hes-saying-hes-donating-millions-of-dollars-to-national-football/\">Continue reading<span class=\"screen-reader-text\"> \"Walter Magaya’s Church Property Auctioned To Pay Back Debts At Time He’s Saying He’s Donating Millions Of Dollars To National Football\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Tatenda Mkuruva Finds New Home",
            "url": "https://www.zimeye.net/2025/03/28/tatenda-mkuruva-finds-new-home/",
            "content": "Sports Correspondent\n\nZimbabwean goalkeeper Tatenda Mkuruva has secured a new chapter in his career, leaving Michigan Stars to join Detroit City FC in the United States. Mkuruva has signed a two-year contract with his new club, which competes in the USL Championship, just below Major League Soccer (MLS).\n\nDetroit City confirmed the transfer in a statement on March 25, announcing that Mkuruva had signed a deal guaranteeing his stay through the 2025 season, with an option for the 2026 campaign. The goalkeeper will wear the #16 jersey for Detroit City and has been training with the team since pre-season.\n\nMkuruvas journey to Detroit City follows his time at Michigan Stars, where he had been based in the metro-Detroit area since 2019. He initially joined Michigan Stars ahead of their inaugural NPSL Members Cup campaign, where he faced Detroit City twice during his first season. Mkuruva quickly became a key figure at Michigan Stars, earning and maintaining the #1 goalkeeper spot from 2019 to 2024, and ultimately rising to the position of club captain.\n\nBefore his move to the US, Mkuruva made his mark in the Zimbabwean Premier League with Dynamos, before moving to South Africas Cape Town City and Zambias Buildcon. Now, he embarks on a new challenge in the US, bringing his wealth of experience to Detroit City.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean goalkeeper Tatenda Mkuruva has secured a new chapter in his career, leaving Michigan Stars to join Detroit … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/tatenda-mkuruva-finds-new-home/\">Continue reading<span class=\"screen-reader-text\"> \"Tatenda Mkuruva Finds New Home\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Reducing Accidents on Highways…",
            "url": "https://www.zimeye.net/2025/03/28/reducing-accidents-on-highways/",
            "content": "Highway accidents are a serious and ongoing issue, with many lives lost or severely impacted due to preventable causes.\n\nA key factor contributing to these accidents is speeding. It has been proven that excessive speed is not only dangerous but can be fatal, affecting both the driver and passengers. The good news is that the solution lies in a simple but vital principle: adhering to speed limits.\n\nSpeed limits are set by the Ministry of Road Transport and Highways to ensure the safety of everyone on the road. These limits are based on the type of road, its condition, and its location, and they are clearly posted on highways to guide drivers. By following these speed limits, drivers can significantly reduce the risk of accidents, protecting not only themselves and their passengers but also pedestrians and other road users.\n\nThe Role of Speed Control Technology\n\nOne of the most effective ways to reduce accidents on highways is to ensure strict adherence to speed limits. However, this requires more than just signage. The government, through the Ministry of Road Transport, must ensure that the traffic control units are equipped with the necessary tools to monitor and enforce speed limits effectively. Speed radars, for example, are crucial for the proper enforcement of these limits. Just as a farmer cannot be expected to clear a field without the right tools, the same principle applies to traffic control. Speed limits cannot be properly enforced with the naked eye alone; modern tools are essential to ensure the safety of all road users.\n\nThe Need for Proper Equipment\n\nIt is essential that police and traffic control units are well-equipped with speed monitoring technology. Without proper tools like speed radars, the effectiveness of speed control is compromised. These tools allow for accurate measurement of a vehicles speed, which is critical in preventing accidents and saving lives. The governments responsibility is to ensure that these units are properly funded and equipped to carry out their duties effectively.\n\nAs a community, we must understand that safety is not solely the responsibility of law enforcement or the government. It is also up to each individual driver. We all play a part in making our roads safer. By adhering to the posted speed limits and being conscious of other road users, we can significantly reduce the number of accidents on highways.\n\nYour Safety Is in Your Hands\n\nUltimately, our safety on the road comes down to personal responsibility. Each driver has the power to make the roads safer by simply following speed limits and exercising caution. The consequences of speeding can be catastrophic, not just for the individual involved but for their passengers, other motorists, and pedestrians. By prioritizing safety and respecting the rules of the road, we all contribute to creating a safer environment for everyone.\n\nSo, remember: Your safety is your responsibility. Adhere to speed limits, stay alert, and encourage others to do the same. Together, we can reduce accidents on highways and save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Highway accidents are a serious and ongoing issue, with many lives lost or severely impacted due to preventable causes. A … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/reducing-accidents-on-highways/\">Continue reading<span class=\"screen-reader-text\"> \"Reducing Accidents on Highways…\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Coordinated Attacks Hit Activists’ Homes Amid Chin’ono’s Fake News Blitz",
            "url": "https://www.zimeye.net/2025/03/28/coordinated-attacks-hit-activists-homes-amid-chinonos-fake-news-blitz/",
            "content": "Coordinated Political Vandalism in Harare And Zvimba West Against Thomas Mapfumo Expose Hopewell Chinonos Fake News\n\nBy A Correspondent | ZimEye | A fresh wave of politically motivated violence has erupted in Zvimba West Constituency, raising new questions about the role of known online influencers and state-aligned agents in misdirecting public attention and shielding the perpetrators. Overnight, two separate acts of vandalism were carried out at the homes of Gloria Padzarondora and Thomas Mapfumoboth senior ZANU-PF officials accused by Emmerson Mnangagwa supporters of aligning with Vice President Constantino Chiwengas faction.\n\nPadzarondora, who serves as Vice Chairlady of Manyame District and campaigned for parliamentary hopeful Mercy Dinha in last years general elections, woke up to find all the windows of her house smashed. Witnesses reported that the assailants fled the scene in a white twin-cab vehicleeerily similar to the modus operandi of recent politically driven attacks across the country.\n\nJust 2km away, Thomas Mapfumo, also a ZANU-PF member in the same district, suffered the same fatehis homes windows shattered in an almost identical manner. The close timing and similarity of the attacks suggest a coordinated strike, rather than isolated incidents.\n\nThis violence bears striking resemblance to other politically charged incidents in Zimbabwes recent past, including the August 1, 2018 post-election violence and arson attacks on Blessed Gezas farm and Gifford Gomwes home in early 2025.\n\nEarlier incidents on 28 March were swiftly misreported by controversial journalist and known Mnangagwa-aligned propagandist Hopewell Chinono.\n\nChinono, who has frequently presented himself as a reformed anti-corruption campaigner, has once again been caught amplifying misleading narratives. In a now-debunked social media post (see attached), Chinono falsely claimed that properties belonging to Mnangagwa alliesKuda Tagwirei, John Mangudya, Tinoda Machakaire, and Wicknell Chivayowere firebombed by unknown assailants. He included a dramatic image of a burning car and made mention of missing soldiers and AK-47s, triggering panic and sensational headlines. The post was later branded fake news with photographic evidence discrediting his claims.\n\nCritics argue that Chinonos post was a diversionary tactica calculated online smokescreen to shift national focus from intra-party violence occurring within ZANU-PF, particularly against perceived Chiwenga loyalists like Padzarondora and Mapfumo. This fits a disturbing pattern where Chinonos platforms are used to launder state propaganda and frame opposition or internal dissenters as violent saboteurs.\n\nHopewell is not just spreading fake news. Hes operating like an online assassin, said a Zvimba resident who asked not to be named. He redirects public outrage while the real victimsoften fellow ZANU-PF membersare silenced and sidelined.\n\nThe Zimbabwe Republic Police has yet to issue a formal statement on the Zvimba West attacks. Meanwhile, residents in the area say fear is spreading and demand urgent action and transparency from authorities.\n\nAs Zimbabwe inches closer to 31 March 2025 demo, the recurrence of factional violence and digital manipulation is a grim reminder of the countrys democratic fragility. What is equally alarming is the role of high-profile media personalities in obscuring rather than revealing the truth.\n\nHopewell Chinono, who once promised a break from partisan media warfare, now appears to have fully returned to the shadows he once claimed to expose.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Coordinated Political Vandalism in Harare And Zvimba West Against Thomas Mapfumo Expose Hopewell Chin’ono’s Fake News By A Correspondent | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/coordinated-attacks-hit-activists-homes-amid-chinonos-fake-news-blitz/\">Continue reading<span class=\"screen-reader-text\"> \"Coordinated Attacks Hit Activists’ Homes Amid Chin’ono’s Fake News Blitz\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Geza To Address Nation Again Today…",
            "url": "https://www.zimeye.net/2025/03/28/geza-to-address-nation-again-today/",
            "content": "Fellow Zimbabweans, tosangana futi nhasi na ,2030 for just a brief address, signal matoiona.https://t.co/Q48a7h1AZY\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Police Keen To Arrest Nyokayemabhunu",
            "url": "https://www.zimeye.net/2025/03/28/police-keen-to-arrest-nyokayemabhunu/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) is currently searching for Wellington Jeremiah Musiiwa, also known as Nyokayemabhunu, in connection with a fraud case.\n\nHowever, some observers suggest that the move may be an attempt to silence Musiiwa, a vocal critic of President Emmerson Mnangagwa, rather than a genuine criminal investigation.\n\nMusiiwa, a well-known social media blogger, has been a strong advocate for mass protests against Mnangagwa, which are planned for March 31.\n\nHe has also been active in exposing alleged corruption within the Zanu PF government.\n\nIt is believed that Musiiwa may have fled the country, although his current whereabouts remain unclear.\n\nPolice Statement:\n\nZRP PRESS STATEMENT27TH MARCH 2025WANTED PERSON FOR FRAUD: WELLINGTON JEREMIAH MASIWA, ALIAS NYOKAYEMABHUNU\n\nThe Zimbabwe Republic Police is appealing for information that may lead to the location and arrest of Wellington Jeremiah Masiwa, alias Nyokayemabhunu (42), from Chigwada Village, Chief Negomo, Mazowe. Masiwa is self-employed.\n\nIn June 2024, Masiwa misrepresented to the complainant that he was in partnership with several foreign investors and had the capacity to facilitate the expansion of the complainants mining business. Acting on this false information, the complainant paid USD $60,000 for the procurement of two tipper trucks. However, after making several unsuccessful follow-ups, the complainant became suspicious when Masiwa became evasive, prompting the complainant to file a police report.\n\nMembers of the public who have information regarding the whereabouts of Wellington Jeremiah Masiwa are urged to contact the National Complaints Desk at (0242) 703631 or via WhatsApp at 0712 800197, or report to the nearest police station.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) is currently searching for Wellington Jeremiah Musiiwa, also known as Nyokayemabhunu, in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/police-keen-to-arrest-nyokayemabhunu/\">Continue reading<span class=\"screen-reader-text\"> \"Police Keen To Arrest Nyokayemabhunu\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Police Arrest Zanu PF Councillor For Denouncing 2030 Agenda",
            "url": "https://www.zimeye.net/2025/03/28/police-arrest-zanu-pf-councillor-for-denouncing-2030-agenda/",
            "content": "By A Correspondent\n\nA Zanu PF councillor from Bikita, Brighton Mushekwa, was arrested on Thursday while addressing vendors at Nyika Rank in Bikita, party sources have confirmed.\n\nThe arrest has sparked further tension within the party, as Mushekwas political alignment and previous actions have drawn the attention of both party officials and local authorities.\n\nMushekwa, a well-known critic of Mr Emmerson Mnangagwas third term, has been a vocal advocate against the current direction of Zanu PFs policies.\n\nA former Bikita District Coordinating Committee (DCC) youth chairman, he was suspended from his position last month. Sources close to the party state that his alignment with Vice President Constantino Chiwenga has made him a target within the party.\n\nHe is seen as a sympathiser of Vice President Constantino Chiwenga, one party source revealed. Mushekwa has often expressed his support for Chiwengas ideas, which has created friction with the leadership in Bikita.\n\nThe circumstances surrounding his arrest are still unclear, but it is believed that his interaction with vendors was seen as an act of defiance, especially considering his suspension from the DCC and his anti-2030 stance. His arrest has been linked to these growing tensions within Zanu PF, which has been facing internal divisions over leadership and direction.\n\nMushekwas outspoken views and connection to Chiwenga have made him a controversial figure within the party, with critics accusing him of undermining the partys official stance. However, those close to him argue that his actions were motivated by genuine concern for the future of the party and the country.\n\nDespite his arrest, Mushekwas supporters remain adamant that his political views are aligned with the broader vision of unity and reform.\n\nThe arrest has added another layer of complexity to the already volatile political climate within Zanu PF, and many are watching closely to see how the situation unfolds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zanu PF councillor from Bikita, Brighton Mushekwa, was arrested on Thursday while addressing vendors at Nyika … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/police-arrest-zanu-pf-councillor-for-denouncing-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Police Arrest Zanu PF Councillor For Denouncing 2030 Agenda\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Mnangagwa Admits “Chameleon” Characters Causing Havoc In Zanu PFBy",
            "url": "https://www.zimeye.net/2025/03/28/mnangagwa-admits-chameleon-characters-causing-havoc-in-zanu-pfby/",
            "content": "By  A Correspondent\n\nDuring a Zanu PF Central Committee meeting in Harare on Thursday, President Emmerson Mnangagwa openly acknowledged the internal chaos within his party, attributing it to members displaying what he described as chameleon-like behaviour.Mnangagwa stated that some party members had been acting as willing allies to external detractors, undermining the partys core values and revolutionary heritage. It is most unfortunate that a retrogressive trend emerged, with some members of our Party, showing their chameleon-like characters as willing accessories to our detractors for the purpose of desecrating our rich revolutionary heritage, Mnangagwa said.The admission comes amid a growing rift between Mnangagwa and his deputy, Vice President Constantino Chiwenga, with both factions grappling for influence within the party. The tensions have only escalated, fueled by figures such as war veteran Blessed Geza, social media personality Nyokayemabhunu, and other disgruntled citizens who are actively calling for Mnangagwas resignation.This internal division has created significant instability within the ruling party, with critics arguing that the partys leadership is failing to address growing concerns over corruption, economic mismanagement, and the erosion of democratic principles.As the battle for control of Zanu PF intensifies, the partys once united front appears to be fracturing, leaving Mnangagwa to contend with not only external opposition but also internal betrayal.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent During a Zanu PF Central Committee meeting in Harare on Thursday, President Emmerson Mnangagwa openly acknowledged the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/mnangagwa-admits-chameleon-characters-causing-havoc-in-zanu-pfby/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Admits “Chameleon” Characters Causing Havoc In Zanu PFBy\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        },
        {
            "title": "Unidentified Gunmen Officer Shoot Dead Police Officer",
            "url": "https://www.zimeye.net/2025/03/28/unidentified-gunmen-officer-shoot-dead-police-officer/",
            "content": "By A Correspondent\n\nBULAWAYO  A police officer was fatally shot in Sizinda, Bulawayo, after he stopped five men who appeared suspicious and asked them to identify themselves shortly after midnight on Friday, according to police.\n\nSergeant Abel Masava, who served at Tshabalala Police Station, was attending to a domestic violence case and was standing next to a police vehicle when he noticed a group of five men dressed in dark clothing approaching.\n\nThe police report states that Masava stopped the men, inquiring about their origin and asking them to identify themselves.\n\nOne of the men pulled out a firearm and shot Sergeant Masava in the head He was quickly transported to United Bulawayo Hospitals, where he was declared dead upon arrival, a police source revealed.\n\nMasava was in his police uniform at the time of the shooting.\n\nEarlier, the fallen officer had left the police station with a colleague after being called to a home in Sizinda where a woman had reported being assaulted by her husband. While the second officer, the domestic violence victim, and her friend were attempting to enter the house, Masava, who was standing next to the vehicle, was shot.\n\nMasavas death marks the second police officer fatality on duty in Bulawayo within a month.\n\nOn March 6, Detective Cassandra Hove was killed after being shot in the chest by a fellow officer in Pumula South suburb. It was later revealed that the bullet intended for an armed robbery suspect had struck Hove, and a police officer was charged in connection with her death.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent BULAWAYO – A police officer was fatally shot in Sizinda, Bulawayo, after he stopped five men who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/28/unidentified-gunmen-officer-shoot-dead-police-officer/\">Continue reading<span class=\"screen-reader-text\"> \"Unidentified Gunmen Officer Shoot Dead Police Officer\"</span></a></p>",
            "time": "06:36",
            "date": "29 Mar 2025"
        }
    ]
}