{
    "news": [
        {
            "title": "Mnangagwa Aide Dies",
            "url": "https://www.zimeye.net/2025/04/01/mnangagwa-aide-dies/",
            "content": "By Munacho GwamandaZanu PF Member of Parliament for Insiza North, Farai Taruvinga has died.\n\nHe was 53.\n\nTaruvinga succumbed to cancer earlier this week at his family home in Hillside, Bulawayo.\n\nThepartysMatabeleland South Provincial chairman, Mangaliso Ndlovu, confirmed his passing.\n\nIcan confirm that we have lost the Member of the National Assembly for Insiza North. He had been unwell for some time,said Ndlovu.\n\nA close friend of the late legislator,Sifiso MafifiMpofu, said Taruvinga had been battling high-grade sarcoma cancer.\n\nHe passed on around 8 AM at his home in Hillside, Bulawayo. He had been fighting the disease for some time,Mpofu said.\n\nHe added that more details regarding funeral arrangementswould be shared by the familyin due course.\n\nTaruvinga was serving his second term as a Member of the National Assembly.\n\nBeyond politics, he was a businessman with interests spanning mining, retail, and entertainment.\n\nHe was the director of Progress Mine, Filabusi Abattoir, Skuta Irrigation Scheme, Anradel Cattle Ranch, and Marvel Shopping and Leisure Centre.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda–Zanu PF Member of Parliament for Insiza North, Farai Taruvinga has died. He was 53. Taruvinga succumbed to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/mnangagwa-aide-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Aide Dies\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Nigeria Raises Concerns Over Warriors and Lesotho Playing in South Africa…",
            "url": "https://www.zimeye.net/2025/04/01/nigeria-raises-concerns-over-warriors-and-lesotho-playing-in-south-africa/",
            "content": "Sports Correspondent\n\nNigeria has expressed dissatisfaction with Zimbabwe and Lesotho playing their World Cup Qualifier matches in South Africa, arguing that it gives Bafana Bafana an unfair advantage.\n\nBoth Zimbabwe and Lesotho currently lack CAF-approved stadiums, prompting them to use South Africa as a base for their home fixtures.\n\nThis is against fair play as it gives South Africa an undue advantage in qualifying for the World Cup, a senior official told SCORENigeria.\n\nIn response, the Nigerian Football Federation (NFF) is calling for the relocation of upcoming home games for Lesotho and Zimbabwe against South Africa. The NFF are therefore asking that the forthcoming home games of Lesotho and Zimbabwe against South Africa be moved out of South Africa, the official added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Nigeria has expressed dissatisfaction with Zimbabwe and Lesotho playing their World Cup Qualifier matches in South Africa, arguing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/nigeria-raises-concerns-over-warriors-and-lesotho-playing-in-south-africa/\">Continue reading<span class=\"screen-reader-text\"> \"Nigeria Raises Concerns Over Warriors and Lesotho Playing in South Africa…\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Knox Mutizwa Goal Buries Mighty Kaizer Chiefs",
            "url": "https://www.zimeye.net/2025/04/01/knox-mutizwa-goal-buries-mighty-kaizer-chiefs/",
            "content": "By A Correspondent\n\nGolden Arrows secured a thrilling victory over Kaizer Chiefs in the Betway Premiership on Saturday, thanks in large part to the impressive performance of Knox Mutizwa.\n\nMutizwa played a crucial role in Arrows win, assisting the teams first goal before scoring the winner in the second half.\n\nHis outstanding display on the field helped Golden Arrows claim a valuable win over the mighty Kaizer Chiefs.\n\nIn other news, Zimbabwean footballer Bill Antonio made a significant impact in KV Mechelens Pro League game against Standard Liege on Sunday. Antonio came on as a substitute in the 66th minute and just two minutes later, his clever cut-back cross found Keano Vanrafelghem, who scored the equalizing goal.\n\nThe goal secured a remarkable comeback 2-2 draw for Mechelen, with Antonio registering his third assist of the season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Golden Arrows secured a thrilling victory over Kaizer Chiefs in the Betway Premiership on Saturday, thanks in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/knox-mutizwa-goal-buries-mighty-kaizer-chiefs/\">Continue reading<span class=\"screen-reader-text\"> \"Knox Mutizwa Goal Buries Mighty Kaizer Chiefs\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "The Deadly Dangers of Distracted Driving: A Wake-Up Call",
            "url": "https://www.zimeye.net/2025/04/01/the-deadly-dangers-of-distracted-driving-a-wake-up-call/",
            "content": "Distracted driving has become one of the most significant threats to road safety in recent years. It only takes a mere five seconds to look away from the road  whether its to read a text, search for a phone number, adjust your cars music or GPS, or pick up something thats fallen  but those five seconds can be deadly. In fact, that short moment of distraction can make the difference between a safe journey and a devastating crash.\n\nWhile it might seem harmless to glance at your phone or fiddle with the radio for a moment, the consequences can be catastrophic. A vehicle moving at just 55 miles per hour travels the length of a football field in five seconds  a dangerous amount of time when youre not focused on the road. Those precious seconds can lead to fatal accidents, leaving you, your passengers, and others on the road in harms way.\n\nEvery moment you spend driving is critical to the safety of everyone around you. It may feel like a small, insignificant distraction, but it can easily result in tragic outcomes. Consider the devastating impact an accident can have on your life and the lives of your loved ones. A crash could leave you struggling in a hospital bed, confined to a wheelchair, or worse, it could end your life. More importantly, it could leave your family in grief and financial turmoil, forever haunted by the absence of your presence.\n\nThink about the effort you put into providing for your family. Imagine how your loved ones would cope without you. Your children may have to drop out of school, and your spouse may struggle to make ends meet. These are the harsh realities of distracted driving that we often fail to acknowledge. A momentary lapse in concentration could change everything for your family, and the consequences are often far-reaching.\n\nThe message is clear: every second behind the wheel is crucial. Never let a moment of distraction cost you everything. Stay focused, drive safely, and keep the ones you love safe. Your family needs you  dont let a few seconds of distraction jeopardize their future.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Distracted driving has become one of the most significant threats to road safety in recent years. It only takes a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/the-deadly-dangers-of-distracted-driving-a-wake-up-call/\">Continue reading<span class=\"screen-reader-text\"> \"The Deadly Dangers of Distracted Driving: A Wake-Up Call\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Mutsvangwa Publicly Attacks Geza",
            "url": "https://www.zimeye.net/2025/04/01/mutsvangwa-publicly-attacks-geza/",
            "content": "By A Correspondent\n\nZANU PF Secretary for Information and Publicity, Cde Christopher Mutsvangwa, has described war veteran Blessed Geza as a daydreamer.\n\nMutsvangwa made the remarks during a Zanu PF press conference in Harare on Tuesday.\n\nAccording to Mutsvangwa, President Mnangagwa is not going anywhere. President Mnangagwa has taken steps to address the challenges faced by minorities in Zimbabwe, including the marginalization of war veterans, he stated.\n\nHe continued, On March 31, 2025, a person was seen in a military uniform, attempting to present themselves as a savior, but this was nothing more than a farce. Zimbabweans are not interested in such events.\n\nMutsvangwa further highlighted ongoing developments in the country, saying, New lithium plants and towns are being established, creating opportunities for job growth and instilling hope in the youth. The diaspora also sees promise in President Mnangagwas efforts. He is making significant contributions to the development of Zimbabwe.\n\nHe also took a jab at Geza, asserting, People want confidence in a leader before they follow him, then Geza expected people to follow him. Maybe it is those behind him who gave him courage. You cannot just wake up thinking you can change a government in Africa, things and systems have changed.\n\nConcluding his remarks, Mutsvangwa said, President Mnangagwa will continue to govern and rule Zimbabwe. Anarchy has been defeated and shamed. His Excellency President Emmerson Mnangagwa remains in power and power is with him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Secretary for Information and Publicity, Cde Christopher Mutsvangwa, has described war veteran Blessed Geza as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/mutsvangwa-publicly-attacks-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Publicly Attacks Geza\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Geza Sends Strong Warning to Police: Don’t Let Mnangagwa Use You",
            "url": "https://www.zimeye.net/2025/04/01/geza-sends-strong-warning-to-police-dont-let-mnangagwa-use-you/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza has fiercely criticized President Emmerson Mnangagwa and his supporters, whom he refers to as the Zvigananda, for attempting to reverse Zimbabwes land reform program. In a statement issued on Monday, Geza expressed his gratitude to the citizens who responded to his call for protests against Mnangagwas push for a third term in office.\n\nGezas Statement:\n\nI am your Blessed Geza, Comrade Bombshell, Geza began. First of all, I want to thank you, Zimbabweans, for heeding our call to take action.\n\nGeza, who took to the streets of Harare earlier that morning to gauge the situation, found the response overwhelming. The streets were empty, absolutely empty. And I received similar reports from other cities. This is very encouraging. You have sent a clear message that you want Emmerson and his corrupt cabal, Zvigananda, to go.\n\nHe further emphasized, This is just the beginning of a series of events to send him packing, and we want to assure you that he is going in the shortest possible time. Keep pressing hard. Momentum must be maintained. We need to remain strong.\n\nHowever, Geza expressed his concerns about the polices response to the protests. We have observed police barbaric actions against innocent and peaceful protesters. We have seen that Emmerson is using the police to instill gross fear in the public instead of engaging with them or, better still, just resigning.\n\nHe specifically called out police commander, Mutamba, saying, Mutamba, I want to warn you: The children of Zimbabwe have a right to demonstrate. That is their democratic right. In the constitution, we are no different from other countries like South Africa. You are oppressing people. You want to do what Smith used to do.\n\nGeza further questioned the legitimacy of the actions being taken by those in power, stating, So, the constitution assembled by 13 million people, and you want to twist it in your capacity as who? Emmersons days in office are numbered. Stop this behavior.\n\nGeza also referenced the March 31 protest, which saw many people close their businesses in solidarity, but emphasized the polices oppressive response. I called for the March 31 protest, and people took heed by closing their shops to allow for the protest. But the police decided to block the people. This shows a desperation to cling to power, Geza said. Let me remind the police, their duty is to maintain law and order, not to foment crimes. They are supposed to protect citizens as they exercise their constitutional rights, not tear gas them into submission. The police are supposed to protect the people, not criminals, including Mnangagwa himself.\n\nAddressing the police officers directly, Geza warned, I would like to open your eyes. You cant be bribed with $50 to deny your fellow citizens their constitutional right to protest. The exit of Mnangagwa will benefit you.\n\nGeza pointed out the dire financial situation of the police, noting, Currently, you are getting slave wages. You need to send your children to school, get good healthcare, travel on good roads, eat decent food, among others. But this government you are protecting is denying you all of this. Open your eyes.\n\nTurning to the broader issue of corruption, Geza stated, Emmerson and his cabal, led by Tagwirei, you have to go. You have been stealing from the people. The blood that was shed for the land cannot be ignored. The land reform was about returning land to the black masses, but you and Emmerson want to reverse it.\n\nHe continued, You want to steal land and use your own banks. Which program has ever been financed by only two banks? What this means is that when people take loans from these banks, the banks will demand title deeds. And when they fail to service the loan, the land will no longer be theirs. It will be owned by the banks, but indirectly, it will be Emmerson and Tagwireis land.\n\nGeza made it clear that he would not allow the reversal of the land reform program. Your behavior of trying to steal land, of reversing the land reform programstop it. We just say stop it. But we know very well that by this week, we will have sent him off, so I dont see this program going ahead.\n\nHe also criticized the ZANU PF youths, specifically pointing out those who were using police uniforms to harass fellow Zimbabweans. You, ZANU PF youths, stop this behavior, which the Mutambas, the Paradzas, and the Machakaires are orchestrating. You are making each other wear police uniforms to harass your own fathers and mothers who are trying to survive.\n\nGeza passionately expressed his concerns for the future of Zimbabwes youth, saying, We are doing this for you, the youth. You are the ones now without jobs, falling into drugs. We are doing this for you, the children of Zimbabwe. So, we want you, the youth, to inherit the right character.\n\nHe also addressed Kuda Tagwirei, accusing him of greed and corruption. Kuda Tagwirei, dont play with us. You are too young. Your behavior, your greedwe know it. You and Emmerson are stealing the countrys wealth. Last time we spoke of it, you monopolize government companies, get banks without paying a penny. Any payments needed, its the government that ends up paying you when youre the buyer.\n\nGeza didnt stop there, accusing Tagwirei of destroying the Seventh Day Adventist Church. You have destroyed the Adventist church. There are quarrels in the church because of you. Some people think youre a righteous person, but theres no one more awful than you in Zimbabwe. Youve used corruption money to buy people in the church.\n\nHe then issued a chilling warning: Dont play with me, young man! Thousands of people who perished didnt die for you and Emmerson to do whatever you want in Zimbabwe, conniving to make you the president. Stop this behavior, or go get a ritual conducted at your rural home. Are you normal?\n\nConcluding his remarks, Geza announced the decision to call off the protest, citing intelligence regarding a potential plot against him. Ive gathered intelligence of an evil planSean Mnangagwa has bought explosives. He wants to bomb certain targets tonight and blame each one on me. This will be done to label me a terrorist.\n\nGeza assured his supporters that the protest would be temporarily halted, saying, We had our peaceful protest today. Now, lets call it off for now. A statement has already been made, and Ill return to you on Wednesday with a very, very crucial announcement. This will change the direction of things and take us to a higher level.\n\nThank you, and God bless you all, Geza concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza has fiercely criticized President Emmerson Mnangagwa and his supporters, whom he refers to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/geza-sends-strong-warning-to-police-dont-let-mnangagwa-use-you/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Sends Strong Warning to Police: Don’t Let Mnangagwa Use You\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Mnangagwa’s Days Are Numbered, Says Geza",
            "url": "https://www.zimeye.net/2025/04/01/mnangagwas-days-are-numbered-says-geza/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza has strongly criticized President Emmerson Mnangagwa and his associates, whom he refers to as the Zvigananda, for their attempts to reverse Zimbabwes land reform program.\n\nIn a statement released on Monday, Geza expressed his gratitude to citizens who supported his call for protests against Mnangagwas third-term agenda.\n\nGezas Statement:\n\nI am Blessed Geza, Comrade Bombshell.\n\nFirst of all, I want to thank all Zimbabweans who answered our call to take action. This morning, I walked through the streets of Harare to assess the situation. The streets were empty, completely empty. I received similar reports from other cities as well. This is incredibly encouraging. You have sent a clear message that you want Emmerson and his corrupt cabal, the Zvigananda, to go.\n\nThis is just the beginning of the journey to send him packing, and I assure you, his days are numbered. We will not stop until hes gone.\n\nKeep pushing, stay strong. We need to maintain the momentum.\n\nWe have observed the polices brutal actions against innocent, peaceful protesters. Emmerson is using the police to instill fear in the public rather than engaging with them or simply resigning as he should.\n\nMutamba, I want to warn you: The children of Zimbabwe have a right to protest. It is their democratic right. According to our constitution, we are no different from countries like South Africa. You are oppressing people. What you are doing is no different from what Ian Smith did.\n\nSo tell me, who do you think you are, trying to twist the constitution created by 13 million people?\n\nEmmersons days in power are numbered. Stop this behavior immediately.\n\nI called for the March 31 protest, and people responded by closing their shops in support of the demonstration, but the police decided to block them. This shows how desperate they are to cling to power. Let me remind the police: your duty is to maintain law and order, not to create crimes. You are supposed to protect citizens as they exercise their constitutional rights, not tear gas them into submission. The police should protect the people, not criminals, including Mnangagwa himself.\n\nTo the police force, I want to open your eyes. You cant be bribed with $50 to deny your fellow citizens their constitutional right to protest. You must realize that Mnangagwas departure will benefit you.\n\nCurrently, you are earning slave wages, yet you need to provide for your children, ensure they receive good education, access decent healthcare, travel on good roads, and eat nutritious food. But this government you are protecting is denying you all of this.\n\nOpen your eyes, the time has come for Emmerson, his cabal, and their allies, including Tagwirei, to go. And you, the police, soldiers, and the CIO, you have a duty to protect the public from Emmerson, Tagwirei, and the mercenaries theyve hired to terrorize you.\n\nTagwirei and Emmerson, your theft and exploitation of Zimbabweans has gone on for too long. The blood that was shed for the land cannot be ignored. The war veterans, the late President Robert Mugabe, and the people fought for land reform to return land to the black masses. You and Emmerson now seek to reverse this program.\n\nYou want to steal land and use your banks to further your agenda.\n\nWhich program has ever been funded by only two banks? What this means is that when people take loans from these banks, the banks will demand title deeds as collateral. This means that as you repay the loan, the land will no longer be yours  it will be owned by the banks. But, in reality, it will be Emmerson and Tagwireis land, because if you fail to repay the loan, the land will be taken away from you.\n\nBut these issues pale in comparison to your attempt to reverse the land reform program. We say enough is enough. By the end of this week, Emmerson will be gone. I dont see this program going ahead.\n\nZANU PF youths, stop your behavior, which is being orchestrated by Mutamba, Paradza, and Machakaire, where you wear police uniforms to harass your own parents and relatives trying to survive.\n\nWhat we are doing is not for ourselves. We are in the afternoon of our lives, but it hurts us to see a country destroyed by Emmerson and his cabal. These efforts are for you, the youth. You are the ones without jobs, turning to drugs, and facing an uncertain future. We are fighting for you, so you can inherit a country with a right character.\n\nKuda Tagwirei, dont underestimate us. You are too young to play these games. Your greed is evident, and we see how you, together with Emmerson, have been siphoning the countrys wealth. Weve discussed how you monopolize government companies, obtain banks without paying, and then get the government to pay for them. We know your corruption.\n\nYour corruption doesnt end there. Youve even infiltrated the Seventh Day Adventist Church, where there are now quarrels because of your actions. You use your ill-gotten money to buy influence in the church, yet you present yourself as a righteous person.\n\nAnd now you want to turn the country into a battleground for your own selfish ambitions. Thousands of people did not die for you and Emmerson to pursue your political games. Thousands died for the freedom and independence of Zimbabwe. Stop this now, or face the consequences.\n\nRegarding the protest, I have decided to call it off for now. I have received intelligence that Sean Mnangagwa has bought explosives with the intention of bombing certain targets tonight and blaming me. This is an attempt to label me as a terrorist.\n\nWe held our peaceful protest today, and a statement has already been made. For now, lets call off further action.\n\nI will return to you on Wednesday with a crucial announcement that will change the direction of our struggle and take us to a new level.\n\nThank you, and God bless you all.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza has strongly criticized President Emmerson Mnangagwa and his associates, whom he refers to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/mnangagwas-days-are-numbered-says-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Days Are Numbered, Says Geza\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Masvingo School Heads Threaten Teachers Over Participation in Geza Protests",
            "url": "https://www.zimeye.net/2025/04/01/masvingo-school-heads-threaten-teachers-over-participation-in-geza-protests/",
            "content": "By A Correspondent\n\nSchool heads in Masvingo have been accused of threatening teachers who failed to report to work on Monday, alleging that they supported war veteran Blessed Gezas call for protests against President Emmerson Mnangagwa. The protests, which took place on March 31, led to widespread unrest, prompting teachers to stay home due to safety concerns.\n\nMany schools in Masvingo Urban were affected, with learners staying home as tensions rose across the region. Teachers who did not show up to work were confronted by school heads, who accused them of participating in the protests and warned of consequences if caught engaging in anti-government activities.\n\nOne teacher shared, We were called and told very clearly that we should be careful about where our loyalties lie. If we are caught participating in activities against the government, there would be consequences.\n\nThe school heads, known members of the Teachers for ED group, dismissed the allegations, describing the claims as baseless and pure fabrication. However, the controversy surrounding the reported threats continues to stir tension among staff at Masvingo Christian College.\n\nTeachers expressed concern about the political instability and the possible repercussions of participating in any anti-government movements. A teacher who attended the protest explained, We were not willing to put our lives at risk by going to work in such an uncertain and volatile situation. It was not about politics, but about our safety.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent School heads in Masvingo have been accused of threatening teachers who failed to report to work on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/masvingo-school-heads-threaten-teachers-over-participation-in-geza-protests/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo School Heads Threaten Teachers Over Participation in Geza Protests\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Zim Problems To Vanish: Nelson Chamisa",
            "url": "https://www.zimeye.net/2025/04/01/zim-problems-to-vanish-nelson-chamisa/",
            "content": "By A Correspondent\n\nOpposition Leader Advocate Nelson Chamisa has assured the nation that the challenges affecting citizens will soon be resolved.\n\nChamisa, a committed Christian, has faced criticism from some quarters for his steadfast faith. Despite this, he remains confident that the nations issues will soon come to an end.\n\nIm aware of the suffering and pain we are all going through as a people. The answer is already there, he said.\n\nHe also expressed gratitude for the support he has received, stating, Thank you all for your unwavering commitment and solid support.\n\nChamisa further emphasized that the resolution to Zimbabwes problems would come in a distinctive manner. The problems we are facing will be solved in a unique way, he remarked.\n\nHe concluded with a message of hope: God is not man that He should promise and not deliver! Be of good cheer. Trust the process. Be blessed. Remember #Godisinit Forever and always ~nc.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition Leader Advocate Nelson Chamisa has assured the nation that the challenges affecting citizens will soon be … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/zim-problems-to-vanish-nelson-chamisa/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Problems To Vanish: Nelson Chamisa\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        },
        {
            "title": "Top Zanu PF Official Dies",
            "url": "https://www.zimeye.net/2025/04/01/top-zanu-pf-official-dies-4/",
            "content": "By A Correspondent\n\nFarayi Taruvinga, the ZANU PF Insiza North MP and a prominent gold dealer in Filabusi, Matabeleland South, has passed away at the age of 54.\n\nAccording to a Zanu PF official, Taruvinga had been battling illness for some time.\n\nCde Taruvinga succumbed to cancer yesterday at his family home in Hillside suburb, Bulawayo, said the Zanu PF official.\n\nTaruvingas passing has sent shockwaves through the community, with many remembering him for his contributions to the region as a legislator and businessman.\n\nAs the news of his death spreads, condolences are pouring in from various sectors, honoring Taruvingas life and legacy.\n\nThe exact details of his funeral arrangements are yet to be announced.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Farayi Taruvinga, the ZANU PF Insiza North MP and a prominent gold dealer in Filabusi, Matabeleland South, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/01/top-zanu-pf-official-dies-4/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zanu PF Official Dies\"</span></a></p>",
            "time": "18:45",
            "date": "02 Apr 2025"
        }
    ]
}