{
    "news": [
        {
            "title": "Relegation Battle Takes Centre Stage as PSL Nears Final Round",
            "url": "https://www.zimeye.net/2025/11/03/relegation-battle-takes-centre-stage-as-psl-nears-final-round/",
            "content": "By Sports Correspondent\n\nHarare  The Castle Lager Premier Soccer League enters its penultimate round this weekend, with attention shifting to the fierce relegation battle now that the championship has already been decided.\n\nScottland FC were crowned champions on Matchday 32 after a resounding 51 victory over Kwekwe United, taking their tally to 65 points and securing the title with two games to spare.\n\nAs the league heads into Matchday 33, only the top eight teams are mathematically safe, leaving nine clubs locked in a tense fight to avoid the drop.\n\nSaturday, 8 November 2025 Fixtures:\n\nSunday, 9 November 2025 Fixtures:\n\nAll matches kick off at 3 PM CAT.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Harare – The Castle Lager Premier Soccer League enters its penultimate round this weekend, with attention shifting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/relegation-battle-takes-centre-stage-as-psl-nears-final-round/\">Continue reading<span class=\"screen-reader-text\"> \"Relegation Battle Takes Centre Stage as PSL Nears Final Round\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Mnangagwa Regime Admits Sharp Decline In Donor Assistance",
            "url": "https://www.zimeye.net/2025/11/03/mnangagwa-regime-admits-sharp-decline-in-donor-assistance/",
            "content": "By A Correspondent\n\nBulawayo  The Mnangagwa administration has acknowledged a steep decline in donor assistance, raising questions about the governments tightening control over civil society and its impact on Zimbabwes development.\n\nPublic Service, Labour and Social Welfare Minister Edgar Moyo told a ministry workshop in Bulawayo last week that non-governmental organisations (NGOs) must align their activities with the countrys national values, priorities and aspirations. He added, NGOs must not lead us; we must lead them. We must show them our needs and not the other way round.\n\nCritics argue that the governments stance reflects an increasing clampdown on independent NGOs, particularly following the signing into law of the Private Voluntary Organisations (PVO) Amendment Act, 2025. The legislation expands government oversight, tightens registration and reporting requirements, and imposes heavier penalties for non-compliance. It also empowers the Registrar of PVOs, restructures the PVO Board, and brings trusts under stricter regulationmoves that opponents say could discourage donor engagement and stifle civil society.\n\nMinister Moyo acknowledged Zimbabwes worsening socio-economic challenges, including youth drug abuse, irregular migration, and a shrinking fiscal space, which he attributed partly to illegal sanctions. He also noted that while traditional donor support has declined, we have not fully explored private-sector partnerships, local resource mobilisation and community-driven development models.\n\nAnalysts warn that the governments insistence on controlling NGOs risks further alienating donors at a time when foreign assistance is crucial. By limiting the independence of civil society, the administration may be undermining the very mechanisms meant to address pressing social and economic issues, leaving communities increasingly vulnerable.\n\nMinister Moyo urged his ministry to craft a five-year strategy focusing on local resource utilisation, community empowerment, and employment creation, but critics remain sceptical that government-led interventions alone can compensate for the sharp fall in external support.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Bulawayo – The Mnangagwa administration has acknowledged a steep decline in donor assistance, raising questions about the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/mnangagwa-regime-admits-sharp-decline-in-donor-assistance/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Admits Sharp Decline In Donor Assistance\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Mnangagwa Hoodwinks Harare Women With 10 000 Chicks",
            "url": "https://www.zimeye.net/2025/11/03/mnangagwa-hoodwinks-harare-women-with-10-000-chicks/",
            "content": "By A Correspondent\n\nThe Young Women for Economic Development (YW4ED) Harare Chapter last week received 10,000 chicks from the ZANU PF Womens League under the Presidential Poultry Scheme, a move hailed by some as a step toward empowering women economically.\n\nIn a statement, YW4ED expressed their appreciation to President Emmerson Mnangagwa for what they described as his visionary leadership and dedication to empowering women and youth through the Presidential Poultry Scheme.\n\nThe chicks were handed over in a ceremony attended by the Womens League and other party officials. Speaking at the event, ZANU PF Secretary for Womens Affairs, Mabel Chinomona, urged the beneficiaries to take full advantage of this opportunity to improve your livelihoods and contribute towards the realization of Vision 2030.\n\nYW4ED Harare Chapter chairperson added, We are grateful to the Womens League for their continued support and mentorship. Together, we reaffirm our commitment to economically empower women and young people across the province.\n\nThe distribution, part of a broader initiative by the ruling party, aims to promote self-reliance, strengthen womens participation in economic activities, and enhance food security. However, critics argue that such giveaways are often politically motivated and may be used to consolidate support.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Young Women for Economic Development (YW4ED) Harare Chapter last week received 10,000 chicks from the ZANU … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/mnangagwa-hoodwinks-harare-women-with-10-000-chicks/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Hoodwinks Harare Women With 10 000 Chicks\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Mavetera Faces Backlash Over Endorsement of Samia Suluhu Hassan’s Controversial Win",
            "url": "https://www.zimeye.net/2025/11/03/mavetera-faces-backlash-over-endorsement-of-samia-suluhu-hassans-controversial-win/",
            "content": "By A Correspondent\n\nZimbabwes Minister of ICT, Tatenda Mavetera, has come under fire after publicly congratulating Tanzanian President Samia Suluhu Hassan on her disputed re-election.\n\nOn Monday, Mavetera took to social media to express her support, writing: My heartfelt congratulations to Her Excellency President Samia Suluhu Hassan on her victory in the just ended Presidential Elections of the Republic of Tanzania. This paves the way for women and girls across our continent to excel, proving that with determination, every ceiling can be shattered. Karibu sana Rais!\n\nHer message sparked controversy, as critics argue that congratulating Hassan overlooks allegations of electoral irregularities and the exclusion of main opposition candidates.\n\nTanzanias electoral commission declared Hassan the winner with 31.9 million votes, accounting for 98% of the ballots, while her nearest rival received just 213,414 votes, or 0.65%. Official reports noted that voter turnout reached 87% of the 37.6 million registered voters, despite violent protests erupting in several regions over the sidelining of opposition leaders.\n\nOpposition activists and political analysts have questioned Maveteras public endorsement, suggesting it sends a worrying signal about Zimbabwes stance on free and fair elections in the region.\n\nOne political commentator, speaking on condition of anonymity, said: By congratulating a leader whose victory is widely disputed, Mavetera risks undermining Zimbabwes credibility on democratic principles.\n\nDespite the backlash, Maveteras office has not issued a clarification, leaving the debate over the appropriateness of her comments ongoing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s Minister of ICT, Tatenda Mavetera, has come under fire after publicly congratulating Tanzanian President Samia Suluhu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/mavetera-faces-backlash-over-endorsement-of-samia-suluhu-hassans-controversial-win/\">Continue reading<span class=\"screen-reader-text\"> \"Mavetera Faces Backlash Over Endorsement of Samia Suluhu Hassan’s Controversial Win\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Mnangagwa God-Ordained, Declares Multi-Faith Economic Dialogue Leader",
            "url": "https://www.zimeye.net/2025/11/03/mnangagwa-god-ordained-declares-multi-faith-economic-dialogue-leader/",
            "content": "By A Correspondent\n\nMutare  Critics have accused President Emmerson Mnangagwa and his ruling ZANU PF party of exploiting religion and community empowerment funds for political gain.\n\nAt a Presidential Empowerment event in Mutare on Sunday, National Multi- Faith Economic Dialogue (NAMFED) chief convener Mr Obey Mapuranga declared, We believe that the spirit of God has ordained President Mnangagwas leadership and we stand in support of his vision for economic development through NAMFED.\n\nAs a faith community, we pledge to support the President during the upcoming elections and beyond.\n\nObservers argue that such statements turn faith leaders into political mouthpieces, undermining the independence of religious institutions. The ceremony also involved the distribution of substantial funds to organisations aligned with ZANU PF. NAMFED, the Vapostori and VaZion for ED, and the Children of War Veterans each received US$50,000, while Cross-Border Traders for ED, Hairdressers for ED, Health Ambassadors for ED, Boys Dzamudhara, Vendors for ED, and Pastors for ED received US$20,000 each.\n\nPresidential Investment Advisor Dr Paul Tungwarara described the funds as a revolving facility meant to benefit future recipients as well, presenting the initiative as a tool for unity and grassroots economic transformation. Critics, however, contend the programme is primarily a mechanism to secure political loyalty ahead of elections rather than a genuine effort to empower communities.\n\nHuman rights advocates warn that using religious endorsement and targeted funding to influence voters erodes democratic principles and entrenches patronage networks at the expense of impartial development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mutare – Critics have accused President Emmerson Mnangagwa and his ruling ZANU PF party of exploiting religion … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/mnangagwa-god-ordained-declares-multi-faith-economic-dialogue-leader/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa God-Ordained, Declares Multi-Faith Economic Dialogue Leader\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Don’t Lead Us, We Lead You, Mnangagwa Minister Threatens NGOs",
            "url": "https://www.zimeye.net/2025/11/03/dont-lead-us-we-lead-you-mnangagwa-minister-threatens-ngos/",
            "content": "By A Correspondent\n\nThe Mnangagwa administration has acknowledged a steep decline in donor assistance, raising questions about the governments tightening control over civil society and its impact on Zimbabwes development.\n\nPublic Service, Labour and Social Welfare Minister Edgar Moyo told a ministry workshop in Bulawayo last week that non-governmental organisations (NGOs) must align their activities with the countrys national values, priorities and aspirations. He added, NGOs must not lead us; we must lead them. We must show them our needs and not the other way round.\n\nCritics argue that the governments stance reflects an increasing clampdown on independent NGOs, particularly following the signing into law of the Private Voluntary Organisations (PVO) Amendment Act, 2025. The legislation expands government oversight, tightens registration and reporting requirements, and imposes heavier penalties for non-compliance. It also empowers the Registrar of PVOs, restructures the PVO Board, and brings trusts under stricter regulationmoves that opponents say could discourage donor engagement and stifle civil society.\n\nMinister Moyo acknowledged Zimbabwes worsening socio-economic challenges, including youth drug abuse, irregular migration, and a shrinking fiscal space, which he attributed partly to illegal sanctions. He also noted that while traditional donor support has declined, we have not fully explored private-sector partnerships, local resource mobilisation and community-driven development models.\n\nAnalysts warn that the governments insistence on controlling NGOs risks further alienating donors at a time when foreign assistance is crucial. By limiting the independence of civil society, the administration may be undermining the very mechanisms meant to address pressing social and economic issues, leaving communities increasingly vulnerable.\n\nMinister Moyo urged his ministry to craft a five-year strategy focusing on local resource utilisation, community empowerment, and employment creation, but critics remain sceptical that government-led interventions alone can compensate for the sharp fall in external support.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Mnangagwa administration has acknowledged a steep decline in donor assistance, raising questions about the government’s tightening … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/dont-lead-us-we-lead-you-mnangagwa-minister-threatens-ngos/\">Continue reading<span class=\"screen-reader-text\"> \"Don’t Lead Us, We Lead You, Mnangagwa Minister Threatens NGOs\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Green Dollar Coin Secures $3 Billion MTN Bond, Cementing Global Asset-Backed Credibility",
            "url": "https://www.zimeye.net/2025/11/03/green-dollar-coin-secures-3-billion-mtn-bond-cementing-global-asset-backed-credibility/",
            "content": "By A Correspondent\n\nLondon, UK  2 November 2025 In a landmark development for blockchain-based finance,Green Dollar Coin (GDC)has secured a$3 billion Medium-Term Note (MTN)bond under theGreen Dollar Development Bank, reinforcing its1:1 liquidity with the U.S. Dollarand elevating its standing among the worlds most securely backed digital currencies.\n\nThe bond, registered underISIN No. XS0294364954, is reportedly lodged withEuroclear BankandStandard Bank, two of the most trusted global financial institutions. This milestone underscores Green Dollar Coins commitment to institutional-grade transparency and financial stability.\n\nStrengthening Liquidity and Investor Confidence\n\nAccording to Green Dollar Coin executives, the MTN bond ensures that every GDC token is fully collateralized by equivalent dollar-denominated financial instruments, providing robust liquidity and security to investors.\n\nThis marks a historic leap for Green Dollar Coin and for the future of sustainable digital finance, said a company spokesperson. Our $3 billion MTN bond gives GDC unmatched real-world backing, liquidity depth, and global credibility.\n\nInstitutional Transparency and Trust\n\nBy integrating a Euroclear-registered bond, Green Dollar Coin enhances confidence in its ecosystem through transparent, verifiable asset support.Euroclear, one of the worlds largest securities depositories, handles multi-trillion-dollar transactions and is widely used by central banks and major institutions for asset settlement.\n\nWithStandard Bankserving as custodian, Green Dollar Coin aims to merge traditional finance and blockchain innovation, offering a sustainable, institutionally backed digital asset that promotes long-term financial inclusion.\n\nAbout Green Dollar Coin\n\nRegistered in the United Kingdom (Company No. 15259074),Green Dollar Coin (GDC)is an environmentally conscious, asset-backed digital currency designed to combine blockchain efficiency with real-world financial stability. The project advocates for transparency, inclusivity, and sustainable development through its eco-focused blockchain platform.\n\nWith the integration of the$3 billion MTN bond, Green Dollar Coin sets a new benchmark for trust, liquidity, and scalability in the global digital asset market.\n\nFor more information, visitwww.greendollarcoin.com.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent London, UK – 2 November 2025 – In a landmark development for blockchain-based finance, Green Dollar Coin … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/green-dollar-coin-secures-3-billion-mtn-bond-cementing-global-asset-backed-credibility/\">Continue reading<span class=\"screen-reader-text\"> \"Green Dollar Coin Secures $3 Billion MTN Bond, Cementing Global Asset-Backed Credibility\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Zanu PF Hardliners Mock Gorimbo After UFC Defeat",
            "url": "https://www.zimeye.net/2025/11/03/zanu-pf-hardliners-mock-gorimbo-after-ufc-defeat/",
            "content": "By A Correspondent\n\nHarare  Zanu PF-linked personalities have mocked Zimbabwean mixed martial artist Themba Gorimbo following his weekend loss to American fighter Jeremiah Wells at UFC Vegas 110, a match he lost by unanimous decision.\n\nOn Sunday controversial businessman Wicknell Chivayo led the charge, ridiculing Gorimbo in a social media post that many described as petty and uncalled for. Chivayo wrote: Useless anzwa butter & kuswera uchitsvaga mbiri pa social media uchituka vanhu ne nyika instead of training. Too many losses, dzoka kumusha uite bouncer ku mabhawa, Chikomana.\n\nIn a sharp and emotional response, Gorimbo clapped back at Chivayo, accusing him of flaunting stolen wealth while undermining hardworking people. Joke of the day today was Wickednel telling me I must come back and be a bouncer, he said. Bro please relax. Honestly, do you think my life has always been rosy? I was once a garden boy, painter, and security guard. With the real Gods grace I am here.\n\nGorimbo went on to say his story had inspired countless people around the world. I am not a yahoo boy, my guy. I sweat for everything. And alongside, I meet good people who have sweated for their money and help me, he said.\n\nThe fighter also questioned Chivayos moral influence, saying, I dont know who Wickednel can inspire in this world. Maybe goons who also want to steal, but real inspiration chaiyo hamuna wamumopa. Ndiyo last post I will ever mention you.\n\nHe further accused the businessman of trying to silence critics through money and influence. Imagine buying people with cars to silence their critical thinking skills so they may turn a blind eye to evil being done. You might have a lot of money, but one thing you can never do is buy me because I dont have a price. I am different.\n\nDespite the loss, Gorimbo remained defiant and optimistic. From nothing to something I won, even when I am losing in your eyes. Bikita to Miami. I thank God, he said.\n\nMeanwhile, Zanu PF online activist Dereck Goto joined the mockery, writing: Id been scratching my head wondering why our dear Themba Gorimbo had suddenly gone mute on social media  little did I know the brothers spirit was warning him kuti brace yourself, disaster incoming.\n\nGoto went on to gloat over the result, saying, Cdes, the silence is over! I come bearing fantastic news  the self-proclaimed loudmouth has been clobbered again this very morning! Thank you Jeremiah Wells for doing the Lords work. We appreciate you. Lots of love from Zimbabwe.\n\nGorimbos defeat may have cost him a win inside the octagon, but for many fans, his resilience, humility, and faith continue to make him a symbol of perseverance beyond the cage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – Zanu PF-linked personalities have mocked Zimbabwean mixed martial artist Themba Gorimbo following his weekend loss … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/zanu-pf-hardliners-mock-gorimbo-after-ufc-defeat/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hardliners Mock Gorimbo After UFC Defeat\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "VP Chiwenga In SA For Medical Check-Up",
            "url": "https://www.zimeye.net/2025/11/03/vp-chiwenga-in-sa-for-medical-check-up/",
            "content": "By A Correspondent-Vice President Constantino Chiwenga last week missed the State of the Nation Address delivered by President Emmerson Mnangagwa after he had left for South Africa for a medical check-up.\n\nGovernment sources said Chiwenga had a doctors appointment in South Africa on the day of the address.\n\nThis was also confirmed by Presidential spokesperson George Charamba to a local online portal.\n\nAt 69 years old, Chiwengas absence from the opening of the third session of the tenth Parliament was conspicuous. Vice President Kembo Mohadi attended in his place. In a terse response to a ZimLive inquiry, presidential spokesman George Charamba stated:\n\nThe vice-president had a medical review in South Africa.\n\nChiwenga is believed to have since returned to Zimbabwe. His last public engagement was on 25 October, when he attended the 75th-anniversary celebrations of St Lukes Mission and St Lukes Mission Hospital in Lupane (Matabeleland North), following a tour of development projects in Matabeleland South.\n\nHis absence at such a key national event has sparked speculation about internal manoeuvring within the ruling party, ZANUPF. Reportedly, allies of Mnangagwaincluding influential businessman Kudakwashe Tagwireiare said to be manoeuvring to sideline Chiwenga from the party and government, effectively eliminating him from the succession contest. Meanwhile, Chiwenga is believed to be resisting efforts to extend Mnangagwas presidency beyond 2028, when his second and final term is due to end under the 2013 constitutionan issue that has placed him at odds with powerful loyalists who privately harbour ambitions of their own.\n\nMnangagwa came to power in November 2017, following the removal of longtime leader Robert Mugabe. Chiwengathen commander of the Zimbabwe Defence Forcesplayed a decisive role in the transition, making him a central figure in the new administration. (He was appointed Vice President shortly afterwards.)\n\nOver the years, a succession contest has simmered within ZANU-PF. Mnangagwa has stressed constitutional limitstwo five-year terms ending in 2028but internal signals suggest efforts to extend his stay or pick a loyal successor are ongoing. Analysts note that the contest is not simply about time in office, but about securing patronage networks, control of the party apparatus, and future access to state resources.\n\nChiwenga, as a former military chief and long-standing figure in the liberation war generation, has been widely viewed as a potential successor. At the same time, his presence also threatens other power centres within ZANU-PF that favour alternative successors or narrower patronage networks linked to Mnangagwas inner circle. Conflicts over corruption, control of tenders, and influence in the security sector further deepen the fault lines.\n\nIn early 2025, reports pointed to a growing rift between Chiwenga and Mnangagwas allies, especially after Chiwenga publicly criticised tenderpreneurs and implied that the Vision 2030 agenda must be inclusive and not monopolised by party elites. Such remarks were widely seen as signalling his disapproval of how power was being exercised and how succession plans were being manipulated.\n\nChiwengas health has been a subject of public and political concern for several years. In February 2019 he was treated in India for an unspecified ailment, and the government acknowledged he was not feeling well. On that occasion, he was described as having swollen hands and discoloured skin patches. By November 2019, he had spent four months in China for medical treatment, after prior treatment spells in South Africa and India.\n\nThese prolonged absences and opaque explanations fuelled speculation about his fitness for officeespecially given his prominent role in succession politics. More recently, in 2023 a court heard evidence that Chiwenga was unconscious when hospitalised in July 2019 in South Africa, and that his doctor had been furious when he was flown out of the country. While the exact details of his condition remain undisclosed, it is clear his health remains fragile and politically sensitive.\n\nGiven the combination of illhealth and highstakes internal party dynamics, Chiwengas absence from major eventssuch as the SONAat a time of intensified succession manoeuvring magnifies public speculation about his status and future within the party.\n\nChiwengas non-attendance at the SONA may reflect more than a routine medical appointment. In the current context, it underscores three inter-linked dynamics:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Vice President Constantino Chiwenga last week missed the State of the Nation Address delivered by President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/vp-chiwenga-in-sa-for-medical-check-up/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga In SA For Medical Check-Up\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        },
        {
            "title": "Prophet Magaya Enters Court While Handcuffed",
            "url": "https://www.zimeye.net/2025/11/03/prophet-magaya-enters-court-while-handcuffed/",
            "content": "video loading below\n\nProphet Walter Magaya enters Harare magistrates court on Monday 3 Nov 2025. He is charged over rape and fraud in a dossier compiled by@GenderZimbabwe@PoliceZimbabwehttps://t.co/Hn8KhXSFAxpic.twitter.com/btTNzRxSvh\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below Prophet Walter Magaya Appears in Court By ZimEye News | Harare – Monday, 3 November 2025 Prophetic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/03/prophet-magaya-enters-court-while-handcuffed/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Magaya Enters Court While Handcuffed\"</span></a></p>",
            "time": "21:46",
            "date": "03 Nov 2025"
        }
    ]
}