{
    "news": [
        {
            "title": "Ken Sharpe Challenges Rotarians To Use Their Skills For Community Impact",
            "url": "https://www.zimeye.net/2025/01/25/ken-sharpe-challenges-rotarians-to-use-their-skills-for-community-impact/",
            "content": "By Business Reporter-WESTPROP Holdings chief executive Mr Ken Sharpe has urged Rotarians to use their different vocations and life skills to impact the community and engender positive change and development.\n\nHe made the call when he addressed the Rotary Club of Harare City on Tuesday on the topic vocational service.\n\nI challenge each of you to identify one way you can apply your vocational skills to serve others. Whether it is through mentorship, skills training, or community development projects, let us work together to make a meaningful difference in our communities.\n\nI have seen that in my own life that being successful in your own right is one thing. But achieving significance and benefitting society and others is much greater, he said.\n\nHe urged Rotarians to use their God-given talents to positively impact society as doing so brings fulfilment.\n\nWhen you apply yourself to use your talent for the right reasons and the right purpose, you will be fulfilled. You will not be worried so much about how much you are paid at the end of the month or how much you are making because that sense of fulfilment is something in you that you know inherently you are born with, he said.\n\nHe said each person should self-reflect on their purpose in life, adding that sportspersons, business people, public speakers and all other professions should use their inborn skills to change the world and increase their sphere of influence because you are no longer just serving self  you are actually serving others.\n\nHe said the Lord blesses each individual differently so that we can be a vehicle for those blessings to flow through to impact the lives of others.\n\nAs Rotarians serving others brings integrity and satisfaction. By applying our professional skills to serve others, we demonstrate our commitment to integrity and ethical behaviour.\n\nBy serving others we are able to engage with communities, understand their needs and address or bring projects that serve their needs, he said.\n\nMr Sharpe said before assisting communities, Rotarians should listen and understand the needs of the people they want to help so that they address the true needs of those communities.\n\nVocational service is not only about what you think and decide to be important. It involves listening to those voiceless people in the back of beyond. They have needs that require capable hands and willing hearts to put into place, he said.\n\nHe said by taking on vocational service projects, Rotarians develop leadership skills, learn to work with others, and confidence building.\n\nYou become part of the transformational change you want to see in the various communities and individuals you engage with, he said.\n\nHe highlighted a few of the activities that he is engaged in as part of his giving back to society. He cited the Sharpe Business Academy, payment of school fees to scores of orphans and vulnerable children, and assistance of widows and single mothers with business start-ups to sustain their families.\n\nAt WestProp Holdings we are committed to vocational service through school fees assistance to scores of orphans and vulnerable children. We assist widows and single mothers with business start-ups so that they can look after themselves. We take in a number of student attaches all with a vision of empowering them and to give them on the job training and infuse in them our culture of excellence, he said.\n\nHe received applause from the Rotarians when he mentioned the work that WestProp did in Greenwood Park that included furnishing the park with new benches.\n\nIn 2023 we committed to rehabilitating the Greenwood Park so that Harare residents could find a pleasant play centre. We provided benches, bins, and rehabilitated the childrens play centre and added a few traditional games like pada and nhodo, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-WESTPROP Holdings chief executive Mr Ken Sharpe has urged Rotarians to use their different vocations and life skills … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/ken-sharpe-challenges-rotarians-to-use-their-skills-for-community-impact/\">Continue reading<span class=\"screen-reader-text\"> \"Ken Sharpe Challenges Rotarians To Use Their Skills For Community Impact\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "Zimra Boasts Of Raiding Poor People’s Foods Instead Of Wicknell’s Smuggled Goods",
            "url": "https://www.zimeye.net/2025/01/25/zimra-boasts-of-raiding-poor-peoples-foods-instead-of-wicknells-smuggled-goods/",
            "content": "Zimbabwe Revenue Authority (ZIMRA) officials have been mercilessly raiding vendors on the streets of Zimbabwe, confiscating small goods such as fruits and sweets in the name of combating smuggling. Yet, glaring inconsistencies have emerged as the tax authority remains silent on billion-dollar scandals involving politically connected elites, including convicted money launderer Wicknell Chivayo and President Emmerson Mnangagwas business associate, Kamlesh Pattni.\n\nhttps://x.com/zimeye/status/1376447560215363585?s=46\n\nWhile ZIMRA boasts of warehouses overflowing with confiscated goodsranging from alcohol and diapers to refrigerators and vehiclesit has failed to address nine years of luxury car imports by Chivayo, whose tax compliance remains a mystery. Chivayo, a convicted money launderer, has openly flaunted his wealth, pledging cars to political celebrities, yet ZIMRA has provided no explanation for why his lavish imports have escaped scrutiny or taxation.\n\nThe hypocrisy deepens as ZIMRA touts its anti-smuggling campaign as a zero-tolerance operation aimed at protecting Zimbabwes economy. Their brutal crackdown on small-scale traders contrasts sharply with their apparent reluctance to investigate Pattnis gold smuggling empire, which has funneled billions out of Zimbabwe while undermining the nations economy. In December 2024, the U.S. Department of the Treasury sanctioned Pattni and his global network for corruption, exposing his role in laundering proceeds from Zimbabwes natural resources with the complicity of high-ranking officials.\n\nPattni, a long-time associate of Mnangagwa, is accused of operating an intricate network of bribery and fraud, siphoning off wealth from Zimbabwes gold exports and laundering the proceeds through international channels. Despite these revelations, ZIMRA has made no public effort to account for the smuggling of gold bricks used to fund election-related activities, further eroding its credibility. The U.S. sanctions highlighted how Pattnis scheme has enriched Zimbabwes ruling elite while robbing citizens of infrastructure, education, and economic development.\n\nDouble Standards in Enforcement\n\nZIMRAs visible enforcement effortssuch as impounding buses and raiding vendors selling small goodsappear to be targeting the powerless while protecting the powerful. Small-scale traders, already struggling to survive, bear the brunt of the campaign, while politically connected billionaires like Chivayo and Pattni escape unscathed. Chivayos fleet of luxury vehicles, imported without proper duty for nearly a decade, underscores ZIMRAs failure to enforce the law impartially.\n\nDespite its declarations of zero tolerance, ZIMRA has remained conspicuously silent about the billions lost through Pattnis smuggling operations. Pattnis network, which stretches across multiple countries, bribed officials to mask illicit activities and used front companies to hide its tracks. The gold smuggling empire, tied to election financing and corruption, represents one of the largest thefts of Zimbabwes natural resources in recent history.\n\nCalls for Accountability\n\nAs the nation grapples with economic hardship, ZIMRAs selective enforcement has sparked outrage. Citizens are questioning how an institution tasked with safeguarding Zimbabwes resources can allow such glaring lapses in oversight. Activists and watchdog groups are demanding transparency in the handling of both Chivayos car imports and Pattnis gold smuggling, emphasizing that ZIMRAs actions are undermining public trust.\n\nThe fact that ZIMRA can boast about confiscating diapers and refrigerators from struggling Zimbabweans while saying nothing about billions in smuggled gold is outrageous, said one economic analyst. This isnt law enforcementits a mockery of justice.\n\nA Ticking Time Bomb\n\nThe silence surrounding Chivayo and Pattni is more than a failure of enforcementits a reflection of systemic corruption that threatens the integrity of Zimbabwes institutions. Until ZIMRA takes action against the real perpetrators of economic sabotage, its anti-smuggling campaign will remain a smokescreen, concealing a culture of impunity that favors the elite at the expense of the nations most vulnerable.\n\nAs ZIMRA continues to crack down on petty traders, the question remains: How long can the government ignore its own complicity in the very crimes it claims to fight? The answers may lie not in the warehouses of confiscated goods, but in the billions of dollars lost to corruption, smuggling, and cronyism.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabwe Revenue Authority (ZIMRA) officials have been mercilessly raiding vendors on the streets of Zimbabwe, confiscating small goods such as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/zimra-boasts-of-raiding-poor-peoples-foods-instead-of-wicknells-smuggled-goods/\">Continue reading<span class=\"screen-reader-text\"> \"Zimra Boasts Of Raiding Poor People’s Foods Instead Of Wicknell’s Smuggled Goods\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "‘O Level’ Prophet Walter Magaya Announces He Remains The Only Qualifying Candidate for ZIFA Presidency",
            "url": "https://www.zimeye.net/2025/01/25/o-level-prophet-walter-magaya-announces-he-remains-the-only-qualifying-candidate-for-zifa-presidency/",
            "content": "By Sports Reporter | Magaya Insists He Was the Only Qualified Candidate After High Court Denial\n\nProphet Walter Magaya, president of Yadah Stars, has declared that he was the only qualified candidate to lead ZIFA, even after his disqualification by the High Court. Speaking for the first time since losing his court bid to stop the ZIFA elections, Magaya maintained that none of the remaining candidates possessed the vision or capability to lead the organization effectively.\n\nAddressing 73 of the 78 ZIFA councillors at his Yadah Complex on Friday night, Magaya made it clear that his exclusion from the race had left ZIFA with subpar options for leadership. I was honest and told everyone that none of the remaining candidates are qualified. After thorough assessments, it became even more evident that I was the only one with a clear plan and the ability to deliver meaningful results, he said.\n\nMagayas confidence in his own qualifications was undeterred by his legal defeat. While he announced his withdrawal of an appeal to the Court of Arbitration for Sport (CAS), he used the platform to emphasize that his disqualification was a blow not to himself, but to the future of Zimbabwean football. The people have approached me asking who I would support now that Ive been disqualified. But after meeting the candidates and reviewing their narratives, it is clear: none of them can match my vision, he asserted.\n\nAlthough Magaya ultimately endorsed Nqobile Magwizi for the ZIFA presidency, his endorsement came with a strong implication that it was a reluctant choice. Out of the remaining candidates, Magwizi is the best option, but only because the alternative is worse, Magaya said. No one can deliver like I would have. This is not arroganceits the truth, based on what I have seen and heard.\n\nThe preacher also expressed frustration over the rumors and uncertainty surrounding the ZIFA Congress. He used the opportunity to demand assurances for the protection of councillors and the prioritization of womens football, matters he claimed only he had been adequately addressing. I had plans for all sectors, from womens football to stadium renovations. None of the other candidates can promise what I was going to deliver, Magaya said.\n\nMagaya made it clear that his passion for football would not be diminished by his exclusion from the race. I will continue driving football development. If you give me Gwanzura, I will fix it. If you give me Chibuku, I will rebuild it. No one can take away my commitment to the game, he declared.\n\nDespite his vocal support for Magwizi, Magayas message was unmistakable: the ZIFA presidency has lost its best chance for meaningful reform with his disqualification. His insistence that he was the only qualified candidate casts a long shadow over the elections, leaving many to wonder what ZIFAs future will look like without his direct involvement.\n\nAs the ZIFA councillors prepare to cast their votes, Magayas remarks serve as a stark reminder of the controversy and division surrounding the leadership race. For Magaya, the message is simple: the system may have sidelined him, but it cannot silence his belief that he was the only person truly capable of transforming Zimbabwean football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter | Magaya Insists He Was the Only Qualified Candidate After High Court Denial Prophet Walter Magaya, president … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/o-level-prophet-walter-magaya-announces-he-remains-the-only-qualifying-candidate-for-zifa-presidency/\">Continue reading<span class=\"screen-reader-text\"> \"‘O Level’ Prophet Walter Magaya Announces He Remains The Only Qualifying Candidate for ZIFA Presidency\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "Prophet Magaya’s Anointing Oil for O Level Passes",
            "url": "https://www.zimeye.net/2025/01/25/prophet-magayas-anointing-oil-for-o-level-passes/",
            "content": "Concerns about the commercialization of religious practices, particularly the selling of anointing oil by Prophet Walter Magaya for purposes such as securing jobs, have risen. Questions have been raised over the effectiveness and authenticity of such claims, pointing to a broader critique of religious leaders monetizing spiritual practices.\n\nAdditionally, the below analysis challenges the credibility of religious figures and their practices by drawing attention to past controversies, including legal battles. The mention of other prominent religious leaders (like TB Joshua and Ezekiel Guti) highlights skepticism about why such practices werent exposed or addressed by other influential prophets.\n\nUltimately, the infographic invites reflection on the intersection of faith, materialism, and ethics in modern religious practices.\n\nUltimately, the infographic invites reflection on the intersection of faith, materialism, and ethics in modern religious practices.\n\nWalter Magaya on many occasions marketing his oil for success concoction.\n\nProphet Walter Magaya has found himself at the center of controversy over his sale of anointing oil. Previously accused of promoting products like anointing oil to help people secure employment, Magaya faced legal challenges thats seen him fail to qualify for the football association, ZIFA top job.\n\nMoreover, the debate extends beyond Magaya himself, as the role of other prominent religious leaders is brought into question. Figures such as the late TB Joshua and Ezekiel Guti, who are revered in their communities, are indirectly implicated in the critique. Why, the narrative asks, did these respected prophets not foresee or address the questionable nature of Magayas practices? Was their silence a sign of complicity or merely oversight?\n\nThe criticism becomes sharper with the suggestion that Magayas anointing oil is no more credible than fabricated qualificationsan allusion to a broader skepticism surrounding his claims. This comparison implies that such spiritual products could lack authenticity and fail to deliver the promised results.\n\nThis ongoing debate highlights the tension between faith and commerce, prompting deeper reflection on the ethics of monetizing spiritual practices. Are such actions rooted in genuine belief, or do they exploit vulnerable communities? As this controversy unfolds, it remains a stark reminder of the need for accountability and integrity in matters of faith.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Concerns about the commercialization of religious practices, particularly the selling of “anointing oil” by Prophet Walter Magaya for purposes such … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/prophet-magayas-anointing-oil-for-o-level-passes/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Magaya’s Anointing Oil for O Level Passes\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "ZAOGA’s Warring Leaders Finally Reconciled? What Next? | Picture",
            "url": "https://www.zimeye.net/2025/01/25/zaogas-warring-leaders-finally-reconciled-what-next-picture/",
            "content": "Reconciliation at last?- These two men (Joseph Guti, right, and Simango Simukai, left) are the perceived arch-leaders of two factions in the late Ezekiel Gutis ZAOGA church. Are their hearts as white as their suits? Simukai is the husband of Josephs leadership rival Lavener Guti, who is late church leaders most prominent daughter that recently clashed with the others wife on stage.\n\nWhite suits have long held a place of psychological significance and cultural influence, symbolizing purity, authority, and a commanding presence. White, as a color, is universally associated with purity, peace, and honesty. When leaders or public figures wear white suits, they inherently suggest transparency and a moral high ground. This is particularly potent in contexts where trust and values are central to their mission, such as religious or philanthropic endeavours.\n\nChurch members in ZAOGAs US branches where Simango Simukai once pastored seem tell a different story from that told by those in Zimbabwe.\n\nOn the other hand the anointed leader, Joseph is still to respond to the demands of the family of a goblin-casting Pastor Michael Vareta, who has three identities. The family demands a public apology after ZAOGA allowed Vhareta to continue claiming in sermons that he was anointed by God while living as a street kid in Rhodesia (now Zimbabwe). The family accuses him of fabricating this story to enhance his spiritual reputation.\n\nThe Vareta family, fathered by a wealthy businessman in Mt. Darwin, says Pastor Varetas claims are false and damaging to their reputation. They argue their firstborn brother, born in 1957, never lived as a street kid in 1978 and accuse him of dishonoring the family for personal gain. His siblings say the family provided a stable upbringing, making his story untrue and unnecessary.\n\nMichael Vhareta also has 3 identitiesOne family member said, Hes painting a false picture of neglect when we supported him. This is not our story.\n\nPastor Vareta asserts he lived on the streets of Salisbury (modern-day Harare) for over eight months during the liberation war in 1978. However, critics argue this was impossible due to Rhodesias strict racial segregation and security measures at the time.\n\nHistorical evidence shows black men of his age were either conscripted into the Rhodesian army or targeted by nationalistic guerrilla fighters. Many have questioned how he could have survived undetected in a heavily policed city center under such conditions.\n\nCritics accuse Pastor Vareta of fabricating this backstory to appear more spiritually anointed. They argue the claim creates a false narrative to inspire trust and attract followers. A ZimEye interviewer confronted him, asking, Are you trying to build your career on a lie to appear as someone God miraculously raised from nothing?\n\nPastor Varetas Defense\n\nIn a lengthy interview, Pastor Vareta stands by his story, attributing his survival to Gods protection. He says, This is my testimony. It happened, whether people believe it or not. I cannot lie before God.\n\nHowever, he admitted his claims conflict with historical records and acknowledged gaps in his story, saying, Its like surviving a car crashyou cant always explain how it happened.\n\nImpact on the Church\n\nThe controversy has raised concerns about leadership integrity within ZAOGA FIF Church. Some compare Varetas claims to previous allegations against the churchs late founder, Ezekiel Guti, who has faced criticism for exaggerating his spiritual experiences. Critics argue this pattern undermines the churchs credibility. In the interview the preacher does not deny that his claims are similar to that his later founder used to market the institution.\n\nThe Vareta family and community members worry his claims tarnish their name and the churchs reputation. They demand an apology and a retraction of the story. One sibling said, He needs to tell the truth, not create a fantasy for fame.\n\nZAOGA church was reached for comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Reconciliation at last?- These two men (Joseph Guti, right, and Simango Simukai, left) are the perceived arch-leaders of two factions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/zaogas-warring-leaders-finally-reconciled-what-next-picture/\">Continue reading<span class=\"screen-reader-text\"> \"ZAOGA’s Warring Leaders Finally Reconciled? What Next? | Picture\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "Vapositori Back Mnangagwa’s Controversial 2030 Agenda",
            "url": "https://www.zimeye.net/2025/01/25/vapositori-back-mnangagwas-controversial-2030-agenda/",
            "content": "By A Correspondent\n\nIn a significant display of political and spiritual unity, members of the Johanne the 5th of Africa Church have endorsed President Emmerson Mnangagwas 2030 Agenda for Zimbabwe. This came to light during the second day of the Johanne the 5th of Africa International Church Provincial Prayer meeting in Victoria Falls, a major gathering that attracted a large number of church leaders and members from across the region.\n\nThe theme for the event, 2025: The Year of Progress and Development, was unveiled, setting the tone for the deliberations and prayers that followed. Attendees came together to seek divine guidance and blessings for the political and social goals outlined in the countrys future plans, with a particular focus on the 2030 Agenda, a framework designed to push Zimbabwe toward greater prosperity.\n\nA key highlight of the prayer meeting was the emphasis on praying for the well-being of President Mnangagwa and his family, a gesture that reflects the strong support the church community has for his leadership. According to a source present at the event, Prayer points include the well-being of President Emmerson Mnangagwa and the First Family, the success of the ZANU PF party, peace and stability within the SADC region, and the eradication of drug and substance abuse.\n\nThese prayer points demonstrate the churchs alignment with the governments vision, emphasizing not only political stability but also the social and economic progress that President Mnangagwas administration aims to achieve. The endorsement comes at a critical juncture, as Zimbabwe aims to position itself as a progressive nation by 2030, with goals including improved infrastructure, a stronger economy, and greater social harmony.\n\nThe support for the 2030 Agenda is also seen as part of the broader narrative of church and state cooperation in Zimbabwe, where religious organizations often play a significant role in shaping national discourse. The churchs commitment to praying for the success of the ZANU PF party further underscores the intertwined relationship between faith-based groups and the ruling government, particularly in key moments of political and social transition.\n\nAs the event concluded, it was clear that the Johanne the 5th of Africa Church remains a significant force in supporting President Mnangagwas vision for the future of Zimbabwe, while also addressing pressing national concerns such as peace, drug abuse, and regional stability. The success of these prayers, many hope, will contribute to the collective effort in moving the country closer to its ambitious 2030 goals.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a significant display of political and spiritual unity, members of the Johanne the 5th of Africa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/vapositori-back-mnangagwas-controversial-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Vapositori Back Mnangagwa’s Controversial 2030 Agenda\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "ZIMRA High Speed Chase Kills Gonyeti Driver",
            "url": "https://www.zimeye.net/2025/01/25/zimra-high-speed-chase-kills-gonyeti-driver/",
            "content": "By A Correspondent\n\nA haulage truck driver tragically lost his life in a head-on collision on Thursday, allegedly while being pursued by suspected ZIMRA (Zimbabwe Revenue Authority) officers and State security agents on an anti-smuggling patrol, approximately 60km outside the border town of Beitbridge.\n\nBeitbridge District Chief Superintendent Mesuli Ncube, quoted by NewsDay, confirmed the fatal crash but lacked further details at the time.\n\nI have dispatched officers to attend the scene. There are no details as yet, but I can confirm a fatal crash involving a haulage truck driver. We could have details later, he said.\n\nAccording to witnesses, the truck was chased by an unmarked Ford Ranger, which had been parked in the bush to ambush vehicles along the route. One eyewitness described the scene, stating, The truck was being chased by the vehicle. The driver lost control and the truck flipped onto its side, killing him.\n\nThe driver was reportedly carrying a passenger at the time of the crash, who fortunately survived the accident. However, the anti-smuggling team allegedly fled the scene immediately after the crash, with no immediate efforts to assist the victims.\n\nThe tragic incident has raised serious concerns about the aggressive tactics reportedly used by ZIMRA officers and State security agents, leading to questions about accountability in the handling of anti-smuggling operations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A haulage truck driver tragically lost his life in a head-on collision on Thursday, allegedly while being … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/zimra-high-speed-chase-kills-gonyeti-driver/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA High Speed Chase Kills Gonyeti Driver\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "Mnangagwa Administration Panicks Over Church Leaders’ Stance Against 2030 Agenda",
            "url": "https://www.zimeye.net/2025/01/25/mnangagwa-administration-panicks-over-church-leaders-stance-against-2030-agenda/",
            "content": "By A Correspondent\n\nIn a sharp rebuke to church leaders and civil society groups speaking out against President Emmerson Mnangagwas potential bid for a third term, Zimbabwes Information Minister, Jenfan Muswere, has defended the proposal, insisting that it is a legitimate and necessary action for the countrys democratic progress. Musweres comments, made in a statement on Wednesday, come amid growing concerns from various quarters, including religious leaders, about the implications of extending Mnangagwas rule beyond the constitutional limit set for 2028.\n\nMuswere underscored that the call to extend the presidential term is a rightful and unquestionable obligation for Zimbabwes Parliament and other political stakeholders. He argued that this move is in line with the national interests, which are represented by elected officials across different political parties in Parliament.\n\nThe politically broad-based call to extend the Presidential term of office beyond 2028 remains a rightful and unquestionable obligation for Parliament, the Party of Zimbabwes permanent national democratic revolution  ZANU PF and other legitimate political stakeholders to this matter, Muswere said. He further emphasized that parliamentarians, regardless of their political affiliations, are duty-bound to represent the views and aspirations of their electorate, and as such, any proposals regarding the extension should reflect the will of the people they serve.\n\nThe Information Ministers statement also took aim at civil society organizations, particularly those funded by Western donors, which have criticized the governments plans. Muswere pointed out that these organizations, which he claimed falsely represent the views of the Church in Zimbabwe, should not influence the political process. Parliament is not answerable to narrow, sectoral and regime-change donor funding antics by a paltry conglomerate of civil society entrepreneurs purporting to represent the views of the Church in Zimbabwe, Muswere stated.\n\nMoreover, Muswere reiterated that ZANU PF, the ruling party, has been a strong proponent of religious freedoms, arguing that the party has championed freedom of worship for all Zimbabweans. He also dismissed criticisms of the ZANU PF-led governments relationship with religious groups, stating that the party would not allow its values to be misrepresented by minority entities and individuals seeking to undermine the governments agenda.\n\nIt is crucial for ZANU PFs godly existential values not to be abused by minority entities and individuals bent on misrepresenting the cordial relationship which the state and the church enjoy, he asserted.\n\nMuswere also reassured the public that any move to extend the presidential term would adhere to constitutional guidelines. The proposal to move a motion on the Presidential Term Limit Extension will follow the provisions of the law, he confirmed, emphasizing that the Constitution would remain central to the process, ensuring that no legal violations would occur.\n\nThis statement from the government comes at a time when a number of religious leaders and human rights activists have voiced concerns about the potential extension of Mnangagwas presidency. Critics argue that such a move\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a sharp rebuke to church leaders and civil society groups speaking out against President Emmerson Mnangagwa’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/mnangagwa-administration-panicks-over-church-leaders-stance-against-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Administration Panicks Over Church Leaders’ Stance Against 2030 Agenda\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "Vapositori Endorse Mnangagwa’s 2030 Agenda",
            "url": "https://www.zimeye.net/2025/01/25/vapositori-endorse-mnangagwas-2030-agenda/",
            "content": "By A Correspondent\n\nIn a significant display of political and spiritual unity, members of the Johanne the 5th of Africa Church have endorsed President Emmerson Mnangagwas 2030 Agenda for Zimbabwe. This came to light during the second day of the Johanne the 5th of Africa International Church Provincial Prayer meeting in Victoria Falls, a major gathering that attracted a large number of church leaders and members from across the region.\n\nThe theme for the event, 2025: The Year of Progress and Development, was unveiled, setting the tone for the deliberations and prayers that followed. Attendees came together to seek divine guidance and blessings for the political and social goals outlined in the countrys future plans, with a particular focus on the 2030 Agenda, a framework designed to push Zimbabwe toward greater prosperity.\n\nA key highlight of the prayer meeting was the emphasis on praying for the well-being of President Mnangagwa and his family, a gesture that reflects the strong support the church community has for his leadership. According to a source present at the event, Prayer points include the well-being of President Emmerson Mnangagwa and the First Family, the success of the ZANU PF party, peace and stability within the SADC region, and the eradication of drug and substance abuse.\n\nThese prayer points demonstrate the churchs alignment with the governments vision, emphasizing not only political stability but also the social and economic progress that President Mnangagwas administration aims to achieve. The endorsement comes at a critical juncture, as Zimbabwe aims to position itself as a progressive nation by 2030, with goals including improved infrastructure, a stronger economy, and greater social harmony.\n\nThe support for the 2030 Agenda is also seen as part of the broader narrative of church and state cooperation in Zimbabwe, where religious organizations often play a significant role in shaping national discourse. The churchs commitment to praying for the success of the ZANU PF party further underscores the intertwined relationship between faith-based groups and the ruling government, particularly in key moments of political and social transition.\n\nAs the event concluded, it was clear that the Johanne the 5th of Africa Church remains a significant force in supporting President Mnangagwas vision for the future of Zimbabwe, while also addressing pressing national concerns such as peace, drug abuse, and regional stability. The success of these prayers, many hope, will contribute to the collective effort in moving the country closer to its ambitious 2030 goals.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a significant display of political and spiritual unity, members of the Johanne the 5th of Africa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/vapositori-endorse-mnangagwas-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Vapositori Endorse Mnangagwa’s 2030 Agenda\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        },
        {
            "title": "A Tribute To Grandmore Hakata",
            "url": "https://www.zimeye.net/2025/01/25/a-tribute-to-grandmore-hakata/",
            "content": "By Hon Lovemore Jimu\n\nMy heart is shattered.I had found myself a brother,colleague,friend and confidante in you Grandmore Hakata.We were not only Parliamentarians but we were brothers.Death be shy and do not be proud you have taken a hardworking man away from us.\n\nTo the family,Glenview South Constituency and everyone else feeling the pain I am feeling I say May God comfort us all in this heartbreaking time of mourning.Mwari vatanha ruva ravo ngatidananei pano panyika hatina nguva yatinofunga tinayo.\n\nGo Well My Friend,ndarwadziwa watisiira ronda risingaperi.Ko zvatakaronga zviya nhai sahwira?Rest in eternal peace bhururu wangu!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Hon Lovemore Jimu My heart is shattered.I had found myself a brother,colleague,friend and confidante in you Grandmore Hakata.We were … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/25/a-tribute-to-grandmore-hakata/\">Continue reading<span class=\"screen-reader-text\"> \"A Tribute To Grandmore Hakata\"</span></a></p>",
            "time": "18:28",
            "date": "25 Jan 2025"
        }
    ]
}