{
    "news": [
        {
            "title": "Mukungunugwa Publishes Gokwe USD10 Million Spending “Breakdown”",
            "url": "https://www.zimeye.net/2025/04/20/mukungunugwa-publishes-gokwe-usd10-million-spending-breakdown/",
            "content": "ZANU PF photographer Cleopas Mukungunugwa writing on Sunday, published a breakdown of where he says the USD10 million expenditure for the Gokwe independence celebration went. He wrote :\n\nKo Standard Newspaper yacho tikangozvivharisa \n\nAn Open Clarification to The Standard on Independence Day Expenditure\n\nIt appears The Standard owned by Alpha Media Holdings and chaired by Trevor Ncube requires yet another economics lesson on the costs of hosting a national event. Since the paper seems determined to mislead the public on the $10 million allocated for Zimbabwes Independence Day celebrations, perhaps a breakdown is necessary.\n\nWhere the Funds Were Allocated\n\n2.Security & Emergency Services\n\nA Question for The Standard.If the paper were genuinely interested in accountability, it would scrutinize all major expenditures including those of private corporations and opposition groups with the same vigor. Instead, it opts for sensationalism, undermining a celebration that unites millions of Zimbabweans.\n\nOne must ask: Why does The Standard consistently distort facts to attack the government while benefiting from its advertising revenue? Is this journalism, or a deliberate campaign to erode public trust in national institutions?\n\nZimbabwes independence was earned through sacrifice. Its celebration is not merely an expense its an investment in national pride, unity, and heritage. If The Standard disagrees, perhaps it should state so plainly rather than disguising bias as investigative reporting.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ZANU PF photographer Cleopas Mukungunugwa writing on Sunday, published a breakdown of where he says the USD10 million expenditure for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/mukungunugwa-publishes-gokwe-usd10-million-spending-breakdown/\">Continue reading<span class=\"screen-reader-text\"> \"Mukungunugwa Publishes Gokwe USD10 Million Spending “Breakdown”\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Tafi Mhaka Says: Geza’s is Helping the Faceless ZANU-PF Chefs, immoral Purveyors of Poverty and Destruction",
            "url": "https://www.zimeye.net/2025/04/20/tafi-mhaka-says-gezas-is-helping-the-faceless-zanu-pf-chefs-immoral-purveyors-of-poverty-and-destruction/",
            "content": "NEWS ANALYSIS: Is Blessed Geza Just Another Face of ZANU-PF? Tafi Mhakas Stark Warning Divides Zimbabweans\n\nApril 20, 2025\n\nAs political tensions in Zimbabwe hit boiling point, a fierce debate has erupted over the role and true intentions of anti-corruption crusader Blessed Geza. While many hail him as a fearless reformer challenging President Emmerson Mnangagwas crumbling regime, others, like political analyst and commentator Tafi Mhaka, have sounded the alarm  accusing Geza of being a Trojan horse for the very ZANU-PF machinery he claims to oppose.\n\nYou want Zanu-PF to rule in one form or the other? Thats the problem. Zanu must go. No to Mnangagwa. No to Geza. And no to Chiwenga. They are all Zanu-PF!\n\nhttps://x.com/tafimhaka/status/1913947256694190253?s=46\n\nIn a sharply worded thread that has since gone viral, Mhaka paints Geza not as a revolutionary, but as a conduit for ZANU-PFs survival strategy. Mhaka claims Geza is helping to preserve the chefs  a colloquial reference to ZANU-PF elites  who presided over decades of mass violence, enforced disappearances, election fraud, and economic decay. He is in fact helping the faceless ZANU-PF chefs, the immoral purveyors of widespread poverty and destruction, Mhaka wrote.\n\nMhakas critique invokes painful national memories: Gukurahundi massacres, the abduction of Itai Dzamara, and the post-election killings of August 1, 2018. In his view, Geza is merely attempting to recycle the same authoritarian order with new branding.\n\nDivided Reactions: A Nation in Debate\n\nThe post sparked passionate debate across Zimbabwean social media. One user, The_Afrikan (@PgMukwara), pushed back hard against Mhakas framing, accusing him of being out of touch with the current generational demands. We are rejecting the establishment of a dynasty, he posted in Shona-infused English, urging critics to leave Geza alone.\n\nOthers echoed Mhakas skepticism. No to Mnangagwa. No to Geza. And no to Chiwenga. They are all ZANU-PF! Mhaka replied in a follow-up tweet, calling for a complete break from the ruling partys legacynot just a change of faces.\n\nStill, the question Do we have any option? posed by another user, @AlexBF, captures the deep despair among citizens. Even those skeptical of Geza admit there are few viable political alternatives. Ashley Shava offered a pragmatic angle, writing: If Geza succeeds in removing Mnangagwa, their next leader will require less effort to remove. It will be an advantage to us, the ordinary people.\n\nThe Real Struggle: Reform or Rebranding?\n\nThe heart of the debate centers on whether Geza represents a genuine break from the ZANU-PF past, or a repackaged front for elite survival. Mhakas argument is that corruption and repression are not just features of individuals like Mnangagwa, but embedded in the DNA of ZANU-PF itself. Therefore, removing one man while keeping the system intact would only prolong the suffering of ordinary Zimbabweans.\n\nGezas camp, on the other hand, seems to frame the struggle more as a tactical effort to remove a dysfunctional leader rather than dismantling the party altogether. His recent addresses have avoided directly denouncing ZANU-PF, instead focusing on Mnangagwas inability to function and calling on MPs to use constitutional powers to impeach him.\n\nConclusion: The Crossroads Moment\n\nZimbabwe stands at a political crossroads. With Mnangagwa skipping public appearances and the opposition fractured, figures like Blessed Geza are increasingly occupying the vacuum of resistance. But whether that vacuum will lead to genuine transformationor merely the rotation of elitesremains uncertain.\n\nTafi Mhakas warning is clear: not every loud voice calling for change is a true revolutionary. As the nation braces for more protests and possible power shifts, Zimbabweans will have to decide what kind of future they wantand whether new leadership without structural reform is change at all.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "NEWS ANALYSIS: Is Blessed Geza Just Another Face of ZANU-PF? Tafi Mhaka’s Stark Warning Divides Zimbabweans April 20, 2025 As … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/tafi-mhaka-says-gezas-is-helping-the-faceless-zanu-pf-chefs-immoral-purveyors-of-poverty-and-destruction/\">Continue reading<span class=\"screen-reader-text\"> \"Tafi Mhaka Says: Geza’s is Helping the Faceless ZANU-PF Chefs, immoral Purveyors of Poverty and Destruction\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Mnangagwa Bunks Prayers After Geza’s Explosive Address",
            "url": "https://www.zimeye.net/2025/04/20/mnangagwa-bunks-prayers-after-gezas-explosive-address/",
            "content": "MBUNGO, ZIMBABWE  Sunday, April 20, 2025\n\nKunze kwaakutoedza. Emmerson Mnangagwa is going. So far we put an end to the 2030 nonsense. Only a few delusional like Daniel Garwe are left. Garwe is ill. We have unified citizens to fight for a Zimbabwe where our aspirations are realised. In this instance I am happy that ashttps://t.co/uV0EcT1Bgh\n\nBy Farai D Hove | ZimEye | President Emmerson Mnangagwa has unexpectedly bunked his highly anticipated appearance at the Zion Christian Church (ZCC) gathering in Mbungo today, sparking intense speculation across the nation. The dramatic no-show comes just hours after fiery anti-corruption activist Blessed Geza issued a bold national address declaring that Mnangagwa will be removed from office within weeks.\n\nThe president, who was expected to deliver remarks at the influential ZCC event, instead delegated the task to Local Government Minister Daniel Garwe. Social media erupted with reactions as Garwe read a prepared speech in Mnangagwas absence, a moment seen by many as a symbolic withdrawal amid growing internal and public pressure.\n\nThis latest development follows reports by ZimEye revealing that Mnangagwas presidential helicopter, recently used during his trip to Gokwe, is considered prone to crashes. The expos raised alarm over the presidents safety and could have factored into his sudden cancellation. However, critics and observers suggest that the real reason may lie in Gezas intensifying campaign.\n\nIn a passionate late-night address on Saturday, Geza delivered a blistering critique of the Mnangagwa regime, ridiculing the presidents last public address in Gokwe and calling on Zimbabweans to unite in peaceful resistance.\n\nThe thing we stopped is the 2030 nonsense No one still talks of that except Daniel Garwe. He takes pills. Mnangagwa has kept him in there, Geza charged, referencing the presidents Vision 2030 agenda which now lies in tatters.\n\nGeza praised the people for their solidarity during past shutdown actions and urged a renewed stay-at-home protest on Tuesday and Wednesday. He emphasized the spiritual nature of the resistance, citing divine intervention in exposing government wrongdoing during the recent Independence Day celebrations.\n\nGod uses weather as a weapon of war We ask the churches to continue praying. The spirits of the land keep doing what you do to make sure Mnangagwa goes.\n\nThe activist also highlighted the plight of over 100 detained protesters and journalists like Blessed Mhlanga, saying their only crime was exercising constitutional rights.\n\nJournalists have permission to take news He was only doing his job, Geza declared.\n\nAs the regime struggles to respond, the streets are buzzing with speculation. Commenters online are not holding back. One viral post by Facebook user Christian Precious MacHingura summed up the moment: GEZA updates left him shivering.\n\nMnangagwas conspicuous absence, paired with Garwes awkward appearance as a stand-in, has further fueled speculation about the presidents waning influence. Sources inside the ruling party claim impeachment whispers have turned into overt discussions, with members of Parliament reportedly no longer wanting him.\n\nWith the opposition energized, the church emboldened, and spirits invoked in the national struggle, all eyes are now on Tuesdays looming shutdownand on whether Mnangagwas silence today signals the beginning of his political end.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "MBUNGO, ZIMBABWE – Sunday, April 20, 2025 By Farai D Hove | ZimEye | President Emmerson Mnangagwa has unexpectedly bunked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/mnangagwa-bunks-prayers-after-gezas-explosive-address/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Bunks Prayers After Geza’s Explosive Address\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Socialite Prince Kelvin Explodes… Speaks On Marabha’s Last Days",
            "url": "https://www.zimeye.net/2025/04/20/socialite-prince-kelvin-explodes-speaks-on-marabhas-last-days/",
            "content": "By A Correspondent\n\nSocialite Prince Kelvin has revealed that Comedian Marabha had no one to bring him food during his final days in the hospital.\n\nZimbabwean Facebook socialite Prince Kelvin, who was hospitalized in the same ward as Marabha, shared a heartfelt account of the comedians last moments.\n\nSpeaking from his hospital bed, Prince Kelvin said, Marabha had nobody to bring him food while in hospital, adding that he was moved by compassion to help. I ended up sharing my food with him, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Socialite Prince Kelvin has revealed that Comedian Marabha had no one to bring him food during his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/socialite-prince-kelvin-explodes-speaks-on-marabhas-last-days/\">Continue reading<span class=\"screen-reader-text\"> \"Socialite Prince Kelvin Explodes… Speaks On Marabha’s Last Days\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Brighton Chimene Raises Zimbabwean Flag High",
            "url": "https://www.zimeye.net/2025/04/20/brighton-chimene-raises-zimbabwean-flag-high/",
            "content": "Sports Correspondent\n\nZimbabwean referee Brighton Chimene proudly flew the national flag high on the continental stage as one of the four match officials in the AFCON Under-17 final held yesterday between Morocco and Mali.\n\nChimene was appointed as the fourth official in a diverse officiating team that included Namibias Andinio Twanyanyuka as the center referee. Salim Asao took charge as the first assistant referee, while the second assistant referee role was filled by Nancy Kasitu from Zambia.\n\nThe tightly contested final ended in a dramatic penalty shootout, with Morocco emerging victorious over Mali with a 4-2 win after a goalless draw in regulation time.\n\nChimenes participation marks a significant achievement for Zimbabwean refereeing, highlighting the growing recognition of local officials at top-tier continental competitions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean referee Brighton Chimene proudly flew the national flag high on the continental stage as one of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/brighton-chimene-raises-zimbabwean-flag-high/\">Continue reading<span class=\"screen-reader-text\"> \"Brighton Chimene Raises Zimbabwean Flag High\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Mnangagwa Celebrates Economic Growth As Citizens’ Suffering Worsens",
            "url": "https://www.zimeye.net/2025/04/20/mnangagwa-celebrates-economic-growth-as-citizens-suffering-worsens/",
            "content": "By A Correspondent\n\nPresident Emmerson Dambudzo Mnangagwa marked Zimbabwes 45th Independence Day in Gokwe with a speech brimming with self-congratulation, touting his governments supposed achievements in unity, economic growth, and national resilience. Yet, beneath the polished rhetoric lies a harsh reality for many Zimbabweans who continue to endure deepening poverty, chronic inflation, and deteriorating public services.\n\nAt the national event in Gokwe-Nembudziya, Midlands Province, Mnangagwa declared, Divisive and alarmist elements will never triumph over a nation such as ours; with a rich liberation history and born out of the blood of the brave sons and daughters of this sacred land. He painted critics as enemies of progress and assured that law enforcement would act in the best interests of Zimbabwelanguage that critics argue often serves to justify repression rather than reform.\n\nDespite his grand declarations, skepticism continues to grow over Mnangagwas ability to deliver real change. Many of the policies he celebrated remain either underfunded, inconsistently implemented, or disconnected from the urgent needs of the majority.\n\nDevolution and Inclusivity\n\nMnangagwa pointed to Gokwe as a symbol of his administrations commitment to devolution, claiming no one would be left behind. However, years into his presidency, many rural areas remain neglected, with poor infrastructure and minimal government presenceraising doubts about the sincerity of this leave no place behind mantra.\n\nEconomic Growth Projections\n\nThe President boasted of a projected 5.6% economic growth rate, driven by the mining sector and global commodity prices. But these figures, while encouraging on paper, mean little to ordinary citizens struggling with joblessness, runaway prices, and wages that dont match the cost of living. Economic growth under Mnangagwa has largely failed to translate into broad-based improvement in livelihoods.\n\nAgriculture and Food Security\n\nHe celebrated the Pfumvudza/Intwasa program and a predicted bumper harvest. Yet, many small-scale farmers have criticized the programs inconsistent support and delays in the distribution of inputs. In a country frequently battered by climate shocks, agricultural resilience remains a distant goal.\n\nInfrastructure and Disaster Recovery\n\nMnangagwa spoke of rehabilitating infrastructure damaged by extreme weather, including schools, clinics, and bridges. But in many communities, such projects have either stalled or never started, and local authorities often cite lack of funding and poor central coordination.\n\nCitizen Empowerment\n\nThe President touted efforts to empower women, youth, and vulnerable groups through financial schemes and training. However, these initiatives often reach only a small fraction of the population, and transparency in their implementation is minimal. For many, the promises of empowerment are more political slogans than tangible change.\n\nVision 2030\n\nMnangagwa again committed to his Vision 2030, pledging industrialization and modernization to uplift Zimbabwe into an upper-middle-income country. But with a stagnant industrial base, a crumbling healthcare system, and a restive population, critics question whether his administration has the vision, competence, or political will to meet that ambitious target.\n\nWhile the President continues to celebrate progress, Zimbabweans on the ground face worsening conditions. The gap between official narratives and lived realities is growingraising uncomfortable questions about who, if anyone, is truly benefiting from the so-called economic transformation. For many, Independence Day was less about pride and progress, and more a painful reminder of promises broken and futures deferred.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Dambudzo Mnangagwa marked Zimbabwe’s 45th Independence Day in Gokwe with a speech brimming with self-congratulation, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/mnangagwa-celebrates-economic-growth-as-citizens-suffering-worsens/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Celebrates Economic Growth As Citizens’ Suffering Worsens\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Matuke Turns Church Gathering Into Political Rally",
            "url": "https://www.zimeye.net/2025/04/20/matuke-turns-church-gathering-into-political-rally/",
            "content": "By A Correspondent\n\nLovemore Matuke, Minister of State Security and ZANU PF Politburo member, has come under fire for commandeering the pulpit at the African Apostolic Churchs Easter Conference in Gutu. Matuke used the platform to campaign for ZANU PF and glorify President Emmerson Mnangagwa, turning a sacred service into a political rally.\n\nThe move has been widely condemned by critics and church observers, who view it as a blatant violation of the churchs sanctity. A church elder described the incident as a hijack, saying, We came here for spiritual upliftment, not political sermons.\n\nMatukes actions were seen as an attempt to align the church with the ruling partys agenda, with many congregants expressing discomfort and skepticism. His call for churches to support government initiatives and combat drug abuse was perceived as politically loaded and insincere by some.\n\nThe incident has sparked a heated debate about the separation of church and state, with many questioning the appropriateness of using a place of worship for political gain. As one congregant put it, The church must remain a sanctuarynot a stage for politicians.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Lovemore Matuke, Minister of State Security and ZANU PF Politburo member, has come under fire for commandeering … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/matuke-turns-church-gathering-into-political-rally/\">Continue reading<span class=\"screen-reader-text\"> \"Matuke Turns Church Gathering Into Political Rally\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Mnangagwa Unfit to Lead Country: Geza",
            "url": "https://www.zimeye.net/2025/04/20/mnangagwa-unfit-to-lead-country-geza-2/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza has delivered a scathing assessment of President Emmerson Mnangagwas leadership, declaring him unfit to continue leading Zimbabwe.\n\nIn a strongly worded statement issued Saturday night, Geza openly called for Mnangagwa to step down immediately, accusing him of presiding over a failed administration.\n\nDont worry about the last kicks of a dying horse  Mnangagwa is going, and we are unrolling a plan of action, Geza said, hinting at a broader strategy by disgruntled liberation war veterans and activists to push for leadership change.\n\nGezas remarks reflect growing frustration among sections of the former liberation fighters, many of whom have become increasingly critical of Mnangagwas governance, economic mismanagement, and failure to deliver on promises made since taking power in 2017.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza has delivered a scathing assessment of President Emmerson Mnangagwa’s leadership, declaring him unfit … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/mnangagwa-unfit-to-lead-country-geza-2/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Unfit to Lead Country: Geza\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Mnangagwa Unfit to Lead Country: Geza",
            "url": "https://www.zimeye.net/2025/04/20/mnangagwa-unfit-to-lead-country-geza/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza has delivered a scathing assessment of President Emmerson Mnangagwas leadership, declaring him unfit to continue leading Zimbabwe.\n\nIn a strongly worded statement issued Saturday night, Geza openly called for Mnangagwa to step down immediately, accusing him of presiding over a failed administration.\n\nDont worry about the last kicks of a dying horse  Mnangagwa is going, and we are unrolling a plan of action, Geza said, hinting at a broader strategy by disgruntled liberation war veterans and activists to push for leadership change.\n\nGezas remarks reflect growing frustration among sections of the former liberation fighters, many of whom have become increasingly critical of Mnangagwas governance, economic mismanagement, and failure to deliver on promises made since taking power in 2017.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza has delivered a scathing assessment of President Emmerson Mnangagwa’s leadership, declaring him unfit … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/mnangagwa-unfit-to-lead-country-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Unfit to Lead Country: Geza\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        },
        {
            "title": "Corruption, Sex Scandals Rock Education Ministry",
            "url": "https://www.zimeye.net/2025/04/20/corruption-sex-scandals-rock-education-ministry/",
            "content": "By A Correspondent\n\nThe Ministry of Primary and Secondary Education is under fire following explosive allegations of rampant corruption and sex-based exploitation within its ranks, particularly in the promotion and transfer of school heads.\n\nSources within the education sector claim that promotions are no longer based on merit, with teachers reportedly paying bribes to secure appointments as school heads. In some disturbing instances, female teachers are allegedly being coerced into sexual relationships with superiors in exchange for promotions.\n\nIf you dont pay, or if you refuse to sleep with someone, youre going nowhere, said one teacher, who spoke on condition of anonymity out of fear of reprisal. Its no longer about qualifications or experience  its about who you know or what you can offer.\n\nThe situation in Masvingo Province has particularly raised eyebrows. Last month, only five candidates were invited for interviews to fill 80 vacant secondary school head posts. According to insiders, 30 candidates had applied, but 25 were disqualified under questionable circumstances.\n\nThis was a deliberate move, said a source familiar with the recruitment process. They wanted fewer candidates so that the remaining 75 positions can be handed out quietly through connections or bribes. The Provincial Education Director and Public Service Commission now have the power to decide who gets what  and thats where the deals are made.\n\nEducation experts have sounded the alarm, warning that such practices are eroding the quality and integrity of Zimbabwes education system.\n\nWhen promotions are no longer based on performance or ability, but on corruption and coercion, the entire education system suffers, said an education policy analyst. It demoralizes teachers, lowers standards, and undermines the future of our children.\n\nDespite the gravity of the allegations, the Ministry of Primary and Secondary Education has yet to issue an official response. As public outrage grows, stakeholders are demanding an independent investigation and accountability for those found to be abusing their positions.\n\nMeanwhile, educators across the country continue to work under a cloud of fear, manipulation, and mistrust  symptoms of a system many say is in urgent need of reform.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Ministry of Primary and Secondary Education is under fire following explosive allegations of rampant corruption and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/20/corruption-sex-scandals-rock-education-ministry/\">Continue reading<span class=\"screen-reader-text\"> \"Corruption, Sex Scandals Rock Education Ministry\"</span></a></p>",
            "time": "08:39",
            "date": "21 Apr 2025"
        }
    ]
}