{
    "news": [
        {
            "title": "Be Wary Of Fatigue",
            "url": "https://www.zimeye.net/2025/04/08/be-wary-of-fatigue/",
            "content": "Feeling tired behind the wheel? Its more than just uncomfortableits dangerous. Drowsy driving is a serious risk that can lead to accidents and harm, not only to you but also to others on the road.\n\nIf youre feeling fatigued, dont push through it. Take a break for a safer journey, is the crucial reminder from road safety experts. Whether youre on a long drive or simply feeling weary after a busy day, pulling over to rest can make all the difference.\n\nRemember, Every life matters. Fatigue impairs your reaction time, judgment, and focus, increasing the chances of making a critical mistake. Dont risk ittake a short break, stretch your legs, and recharge before continuing your journey.\n\nPrioritize safety, and let your well-being guide you to safer travels. If youre tired, stop, rest, and return to the road refreshed. It could save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Feeling tired behind the wheel? It’s more than just uncomfortable—it’s dangerous. Drowsy driving is a serious risk that can lead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/be-wary-of-fatigue/\">Continue reading<span class=\"screen-reader-text\"> \"Be Wary Of Fatigue\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Mnangagwa Spooks Torment Zanu PF Councillor For Sympathising With Jenarari Chiwenga",
            "url": "https://www.zimeye.net/2025/04/08/mnangagwa-spooks-torment-zanu-pf-councillor-for-sympathising-with-jenarari-chiwenga/",
            "content": "By A Correspondent\n\nState security agents are subjecting Zanu PF councillor Zivanai Zvada from Zaka to ongoing harassment for allegedly expressing sympathy towards Vice President Constantino Chiwenga.\n\nZvada, who represents Ward 24 in Zaka, was detained last week by the police on charges of inciting public disorder. Since then, State security agents have been closely monitoring and tormenting the Zanu PF official.\n\nA Zanu PF source revealed, The mans family is under surveillance as State Security agents fear he will influence the community to speak out against President Emmerson Mnangagwa.\n\nThe arrest follows a controversial post shared by Zvada in a WhatsApp group. The post included a message from political activist Never Masweraseyi that read, Mnangagwa must go, which reportedly sparked the authorities attention.\n\nThe situation highlights the ongoing tensions within Zanu PF as security agencies take a hardline stance against perceived dissent within the party ranks.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent State security agents are subjecting Zanu PF councillor Zivanai Zvada from Zaka to ongoing harassment for allegedly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/mnangagwa-spooks-torment-zanu-pf-councillor-for-sympathising-with-jenarari-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Spooks Torment Zanu PF Councillor For Sympathising With Jenarari Chiwenga\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Marry Mubaiwa To Hopewell Chin’ono: ‘I Don’t Even Know You Yet You’re Announcing You’ve Met Me’",
            "url": "https://www.zimeye.net/2025/04/08/marry-mubaiwa-to-hopewell-chinono-i-dont-even-know-you-yet-youre-announcing-youve-met-me/",
            "content": "By A Correspondent | ZimEye | Barely a week after he popularised a misleading claim that ZANU PF Spokesman Chris Mutsvangwa fled Blessed Geza to Dubai last Monday, journalist Hopewell Chinono has been challenged over another statement hes made.\n\nThis time the person questioning him is Vice President Constantino Chiwengas ex wife Marry Mubaiwa, who Chinono claims he once met at a local clinic.\n\nThe mother of five is battling a barrage of false statements beingmade by people who are claiming to be sympathetic to her cause.\n\nIn a post, Chinono claims he once met Marry at a clinic where she was with an unnamed pastor, and some family members.\n\nBut speaking to ZimEye, Miss Mubaiwa says:\n\nWhich pastor is this Hopewell says he saw me with?\n\nWhy is Hopewell lying that I met him? Ive never met him in my life, and I dont even know him.\n\nIve never spoken with him before, says Marry Mubaiwa.\n\nShe also adds: What does he hope to gain from telling people that he met me? Who is sending him to lie that hes spoke to me before, because Ive met him, its all a lie?, she charges.\n\nMr Chinono you say you met me, where is the picture or recording, and can you name the pastor you say you saw me with?, she asks.\n\nShe goes on to ask- In our church we have captains, we dont have pastors. So theres no way you would have met me with a pastor.\n\nIve never asked for your help. I dont need your help, Ive been doing just fine without you, concludes Miss Mubaiwa.\n\nHopewell Chinono was reached for comment.\n\nSIDE CONTEXT | Before his sudden death, the senior Journalist Geoff Nyarota instructed Simba Chikanza to deploy his 25 years-insurance-industry-expertise to finalise his (Nyarotas) bigger-than-Willowgate investigation on Hopewell Chinono, whos Nyarotas boasting-1996 50,000-sportscar-ex-employee whod insulted him on social media and falsely accused an NHS whistleblower of what shes never done. Aside corrupting the army so they falsely civil society of tension, hes used journalism to assist Mnangagwa extend his illegal presidency. Writes Chikanza,My investigatory expertise used to run Zimnat, Botswana Insurance, and Lion Of Uganda at 23 years age (when this Daddy character was changing his own name 3 times in under 2 years : 2000-3), is now going to saving lives and stopping large-scale economic wrongdoing. I wont let Geoff and the people down.\n\n[Follow some of my investigations which include GoldMafia, Banyure Gatwick Airport Hacking, Bomb Attack On Chitepo, Bomb Attack On Chiwenga, Edgar Lungu 2021, Matemadanda Poison Attack, Muchinguri COVID19 Deaths Scam, Auxillia Mnangagwa Armed Robber Expose] \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Barely a week after he popularised a misleading claim that ZANU PF Spokesman Chris … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/marry-mubaiwa-to-hopewell-chinono-i-dont-even-know-you-yet-youre-announcing-youve-met-me/\">Continue reading<span class=\"screen-reader-text\"> \"Marry Mubaiwa To Hopewell Chin’ono: ‘I Don’t Even Know You Yet You’re Announcing You’ve Met Me’\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Machakaire Now A Free Man After 36-Day Detention For Praising Geza",
            "url": "https://www.zimeye.net/2025/04/08/machakaire-now-a-free-man-after-36-day-detention-for-praising-geza/",
            "content": "By A Correspondent| A 34-year-old man is now enjoying his freedom after the National Prosecuting Authority (NPA) stopped prosecuting him after spending more than one month in detention on charges of undermining authority of or insulting President Emmerson Mnangagwa.\n\nAlfred Ngonidzaishe Machakaire, who resides in Gowo village under Chief Makoni in Inyati in Makoni District in Manicaland province, had spent 36 days in both police cells and at Rusape Prison after he was arrested on 24 February 2025 by Zimbabwe Republic Police officers, who charged him with undermining authority of or insulting President Mnangagwa as defined in section 33(2)(a)(b) of the Criminal Law (Codification and Reform) Act.\n\nAccording to prosecutors, Machakaire undermined authority of and insulted President Mnangagwa when he was involved in a verbal altercation withLeonard Chidemo, the ruling ZANU PF political party Councillor for Ward 5 in Makoni North constituency in Makoni District in Manicaland, who was drinking beer at Mugadza Bottle Store at Runyange Business Centre in Chendambuya, where he allegedly asked Chidemo to buy him some beer.\n\nChidemo reportedly told Machakaire that he did not have some money to buy him beer and this did not go down well with him and he started shouting at the ZANU PF political party Councillor.\n\nProsecutors said Machakaire, who was represented byLeonard ChigadzaofZimbabwe Lawyers for Human Rights, undermined authority of or insulted President Mnangagwa by uttering the following words; You Chidemo, down with Mnangagwa, I am Geza, on the 31st, the country will be fine, Mnangagwa is a vagina, you have caused the death of people in the country.\n\nAccording to prosecutors, Machakaire acted unlawfully when he allegedly uttered the insulting words and also praised Geza, a veteran of the liberation war and a ZANU PF political party central committee member, who was recently expelled from the ruling political party, after opposing manoeuvres to amend the Constitution and extend President Emmerson Mnangagwas tenure beyond two terms.\n\nOn 1 April 2025, Machakaire was a relieved man after the NPA declined to prosecute him and he was released from prison custody.\n\nMachakaire is the latest person to be set free after the NPA recently ceased prosecution ofIshmael Maukazuva, the Councillor for Ward 12 in Chikomba West constituency in Mashonaland East province, who had been in detention after he was arrested by ZRP officers and charged with undermining authority of or insulting President Emmerson Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A 34-year-old man is now enjoying his freedom after the National Prosecuting Authority (NPA) stopped prosecuting him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/machakaire-now-a-free-man-after-36-day-detention-for-praising-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Machakaire Now A Free Man After 36-Day Detention For Praising Geza\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Advocate Chamisa Exposes Stinking Corruption In Zanu PF",
            "url": "https://www.zimeye.net/2025/04/08/advocate-chamisa-exposes-stinking-corruption-in-zanu-pf/",
            "content": "By A Correspondent\n\nOpposition leader Advocate Nelson Chamisa has publicly condemned widespread corruption within Zanu PF, accusing the party of rampant looting and mismanagement.\n\nChamisa specifically pointed to President Emmerson Mnangagwa as the main figure behind the corruption that has plagued the country.\n\nIn his statement, Chamisa said:\n\nCORRUPTION STINKSA FISH ROTS FROM THE HEAD. For almost 27 years, Ive stood firm against corruption in all its forms. Not for applause, not for likes, or to trend, but because I believe Zimbabweans deserve better. Its no longer enough to simply point out the rotwe all live it. The time has come to FIX IT.\n\nHe went on to emphasize the need for systemic change, not just a change of leadership. He added:\n\nIt begins with changing the system that enables it. Not just a change of faces, but a total renewal of values and vows.\n\nChamisa reiterated his vision for a government that truly serves the people, focusing on progress and empowerment. He continued:\n\nOur vision is for a transformational and developmental government that servesnot steals. That buildsnot bleeds. That empowersnot impoverishes.\n\nHe concluded by calling corruption a betrayal of Zimbabwes liberation values and a sin against God, urging Zimbabweans to join him in the fight against it:\n\nCorruption is not just a crime. It is a sin against God. Its a betrayal of the liberation values. And the cure starts with US ALL. Support this vision!\n\n#SomethingNew #NextZimbabwe\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Advocate Nelson Chamisa has publicly condemned widespread corruption within Zanu PF, accusing the party of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/advocate-chamisa-exposes-stinking-corruption-in-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Advocate Chamisa Exposes Stinking Corruption In Zanu PF\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Zanu PF Boss Accuses Geza Of Stealing Clothes During Liberation War",
            "url": "https://www.zimeye.net/2025/04/08/zanu-pf-boss-accuses-geza-of-stealing-clothes-during-liberation-war/",
            "content": "By A Correspondent\n\nZANU PF National Political Commissar Munyaradzi Machacha has made explosive claims against Blessed Runesu Geza, accusing him of dishonesty and greed during the liberation war.\n\nMachacha alleged that Geza, a former ZANU PF Central Committee member, engaged in theft while serving in Mozambique, stealing goods from a logistics warehouse and reselling them to villagers.\n\nThese allegations come after Gezas fallout with the ruling party over its push to amend the constitution to allow President Emmerson Mnangagwa a third term.\n\nGeza has previously faced accusations of serious crimes, including rape, murder, and theft.\n\nThe timing of these new accusationsafter his break with the partyhas raised questions.\n\nIn a video shared by ZANU PF on social media, Machacha, who claims to be related to Geza, addressed party members at an undisclosed location, revealing his family connection to the accused. He said:\n\nI acknowledge that Geza is my uncle. You heard him rant that I am his nephew, yes, its true. I am not speaking of a person that I am not familiar with. We were together at Chimoio during the war.\n\nMachacha went on to claim that Geza never fought at the warfront. Instead, he allegedly spent his time stealing from the camps logistics warehouse. According to Machacha, Geza would steal clothes intended for guerrilla fighters and sell them in local villages, or exchange them for alcohol and cigarettes. He said:\n\nThere was a big hall which served as a logistics warehouse where clothes for guerrilla fighters were stored. Bombshell would go there and steal jeans and shirts, which he would go and sell in the villages or exchange for beer or cigarettes.\n\nHe literally never spent a single day in camp. Each morning, he would go around villages and get chicken, beer, cigarettes, and Saraveji.\n\nMachacha also stated that Geza faced punishment for his actions, including being flogged by security personnel, but remained unrepentant. He claimed:\n\nWhenever he was caught stealing, he would be given corporal punishment, flogged on the buttocks by security details at the camp. But he never learned his lesson.\n\nMachacha further accused Geza of dishonestly claiming to be the son of nationalist Robert Mugabe while in Romania for military training, which led to special treatment from Romanian authorities. He said:\n\nThe correct fact was that Gezas elder brother was married to Mugabes sister. He would be chauffeured in limousines around Romania.\n\nMachacha also alleged that Geza had tricked FRELIMO soldiers during a military operation in Mozambique by intoxicating them, then stealing engines from their Scania trucks and smuggling them into Zimbabwe. He said:\n\nGeza would get the FRELIMO soldiers drunk and then steal the engines from their Scania trucks, which he would smuggle back into Zimbabwe.\n\nIn addition, Machacha accused Geza of raiding white commercial farmers cattle during the land reform program and taking control of abattoirs, where he slaughtered and sold the stolen cattle. He further alleged that Geza looted diamonds during the Chiadzwa diamond rush while serving as a security officer for Mbada Diamonds.\n\nLastly, Machacha suggested that Gezas fallout with President Mnangagwa began when he was disqualified from running in the 2018 elections for the Sanyati constituency due to a pending rape case involving a local schoolgirl.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF National Political Commissar Munyaradzi Machacha has made explosive claims against Blessed Runesu Geza, accusing him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/zanu-pf-boss-accuses-geza-of-stealing-clothes-during-liberation-war/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Boss Accuses Geza Of Stealing Clothes During Liberation War\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "School Head Steals Examination Fees",
            "url": "https://www.zimeye.net/2025/04/08/school-head-steals-examination-fees/",
            "content": "By A Correspondent\n\nA Shurugwi school head, Emmanuel Hove, has been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) for allegedly converting $1,745 in Zimsec examination registration fees to personal use.\n\nThe 52-year-old Dombojena Primary School head was remanded in custody by Magistrate Patricia Gwetsai.\n\nThe theft was discovered by deputy head Kundai Pedzi, who attempted to register pupils for the examinations.\n\nParents and guardians of 77 pupils had paid the registration fees between January and March 2024, totaling $1,745.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Shurugwi school head, Emmanuel Hove, has been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) for allegedly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/school-head-steals-examination-fees/\">Continue reading<span class=\"screen-reader-text\"> \"School Head Steals Examination Fees\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Mliswa Claims Mnangagwa Is 100% Fit…",
            "url": "https://www.zimeye.net/2025/04/08/mliswa-claims-mnangagwa-is-100-fit/",
            "content": "By A Correspondent\n\nTemba Mliswa, the former ZANU PF Mashonaland West Provincial Chairman, has strongly defended President Emmerson Mnangagwa, asserting that the ruling party frontman is in excellent health.\n\nThe comments followed a video from Mnangagwas speech at the 3rd Africa Education Summit 2025 in Victoria Falls, which quickly gained attention on social media.\n\nIn the clip, Mnangagwa is seen delivering humorous remarks and making light-hearted gestures in Shona, leaving some international attendees confused by the playful tone.\n\nThe viral video sparked accusations from Jealousy Mawarire, who criticized Mnangagwas inner circle for taking advantage of him. Mawarire suggested that Mnangagwa should remain in office instead of being advised to step down and take rest.\n\nIn response to these assertions, Mliswa took to X (formerly Twitter) on Monday to assert that Mnangagwa is neither frail nor unwell. He emphasized that the president remains mentally sharp for his age. Mliswa wrote:\n\nAfter the Geza uprising fizzled out, some people have started spreading stories of a fragile and sick president. Let me clarify: these rumors are far from the truth. The president is as sharp as ever for someone of his age.\n\nYou cant just create a narrative and expect people to believe it. While its natural to have differing opinions, its more productive to focus on strengthening your own party or campaign rather than attacking an elected leader with baseless claims.\n\nI had the opportunity to interact with the president recently at an event at his farm, and he was full of energy. He even danced to traditional music, which is hardly the behavior of someone unwell.\n\nIve never been one to engage in sycophantic behavior, even during my time as an MP. My criticism of the government has always been constructive. The difference is that those who accuse me of bootlicking thrive on negativity and insults, something I refuse to engage in.\n\nThe narrative of the president being sick is completely unfounded. Just recently, at the education conference in Victoria Falls, he made a joke that fit perfectly within the context of his speech.\n\nHowever, those who werent present selectively edited the video and used it to claim that hes incompetent. Who does that? For those of us who were there, including foreign guests, the meaning was clear and had nothing to do with some amateur psychological analysis.\n\nYou cant manipulate a story by cherry-picking facts to suit your agenda, just as you cant edit a video out of context and claim it proves something it doesnt. The president is well aware of his health, which is why he has hinted at stepping down in 2028.\n\nSpreading false narratives wont hasten his exit. Those with political insight should focus on building real grassroots support. Get involved with communities and prepare for 2028 elections instead of hiding behind social media and telling comforting lies.\n\nThe opposition has been trapped in this cycle for years, thinking that the 180,000 people on X represent the whole country. When the elections come, theyll be in for a rude awakening. Right now, as someone once said, the opposition is dead as a dodo.\n\nFor those overseas, stop relying on false claims about the presidents health. Instead, start making plans to return home and vote. Living on a foundation of deception and unfulfilled promises wont get you far. Its time to create your own path.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Temba Mliswa, the former ZANU PF Mashonaland West Provincial Chairman, has strongly defended President Emmerson Mnangagwa, asserting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/mliswa-claims-mnangagwa-is-100-fit/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Claims Mnangagwa Is 100% Fit…\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Veteran State Media Journalist Dies",
            "url": "https://www.zimeye.net/2025/04/08/veteran-state-media-journalist-dies/",
            "content": "By James Gwati-Veteran journalist and senior New Ziana staffer,Herbert Mutugwi has died.\n\nHe was 58.\n\nMutugwi, a prominent figure in Zimbabwean state media, collapsed and died at work on Monday.\n\nHis sudden death has cast a pall over the media fraternity, with colleagues mourning the loss of a seasoned journalist, mentor, and friend.\n\nThough he had recently battled illness, Mutugwi had recovered and returned to duty, determined to continue serving the profession he had dedicated his lifeto.\n\nIn a statement, the Zimbabwe Mass Media Trust (ZMMT), the parent company of New Ziana, expressed deep sorrow at his passing.\n\nThe Board of Trustees of the Zimbabwe Mass Media Trust, along with management and staff, extend our heartfelt condolences toHerbertsfamily and friends during this difficult time,said ZMMT executive secretary Ray Mungoshi.\n\nHerbert was a valuable member of our team and played a crucial role in the revival efforts of New Ziana.His experience, expertise, and unparalleled ability to mentor reporters will be deeply missed. We have lost a true champion of journalism. His legacy will live on through the many lives he touched.\n\nWith nearly four decades of journalistic service, Mutugwi was among the last of a rare generation of newsroom veteranspillars of institutional memory and guidance in an evolving media landscape.\n\nHe began his journalism journey in 1987 after graduating from Harare Polytechnic College with a Diploma in Mass Communications.\n\nHe joined theChroniclenewspaper as a cadet reporter and rosethrough the ranksto become assistant news editor by 1992a position he held with distinction until 1997.\n\nThat year, he assumed the role of news editor at theManica Post, where he remained for six years, overseeing one of the most crucial editorial portfolios in the industry.\n\nIn 2010, after leaving the Zimpapers group, Mutugwi joined New Ziana and served as editor of theNehanda Guardianin MashonalandCentral,before being transferred to edit theMasvingo Star, a flagship publication in the New Ziana stable.\n\nMore recently, he worked at theagencyshead office, where he focused on mentoring young reporterspassing on the wisdom of years spent navigating the newsroom.\n\nSoft-spoken yet firm, meticulous in his craft, and unwavering in his dedication, Mutugwiwas reveredby peers and protgs alike. His death marks the end of an era.\n\nFuneral arrangements willbe announcedin due course following consultations with the family.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati-Veteran journalist and senior New Ziana staffer, Herbert Mutugwi has died.  He was 58. Mutugwi, a prominent figure in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/veteran-state-media-journalist-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran State Media Journalist Dies\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        },
        {
            "title": "Information Minister “Fired” Over Party Protocol Breach",
            "url": "https://www.zimeye.net/2025/04/08/information-minister-fired-over-party-protocol-breach/",
            "content": "By Munacho Gwamanda-Information Minister Jenfan Muswere is facing backlash from within Zanu PF for allegedly bypassing internal party procedures.\n\nIn a strongly worded letter dated7 April2025Zanu PF spokesperson Christopher Mutsvangwa effectivelyfiredMuswere, accusing him of using state mediato prematurely announce party election results without properauthorisation.\n\nIn the letteraddressedto Muswere, Mutsvangwa lambasted the minister for allegedly bypassing party procedures by allowing state broadcaster ZBC andThe Heraldto announceWomensLeague provincial election results before the partyhadofficially ratified them.The electionswere heldin Manicaland onApril 6.\n\nDescribing the announcement asirregularand an attempt toupend standard internal consultations,Mutsvangwa wrote that the statement aired and published by Muswere wasof no consequence.\n\nHe warned that the correct and final position would only be communicated by his departmentas therightful party mouthpieceeffectively challengingMusweresauthority and overstepping into ministerial turf.\n\nBehind this clash lies a deeper political contest.\n\nChristopher Mutsvangwa, who claims to be a war veteran, has, in recent years,positioned himself as a power broker and potential presidential contender.\n\nThough he has not openly declared his intentions, his increasing assertiveness in party affairs and sharp political commentary hasbeen interpretedas part of a campaign to carve out a post-Mnangagwa path for himself.\n\nInsiders say Mutsvangwa is emboldened by factional fractures within Zanu PF, especially as President Emmerson Mnangagwa faces growing opposition over his controversial push to extend his term beyond 2028.\n\nMutsvangwais believedto be rallying support among war veterans and the disenchanted elitewho view him as a more charismatic alternative toMnangagwasincreasingly authoritarian rule.\n\nOnce seen as a close ally of Mnangagwa,Mutsvangwasrelationship with the president has grown cold, especially amid whispers that Mnangagwa is grooming younger loyalists like Muswere while sidelining seasoned war veterans.\n\nSources within the party allege that Mutsvangwa has long felt betrayed by Mnangagwa, who he helped ascend to power in the aftermath of the 2017 military coup that ousted Robert Mugabe.\n\nThe friction hasbeen compoundedby competing networks of patronage and a toxic mix of personal and political scandals.\n\nOne of the most salaciousand damagingrumours fuelling the rift involves claims that Monica Mutsvangwa,Christopherswife and a senior Zanu PF official in her own right, once had an intimate relationship with Mnangagwa that allegedly resulted in a child.\n\nWhile the claim has never been substantiated andis widely seenas political gossip, its circulation inbothinternal party discussions and dissident online platforms has intensified the hostility between thetwocamps.\n\nJenfan Muswere, the youthful Minister of Information and Zanu PF MP forMakoni,is perceived to beMnangagwasprotg.\n\nHis growing prominenceespecially in state mediahas made him a target for Mutsvangwa, who sees Muswere as a threat to his influence and a symbol ofMnangagwasefforts to bypass traditional party structures.\n\nMuswere wants to be a Mnangagwa darlingandMutsvangwa is not happy about that,a senior Zanu PF official confided.This is no longer about media policyitsabout who controls the narrative as Mnangagwa tries to outflank his opponents inside the party.\n\nThe letter to Muswere may be the clearest sign yet that Mutsvangwais doneplaying nice.\n\nBy flexing his authority as the official party spokesperson, Mutsvangwa is reasserting control over internal communications while sending a chilling warning to those he views as presidential lackeys.\n\nAs Zanu PF heads toward a potentially explosive elective congress, the battle lines between the war veteran class andMnangagwasinner circle arebeing drawnever more clearly.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Information Minister Jenfan Muswere is facing backlash from within Zanu PF for allegedly bypassing internal party procedures. In … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/08/information-minister-fired-over-party-protocol-breach/\">Continue reading<span class=\"screen-reader-text\"> \"Information Minister “Fired” Over Party Protocol Breach\"</span></a></p>",
            "time": "06:31",
            "date": "09 Apr 2025"
        }
    ]
}