{
    "news": [
        {
            "title": "Illegal Miners Cause Havoc In Zvishavane",
            "url": "https://www.zimeye.net/2025/03/02/illegal-miners-cause-havoc-in-zvishavane/",
            "content": "By A Correspondent\n\nA significant crack has appeared on a section of Zvishavanes Novale Road, a direct result of illegal mining activities. This development has raised serious safety concerns for both residents and travelers.\n\nHowever, illegal mining is obstructing the progress intended by this initiative.\n\nZvishavane District Development Coordinator, Mr. Darlington Chokera, has strongly condemned the illegal mining activities occurring near residential areas and vital public infrastructure. He emphasized the need for coordinated efforts to tackle this issue.\n\nWe are launching an aggressive operation to remove these offenders, and we urge the community to assist by reporting any illegal or dangerous activities like this to the authorities, he stated.\n\nNovale Road is an essential route that connects various communities and businesses within Zvishavane.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A significant crack has appeared on a section of Zvishavane’s Novale Road, a direct result of illegal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/illegal-miners-cause-havoc-in-zvishavane/\">Continue reading<span class=\"screen-reader-text\"> \"Illegal Miners Cause Havoc In Zvishavane\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "Three ZESA Workers Use Fake Certificates To Get Employment",
            "url": "https://www.zimeye.net/2025/03/02/three-zesa-workers-use-fake-certificates-to-get-employment/",
            "content": "By A Correspondent\n\nThree employees of the Zimbabwe Power Company (ZPC) in Hwange have been taken to court for allegedly using counterfeit qualifications to secure employment with the power utility a decade ago.\n\nThe trio, Anthony Mukarati, Lloyd Tichafa Mutyanda, and Posent Ngwenya, are accused of submitting fake documents, purportedly issued by the former Ministry of Manpower Development, to land positions as riggers at ZPC. They reportedly enjoyed employment benefits for 10 years based on these forged certificates.\n\nAll three, residents of Hwange, were found in possession of counterfeit Class One Rigging Certificates. The state claims that the three individuals were responsible for producing and presenting the falsified qualification documents to ZPC during their initial employment application process.\n\nThe state further alleges that, over the years, the trio caused ZESA a financial loss of more than US$65,000 in wages and other earnings.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Three employees of the Zimbabwe Power Company (ZPC) in Hwange have been taken to court for allegedly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/three-zesa-workers-use-fake-certificates-to-get-employment/\">Continue reading<span class=\"screen-reader-text\"> \"Three ZESA Workers Use Fake Certificates To Get Employment\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "What do you think Trump is saying of Mnangagwa",
            "url": "https://www.zimeye.net/2025/03/02/what-do-you-think-trump-is-saying-of-mnangagwa/",
            "content": "What do you think Trump is saying of Mnangagwa?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "Crocodile Kills Toddler",
            "url": "https://www.zimeye.net/2025/03/02/crocodile-kills-toddler/",
            "content": "Tragedy in Nkayi: 13-Year-Old Boy Killed in Crocodile Attack While Swimming in Gweru River\n\nNkayi, Matabeleland North  March 2, 2025  A tragic incident unfolded in Sibangilizwe Village, Nkayi District, after a 13-year-old boy, Louise Mpofu, lost his life in a crocodile attack while swimming in the Gweru River during a fishing expedition with friends.\n\nThe harrowing event took place when Louise, a Grade Five learner, and two of his friends from the village decided to take a swim after a fishing session. Their fun quickly turned into horror when a crocodile suddenly attacked Louise, dragging him underwater as he screamed for help.\n\nDesperate Search Ends in Tragedy\n\nAccording to Matabeleland North police spokesperson Inspector Glory Banda, the boys friends ran home to alert his father and other villagers. A search team immediately rushed to the river, but by the time they arrived at 3 PM, only Louises clothes were found on the riverbank.\n\nDespite a thorough search, the boys body was not immediately located, forcing the villagers to resume the search the following day. The tragic discovery was made at 2 PM, approximately three kilometers downstream from where the attack had occurred.\n\nThe body had a missing left leg and several crocodile bites on the right leg and waist, said Insp Banda, confirming that the attack was fatal.\n\nThis incident has left the community in mourning, with calls for greater awareness about crocodile-infested waters and safety measures for villagers who rely on rivers for fishing and other daily activities.\n\nSurviving a Crocodile Attack: Expert Advisory on Emergency Response\n\nWhile crocodile attacks are rare but deadly, knowing how to respond in such a crisis can mean the difference between life and death. Heres what you should do if you ever find yourself under attack by a crocodile:\n\n1. Avoid High-Risk Areas Stay away from known crocodile-infested waters, especially in rivers, lakes, and swamps where crocodiles are common. Be cautious when fishing, bathing, or washing clothes near water bodies. Always be on the lookout for warning signs or local reports of crocodile activity.\n\n2. What to Do if a Crocodile Attacks You\n\nIf a crocodile grabs you, immediate action is critical: Fight Back Aggressively Aim for the eyes, nostrils, and throatthese are the most sensitive areas. Use any available object, like a fishing rod, stick, or rock, to jab or hit the crocodile. If you have nothing, use your fingers to gouge its eyes. Prevent the Death Roll Crocodiles kill by biting and rolling their prey underwater to drown it. If caught, try to roll with the crocodile instead of resistingthis may reduce severe injuries. Hold Its Jaws Shut A crocodiles bite force is strong, but its muscles to open its mouth are weak. If possible, hold the jaws shut and try to pry yourself free. Stay Above Water and Get to Shore If you can escape, swim away quickly but calmly to avoid attracting further attacks. Once on land, move as far away as possiblecrocodiles can run short distances on land.\n\n3. Emergency Response After an Attack Stop the Bleeding  If bitten, use cloth or a belt as a tourniquet to control bleeding. Seek Medical Help Immediately  Crocodile bites can cause severe infections due to bacteria in their mouths. Report the Incident  Alert local authorities or wildlife agencies to prevent future attacks.\n\n4. Long-Term Safety Measures Educate children and community members about the dangers of swimming in crocodile-infested waters. Install warning signs and barriers near dangerous rivers. Work with wildlife authorities to monitor crocodile populations and relocate aggressive crocodiles.\n\nFinal Thoughts\n\nThe tragic death of Louise Mpofu is a painful reminder of the dangers posed by crocodile-infested waters. While Zimbabwean rivers provide essential resources for many communities, awareness and precautionary measures are vital to prevent further loss of life.\n\nAuthorities and communities must work together to enhance water safety education, introduce protective measures, and ensure safe access to natural water bodies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tragedy in Nkayi: 13-Year-Old Boy Killed in Crocodile Attack While Swimming in Gweru River Nkayi, Matabeleland North – March 2, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/crocodile-kills-toddler/\">Continue reading<span class=\"screen-reader-text\"> \"Crocodile Kills Toddler\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "“Gore reGudo” Explained",
            "url": "https://www.zimeye.net/2025/03/02/gore-regudo-explained/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "Sexism Scandal Rocks Zanu PF",
            "url": "https://www.zimeye.net/2025/03/02/sexism-scandal-rocks-zanu-pf/",
            "content": "By A Correspondent\n\nPressure groups in Zimbabwe have sharply criticized the ruling Zanu PF party for reducing women to mere objects of sexualization.\n\nThis backlash comes after the circulation of a controversial video on social media, in which a woman known as Mai Welly is seen performing suggestive dance moves in front of enthusiastic Zanu PF supporters.\n\nThe video quickly went viral, sparking outrage among various womens organizations and activists, who argue that such portrayals contribute to the objectification of women and perpetuate harmful stereotypes.\n\nWomen are not objects. The stereotype portrayal of women as mere sexual beings is uncalled for in any modern society, said one spokesperson from a womens organization based in Masvingo. This kind of behavior diminishes the dignity of women and sends the wrong message to the younger generation about gender equality and respect.\n\nActivists have called for a collective effort to promote respectful and empowering representations of women in both politics and the media. Some have also expressed concerns over the political exploitation of womens bodies, arguing that it distracts from more pressing issues such as gender equality, womens rights, and economic empowerment.\n\nAs the video continues to draw criticism, it remains to be seen how the ruling party will respond to the accusations and whether they will take steps to address these concerns.\n\nBeyond Embarrassing: Why Does Zanu-PF Reduce Women to Booty-Shaking Objects?pic.twitter.com/bNoePv50a2\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Pressure groups in Zimbabwe have sharply criticized the ruling Zanu PF party for reducing women to mere … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/sexism-scandal-rocks-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Sexism Scandal Rocks Zanu PF\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "Minister Says Journalists Are Free But They’re Not",
            "url": "https://www.zimeye.net/2025/03/02/minister-says-journalists-are-free-but-theyre-not/",
            "content": "Zimbabwes Information Minister Calls for Journalists Protection but Warns Against Overthrow Advocacy\n\nHarare, March 2, 2025  Zimbabwes Minister of Information, Publicity, and Broadcasting Services, Dr. Jefran Muswere, has emphasized the need for consistent protection of journalists in the country, while also drawing a firm line against media content that advocates for the overthrow of a democratically elected government.\n\nSpeaking at the third-anniversary celebration of 3Ktv at their Harare offices on Friday, Dr. Muswere underscored the importance of media freedom within Zimbabwes constitutional framework. He highlighted that Sections 61 and 62 of the Constitution guarantee freedom of expression and access to information, but do not permit any calls for the removal of a legitimate government.\n\nMedia Freedom Must Be Guarded Jealously\n\nWe should also be unequivocally clear regarding the supreme law of the country; the right to broadcast the overthrow of a legitimate and democratic government does not exist within our Constitution, Dr. Muswere said.\n\nHe reiterated that media freedom and freedom of expression should be jealously guarded, and that journalists must be consistently protected to perform their duties without interference.\n\nDr. Muswere also reaffirmed the governments commitment to working with the Zimbabwe Media Commission (ZMC) and other stakeholders to support media houses and ensure their sustainable growth.\n\nEmphasis on Media Ethics and Responsibility\n\nWhile pledging government support for the media industry, Dr. Muswere stressed that journalism must be built on ethics, credibility, and factual accuracy.\n\nWe are the architects of our destiny, which is why the President has consistently emphasized Nyika inovakwa nevene vayo (a nation is built by its own people). Every member of the fourth estate bears this responsibility, he noted.\n\nHe urged journalists to prioritize verification of information and ensure that their sources are credible. The robustness and growth of the media industry rely on professional integrity and adherence to ethical journalism, he added.\n\nGovernments Commitment to Media Development\n\nDr. Muswere acknowledged the legislative, policy, and infrastructure initiatives the government has undertaken to promote media diversity and plurality. He also highlighted ongoing efforts to amend the Broadcasting Services Act, saying the government recognizes the challenges that have hindered the growth of Zimbabwes media sector.\n\nIn overcoming adversity, success lies in leadership, planning, organization, and resource management. The evolution of the media industry will depend on its ability to embrace modern technology and human capital development, he said.\n\nHe commended 3Ktv for its strides in technological innovation and content creation, calling it an example of how Zimbabwes media sector can adapt and grow towards the national Vision 2030 goal of an upper middle-income society with a well-informed population.\n\nMedias Role in Nation-Building\n\nDr. Musweres remarks come amid ongoing discussions on the balance between media freedom and national stability. While journalists and media houses are encouraged to operate freely, the government has made it clear that certain lines should not be crossed, particularly in matters of national security.\n\nHis comments have sparked mixed reactions, with media watchdogs calling for greater press freedom protections, while government officials maintain that responsible journalism must align with constitutional limits.\n\nAs Zimbabwe continues to refine its media laws and policies, stakeholders in the industry will be closely watching how government actions align with its promises of press freedom and journalist protection.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabwe’s Information Minister Calls for Journalists’ Protection but Warns Against Overthrow Advocacy Harare, March 2, 2025 – Zimbabwe’s Minister of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/minister-says-journalists-are-free-but-theyre-not/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Says Journalists Are Free But They’re Not\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "Secret Beer Factory Busted By Police",
            "url": "https://www.zimeye.net/2025/03/02/secret-beer-factory-busted-by-police/",
            "content": "Illicit Brewery Busted in Harare by Zimbabwe Republic Police\n\nBy Dorrothy Moyo | ZimEye | Harare, March 1, 2025  In a major crackdown on illegal alcohol production, the Zimbabwe Republic Police (ZRP) has exposed and dismantled an underground brewery operating in Southerton, Harare. Authorities conducted a raid at the illicit facility, which was producing unregulated alcoholic beverages in large quantities.\n\nMassive Underground Brewery Exposed\n\nLaw enforcement officers, accompanied by officials, were seen inspecting large containers filled with fermenting substances used in the production of illicit alcohol. The unlicensed brewery had multiple makeshift fermentation tanks containing an unknown mixture of ingredients. Authorities confiscated barrels of liquid suspected to be part of an illegal brewing operation.\n\nIn images shared by the ZRP, police officers and investigators were seen uncovering large plastic drums, vats of fermenting alcohol, and packaged illicit beverages ready for distribution. The operation was reportedly running without proper health and safety regulations, raising serious public health concerns.\n\nPublic Concerns and Social Media Reactions\n\nFollowing the police raid, Zimbabweans have taken to social media to express mixed reactions to the discovery. Some citizens applauded the police for cracking down on illegal businesses, while others questioned why the facility was well-organized and appeared to be operating systematically.\n\nOne social media user commented, Why does the place look smart and well-managed, yet its an underground operation? Why are they not legalizing their business? Another questioned why the authorities had not disclosed the name and owners of the illicit brewery.\n\nMeanwhile, some expressed frustration over the governments focus on such operations while corruption and larger economic challenges persist in Zimbabwe. Why ignore ZANU-PF overground corruption, murder, and thieving all over Zimbabwe? one user wrote, implying that government officials should focus on broader systemic issues.\n\nWhats Next?\n\nAuthorities have yet to confirm if arrests were made during the raid or the exact charges that will be brought against those involved. Investigations are expected to continue, with authorities urging the public to report similar operations that could pose health risks.\n\nThe discovery raises further questions about Zimbabwes underground economy and the growing demand for cheap, illicit alcohol. As the government intensifies crackdowns on illegal businesses, many are calling for a more comprehensive approach that includes regulatory reforms to support legitimate local brewers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Illicit Brewery Busted in Harare by Zimbabwe Republic Police By Dorrothy Moyo | ZimEye | Harare, March 1, 2025 – … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/secret-beer-factory-busted-by-police/\">Continue reading<span class=\"screen-reader-text\"> \"Secret Beer Factory Busted By Police\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "Trump, Zelensky Clash in Heated Oval Office Meeting…",
            "url": "https://www.zimeye.net/2025/03/02/trump-zelensky-clash-in-heated-oval-office-meeting/",
            "content": "By A Correspondent\n\nWASHINGTON, Feb 28 (Reuters)  Ukrainian President Volodymyr Zelenskys meeting with U.S. President Donald Trump at the White House on Friday ended in a heated confrontation, with both leaders exchanging sharp words in front of the media regarding the ongoing conflict with Russia.\n\nZelensky had viewed the Oval Office meeting as an opportunity to persuade the United States to continue opposing Russian President Vladimir Putin, who initiated the invasion of Ukraine three years ago. However, the meeting quickly escalated when Vice President JD Vance criticized Zelensky, accusing him of being disrespectful. Vance remarked, You should be thanking the president. Trump joined in, telling Zelensky, Youre gambling with World War III. The exchange culminated with Zelensky being asked to leave, according to a U.S. official.\n\nAn agreement between Ukraine and the United States to jointly develop Ukraines rich natural resources, which Kyiv and its European allies had hoped would improve relations, was left unsigned and remains in limbo.\n\nIn response, European leaders quickly voiced their support for Zelensky. German chancellor candidate Friedrich Merz stated, We must never confuse aggressor and victim in this terrible war. Zelensky also held telephone conversations with French President Emmanuel Macron, NATO Secretary General Mark Rutte, and EU Council President Antonio Costa, according to an official in the Ukrainian delegation in Washington.\n\nBritain is scheduled to host a meeting of European leaders and Zelensky on Sunday to discuss a security framework for any potential peace agreement between Moscow and Kyiv.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent WASHINGTON, Feb 28 (Reuters) – Ukrainian President Volodymyr Zelensky’s meeting with U.S. President Donald Trump at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/trump-zelensky-clash-in-heated-oval-office-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Trump, Zelensky Clash in Heated Oval Office Meeting…\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        },
        {
            "title": "“Mnangagwa Will Not Rule Forever”",
            "url": "https://www.zimeye.net/2025/03/02/mnangagwa-will-not-rule-forever/",
            "content": "By A Correspondent\n\nZanu PF Womens League leader Marbel Chinomona, on Friday, called on President Emmerson Mnangagwa to take stronger action against those who criticize him.\n\nChinomona argued that Mnangagwas humility is being exploited by political opponents, who are taking advantage of his perceived softness.\n\nShe made these comments during the launch of the Zanu PF Incubator Project.\n\nChinomona stated:\n\nThere is no sun that can rise while another is still shining. President Mnangagwa is in office, but, of course, he will eventually leave. We will not tolerate those who attack the President on social media. Who do they think they are to insult the President?\n\nWhile Chinomonas comments suggest that Mnangagwa is too lenient, the president has long been associated with a tough, no-nonsense persona, earning him the nickname Crocodile for his ruthless political tactics.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Women’s League leader Marbel Chinomona, on Friday, called on President Emmerson Mnangagwa to take stronger … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/02/mnangagwa-will-not-rule-forever/\">Continue reading<span class=\"screen-reader-text\"> \"“Mnangagwa Will Not Rule Forever”\"</span></a></p>",
            "time": "20:25",
            "date": "02 Mar 2025"
        }
    ]
}