{
    "news": [
        {
            "title": "Mnangagwa Declares Only ‘Dictators of Zimbabwe’ Are Allowed To Pray For It",
            "url": "https://www.zimeye.net/2024/12/30/mnangagwa-declares-only-dictators-of-zimbabwe-are-allowed-to-pray-for-it/",
            "content": "Bulawayo  Zimbabwe Can Only Be Prayed For by Its Captors: Mnangagwa Declares Himself Sovereign Over Nations Destiny\n\nBy Dorrothy Moyo | ZimEye |  In a bold and polarizing declaration, President Emmerson Mnangagwa has proclaimed that only Zimbabwes ownersa term many interpret as its ruling elitehave the right to pray for the nation. The statement, made during a church gathering at the Zimbabwe International Trade Fair grounds, comes at a time when Mnangagwa has increasingly styled himself as a modern-day King Munhumutapa, ruling over a nation he views as his personal dominion.\n\nhttps://x.com/zimeye/status/1873431750682234969?s=46\n\nThis symbolism extends beyond rhetoric. Mnangagwa has established the Mutapa Investment Fund, a state-controlled wealth fund headquartered in the former home of the late opposition leader Morgan Tsvangirai. This audacious move has been widely seen as a deliberate act of mockery toward Tsvangirais legacy, serving as yet another declaration of Mnangagwas complete dominance over Zimbabwes political and historical narrative.\n\nBy intertwining divine imagery with sovereign authority, Mnangagwa has rebranded himself as both the spiritual and political custodian of Zimbabwe. But in doing so, he has drawn sharp criticism from those who see his statements as a chilling assertion that the nation remains in the grip of its captors, who dictate its fate, its prayers, and even the legacy of its fallen leaders.\n\nMnangagwa stirred controversy yesterday during a church service at the Zimbabwe International Trade Fair (ZITF) grounds, declaring that only the owners of Zimbabwe are permitted to pray for the country. The remarks came after Prophet Andrew Wutaunashe anointed Mnangagwa as the nations president until 2030, proclaiming a divine endorsement of his leadership.\n\nYou will be performing signs and wonders till 2030! Wutaunashe declared, as Mnangagwa stood alongside his deputy, Kembo Mohadi. Notably absent from the gathering was Vice President Constantino Chiwenga, fueling speculation about shifts within Zimbabwes power structure. The prominent presence of ZANU-PF chairwoman Oppah Muchinguri-Kashiri beside Mnangagwa suggested she may be positioned as Chiwengas replacement amid growing calls within the military deep state for Mnangagwa to hand over power to Chiwenga.\n\nMnangagwas Vision for the Future\n\nFollowing Wutaunashes prophetic blessing, Mnangagwa addressed the congregation, proclaiming a brighter future for Zimbabwe underpinned by divine guidance and national development.\n\nAs we look to the future, our nation is emboldened by the goodness of Almighty God that saw us liberate ourselves from colonial bondage and repossess the land stolen from our forefathers, Mnangagwa said. Today, we stand proud and tall as a truly free and independent people, enjoying freedom of worship and advancing Godly values alongside a people-centred national development agenda.\n\nHe urged citizens to focus on the countrys Vision 2030 goals, citing biblical scripture to inspire productivity and responsibility. Genesis Chapter 1, verse 28 instructs us to be fruitful and subdue the earth, Mnangagwa said, reinforcing the ZANU-PF national philosophy: Nyika inovakwa, inotongwa, inonamatirwa nevene vayo (A country is built, ruled, and prayed for by its owners).\n\nPolitical Intrigue Deepens\n\nThe absence of Vice President Chiwenga and the elevated profile of Muchinguri-Kashiri at the event adds fuel to ongoing speculation about internal power struggles within ZANU-PF and the military. Reports suggest a faction within the military is pressuring Mnangagwa to cede power to Chiwenga, his former ally in the 2017 coup that ousted Robert Mugabe.\n\nThe symbolic anointing of Mnangagwa until 2030 and the exclusion of Chiwenga at such a high-profile religious event is seen by analysts as a deliberate move to consolidate power and assert Mnangagwas dominance over party and state structures.\n\nPublic and Political Reactions\n\nMnangagwas remarks about the owners of Zimbabwe have drawn criticism, with opposition leaders and civil society groups questioning the exclusionary undertones of the statement. Critics argue the rhetoric could alienate sections of the population and deepen divisions in an already polarized nation.\n\nMeanwhile, the prophetic endorsement by Wutaunashe has been met with mixed reactions. Supporters within ZANU-PF hailed it as a sign of divine favor, while skeptics dismissed it as an attempt to use religion to cement political authority.\n\nThe Road Ahead\n\nAs the political landscape evolves, the focus remains on whether Mnangagwa can maintain unity within ZANU-PF and fend off mounting pressure from rival factions. With Vision 2030 at the center of his rhetoric, Mnangagwa is attempting to project stability and progress amid growing calls for change both within and outside his party.\n\nThis unfolding drama is sure to dominate Zimbabwean politics in the months ahead. Stay tuned for updates as the situation develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo – “Zimbabwe Can Only Be Prayed For by Its Captors”: Mnangagwa Declares Himself Sovereign Over Nation’s Destiny By Dorrothy … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/mnangagwa-declares-only-dictators-of-zimbabwe-are-allowed-to-pray-for-it/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Declares Only ‘Dictators of Zimbabwe’ Are Allowed To Pray For It\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Kasukuwere Vows to Block Mnangagwa “Selfish” Agenda",
            "url": "https://www.zimeye.net/2024/12/30/kasukuwere-vows-to-block-mnangagwa-selfish-agenda/",
            "content": "By A Correspondent\n\nSaviour Kasukuwere, former ZANU PF Political Commissar and leader of the Generation 40 (G40) faction, has forcefully rejected President Emmerson Mnangagwas efforts to extend his time in office beyond the constitutional limits.\n\nMnangagwa, who has been consolidating power within his party, is pushing for constitutional amendments that would allow him to stay in office beyond his current term, which is set to end in 2028. However, Kasukuwere was quick to dismiss the proposal, labeling it as daydreams. He vowed to stop Mnangagwas plans, pledging to take action during the 2025 elections.\n\nKasukuweres comments came in response to remarks made by ZANU PF Central Committee member Jenfan Muswere, who stated that the resolutions passed at the partys recent Annual Peoples Conference were binding, having been adopted unanimously by delegates. Muswere emphasized that there were no objections when the resolutions were read aloud at the conference.\n\nOne of the key resolutions proposed extending Mnangagwas presidential term by two more years, until 2030, to allow for the completion of his Vision 2030 agenda. The resolution reads: The Delegates to the ZANU PF 21st National Peoples Conference resolve as follows: the President and First Secretary of ZANU PF Party, His Excellency, Cde. Dr E. D. Mnangagwas term of office as President of the Republic of Zimbabwe and First Secretary of ZANU PF be extended beyond 2028 to 2030. The Party and Government should, therefore, set in motion the necessary amendments to the National Constitution so as to give effect to this resolution.\n\nDespite the official stance, Kasukuwere, who has previously argued that Mnangagwas Vision 2030 will not come to fruition, is determined to block this proposal. He boldly declared, Its a Tingiringo resolution. I will handle it in the coming weeks. For now, lets rest. Kasukuweres statement underscores his commitment to preventing Mnangagwa from extending his rule beyond 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Saviour Kasukuwere, former ZANU PF Political Commissar and leader of the Generation 40 (G40) faction, has forcefully … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/kasukuwere-vows-to-block-mnangagwa-selfish-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Kasukuwere Vows to Block Mnangagwa “Selfish” Agenda\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Zanu PF Seeks To Extend Influence Beyond Politics",
            "url": "https://www.zimeye.net/2024/12/30/zanu-pf-seeks-to-extend-influence-beyond-politics/",
            "content": "By A Correspondent\n\nIn a bold and controversial statement, Zanu PF Youth League deputy secretary for Commissariat, Taurai Kandishaya, recently declared that the ruling party has the power to influence not just political elections but even sports-related contests in Zimbabwe.\n\nKandishaya made these remarks on Saturday, taking a jab at the perceived factionalism within the party while asserting Zanu PFs dominance in every form of election in the country.\n\nKandishayas comments were made with a dose of sarcasm. He remarked, If you think there are fights within ZANU PF then call for an election and see what is called unity of purpose. Even School Development Committee Elections, even burial society elections. ZANU PF aligned candidate will win.\n\nHe continued by suggesting that the ruling partys influence extends far beyond the political arena, even joking about the upcoming ZIFA (Zimbabwe Football Association) elections set for January 2025, saying, Handina kumbotaura zveZIFA ini (I havent even mentioned ZIFA).\n\nThe statement has sparked concern among critics, particularly within the sports community, about the potential politicization of the ZIFA elections, which traditionally are independent of government influence.\n\nKandishayas comments underscore Zanu PFs long-standing tendency to assert control over various spheres of Zimbabwean society, a trend that has raised questions about the independence of institutions and democratic processes in the country.\n\nWhile Kandishayas words may have been delivered with sarcasm, the implication is clear: Zanu PF is prepared to ensure the success of its aligned candidates in all forms of elections, even those unrelated to politics.\n\nThe ruling partys self-proclaimed ability to sway results in such a wide range of areasfrom school boards to sports associationspoints to the significant power it wields over Zimbabwes institutional framework.\n\nThe forthcoming ZIFA elections, in particular, could serve as a battleground for political maneuvering, with many fearing that the governing partys influence may undermine the autonomy of football administration in the country.\n\nCritics worry that such political interference could harm the integrity of football and other areas traditionally governed by non-partisan bodies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold and controversial statement, Zanu PF Youth League deputy secretary for Commissariat, Taurai Kandishaya, recently … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/zanu-pf-seeks-to-extend-influence-beyond-politics/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Seeks To Extend Influence Beyond Politics\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Mnangagwa Preaches Gospel of Love in Bulawayo: Do You Think He Is Sincere?",
            "url": "https://www.zimeye.net/2024/12/30/mnangagwa-preaches-gospel-of-love-in-bulawayo-do-you-think-he-is-sincere/",
            "content": "By A Correspondent\n\nOn December 29, 2024, President Emmerson Dambudzo Mnangagwa addressed a large congregation during the 8th Zimbabwe National Thanksgiving and Dedication Service in Bulawayo, preaching a message centered on unity, love, and gratitude to God for the progress the country has made. The Presidents speech, however, raises the question: is his commitment to these values truly sincere, or is it a political move to solidify his leadership in the eyes of the public?\n\nIn his address, Mnangagwa spoke of the importance of love and unity, citing Biblical references that emphasized these virtues. He quoted John 15:12-13, where Jesus commands, Love each other as I have loved you. Greater love has no one than this: to lay down ones life for ones friends. He further proclaimed that love, peace, unity and harmony are the greatest gifts that we must bequeath to future generations, urging the people of Zimbabwe to embody these values in their daily lives.\n\nMnangagwas message of peace and unity was complemented by his assertion that the country is progressing under the Second Republic, with notable strides in agriculture, infrastructure, and economic development. He attributed these successes to the guidance of the Almighty, stressing that our nation is being renewed day by day towards Vision 2030.\n\nIn his speech, Mnangagwa also expressed gratitude to the Church for its role in nation-building, acknowledging the leadership of various denominations. I particularly recognize the leadership of our churches for being godly spiritual shepherds, he said, while also commending congregants for spreading the gospel and nurturing spiritual growth.\n\nHe made an emotional appeal to the youth, urging them to resist negative influences that might lead them to hate or look down upon their own motherland. Open your eyes and hearts to truly love and be committed to the land of your birth, Mnangagwa emphasized. This was particularly poignant as it came after years of internal strife and economic challenges that have made many Zimbabweans question the countrys trajectory.\n\nHowever, while his words were uplifting, some might wonder if the Presidents actions align with the message of love and unity he preached. Critics of Mnangagwas administration point to the ongoing economic hardships and human rights issues that persist under his leadership. Despite the Presidents calls for prosperity, there remains significant skepticism about the governments ability to deliver on promises of development and social cohesion.\n\nThe message of patriotism, echoed through Bible verses like Psalm 137, which calls on people to prefer Zimbabwe above my own joy, underscores a strong nationalistic tone. Yet, it begs the question of whether these calls for love and national unity are being genuinely embraced by the Presidents policies, especially in light of the challenges facing many Zimbabweans today.\n\nMnangagwas address also touched on the countrys independence and the reclaiming of land, referring to Zimbabwe as a land of valleys and hills, rich in resources. He reminded the nation of its self-liberation, stating, We are our own liberators. This echoed the rhetoric often used by his government, emphasizing national sovereignty and the need for Zimbabweans to take ownership of their future. But some critics argue that while the President speaks of prosperity, tangible results remain elusive for many ordinary citizens.\n\nDespite the lofty ideals presented in his speech, some Zimbabweans may question whether these values of love and unity will be truly realized under Mnangagwas leadership. As the nation moves forward, it will be up to both the government and the people to embody these principles in practical, everyday ways that uplift the country as a whole.\n\nIn conclusion, while President Mnangagwas sermon in Bulawayo undoubtedly carried a powerful message of love, unity, and patriotism, the sincerity of his commitment to these ideals remains under scrutiny. His governments actions will ultimately determine whether the nation can move from rhetoric to real progress, and whether the gospel of love he preaches will be more than just words.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent On December 29, 2024, President Emmerson Dambudzo Mnangagwa addressed a large congregation during the 8th Zimbabwe National … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/mnangagwa-preaches-gospel-of-love-in-bulawayo-do-you-think-he-is-sincere/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Preaches Gospel of Love in Bulawayo: Do You Think He Is Sincere?\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Mnangagwa Seizes Pulpit In Bulawayo…",
            "url": "https://www.zimeye.net/2024/12/30/mnangagwa-seizes-pulpit-in-bulawayo/",
            "content": "ADDRESS BY THE PRESIDENT, HIS EXCELLENCY,DR. Emmerson Dambudzo Mnangagwa AT THE 8th ZIMBABWE NATIONAL THANKSGIVING AND DEDICATION SERVICE BULAWAYO\n\n29 DECEMBER 2024\n\nOur Director of Ceremonies;Chairman of the Zimbabwe IndigenousInterdenominational Council of Churches,Rev. A. Wutawunashe;First Lady, Amai A. Mnangagwa;Vice President, Hon. Gen. (Rtd) Dr. C. G. D. N. Chiwenga;Vice President, Hon. Col. (Rtd) K. C. D. Mohadi;Minister of Defence, Hon. O. C. Z. Muchinguri-Kashiri;Minister of State for Bulawayo Metropolitan Province,Hon. J. Ncube;Other Honourable Ministers here present;Patron of the Zimbabwe Indigenous Inter-DenominationalCouncil of Churches, His Grace Bishop Dr. N. Mutendi;Chief Secretary to the President and Cabinet, Dr M.Rushwaya;President of the National Chiefs Council, Chief MtshaneKhumalo neMadzimambo edu;Senior Government Officials;His Worship, the Mayor of Bulawayo, Councillor D.Coltart;Bishops and Church Leaders here present;Congregants.\n\nIt is a great privilege to fellowship with you, at this 8thNational Thanksgiving and Dedication Service. Us inGovernment always look forward to such gatherings,organised so that we can come together as a people to express our gratitude to the Almighty God for the many positive milestones which surround our nation. We do so humbly and boldly, giving thanks for the year behind us and dedicate the year ahead. The Bible reminds us not to lean on our own understanding, but to acknowledgeAlmighty God, in all our ways, and He shall direct ourpaths.\n\nThe word of God in Psalm Chapter 107 verse 1, further exhorts us to, Give thanks to the Lord, for His mercy endures forever. We are aware that every good, perfect and pleasant gift comes from Almighty God, with whom there is no variation or shadow of change.\n\nMwari havashanduki, zuro, nhasi, namangwana.Guided by First Thessalonians, Chapter 5 Verse 18, Iencourage the Church, to rejoice and to carry on praying and interceding for our beloved motherland, Zimbabwe, in all circumstances. This is the will of the Almighty God.\n\nNyika inonamatirwa, inotongwa, inovakwa nevenevayo/ ilizwe li-khu-le-ke-lwa, libuswe, lakhiwangabanikazi balo.We have confidence that, if we ask anything according to His will, He hears us, and that He shall grant our requests.\n\n(First John Chapter 5, verses 14 and 15.)As such, we Enter His gates with thanksgiving, Hiscourts with praise and we bless His name. The Lord isgood, His mercy endures forever, His faithfulness lasts from generation to generation. (Psalm 100 Verses 4 and5)\n\nThe theme of this years Service Our Nation  OurOpportunity: Celebrating the Progress, acknowledging the Potential of our Country Zimbabwe, is both inspiring and energising.Looking back at the successes we have scored under the Second Republic, we are seeing the goodness of the Lord in our land of Zimbabwe. We are not in despair and Almighty God has never abandoned us. Our nation is being renewed day by day towards Vision 2030.\n\nCommunities are being transformed to be empowered and more prosperous.We are leaving no one and no place behind. For these, and many other gifts, we thank Almighty God.Allow me to commend the remarkable contributions of Churches across all denominations in nation building.\n\nI particularly recognise the Leadership of our Churches, in their various offices, for being Godly spiritual shepherdsover the people of our country. The Lord says in Jeremiah 3 verse 15 I will give you shepherds according to my heart, who will feed you with knowledge andunderstanding.\n\nThank you all for remaining true to the offices you hold,within the Churches, in our country. Your individual and collective, wholehearted service is appreciated by my Government. More-so that you have preached the uncorrupted word of God, which remains the beacon of hope, source of wisdom, and guidance for the people of our nation.\n\nI, further applaud congregants as a whole, for spreading the gospel and nurturing the spiritual growth of many people from different backgrounds, inspiring them to live according to Gods teachings of love, unity, compassion and service.\n\nThis Thanks-giving Service is, therefore, also a tribute to the profound impact and unity of purpose which has been demonstrated in our communities, by the Church as a whole.\n\nFellow Congregants;As we look to the future, our nation is emboldened by thegoodness of Almighty God that saw us liberate ourselves from colonial bondage and ultimately repossess the land stolen from our forefathers by those who occupied our beautiful country. Today, we stand proud and tall as a truly free and Independent people, enjoying freedom of worship and advancing Godly values as well as a people-centred national development agenda.\n\nIn the year ahead, unflinching focus on our national Vision,goals and aspirations, coupled with hard honest work;production and productivity; should see us live up to the instruction given to us in Genesis Chapter 1 verse 28.\n\nIt is, our responsibility and duty to be fruitful and to subdue the earth. We remain anchored on our national philosophy,Nyika inovakwa, inotongwa, inonamatirwa nevenevayo/ ilizwe, lakhiwa, libuswe likhu-le-kelwe,ngabanikazi balo.\n\nThrough the theme of this years National Thanksgiving and Dedication Service, the Church in Zimbabwe is rallying us all, to progressive, Godly and Biblicalpatriotism.\n\nIndeed, the land, Zimbabwe which the Lord hasgiven us, is an exceedingly good land. We are thankful to Almighty God.\n\nFurther, development initiatives and programmes, for the upliftment and prosperity of our people, have become the solid foundation upon which we are building our country brick by brick and stone upon stone.\n\nUs the people of Zimbabwe are our own liberators and using our indigenous resources, skills and talents. Others are welcome to assist us.\n\nIn the agriculture sector, as a Government and a people, we are not folding our arms and surrendering to the vagaries of climate change. Numerous dams are being built and boreholes sunk to mitigate the impact of climate change.\n\nIn relation to the current uneven rainfall patterns,Let us ask for rain from the Lord, for it is Almighty God who makes storm clouds and gives showers of rain toeveryone. (Zachariah Chapter 10 verse 1)\n\nWe raise up our arms in thanksgiving for the rapidmodernisation and expansion of our infrastructure as well as increased inflows of economic investments and diaspora remittances, which are having transformational impacts on economic growth.\n\nThe areas of remarkable progress are vast and cut across all sectors such as mining, manufacturing, tourism, ICTs,education and other social services.Zimbabwe is rising as a force of indigenous heritage-based development. We pay tribute to the revolutionary values, ideals and national pride bequeathed to us by our forebears.\n\nFellow Citizens and Brethren;The future of Zimbabwe is growing brighter and brighter.\n\nWe declare Deuteronomy Chapter 8 verses 8 to 10, which says, in part;For the Lord our God brought us into a good land,a land of valleys and hills. A land of wheat, andbarley, and vines, a land wherein we shall eat breadwithout scarceness. A land whose stones are iron,and out of whose hills we dig precious stones.Hence, we bless the Lord our God for the good landwhich He has given unto us. Hallelujah.\n\nIn pursuit of our National Vision 2030, I call upon us to embrace true patriotism and genuine love for our country and our people. Borrowing from the exhortations in Psalm137 Chapter urge us, individually verses 5and 6\n\nI also and collectively to patriotically proclaim that,If I forget I , let my right hand forget Zimbabwe . skill her If I do not remember nor prefer Zimbabwe above my own joy, let my tongue cling to the roof of my mouth.\n\nThe youth of our country are particularly challenged to resist the machinations by detractors to have them hate or look down upon their own motherland, Zimbabwe. Never be blind to the vast potential of our land. Open your eyes and hearts to truly love and be committed to the land of your birth. You, the youth, are the future of this great country.\n\nMeanwhile, we thank Jehovah God that our SADC region is united in purpose, to bring peace, development and prosperity to all our peoples.\n\nIn this spirit, I recognise and warmly welcome those who are in this service from across the SADC region. Please feel at home, away from home.\n\nFellow Congregants; As the Church in Zimbabwe, let us remain inspired by the wise counsel of the Lord Jesus Christ in John Chapter 15Verses 12 and 13 which says, My command is this: Love each other as I have loved you, Greater love has no one than this: to lay down ones life for ones friends.\n\nLove is indeed the common denominator in the way we relate with Almighty God and with one another. Love should remain ingrained within the Church and among the people of our nation. Love, peace, unity and harmony are the greatest gifts that we must bequeath to future generations. According to First Corinthians Chapter 13 verses 8 to 10, Inspired speech and prophecies will oneday end.\n\nPraying in tongues will end. Understandingwill reach its limit, but love never fails.\n\nAdditionally, it is critically, important that our trust andconfidence remains anchored in the mighty power and faithfulness of Jehovah God. He shall surely fulfil His promises and plans over our families, communities, provinces and the nation as a whole.Finally, as we dedicate our nation and consecrate ourselves to the work that lies ahead, let us embrace and advance initiatives and innovations that propel our development, modernisation and industrialisation agenda.\n\nIndividually and collectively, we must hold firm eachothers hands, as we develop our country. Deuteronomy Chapter 28 verses 1 to 6 assures us of the abundant blessings that come about as a result of obedience and walking in the fear of the Lord.If Zimbabwe fully obeys the Lord our God; andcarefully follows His commands that He has given us, the Lord our God will set us far above other nations.\n\nWe will be blessed in our cities and blessed in thecountryside. Our children will be blessed; and the crops of our land; and our livestock; Our herds and our flocks will also be blessed.\n\nZimbabwe will be blessed when we go in, and blessedwhen we go out. If we obey the word of the Lord, AlmightyGod will grant that the enemies who rise up against us, will be defeated before us. They will come to us in one direction, and flee from us in several.\n\nThe Lord will send a blessing on everything our nationsets out to do.The Lord, Almighty God will bless Zimbabwe in thisland He has given us and we shall be established.\n\nAs we enter 2025, the Lord will grant Zimbabwe abundant prosperity, if we continue to follow His commandments. Standing on these promises, we therefore, dedicate ourselves and our nation to Jehovah God.\n\nWe commit to forge ahead in unity and in one accord; as one people and one great nation. May God bless our efforts for more historic milestones towards the realisation of Vision 2030 and beyond.\n\nWith these remarks, it gives me great pleasure to wish you all a happy, blessed and prosperous 2025.May the Grace of our Lord Jesus Christ and thefellowship of the Holy Spirit remain with you all, now and forever more.\n\nAlleluia.God bless you.God bless Zimbabwe.I thank you.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ADDRESS BY THE PRESIDENT, HIS EXCELLENCY,DR. Emmerson Dambudzo Mnangagwa AT THE 8th ZIMBABWE NATIONAL THANKSGIVING AND DEDICATION SERVICE BULAWAYO 29 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/mnangagwa-seizes-pulpit-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Seizes Pulpit In Bulawayo…\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Slot Cautions Liverpool Despite Comfortable Lead",
            "url": "https://www.zimeye.net/2024/12/30/slot-cautions-liverpool-despite-comfortable-lead/",
            "content": "Sports Correspondent\n\nLiverpool manager Arne Slot has urged his players to stay vigilant, reminding them that their current seven-point lead at the top of the Premier League could quickly evaporate if they become complacent.\n\nThe Reds extended their advantage with a hard-fought 3-1 victory over Leicester City on Boxing Day. Despite falling behind early to a goal from Jordan Ayew in the sixth minute, Liverpool responded with goals from Cody Gakpo, Curtis Jones, and Mohamed Salah to secure the win.\n\nIn reflecting on the title race, Slot pointed to Manchester Citys dramatic drop from first to seventh as a cautionary tale.\n\nWhen youve been in this game for a long time, you know that with 20 games to go, you dont pay attention to the table, Slot said after the match. Just a month ago, we were one point behind City, and look at where they are now. This can happen to any team, so its far too early to celebrate. Weve all witnessed the challenges, and many of our victories havent come easily. It shows how tough it is to win, even with a full squad. We must continue to take it one game at a time.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Liverpool manager Arne Slot has urged his players to stay vigilant, reminding them that their current seven-point lead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/slot-cautions-liverpool-despite-comfortable-lead/\">Continue reading<span class=\"screen-reader-text\"> \"Slot Cautions Liverpool Despite Comfortable Lead\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Prophet Wutaunashe Anoints Mnangagwa As 2030 President In New Song Without VP Chiwenga Nearby",
            "url": "https://www.zimeye.net/2024/12/29/prophet-wutaunashe-anoints-mnangagwa-as-2030-president-in-new-song-without-vp-chiwenga-nearby/",
            "content": "VIDEO LOADING BELOW\n\n8PM SUNDAY  LIVE COMMENT WITH HOWARD NYONI AND OTHERS\n\nBREAKING- Prophet Wutaunashe Anoints Mnangagwa As 2030 President In New Song Without VP Chiwenga Nearbyhttps://t.co/Tdp3F4cIBzpic.twitter.com/TzxJqQdXRU\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW 8PM SUNDAY – LIVE COMMENT WITH HOWARD NYONI AND OTHERS",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Venâncio Mondelano’s CNN Interview English Transcript",
            "url": "https://www.zimeye.net/2024/12/29/venancio-mondelanos-cnn-interview-english-transcript/",
            "content": "(transcript by ZimEye)\n\nGuest Introduction:\n\nOn CNN Fim de Tarde, Venncio Mondelano, a candidate for the presidency of Mozambique, discusses a new phase of protests starting soon. This phase is tied to the upcoming transition of power, with the president and new legislature set to take office by January 15-17. The protests aim to express rejection of the disputed electoral results, which Mondelano claims are deeply flawed, as noted by Mozambiques Attorney General, legal experts, and international observers.\n\nOn Allegations of Violence and Protests:\n\nMondelano denies advocating for arming the population but highlights state violence against protesters, calling it a massacre. He mentions instances of police brutality and killings during peaceful demonstrations, including the use of live ammunition against unarmed citizens. He points out that various trained groups in Mozambique, including some within the official armed forces, are ready to defend the people exercising their constitutional right to protest.\n\nPossible Civil War:\n\nMondelano acknowledges the risk of civil war due to escalating tensions but emphasizes his efforts to prevent violence. He describes his approach as one of containment, introducing peaceful protest measures to avoid widespread unrest. He blames the government and police for initiating violence.\n\nInternational Support:\n\nMondelano has engaged with the European Parliament and international bodies, highlighting irregularities in Mozambiques elections. He notes significant solidarity from Portuguese citizens and intellectuals, though he criticizes the Portuguese governments response as uninformed. He hopes Portugal will play a key role in Mozambiques integration into Europe and support its democratic aspirations.\n\nTransition of Power:\n\nMondelano rejects the legitimacy of the upcoming inauguration of Daniel Chapo from the ruling FRELIMO party. He plans to establish a Peoples Constitutional Court to validate his claim to the presidency, emphasizing legal and peaceful means to challenge the results.\n\nProposed Dialogue and Mediation:\n\nDespite the governments alleged use of violence, Mondelano remains open to dialogue. He calls for international mediation, involving the United Nations, international human rights organizations, the International Criminal Court, and key actors like Portugal, the European Union, the U.S., South Africa, and the Vatican.\n\nClosing Remarks:\n\nMondelano reiterates his commitment to peaceful solutions and thanks CNN for the opportunity to discuss Mozambiques political crisis.\n\nThe following is the interviews text translated word for word into clear English:\n\nHost Introduction:\n\nOur guest on CNN Fim de Tarde is Venncio Mondelano, candidate for the presidency of Mozambique. Good afternoon, welcome to CNN Fim de Tarde. Recently, youve been speaking about a new phase of protests, the details of which will be revealed next Monday. What is this phase, and what scenario should the country expect?\n\nVenncio Mondelano:\n\nThank you very much to CNN Portugal for this opportunity. This phase, lets say, is the phase that precedes the final stage of the electoral calendar. As you know, strictly speaking, by January 15, 16, and 17, the President of the Republic and the new legislature of the Assembly of the Republic must take office. In this final phase, we will have a set of measures for protests and demonstrations of rejection, which will be entirely different from the approximately four phases before that began on October 21 and ran, lets say, until last Friday. Certainly, I wont give details about this, for obvious reasons, but its nothing more or less than the continuation of protestsa continuation of the demonstration of rejection of this agreement, which is more than proven. The agreement by the Constitutional Council had more than enough grounds not to have been validated.\n\nThe Attorney Generals Office, which is a competent and qualified institution for this purpose, stated that the electionsthe provisional results of the National Electoral Commissionwere unfounded, contradictory, and riddled with irregularities, making them unfit for validation. Furthermore, the legal opinion of the Bar Association highlighted the gross irregularities in the electoral process, and the European Union observation mission also pointed out irregularities that, under normal circumstances, should have prevented the Constitutional Council from even considering validating these results.\n\nHost:\n\nYouve been accused of threatening to arm the Mozambican population protesting the election results. Will this new phase include that step? What needs to happen for you to take such a step, and what is your objective in considering it?\n\nVenncio Mondelano:\n\nNo, I did not suggest arming the population. From the beginning, weve always identified ourselves as a purely civil movement. What I said was that whats happening is a massacre in Mozambique against protesters. The official numbers released are the ones that are convenient to the government. For instance, following a staged prison escape at Mozambiques largest prison, there are over 100 bodies in the morgue at the Central Hospital labeled as unidentified. This indicates far more unidentified victims of the massacre.\n\nWhat Im saying is that there is, in fact, an armed government that is disproportionately suppressing the constitutional right to protest. It is killing citizens indiscriminately. What I mentioned was that there are various groups in Mozambique, including within the official armed forces, and other militarily trained forces, that are now offering to defend the population when they exercise their constitutional right to protest. We now feel compelled to accept the help of these forces that see the need to protect the population during what I would describe as a genocide taking place in Mozambique.\n\nHost:\n\nWith the intensification of protests in this new phase, could Mozambique be on the path to a civil war? Do you admit this possibility?\n\nVenncio Mondelano:\n\nYes, let me say this. I once spoke to the President of the Republic and told him that, strictly speaking, the Mozambican government, the FRELIMO party, and the president himself should feel gratitude toward me. From the start, since October, the general sentiment of the Mozambican population has been one of deep and burning revolt. People wanted to resort to extreme violence immediately.\n\nThe steps Ive introduced, with their somewhat suggestive names, are precisely to contain the population and prevent an escalation of extreme violence. Thats why the measures I announce are, in truth, ways to contain the burning desire of the people to resort to violence.\n\nHost:\n\nSo, youre saying that the violence comes from the other sidethe authorities?\n\nVenncio Mondelano:\n\nNaturally. Let me give you a simple example. When we began the first protests on October 21the reference date for all processesI called for a national strike to paralyze all work in Mozambique. Two days earlier, on October 19, my personal lawyer and national representative were murdered with 25 bullets from a military weapon. I invited the population to simply show rejection of this barbaric assassination of my lawyer.\n\nWhen the national strike happened, all activity ceased. I personally, in front of international journalists and some Portuguese media outlets, was attacked by the police while giving an interview. From the outset, the police intended to create situations to justify extreme violence and kill people. On October 21, I was personally hit by a tear gas canister during the protests.\n\nEven during our second phase of protests, which included symbolic, peaceful measures such as stopping the country at noon and singing the national anthem, police shot people kneeling while singing. The goal of the National Police has always been to assassinate citizens and use extreme violence, which continues today.\n\nHost:\n\nWhat kind of contact have you had with the international community, and have you received any support for your cause?\n\nVenncio Mondelano:\n\nWe dont have anything definitive yet, but weve made preliminary contacts. I had a high-level opportunity to speak with the European Parliament and its member parties, thanks in part to Portuguese MPs from initiatives like the Liberal Initiative. I explained Mozambiques situation to the European Parliament.\n\nI believe that the Portuguese people, based on my observations and conversations, are very supportive of Mozambique. However, the Portuguese government and the EU should treat Mozambiques crisis with the same urgency given to Venezuela or Georgia. The recent EU observation mission concluded that the elections in Mozambique were neither free, fair, nor transparent and were marred by severe irregularities that should have prevented their validation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "(transcript by ZimEye) Guest Introduction: On CNN Fim de Tarde, Venâncio Mondelano, a candidate for the presidency of Mozambique, discusses … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/venancio-mondelanos-cnn-interview-english-transcript/\">Continue reading<span class=\"screen-reader-text\"> \"Venâncio Mondelano’s CNN Interview English Transcript\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Zim Engineer Sets New Standards In Australia",
            "url": "https://www.zimeye.net/2024/12/29/zim-engineer-sets-new-standards-in-australia/",
            "content": "By Technology ReporterA Zimbabwean engineer, Eng KokeraiMurombo, has achieved the prestigious Chartered Professional Engineer (CPEng) credential from Engineers Australia, marking an extraordinary milestone in the global engineeringfield.\n\nThis internationally acclaimed credential represents the apex of technical excellence and is a distinction few Africans attain.\n\nIt underscores Eng Murombos profound expertise and relentless dedication to his craft.\n\nWith a Bachelor of Engineering Honours Degree in Mechanical Engineering, Eng Murombo has emerged as a trailblazer in Australias mining industry, combining technical innovation with a commitment to sustainable practices.\n\nHis journey reflects the resilience and determination Zimbabweans are celebrated for globally.\n\nMy goal has always been to excel and break barriers, said EngMurombo. Earning the Chartered credential is not just a personal achievement; it represents years of hard work and a dedication to maintaining the highest standards in engineering. Its an honor to showcase Zimbabwean excellence on an international stage.\n\nEng Murombo is also pursuing an MBA at the University of Melbournes Business School, aimingto enhance his leadership skills.\n\nHe envisions returning to Africa as a senior executive to spearhead transformative engineering projects and inspire the next generation of innovators.\n\nI am passionate about nurturing future engineers in Zimbabwe and demonstrating that extraordinary achievements are within reach. Together, we can build a brighter future for our communities, he affirmed.\n\nState Media/ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Technology Reporter—A Zimbabwean engineer, Eng Kokerai Murombo, has achieved the prestigious Chartered Professional Engineer (CPEng) credential from Engineers Australia, marking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/zim-engineer-sets-new-standards-in-australia/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Engineer Sets New Standards In Australia\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        },
        {
            "title": "Benni McCarthy Set to Become Harambee Stars Head Coach?",
            "url": "https://www.zimeye.net/2024/12/29/benni-mccarthy-set-to-become-harambee-stars-head-coach/",
            "content": "Sports Correspondent\n\nBenni McCarthy is reportedly poised to take over as the new head coach of the Kenya national football team, Harambee Stars.\n\nMcCarthy, who has been without a club since leaving Manchester United in June, where he served as assistant coach to Erik Ten Hag, is said to have emerged as the top candidate for the role. According to reports from both Kenya and South Africa, the Football Kenya Federation (FKF) recently conducted interviews and has made the decision to appoint the former Bafana Bafana striker.\n\nThe 46-year-old South African is expected to begin his tenure in January 2025.\n\nMcCarthy will take over from Engin Firat, who resigned earlier this month after a three-year stint as the national team coach. Firats resignation followed Kenyas elimination from the race to qualify for the 2025 Africa Cup of Nations, with Zimbabwe playing a key role in ending their hopes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Benni McCarthy is reportedly poised to take over as the new head coach of the Kenya national football … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/benni-mccarthy-set-to-become-harambee-stars-head-coach/\">Continue reading<span class=\"screen-reader-text\"> \"Benni McCarthy Set to Become Harambee Stars Head Coach?\"</span></a></p>",
            "time": "06:28",
            "date": "30 Dec 2024"
        }
    ]
}