{
    "news": [
        {
            "title": "Chief Hwenje Stages 1st ED Bootlicking Musical Show After Death Romours",
            "url": "https://www.zimeye.net/2024/12/17/chief-hwenje-stages-1st-ed-bootlicking-musical-show-after-death-romours/",
            "content": "By Showbiz Reporter  Zanu PF-aligned singer Admire Sanyanga Sibanda,popularlyknown asChief Hwenje, made his first public performance last Thursday after weeks of swirling death rumours.\n\nHwenje entertained a large crowd at Mkandapi Business Centre in Shurugwi, where President Emmerson Mnangagwa commissioned the resurfaced Shurugwi-Mhandamabwe Road.\n\nSpeaking at the Zanu PF event, Hwenje revealed that President Mnangagwa facilitated his recent trip to India for cancer treatment.\n\nI want to thank the First Family for ensuring that I went to India. The President ensured that I got all the treatment and attention I needed, including the medical procedure I underwent. They constantly checked on me to hear about my progress,Hwenje told state media.\n\nThismarkedHwenjessecond public appearance in aweek,following his emergence alongsideMnangagwasclose ally Owen Ncube.\n\nLast month,Hwenjescancer diagnosis triggered a public outcry over allegations that Zanu PF had exploited the artist and abandoned him during his health crisis.\n\nInitially, presidential spokesperson George Charamba claimedthat theruling party had flown Hwenje to South Africa for treatment.\n\nHowever, the absence of photographic evidence fueled speculation about hiswellbeing.\n\nChief Hwenje rose to prominence followingZimbabwes2017 military coup that ousted Robert Mugabe after 37 years in power.\n\nHis praise songs,includingGarwe Rauya(The Crocodile Has Come), became anthems forMnangagwasloyalists, earning Hwenje a reputation as a zealoussupporter of the ruling party.\n\nHowever, his plight mirrors a recurring trend in ZanuPFshistory of exploiting artists for political propaganda before casting them aside.\n\nIn the early 2000s, Last Chiyangwa, better known asTambaoga, gained fame for his pro-Zanu PF songRambai Makashinga(Remain Resilient), which justified state-sanctioned land seizures.\n\nOnce a celebrated voice of the regime, Tambaoga now lives in destitution, a cautionary tale of political loyalty gone unrewarded.\n\nSimilarly, the late revolutionary singer Dickson Chingaira, affectionately calledCde Chinx, dedicated his music to ZanuPFsliberation war rhetoric.\n\nDespite his unwavering loyalty, Chinx spent his final years in poverty, with minimal support from the party he served.\n\nWhileHwenjesreappearance may quell rumours of his death, it reignites questions about ZanuPFstreatment of loyal artists.\n\nWillHwenjescurrent favour endure, or is he destined to meet the same fate as Tambaoga and Cde Chinx?\n\nFor now,Hwenjespublic performances and state-backed praise may signal recovery, but hisstory serves as a sobering reminder of the high-cost artists pays when aligning their craft with a political machine known for exploiting and discarding its propaganda tools.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Zanu PF-aligned singer Admire Sanyanga Sibanda, popularly known as Chief Hwenje, made his first public performance last Thursday after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/chief-hwenje-stages-1st-ed-bootlicking-musical-show-after-death-romours/\">Continue reading<span class=\"screen-reader-text\"> \"Chief Hwenje Stages 1st ED Bootlicking Musical Show After Death Romours\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Bushiri Resurfaces, Attacks Chris Brown",
            "url": "https://www.zimeye.net/2024/12/17/bushiri-resurfaces-attacks-chris-brown/",
            "content": "South Africa-Fugitive Malawian preacher and self-proclaimed prophet Shepherd Bushiri has resurfaced online, launching a scathing attack on the South African media for what he termedhypocrisyin their praise of American singer ChrisBrownsweekendshows in Johannesburg.\n\nBrownsdouble performance at the iconic FNB Stadium drew a combined crowd of 94,000 fans, marking one of thebiggestmusical events of the year.\n\nHowever, Bushiri, posting on hisXaccount, claimed his religious gatherings at the same venue had far exceeded these numbers and accused local media of bias.\n\nSo ChrisBrownsconcert at FNB Stadium drew a crowd of 94,000 and the South African weirdo media is going crazy crowning himthe biggest crowd puller.What a shame. Hate is really an animal,Bushiri wrote.We recorded an all-time high of 110,000 people attending my Crossover Night prayers for four consecutive times. Despite FNB Management confirming this publicly, no South African media wrote about it till date.\n\nHe further accused the media ofhating men of Godwhile celebrating what he described asevil.\n\nBushiriscomments come amidlingeringcontroversy surrounding his dramatic exit from South Africa.\n\nThe preacher and his wife fled to Malawi in 2020 while out on bail following their arrest on charges of fraud, money laundering, and corruption involving millions of rands.\n\nDespite ongoing legal efforts,southAfrican authorities have since struggled to extradite the pair.\n\nBushirisremarks sparked mixed reactions on social media, with some defending his claims of double standards while others questioned his moral authority given his unresolved criminal cases.\n\nChrisBrownsconcerts, meanwhile, have been hailed as amajorsuccess, with fans celebrating the internationalstarsreturn to South Africa after a decade-long absence.\n\nSo Chris Browns concert at FNB Stadium drew a crowd of 94,000 and the South African weirdo Media is going crazy crowning him; the biggest crowd puller. What a shame. Hate is really an animal. They are trying to pay a blind eye on my meetings in the same stadium where wepic.twitter.com/dYwCtD25YG\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa-Fugitive Malawian preacher and self-proclaimed prophet Shepherd Bushiri has resurfaced online, launching a scathing attack on the South African … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/bushiri-resurfaces-attacks-chris-brown/\">Continue reading<span class=\"screen-reader-text\"> \"Bushiri Resurfaces, Attacks Chris Brown\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Accident: How Gonyet Driver Crashed Into 6 Trucks",
            "url": "https://www.zimeye.net/2024/12/17/accident-how-gonyet-driver-crashed-into-6-trucks/",
            "content": "Zimbabwean Truck Driver Dies in Multi-Vehicle Collision on N3, Marrianhill Toll Plaza\n\nBy A Correspondent | Durban, South Africa  Tragedy struck at the Marrianhill Toll Plaza on the N3 highway in KwaZulu-Natal, Friday evening, after a horrific multi-vehicle collision involving six trucks and five cars left one person dead and over 15 others critically injured.\n\nThe accident, which occurred in wet and rainy conditions, created a devastating scene of destruction as emergency responders raced to rescue victims trapped in mangled vehicles.\n\nScene of Carnage\n\nEyewitness images from the accident paint a harrowing picture of the aftermath. In the first frame, the overturned body of a large truck stands tall, twisted and crushed beyond recognition, its metal body mangled into sharp, jagged wreckage. Around it, shattered glass, vehicle debris, and injured survivors scatter the rain-slicked road, illuminated only by the flashing lights of emergency vehicles. The heavy truck, believed to have caused the initial impact, remains the center of the destruction.\n\nIn another image, a light motor vehicle lies flattened on its side, its structure crumpled to an unrecognizable heap of steel. The roof is almost entirely compressed into the chassis, underscoring the force of the collision. Nearby, rescue workers and paramedics can be seen using advanced tools to extract victims pinned inside.\n\nA third image shows a chaotic scene on the N3 highway, lined with several damaged vehicles, including large trucks, surrounded by emergency vehicles. Traffic is at a standstill while rescue operations continue under worsening weather conditions.\n\nOfficial Statement and Investigation\n\nNdabezinhle Sibiya, spokesperson for KwaZulu-Natal Transport and Human Settlements, confirmed that the collision involved a Zimbabwean heavy motor vehicle, which collided with six trucks and five cars in a chain reaction.\n\nThe driver of the Zimbabwean truck tragically died on the scene. Over 10 people sustained critical injuries, and paramedics worked tirelessly to stabilize and transport them to hospitals in Durban, said Sibiya.\n\nHe urged motorists to avoid the Marrianhill Toll Plaza area, as clean-up and investigations by Road Traffic Inspectorate (RTI) officials continued through the night.\n\nEmergency Response Efforts\n\nParamedics described the scene as one of chaos and carnage. Garrith Jamieson, spokesperson for ALS Paramedics Medical Services, praised the swift efforts of emergency responders, including advanced life support teams and the eThekwini Fire Department, who used heavy machinery to free victims trapped in the twisted wreckage.\n\nDespite best efforts, one truck driver was found severely entrapped in the wreckage and succumbed to his injuries on site, Jamieson confirmed. Multiple people sustained varying injuries, and ambulances transported them to various hospitals for urgent care.\n\nTraffic Impact and Safety Concerns\n\nThe N3 highway was closed for several hours, causing significant traffic disruptions as emergency personnel worked tirelessly to clear the scene. Authorities have urged motorists to exercise caution, especially during adverse weather conditions, and delay trips where possible.\n\nThe cause of the crash remains under investigation, with preliminary reports suggesting poor visibility and wet road conditions as potential contributing factors.\n\nEnd of Report.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabwean Truck Driver Dies in Multi-Vehicle Collision on N3, Marrianhill Toll Plaza By A Correspondent | Durban, South Africa – … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/accident-how-gonyet-driver-crashed-into-6-trucks/\">Continue reading<span class=\"screen-reader-text\"> \"Accident: How Gonyet Driver Crashed Into 6 Trucks\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Mukuru Hit by Armed Robbers Again",
            "url": "https://www.zimeye.net/2024/12/17/mukuru-hit-by-armed-robbers-again/",
            "content": "By Dorrothy Moyo | Harare, Zimbabwe  A gang of armed robbers struck a Mukuru Money Transfer agency at Makomva Shopping Centre in Glen View yesterday morning, escaping with over US$2,700 and R2,350 in yet another targeted attack on financial outlets.\n\nThe robbery occurred at approximately 10 AM when four suspects, armed with pistols, arrived at the busy shopping center in a black Toyota Mark X. The robbers, who had allegedly conducted surveillance earlier, waited for a cash delivery before executing their well-orchestrated heist.\n\nHostages and Shots Fired\n\nEyewitnesses recounted the dramatic scene as the robbers stormed the Mukuru outlet, located within a pharmacy. The gang held the agencys workers and a customer hostage at gunpoint, demanding cash. One customer, who had just withdrawn US$950, was attacked and robbed alongside the teller, from whom US$1,839 and R2,350 were looted.\n\nThe chaos escalated when the robbers fired shots into the air to intimidate bystanders as they fled the scene, causing panic among shoppers.\n\nIt was terrifying. They were armed and aggressive, and the sound of gunfire sent people running in all directions, said one eyewitness who was at the shopping center during the robbery.\n\nPolice Launch Investigation\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident, saying investigations are already underway.\n\nWe can confirm that US$2,789 and R2,350 were stolen by four suspects armed with pistols. They fled in a black Toyota Mark X, and we are working to determine whether the vehicle had a registration number, said Commissioner Nyathi.\n\nHe urged the public to remain vigilant and assist police with any information that may help identify the suspects.\n\nRise in Robberies\n\nThis incident highlights a concerning trend of targeted robberies against financial service providers, particularly Mukuru Money Transfer outlets, which handle significant cash volumes. The robbery comes amid growing concerns over the safety of cash-in-transit operations and increased criminal activity in Harare.\n\nOther Criminal Incidents\n\nIn separate incidents, police are investigating multiple cases of unlawful entry and theft:On December 13, an unknown suspect broke into a residence on Abyone Drive, Newlands, stealing a cash box containing US$20,000 and a laptop.On December 12, unknown assailants broke into Rakodzi Estate in Marondera and stole firearms, including a Farbam shotgun, a Brno shotgun, and a BSA rifle, while the homeowner was away in Harare.\n\nPolice Urge Caution\n\nThe police have urged businesses, particularly cash handling agencies, to improve security measures, including hiring trained guards and investing in surveillance systems.\n\nCriminal gangs are targeting locations where cash is readily available. We appeal to the public to report any suspicious activity and remain alert, Commissioner Nyathi added.\n\nPublic Concern\n\nResidents of Glen View and other high-density areas have expressed growing concern over the frequency of armed robberies, calling on authorities to implement stronger measures to curb these incidents.\n\nAs investigations continue, the public remains on edge, with fears that such brazen attacks may become even more frequent in the absence of decisive interventions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Harare, Zimbabwe – A gang of armed robbers struck a Mukuru Money Transfer agency at Makomva … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/mukuru-hit-by-armed-robbers-again/\">Continue reading<span class=\"screen-reader-text\"> \"Mukuru Hit by Armed Robbers Again\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabwe Fails to Airlift 20 Citizens Still Stranded in Sierra Leone",
            "url": "https://www.zimeye.net/2024/12/17/zimbabwe-fails-to-airlift-20-citizens-still-stranded-in-sierra-leone/",
            "content": "Harare, Zimbabwe  The Zimbabwean Government has come under increasing scrutiny after failing to airlift over 20 citizens stranded in Sierra Leone following a human trafficking ordeal. Despite mounting public pressure, the victimslured to the West African nation with false promises of lucrative job opportunitiesremain in dire conditions while awaiting assistance.\n\nThe victims were reportedly deceived by a human trafficking syndicate involving both a foreign entity and a local company, which exploited their desperation for employment. While a handful of survivors have managed to return home in recent weeks, including two placed in protective custody last week, several others remain trapped in Sierra Leone.\n\nGovernment Appeals for International Assistance\n\nIn response to the worsening crisis, the Government has enlisted the International Organisation for Migration (IOM) to coordinate efforts to bring back the stranded citizens. Public Service, Labour, and Social Welfare Minister July Moyo confirmed the Governments collaboration with the IOM but stopped short of providing a concrete timeline for their return.\n\nRight now, we have a situation in Sierra Leone, where our people were recruited there and they are being abused. While some have returned home, we still have others who are still out there, Minister Moyo said.\n\nThe delay has sparked frustration among affected families and raised questions about Zimbabwes preparedness to handle similar crises.\n\nGrowing Concerns and Calls for Accountability\n\nCritics argue that Zimbabwes response has been slow and reactive, with survivors reporting harrowing conditions and abuses while stranded. The lack of immediate action to secure their safe passage home has intensified public outcry, especially as other nations have managed to evacuate their citizens from similar situations.\n\nA human rights advocate, speaking on condition of anonymity, criticized the lack of urgency:\n\nEvery moment these victims remain stranded, they are at risk. Zimbabwe cannot afford to delay. The Government must prioritize securing flights and bringing these citizens home immediately.\n\nRaising Awareness Amid Trafficking Risks\n\nThe ordeal highlights a troubling trend of Zimbabweans falling prey to human trafficking syndicates amid economic challenges and unemployment. Minister Moyo emphasized the need to regulate recruitment agencies and educate citizens about the risks of irregular migration.\n\nMigration is beneficial, but it also comes with human trafficking challenges, Minister Moyo said. The Government is implementing measures to prevent such exploitation, including regulating recruitment agencies and working with international partners like the IOM.\n\nHowever, these measures offer little comfort to the families of those still stranded, as tangible action to secure their return remains elusive.\n\nPrevious Incidents Highlight Systemic Failures\n\nThe Sierra Leone case is not isolated. Minister Moyo referenced a similar incident in Kuwait, where Zimbabwean victims of trafficking faced prolonged suffering before their eventual return. These recurring failures underscore the systemic gaps in Zimbabwes ability to protect its citizens abroad and respond effectively to crises.\n\nUnanswered Questions\n\nWhile the Governments collaboration with the IOM is a step forward, critics argue that a comprehensive evacuation plan is long overdue. Families are now demanding transparency and a clear commitment to ensure their loved ones return safely.\n\nThe continued delay in airlifting Zimbabweans trapped in Sierra Leone serves as a stark reminder of the dangers of unchecked human trafficking and the urgent need for proactive measures to protect vulnerable citizens.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, Zimbabwe – The Zimbabwean Government has come under increasing scrutiny after failing to airlift over 20 citizens stranded in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/zimbabwe-fails-to-airlift-20-citizens-still-stranded-in-sierra-leone/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Fails to Airlift 20 Citizens Still Stranded in Sierra Leone\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Mthuli Promises To Fix Smuggling Following US Sanctions On ED’s GoldMafia Partner",
            "url": "https://www.zimeye.net/2024/12/17/mthuli-promises-to-fix-smuggling-following-us-sanctions-on-eds-goldmafia-partner/",
            "content": "Govts Anti-Smuggling Crackdown Raises Questions Over Mnangagwas Alleged Links to Sanctioned Gold Smuggling Network\n\nBy A Correspondent |Harare, Zimbabwe  As the Government intensifies its nationwide crackdown on smuggling and illicit trade, revelations have emerged exposing President Emmerson Mnangagwas alleged links to a sanctioned gold smuggling network, raising questions about the sincerity of the operation.\n\nWhile Finance Minister Professor Mthuli Ncube condemned smuggling as detrimental to Zimbabwes economy during the launch of the anti-smuggling blitz, he failed to address recent U.S. Treasury sanctions that implicate President Mnangagwa in the very practices the Government now claims to be eradicating.\n\nOn December 9, 2024, the U.S. Treasury Departments Office of Foreign Assets Control (OFAC), in coordination with the UK government and the FBI, sanctioned 28 individuals and businesses involved in a global gold smuggling and money laundering network centered in Zimbabwe. At the heart of the operation is Kamlesh Pattni, a controversial figure who has been implicated in exploiting Zimbabwes natural resources through corrupt partnerships with high-level government officials.\n\nThe OFAC report specifically named Pattnis Sun Multinational DMCC network, which has deep ties to Zimbabwes leadership, including allegations of direct collaboration with President Mnangagwa, who himself was sanctioned on March 4, 2024, under Executive Order 13818 for corruption and human rights abuses.\n\nOmissions in Governments Narrative\n\nDespite the Governments current anti-smuggling initiative, Minister Ncube made no mention of the systemic corruption highlighted by the U.S. and UK sanctions, which accuse Mnangagwas regime of facilitating illicit gold exports through bribery and fraudulent incentives. The network, according to OFAC, has systematically drained Zimbabwe of its natural wealth while enriching corrupt officials and shielding criminal enterprises.\n\nPattnis network is emblematic of globalized corruption, exploiting Zimbabwes resources while depriving its citizens of economic benefits, stated Bradley T. Smith, Acting Under Secretary for Terrorism and Financial Intelligence.\n\nThe Mnangagwa Connection\n\nPattnis operations reportedly thrived under the patronage of high-ranking officials, with President Mnangagwa at the center of these allegations. Pattnis network, through front companies and trusted couriers, orchestrated the export of Zimbabwes gold and diamonds while returning inflated cash figures to benefit government insiders. In exchange for protection, Pattnis operations bypassed customs controlsthe very issues the current anti-smuggling crackdown claims to address.\n\nInternational Accountability\n\nThe revelations have led observers to question whether the Governments anti-smuggling operation is genuine or a smokescreen to distract from international scrutiny. By failing to acknowledge Mnangagwas alleged involvement, critics argue that the campaign appears more focused on small-scale vendors and transport operators while ignoring entrenched corruption at the highest levels.\n\nIndustry Reaction and Public Outcry\n\nThe Confederation of Zimbabwe Retailers (CZR) and other business stakeholders have cautiously welcomed the crackdown, but concerns remain about the selective nature of enforcement. CZR President Dr. Denford Mutashu called for fairness, saying, While this operation targets smugglers harming local industries, it must be impartial. If corruption at the top is not addressed, these efforts will lack credibility.\n\nMeanwhile, civil society organizations and opposition leaders have demanded an independent inquiry into the Presidents alleged role in enabling Pattnis network, as revealed in the OFAC sanctions.\n\nAs Zimbabwe navigates this anti-smuggling drive, the failure to confront allegations against Mnangagwa casts a shadow over the Governments efforts, raising fears that the initiative is more performative than transformative.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Govt’s Anti-Smuggling Crackdown Raises Questions Over Mnangagwa’s Alleged Links to Sanctioned Gold Smuggling Network By A Correspondent | Harare, Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/mthuli-promises-to-fix-smuggling-following-us-sanctions-on-eds-goldmafia-partner/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Promises To Fix Smuggling Following US Sanctions On ED’s GoldMafia Partner\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Double Tragedy  at Durban Funeral",
            "url": "https://www.zimeye.net/2024/12/17/double-tragedy-at-durban-funeral/",
            "content": "In a shocking and devastating incident, two police officers and a woman were tragically killed in Cliffdale, Durban. The horrific event unfolded at a funeral, where an unknown gunman opened fire, claiming the life of a female attendee.\n\nUpon responding to the distress call, two police officers arrived at the scene, only to be met with gunfire. Unfortunately, both officers succumbed to their injuries, losing their lives in the line of duty.\n\nThe motive behind the senseless killings remains unclear, and authorities are working tirelessly to identify the perpetrator and bring them to justice.\n\nThis tragic event has sent shockwaves through the community, leaving many in mourning and searching for answers. Our thoughts are with the families and loved ones of the victims, as well as the South African Police Service.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In a shocking and devastating incident, two police officers and a woman were tragically killed in Cliffdale, Durban. The horrific … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/double-tragedy-at-durban-funeral/\">Continue reading<span class=\"screen-reader-text\"> \"Double Tragedy  at Durban Funeral\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Eastern Region Soccer League Honours Top Performers at 2024 Annual Awards Ceremony",
            "url": "https://www.zimeye.net/2024/12/17/eastern-region-soccer-league-honours-top-performers-at-2024-annual-awards-ceremony/",
            "content": "Sports Correspondent\n\nThe Eastern Region Soccer League held its 2024 annual awards ceremony this weekend to celebrate the exceptional achievements of players, coaches, and referees from the just-ended season.\n\nThe event, hosted at Triangle Country Club on Saturday, recognized standout performers for their remarkable contributions to the sport.\n\nAmong the awardees were Ali Sadiki of Triangle United Football Club, Junior Peter Mushure from FC Wangu Mazodze, and Tawanda Chatuluka of FC Hunters. These players were honored for their outstanding performances and earned a spot in the prestigious list of the 11 best players of the past season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Eastern Region Soccer League held its 2024 annual awards ceremony this weekend to celebrate the exceptional achievements … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/eastern-region-soccer-league-honours-top-performers-at-2024-annual-awards-ceremony/\">Continue reading<span class=\"screen-reader-text\"> \"Eastern Region Soccer League Honours Top Performers at 2024 Annual Awards Ceremony\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Latest On Cyclone Chido",
            "url": "https://www.zimeye.net/2024/12/17/latest-on-cyclone-chido/",
            "content": "By A Correspondent\n\nTropical Cyclone Chido is expected to hit Zimbabwe, bringing torrential rains and strong winds that may cause significant disruption. The cyclone will primarily affect Matabeleland North, Matabeleland South, Masvingo, Midlands, and Harare provinces, with winds averaging 50 km/h and heavy rainfall that could result in destruction.\n\nWhile the rain is much-needed, authorities are preparing for potential disasters. Nathan Nkomo, director of the Civil Protection Unit (CPU), reassured the public that evacuation points are being set up in vulnerable areas. Cyclone Chido will bring much-needed rain, but, unfortunately, cyclones cause disasters, Nkomo said .\n\nPreparations and Concerns\n\nCyclone Chido made landfall in Mozambique, causing significant damage and disrupting communication. The cyclones impact is expected to be less severe in Zimbabwe than in neighboring countries.\n\nPotential Risks\n\nThe United Nations Office for the Coordination of Humanitarian Affairs (OCHA) estimates that approximately 2.7 million people across six Southern African countries will be affected by Cyclone Chido .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tropical Cyclone Chido is expected to hit Zimbabwe, bringing torrential rains and strong winds that may cause … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/latest-on-cyclone-chido/\">Continue reading<span class=\"screen-reader-text\"> \"Latest On Cyclone Chido\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Tawanda Chirewa’s Derby County Future Uncertain Amid Injury Setbacks",
            "url": "https://www.zimeye.net/2024/12/17/tawanda-chirewas-derby-county-future-uncertain-amid-injury-setbacks/",
            "content": "Sports Correspondent\n\nDerby County head coach Paul Warne has addressed concerns surrounding Tawanda Chirewas loan spell, following the midfielders prolonged injury struggles. Chirewa, on loan from Wolves, has made only two league appearances due to a torn thigh muscle that kept him sidelined for nearly two months.\n\nAfter resuming training with the senior team, Warne emphasized that Chirewa must earn his place through hard work and competition. Hes got himself back fit and now he has to get back into the squad, Warne said. To do that, he needs to train better than everybody else. He has to fight for his spot.\n\nWarne clarified that neither Wolves nor Chirewas agent have contacted him regarding the players future, stating its too early to make decisions. It hasnt worked out for him or for us as well as it could have, simply because he got injured, Warne concluded. But hes here for the season and has looked good in training.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Derby County head coach Paul Warne has addressed concerns surrounding Tawanda Chirewa’s loan spell, following the midfielder’s prolonged … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/tawanda-chirewas-derby-county-future-uncertain-amid-injury-setbacks/\">Continue reading<span class=\"screen-reader-text\"> \"Tawanda Chirewa’s Derby County Future Uncertain Amid Injury Setbacks\"</span></a></p>",
            "time": "09:46",
            "date": "17 Dec 2024"
        }
    ]
}