{
    "news": [
        {
            "title": "UK Regulator Shuts Down Tshabangu-Welshman Linked Law Firm “To Protect The Public”",
            "url": "https://www.zimeye.net/2025/01/18/uk-regulator-shuts-down-tshabangu-welshman-linked-law-firm-to-protect-the-public/",
            "content": "By A Correspondent | ZimEye | UK regulators have shut down a London based law firm. This is the entity that helped raise USD25million for politicians Sengezo Tshabangu and Professor Welshman Ncubes publicist to amass properties used in the process of destabilising Nelson Chamisas party between 2018 and 2024.\n\nThe law firms founder, Julian Condliffe has and continues to be under investigation over allegedly deceiving investors mostly Zimbabweans saying she would help them obtain title deeds in both UK and Zimbabwe, under her wholly owned company and secondly under the girlfriend of Welshman Ncubes publicist Jimmy Chasafara, Sithule Tshumas Qoki Zindlovukazi entity.\n\nCondliffe had built a reputation as an acclaimed award winning solicitor, with a polished media presence, during the 6 year period, amid her many videos promising to assist property seekers become millionaires.\n\nHer Creative Legal Solutions company amassed several millions of pounds in UK while in Zimbabwe, Qoki sucked a whopping USD25million from investors some who were in UK, others in US, Canada, UAE, Australia and South Africa.\n\nThe SRAs findings follow a 3 year long ZimEye investigation that exposed the first case. In one of them, 56,000 was recovered following a protracted court battle at Birmingham in 2023. They state in part:\n\nGrounds of intervention into the practice of Julian CondliffeThere is reason to suspect dishonesty on the part of Ms Condliffe in connection with her practice as a solicitor  paragraph 1(1)(a)(i) Schedule 1 Solicitors Act 1974 (as amended).Ms Condliffe has failed to comply with rules  paragraph 1(1)( c) Schedule 1 Solicitors Act 1974.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | UK regulators have shut down a London based law firm. This is the entity … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/uk-regulator-shuts-down-tshabangu-welshman-linked-law-firm-to-protect-the-public/\">Continue reading<span class=\"screen-reader-text\"> \"UK Regulator Shuts Down Tshabangu-Welshman Linked Law Firm “To Protect The Public”\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "Search Intensifies for Missing Kariba Woman and Fisherman",
            "url": "https://www.zimeye.net/2025/01/18/search-intensifies-for-missing-kariba-woman-and-fisherman/",
            "content": "Kariba, Zimbabwe  January 18, 2025| By Farai D Hove | ZimEye |A massive community-led search operation is underway in Kariba following the disappearance of two residents, Sabina Maghona and a fisherman identified as Mativiri. The searches are being coordinated with the help of local leaders and concerned residents.\n\nSabina Maghona, 37, went missing on December 28, 2024, after telling people she was headed to Kariba General Hospital but never arrived. The search for her, led by Ward 2 Councillor George Masendu, has focused on areas near bushes where lion sightings are common, raising fears for her safety.\n\nParallel Search for Missing Fisherman\n\nIn a separate incident, Mativiri, a local spear fisherman, disappeared near the Zambezi River. Community members and authorities have launched a search along the riverbank, with concerns about dangerous wildlife and harsh terrain complicating the effort.\n\nAppeal to the Public\n\nCouncillor Masendu has urged residents in Kariba and surrounding areas to assist in the search. If you are in Kariba and can help, please contact me or report to the nearest police station, he said.\n\nLocal Member of Parliament Mutsa Murombedzi also highlighted the communitys efforts, urging anyone with information about the missing individuals to come forward.\n\nGrowing Concerns\n\nThe disappearances have sparked anxiety in Kariba, a town known for its proximity to wildlife habitats. Families and community members are working tirelessly to ensure the safe return of both individuals, while police continue to investigate the circumstances surrounding their disappearances.\n\nAuthorities have emphasized the need for vigilance and have called on anyone with information to assist in resolving the cases.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Kariba, Zimbabwe — January 18, 2025 | By Farai D Hove | ZimEye | A massive community-led search operation is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/search-intensifies-for-missing-kariba-woman-and-fisherman/\">Continue reading<span class=\"screen-reader-text\"> \"Search Intensifies for Missing Kariba Woman and Fisherman\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "Harare Water Tender Given An Unknown Company Called “Helcrow”",
            "url": "https://www.zimeye.net/2025/01/18/harare-water-tender-given-an-unknown-company-called-helcrow/",
            "content": "Harare Officials Question Water Infrastructure Deal Awarded to Helcraw Electrical Projects\n\nHarare, Zimbabwe  January 18, 2025\n\nHarare City Council officials have raised serious concerns over the governments selection of Helcraw Electrical Projects for a major water infrastructure contract, citing doubts about the companys financial and technical capacity. The Zimbabwe Independent has learned that these concerns were brought up during a series of meetings with the Ministry of Local Government and Public Works this week.\n\nHelcraw Electrical Projects, linked to Zanu PF legislator Farai Jere, has partnered with Chinese firm Hangzhou Laison Technology to establish a new water treatment plant, supply prepaid water meters, and replace sections of the citys aging pipe network. However, Harare officials have questioned the companys suitability for the multimillion-dollar project, given its unsuccessful bid to supply water meters in a US$2 million tender in 2023.\n\nLack of Due Diligence\n\nOn January 12, city officials, including acting water director Richard Kunyadini, attended a meeting at Makombe Building to discuss Helcraws selection. According to a senior government official, the discussions focused on whether Helcraw had the capacity to finance and implement the project.\n\nThe meeting emphasised the need for due diligence on Helcraw Electrical Projects. Concerns were raised about their financial and technical capacity to undertake the project and the lack of proof of funding, the source said.\n\nThe deal has also sparked criticism over its alleged lack of transparency. Helcraw reportedly signed a Memorandum of Understanding (MoU) with the government without undergoing a formal tender process.\n\nCosts and Scope of the Project\n\nConfidential documents reviewed by the Independent reveal that Helcraw will:\n\nSupply prepaid meters for 350,000 properties at a cost of US$96 million.\n\nReplace 100 kilometers of pipe network valued at US$23 million.\n\nDespite the magnitude of the project, officials at the meeting reportedly agreed that such an initiative could not be undertaken by a single firm, raising further doubts about Helcraws ability to deliver.\n\nResponses from Key Stakeholders\n\nFarai Jere, linked to Helcraw, declined to comment over the phone and requested a meeting with the publication next week. Acting water director Kunyadini referred questions to Harare Mayor Jacob Mafume, who defended the deal but acknowledged that no concerns were raised in his presence during the signing ceremony.\n\nI am in Russia. I attended the meetings to sign agreements. Not one person questioned their capacity in my presence, Mafume said.\n\nLocal Government Minister Daniel Garwe and Engineer Edmore Njoma, who also attended the meeting, did not respond to inquiries at the time of publication.\n\nBroader Concerns\n\nThis development comes as Harare battles a worsening water crisis, with aging infrastructure and inadequate resources affecting supply. Critics warn that awarding such a large-scale project without thorough scrutiny risks further mismanagement of public funds.\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) is reportedly being pressured to intervene and investigate the tender process. For now, the fate of the project remains uncertain as debates over Helcraws capacity and transparency intensify.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare Officials Question Water Infrastructure Deal Awarded to Helcraw Electrical Projects Harare, Zimbabwe — January 18, 2025 Harare City Council … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/harare-water-tender-given-an-unknown-company-called-helcrow/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Water Tender Given An Unknown Company Called “Helcrow”\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "ZRP Cops Caught In The Act",
            "url": "https://www.zimeye.net/2025/01/18/zrp-cops-caught-in-the-act/",
            "content": "Mutare, Zimbabwe  January 18, 2025\n\nIn a dramatic turn of events, a Mutare taxi driver exposed a bribery attempt by two officials after reporting them to the Zimbabwe Anti-Corruption Commission (ZACC). The accused persons, whose identities have not been disclosed, were apprehended after a sting operation organized by ZACC investigators.\n\nThe incident began on January 7, 2025, when the accused persons arrested the taxi driver for illegally operating in the Mutare Central Business District (CBD). They demanded a bribe of USD 90 to release his vehicle. Unable to pay the amount, the driver requested that they accompany him to his employers residence to collect the money.\n\nThe Clever Ruse\n\nInstead of driving to his employers home, the driver went to ZACC offices under the guise of collecting the money. Upon arrival, he parked outside the gate while the accused waited under a tree nearby. Inside the ZACC offices, the driver reported the bribery attempt, prompting officials to set up a trap.\n\nThe accused persons had disappeared by the time ZACC officers prepared the sting. However, the driver, now accompanied by an investigator posing as his employer, proceeded to the CBD to meet the accused.\n\nThe Sting Operation\n\nThe accused reappeared when the driver parked in the CBD. They entered his vehicle, accused him of deception, and reiterated their demand for a bribe. ZACC investigators, working undercover, negotiated the bribe down to USD 20. The accused then instructed the driver to head to the civic center, where they would collect the money.\n\nAs reinforcement officers moved in, the accused dropped the cash and attempted to flee the scene. Their escape was short-lived as they were quickly apprehended by ZACC officials.\n\nLegal Proceedings\n\nThe accused were granted bail and are scheduled to appear in court on January 25, 2025.\n\nThis incident highlights the ongoing fight against corruption in Zimbabwe, with citizens increasingly cooperating with anti-corruption authorities to expose malpractice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare, Zimbabwe — January 18, 2025 In a dramatic turn of events, a Mutare taxi driver exposed a bribery attempt … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/zrp-cops-caught-in-the-act/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Cops Caught In The Act\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "Mnangagwa Seeds Stolen",
            "url": "https://www.zimeye.net/2025/01/18/mnangagwa-seeds-stolen/",
            "content": "Presidential Input Scheme Seeds Stolen in Tsholotsho\n\nMatabeleland North, Zimbabwe  January 18, 2025\n\nA truckload of Presidential Input Scheme supplies destined for Ward Seven in Tsholotsho district has vanished without a trace, along with its accompanying personnel and crucial agricultural inputs. Nearly two weeks after its disappearance, authorities are yet to locate the truck, valued stock, or the individuals responsible for its delivery.\n\nThe vehicle, which went missing on January 4, was carrying:\n\n400 bags of 50kg Urea fertilizer\n\n30 bags of 10kg sunflower seeds\n\n100 bottles of 200ml Imidacloprid chemicals\n\nThe truck was last seen leaving the Tsholotsho Grain Marketing Board (GMB) depot under the supervision of extension officer Ms. Kwanele Dube, GMB contract employee Mr. Langton Ncube, and police officer Abisinjo Mpofu. None of the three have been seen or heard from since.\n\nDispatch Irregularities\n\nInvestigations revealed a troubling detail: the stock was not signed off in the provisional dispatcher book at the GMB depot because the book was reportedly full. This gap in protocol has raised questions about procedural compliance and the potential for internal collusion.\n\nMatabeleland North Acting Director of Local Government Services, Mr. Tapiwa Zivovoi, confirmed the lack of progress in the case. We have not been informed of any arrests nor recovery of the truck and its inputs, he said, calling for urgent action to address the situation.\n\nCID Steps In\n\nThe mysterious disappearance is now under the scrutiny of detectives from the Criminal Investigations Department (CID). Sources close to the investigation describe the case as highly sensitive, given the implications for the Presidential Input Scheme, which is a cornerstone of Zimbabwes efforts to bolster agricultural productivity and rural livelihoods.\n\nConcerns Over Accountability\n\nThis incident has sparked outrage and concern among local farmers in Ward Seven, who rely on these inputs to sustain their livelihoods. This is devastating. We were counting on this support to start the planting season, said one farmer.\n\nThe disappearance also raises broader concerns about accountability and the security of public resources. Calls are growing for a thorough overhaul of procedures surrounding the distribution and monitoring of government input programs.\n\nThe Presidential Input Scheme, championed by President Emmerson Mnangagwa, is a flagship initiative designed to provide smallholder farmers with seeds and fertilizers to enhance food security. This theft represents a significant blow to the programs objectives.\n\nAuthorities have urged anyone with information to come forward as investigations continue. For now, the fate of the missing truck and its contents remains shrouded in mystery.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Presidential Input Scheme Seeds Stolen in Tsholotsho Matabeleland North, Zimbabwe — January 18, 2025 A truckload of Presidential Input Scheme … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/mnangagwa-seeds-stolen/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Seeds Stolen\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "Bulawayo Man Jailed For Reckless Driving",
            "url": "https://www.zimeye.net/2025/01/18/bulawayo-man-jailed-for-reckless-driving/",
            "content": "By A Correspondent\n\nA reckless drive taken by Bulawayo resident Previous Moyo (24) ended in multiple accidents when he was involved in five separate crashes on the same day, while driving without a license and under the influence of alcohol.\n\nOn December 26 last year, after his sister, Sithembinkosi Chisenzi, left for her rural home in Masvingo, Previous entered her room, found the car keys hidden in the wardrobe, and took them without permission. He then drove towards the city center, where his first accident occurred when he rear-ended another vehicle near Bulawayo City Hall on 8th Avenue, before fleeing the scene.\n\nHis reckless driving continued as he was involved in another collision at the intersection of 8th Avenue and Joshua Mqabuko Street, once again driving off without stopping. He then made a U-turn and headed to the Parklands suburb, where he caused yet another accident on an unnamed road. He continued driving along Coghlan Avenue in Parklands, where he was involved in a fourth accident, once again failing to stop.\n\nA few minutes later, Previous collided with a cyclist, who managed to apprehend him and take him to Khumalo Police Base, where he was arrested.\n\nPrevious appeared before Bulawayo magistrate Ernest Muzembi on five counts of negligent driving and pleaded guilty to all charges. The magistrate sentenced him to seven months in jail, noting that his actions posed a significant risk to public safety, especially as he was driving without a license.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A reckless drive taken by Bulawayo resident Previous Moyo (24) ended in multiple accidents when he was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/bulawayo-man-jailed-for-reckless-driving/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Man Jailed For Reckless Driving\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "7 Children Drown In Green Valley Dam",
            "url": "https://www.zimeye.net/2025/01/18/7-children-drown-in-green-valley-dam/",
            "content": "By A Correspondent\n\nResidents of Green Valley suburb in Goromonzi have raised concerns over the alarming number of child drownings at in a nearby dam.\n\nBetween November last year and January this year, seven children lost their lives in the dams deep waters.\n\nThe dam, located in the Green Valley suburb of Goromonzi district, east of Harare, appears harmless with its decorative artificial waterfall. However, its deep waters, hidden by floating weeds, have proven fatal for young swimmers.\n\nA resident expressed during an interview with State broadcaster ZBC News, Children are drawn to swim here, but the depth of the dam wall is deceptive, and they end up drowning.\n\nAnother resident shared a local legend, Some believe a mermaid lurks beneath, given the mysterious circumstances surrounding the drownings.\n\nTo prevent further tragedies, residents are calling for measures to restrict access to the dam. Erecting a fence or concrete barrier with razor wire could save lives, suggested a concerned resident.\n\nThe latest victim, a 16-year-old boy, drowned on Tuesday, prompting renewed urgency for action to be taken to ensure the dam is safe and secure.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Residents of Green Valley suburb in Goromonzi have raised concerns over the alarming number of child drownings … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/7-children-drown-in-green-valley-dam/\">Continue reading<span class=\"screen-reader-text\"> \"7 Children Drown In Green Valley Dam\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "Chivayo Continues to Splash Looted Cash",
            "url": "https://www.zimeye.net/2025/01/18/chivayo-continues-to-splash-looted-cash/",
            "content": "By A Correspondent\n\nControversial businessman Wicknell Chivayo has once again sparked outrage with his lavish spending, this time gifting a brand-new Mercedes Benz C200 to C.H Mukungunugwa, a loyal Zanu PF foot-soldier. Chivayo, known for his close ties to the ruling party, took to his social media platform, X, to praise Mukungunugwas dedication to the party.\n\nChivayos gesture has raised questions about the sources of his wealth, particularly his history of rewarding loyal party members.\n\nCritics argue that such acts of generosity are a way to further cement loyalty within the party ranks. Chivayos distribution of cars to Zanu PF loyalists has become a point of contention, fueling speculation about his influence within the party and the nature of his business operations.\n\nChivayos business dealings have faced scrutiny in the past, including his involvement in the botched Gwanda project, which has been marred by allegations of corruption and mismanagement of state funds. The projects failure has sparked widespread outrage, with many Zimbabweans questioning how Chivayos company, Intratrek Zimbabwe, was awarded the tender despite lacking experience in the energy sector.\n\nAs the debate over Chivayos wealth continues, his latest gesture adds fuel to the ongoing conversation about the intersection of business, politics, and loyalty in Zimbabwe. Many are left wondering whether Chivayos lavish spending is a sign of his own success or a symptom of a larger problem  the looting of state funds through clandestine deals and corruption.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial businessman Wicknell Chivayo has once again sparked outrage with his lavish spending, this time gifting a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/chivayo-continues-to-splash-looted-cash/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Continues to Splash Looted Cash\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "Mnangagwa Ally Boasts of Economic Growth Amidst Widespread Poverty",
            "url": "https://www.zimeye.net/2025/01/18/mnangagwa-ally-boasts-of-economic-growth-amidst-widespread-poverty/",
            "content": "Owen Ncube, a key ally of President Emmerson Mnangagwa, has claimed that Zimbabwes economy is on an irreversible growth trajectory despite the countrys ongoing economic crisis. Ncube, the Minister of State for Provincial Affairs and Devolution, made these comments during the Hero Burial of John Mazwienzara at the Provincial Heroes Acre in Gweru.\n\nHowever, Ncubes assertions of economic growth contradict the harsh reality faced by many Zimbabweans. The country is struggling with soaring unemployment, inflation, and poverty, leaving many citizens feeling left behind.\n\nA Tale of Two Economies: Growth vs. Reality\n\nWhile Ncube boasts of signature modern infrastructure projects and heritage-based innovation, the World Bank paints a different picture. According to their report, Zimbabwes economy is expected to grow at a slower rate of 2% in 2024 due to El Nio-induced droughts, lower mining prices, and macroeconomic instability .\n\nThe report also highlights the countrys significant developmental challenges, including:\n\nZimbabwes Economic Reality Check\n\nAs Ncube and the government celebrate perceived economic growth, many Zimbabweans are struggling to make ends meet. The countrys economic challenges are real, and its essential to acknowledge and address them.\n\nRather than boasting of growth, the government should focus on implementing policies that benefit all Zimbabweans, not just a select few. This includes addressing macroeconomic vulnerabilities, investing in infrastructure, and promoting private sector-led growth.\n\nOnly then can Zimbabwe truly claim to be on a path towards sustainable economic growth and development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Owen Ncube, a key ally of President Emmerson Mnangagwa, has claimed that Zimbabwe’s economy is on an “irreversible growth trajectory” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/mnangagwa-ally-boasts-of-economic-growth-amidst-widespread-poverty/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ally Boasts of Economic Growth Amidst Widespread Poverty\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        },
        {
            "title": "Lawyer Says ‘Failing to Produce An O-Level Certificate Doesn’t Necessarily Mean Magaya Doesn’t Possess One’",
            "url": "https://www.zimeye.net/2025/01/18/lawyer-says-failing-to-produce-an-o-level-certificate-doesnt-necessarily-mean-magaya-doesnt-possess-one/",
            "content": "High Court Reserves Judgment on Magayas ZIFA Presidential Bid Challenge\n\nBy Court Correspondent | ZimEye | Harare  High Court judge Justice Tawanda Chitapi has reserved his judgment until Thursday in the case involving Walter Magaya, the founder of Yadah Stars, who is contesting his disqualification from running for the Zimbabwe Football Association (ZIFA) presidency.\n\nMagayas disqualification stems from his failure to produce an O-Level certificate or its equivalent, as required by the ZIFA constitution. Represented by renowned lawyer Thabani Mpofu, Magaya argues that the disqualification is unjustified.\n\nArguments from Magayas Legal Team\n\nMpofu described the matter as simple and straightforward, emphasizing that the ZIFA constitution only requires a minimum qualification of O-Level or its equivalent.\n\nIf a qualification issued by a university exceeds the standard of an O-Level, this application ought to succeed, Mpofu argued.\n\nHe accused ZIFA of failing to provide adequate reasons for Magayas disqualification, stating, The respondents are aware they need to justify their decision but have not demonstrated that the documents submitted by Magaya fail to meet the required qualifications.\n\nMpofu also stressed that failing to produce an O-Level certificate does not necessarily mean Magaya does not possess one, adding, The process allows time to comply and contest discrepancies in documentation.\n\nZIFAs Defense\n\nZIFA, represented by Professor Lovemore Madhuku, dismissed Magayas application as baseless and argued that it was improperly brought before the High Court. Madhuku maintained that ZIFA, as a private non-profit organization, is not subject to judicial review under administrative law.\n\nZIFA is not an administrative body. It is a private organization, and its decisions cannot be reviewed by this court, Madhuku submitted. He further argued that Magayas failure to produce an O-Level certificate disqualifies him outright, stating, The primary requirement is O-Level or its equivalent. Diplomas or higher qualifications cannot substitute this minimum standard.\n\nSharp Exchanges in Court\n\nMadhuku criticized Magayas legal approach, stating that his argument undermined the clear requirements of the ZIFA constitution. You cannot skip foundational requirements, just like you cannot start at Grade 4 without completing ECD, Madhuku quipped.\n\nHe also challenged Magayas claims of equivalence, asserting, If Magaya had an O-Level, he would have attached it to his application. The absence of this document speaks volumes.\n\nThe Verdict Awaits\n\nJustice Chitapi reserved judgment after hearing submissions from both parties. The outcome of this case could set a precedent for the interpretation of qualifications in sports governance in Zimbabwe. Should Magaya succeed, it may lead to a broader discussion on the alignment of ZIFAs electoral requirements with international best practices.\n\nFor now, all eyes remain on the High Court as it prepares to deliver its ruling on this contentious matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "High Court Reserves Judgment on Magaya’s ZIFA Presidential Bid Challenge By Court Correspondent | ZimEye | Harare – High Court … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/18/lawyer-says-failing-to-produce-an-o-level-certificate-doesnt-necessarily-mean-magaya-doesnt-possess-one/\">Continue reading<span class=\"screen-reader-text\"> \"Lawyer Says ‘Failing to Produce An O-Level Certificate Doesn’t Necessarily Mean Magaya Doesn’t Possess One’\"</span></a></p>",
            "time": "06:31",
            "date": "19 Jan 2025"
        }
    ]
}