{
    "news": [
        {
            "title": "Mother Arrested for Selling Two-Year-Old Son for R75,000",
            "url": "https://www.zimeye.net/2025/02/15/mother-arrested-for-selling-two-year-old-son-for-r75000/",
            "content": "By A Correspondent\n\nA shocking case of child trafficking has come to light in Vanderbijlpark, where a 32-year-old mother, Keneilwe Shalaba, has been arrested for selling her two-year-old son for a staggering R75,000.\n\nShalaba, who is currently pregnant with twins, had initially reported her son missing in November, claiming that he had been snatched from her. However, investigations revealed a sinister truth  she had received payment for her son on the very same day she reported him missing.\n\nThe authorities have taken Shalaba into custody, and she is facing charges related to child trafficking. The case has sent shockwaves through the community, raising concerns about the safety and welfare of children.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking case of child trafficking has come to light in Vanderbijlpark, where a 32-year-old mother, Keneilwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/mother-arrested-for-selling-two-year-old-son-for-r75000/\">Continue reading<span class=\"screen-reader-text\"> \"Mother Arrested for Selling Two-Year-Old Son for R75,000\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "A Tribute To Morgan Richard Tsvangirai",
            "url": "https://www.zimeye.net/2025/02/15/a-tribute-to-morgan-richard-tsvangirai/",
            "content": "By A Correspondent\n\nOn the 14th of February 2018, Zimbabwe and the world lost one of its most remarkable political figures: Morgan Tsvangirai, the founding president of the Movement for Democratic Change (MDC). His death marked the end of an era for Zimbabwean politics, and a deep sense of loss reverberated across the nation and beyond.\n\nBorn on March 10, 1952, in Gutu, Zimbabwe, Tsvangirais life journey would become one of resilience, defiance, and undying commitment to democracy. A labor leader by trade, he rose to prominence in the 1990s when he became the Secretary-General of the Zimbabwe Congress of Trade Unions (ZCTU). In the face of oppressive government policies, he spoke boldly for workers rights and social justice. His outspokenness against Zimbabwes ruling party, ZANU-PF, ultimately led him to establish the MDC in 1999, a political party dedicated to providing an alternative to the long-standing regime of President Robert Mugabe.\n\nTsvangirais political path was not without hardship. He faced intimidation, imprisonment, and brutal violence at the hands of those who opposed his ideals. Despite this, he stood resolute, never wavering in his commitment to democratic change, human rights, and the well-being of all Zimbabweans.\n\nHis leadership of the MDC was a beacon of hope for millions of Zimbabweans who were disillusioned with the status quo. Tsvangirais courage inspired a generation of people to believe in a better, more democratic future. He led the MDC through turbulent elections, most notably in 2008, when his party won the first-round vote but was denied victory in the subsequent run-off, after the regime resorted to extreme violence and manipulation.\n\nDespite these challenges, Morgan Tsvangirai remained steadfast in his belief that the path to freedom and democracy could not be diverted by tyranny. His political journey was marked by both victories and defeats, but through it all, he never lost sight of his mission to establish a fair and just society for all Zimbabweans.\n\nHis most significant legacy perhaps came in the form of the coalition government that was formed in 2009. Tsvangirai entered into a power-sharing agreement with Robert Mugabe, where he became the Prime Minister. The government, though fraught with difficulties, brought a semblance of stability to Zimbabwe after years of economic collapse and political strife. This chapter was a testament to Tsvangirais pragmatism and commitment to ensuring Zimbabwes survival amidst adversity.\n\nTsvangirais passing in Johannesburg on February 14, 2018, was a moment of profound grief, not only for his family, but for all those who saw him as a symbol of hope. As the MDC mourned the loss of their leader, Zimbabweans reflected on his unyielding struggle for democracy and his role in shaping the nations political landscape.\n\nToday, as we remember Morgan Tsvangirai, we honor his indelible mark on Zimbabwes history. He was a fighter, a democrat, and a true patriot. In the words of those who loved him, he ran his race and fought a good fight. His legacy lives on in the hearts of the many people who continue to strive for the ideals he stood for.\n\nRest in peace, Pakuru. Morgan Richard Tsvangirai, Chikara cheZanu (the Lion of Zanu), may your courage and determination never be forgotten. MHSRIP.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent On the 14th of February 2018, Zimbabwe and the world lost one of its most remarkable political … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/a-tribute-to-morgan-richard-tsvangirai/\">Continue reading<span class=\"screen-reader-text\"> \"A Tribute To Morgan Richard Tsvangirai\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "Mnangagwa Grabs Controversial Award",
            "url": "https://www.zimeye.net/2025/02/15/mnangagwa-grabs-controversial-award/",
            "content": "By Own Correspondent\n\nZimbabwes President, Emmerson Mnangagwa, was awarded the Liberation Vanguard Award by the Africa Youth Congress (AYC) on Wednesday, a recognition that has sparked mixed reactions.\n\nThe award was presented to Mnangagwa at a ceremony in Harare, which was attended by Taurai Kandishaya, a prominent Zanu PF Youth League official.\n\nSpeaking about the award, Kandishaya, who is also the President of the Africa Youth Congress, stated:Today, in my capacity as President of Africa Youth Congress, leading my delegation, I had the honour and privilege of handing over an award to President ED Mnangagwa from Africa Youth Congress, which was given to him at a congress held in Uganda in January.\n\nThe Liberation Vanguard Award was presented to Mnangagwa in recognition of his unwavering dedication and contribution to the liberation, freedom, justice, and sovereignty of African nations through self-determination across the continent, according to Kandishaya. The award was touted as a tribute to Mnangagwas leadership in championing the African ideal of self-dependence, a sentiment he has consistently expressed with the Nyika Inovakwa Nevene Vayo mantra, which translates to the country is built by its own people.\n\nKandishaya further elaborated on the significance of the award, stating:The Nyika Inovakwa Nevene Vayo mantra is a clear vision of self-dependence, inclusivity, and determination to nation-building.\n\nHowever, the award has raised eyebrows, with critics questioning the motives behind such recognitions and the organizations credibility. The timing of the award and the political implications surrounding Mnangagwas leadership have sparked debate, especially given the ongoing challenges faced by Zimbabwe under his rule, including issues of governance, human rights, and economic instability.\n\nWhile Mnangagwas supporters have hailed the award as a well-deserved acknowledgment of his contributions to Africas sovereignty and self-determination, others view it as a politically motivated gesture by an organization closely linked to the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Own Correspondent Zimbabwe’s President, Emmerson Mnangagwa, was awarded the Liberation Vanguard Award by the Africa Youth Congress (AYC) on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/mnangagwa-grabs-controversial-award/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Grabs Controversial Award\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "Wolverhampton Wanderers Boss Speaks On Munetsi Potential",
            "url": "https://www.zimeye.net/2025/02/15/wolverhampton-wanderers-boss-speaks-on-munetsi-potential/",
            "content": "Sports Correspondent\n\nWolves coach Vitor Pereira has expressed his admiration for new signing Marshall Munetsi, predicting that the midfielder will score numerous goals for the club. Munetsi made his debut for Wolves in the 2-0 FA Cup win over Blackburn Rovers, showcasing his attacking prowess.\n\nPereira praised Munetsis unique blend of physicality and goal-scoring ability, highlighting his capacity to transition quickly from defense to offense. The coach noted that Munetsis career history demonstrates his ability to score goals, and he is eager to see this trait continue at Wolves.\n\nMunetsis debut performance, which included a header that went wide and a one-on-one opportunity, has given Pereira confidence in the midfielders potential to add a new dimension to Wolves attack.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Wolves coach Vitor Pereira has expressed his admiration for new signing Marshall Munetsi, predicting that the midfielder will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/wolverhampton-wanderers-boss-speaks-on-munetsi-potential/\">Continue reading<span class=\"screen-reader-text\"> \"Wolverhampton Wanderers Boss Speaks On Munetsi Potential\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "So Sad: Young Madrid Fan Dies After Fulfilling Wish To Meet Mbappe",
            "url": "https://www.zimeye.net/2025/02/15/so-sad-young-madrid-fan-dies-after-fulfilling-wish-to-meet-mbappe/",
            "content": "By A Correspondent\n\nA heartbreaking tragedy has struck the Real Madrid community with the passing of a young fan, Lorenzo, who had recently fulfilled his lifelong dream of meeting Kylian Mbapp and the team.\n\nLorenzos visit to the Santiago Bernabu Stadium was a memorable experience, and the club is deeply saddened by his loss. Real Madrid Club de Ftbol, its president, and the Board of Directors have extended their condolences to Lorenzos loved ones.\n\nIn a statement, the club remembered Lorenzo with great affection, acknowledging the significant impact he had on the Real Madrid community. His memory will continue to inspire and be cherished by the team and fans.\n\nThe club wishes Lorenzo eternal peace, and his legacy will live on in the hearts of everyone associated with Real Madrid.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A heartbreaking tragedy has struck the Real Madrid community with the passing of a young fan, Lorenzo, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/so-sad-young-madrid-fan-dies-after-fulfilling-wish-to-meet-mbappe/\">Continue reading<span class=\"screen-reader-text\"> \"So Sad: Young Madrid Fan Dies After Fulfilling Wish To Meet Mbappe\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "Mnangagwa Lures Healthcare Workers With Residential Stands",
            "url": "https://www.zimeye.net/2025/02/15/mnangagwa-lures-healthcare-workers-with-residential-stands/",
            "content": "By A Correspondent\n\nIn a move that appears aimed at influencing healthcare professionals, the Zanu PF-affiliated group Doctors and Nurses4ED is offering residential stands for as little as USD 190.\n\nThe stands, reportedly being taken from local authorities across Zimbabwe, are part of a larger strategy to win over doctors and nurses.\n\nIn a statement issued on Friday, Doctors and Nurses4ED shared details of their ongoing efforts, specifically the Marondera project.\n\nAccording to the group, the project is nearing completion, with significant progress being made on the site. I would like to inform you that our Marondera project is almost complete. There is massive work being done on the site. Few stands left for those interested, the statement reads.\n\nThe group encourages medical professionals to act quickly, offering a tempting deal: Just pay $190 and get your stand, Paperwork and allocation done on the same day. To further incentivize potential buyers, they provided a contact number for interested parties: For more information contact 0785477262. Thank you, Cde Basikoro.\n\nThis offer raises concerns about the ethical implications of such deals and whether they are part of a larger political strategy to gain support from healthcare workers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that appears aimed at influencing healthcare professionals, the Zanu PF-affiliated group Doctors and Nurses4ED … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/mnangagwa-lures-healthcare-workers-with-residential-stands/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Lures Healthcare Workers With Residential Stands\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "Remembering Right Honourable Morgan Tsvangirai",
            "url": "https://www.zimeye.net/2025/02/15/remembering-right-honourable-morgan-tsvangirai/",
            "content": "By Own Correspondent\n\nOn the 14th of February 2018, Zimbabwe and the world lost one of its most remarkable political figures: Morgan Tsvangirai, the founding president of the Movement for Democratic Change (MDC). His death marked the end of an era for Zimbabwean politics, and a deep sense of loss reverberated across the nation and beyond.\n\nBorn on March 10, 1952, in Gutu, Zimbabwe, Tsvangirais life journey would become one of resilience, defiance, and undying commitment to democracy. A labor leader by trade, he rose to prominence in the 1990s when he became the Secretary-General of the Zimbabwe Congress of Trade Unions (ZCTU). In the face of oppressive government policies, he spoke boldly for workers rights and social justice. His outspokenness against Zimbabwes ruling party, ZANU-PF, ultimately led him to establish the MDC in 1999, a political party dedicated to providing an alternative to the long-standing regime of President Robert Mugabe.\n\nTsvangirais political path was not without hardship. He faced intimidation, imprisonment, and brutal violence at the hands of those who opposed his ideals. Despite this, he stood resolute, never wavering in his commitment to democratic change, human rights, and the well-being of all Zimbabweans.\n\nHis leadership of the MDC was a beacon of hope for millions of Zimbabweans who were disillusioned with the status quo. Tsvangirais courage inspired a generation of people to believe in a better, more democratic future. He led the MDC through turbulent elections, most notably in 2008, when his party won the first-round vote but was denied victory in the subsequent run-off, after the regime resorted to extreme violence and manipulation.\n\nDespite these challenges, Morgan Tsvangirai remained steadfast in his belief that the path to freedom and democracy could not be diverted by tyranny. His political journey was marked by both victories and defeats, but through it all, he never lost sight of his mission to establish a fair and just society for all Zimbabweans.\n\nHis most significant legacy perhaps came in the form of the coalition government that was formed in 2009. Tsvangirai entered into a power-sharing agreement with Robert Mugabe, where he became the Prime Minister. The government, though fraught with difficulties, brought a semblance of stability to Zimbabwe after years of economic collapse and political strife. This chapter was a testament to Tsvangirais pragmatism and commitment to ensuring Zimbabwes survival amidst adversity.\n\nTsvangirais passing in Johannesburg on February 14, 2018, was a moment of profound grief, not only for his family, but for all those who saw him as a symbol of hope. As the MDC mourned the loss of their leader, Zimbabweans reflected on his unyielding struggle for democracy and his role in shaping the nations political landscape.\n\nToday, as we remember Morgan Tsvangirai, we honor his indelible mark on Zimbabwes history. He was a fighter, a democrat, and a true patriot. In the words of those who loved him, he ran his race and fought a good fight. His legacy lives on in the hearts of the many people who continue to strive for the ideals he stood for.\n\nRest in peace, Pakuru. Morgan Richard Tsvangirai, Chikara cheZanu (the Lion of Zanu), may your courage and determination never be forgotten. MHSRIP.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Own Correspondent On the 14th of February 2018, Zimbabwe and the world lost one of its most remarkable political … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/remembering-right-honourable-morgan-tsvangirai/\">Continue reading<span class=\"screen-reader-text\"> \"Remembering Right Honourable Morgan Tsvangirai\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "Mother Sells Own Son For Cash Reward",
            "url": "https://www.zimeye.net/2025/02/15/mother-sells-own-son-for-cash-reward/",
            "content": "By A Correspondent\n\nA shocking case of child trafficking has come to light in Vanderbijlpark, where a 32-year-old mother, Keneilwe Shalaba, has been arrested for selling her two-year-old son for a staggering R75,000.\n\nShalaba, who is currently pregnant with twins, had initially reported her son missing in November, claiming that he had been snatched from her. However, investigations revealed a sinister truth  she had received payment for her son on the very same day she reported him missing.\n\nThe authorities have taken Shalaba into custody, and she is facing charges related to child trafficking. The case has sent shockwaves through the community, raising concerns about the safety and welfare of children.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking case of child trafficking has come to light in Vanderbijlpark, where a 32-year-old mother, Keneilwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/15/mother-sells-own-son-for-cash-reward/\">Continue reading<span class=\"screen-reader-text\"> \"Mother Sells Own Son For Cash Reward\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "Chamisa Survives Mnangagwa Covid Assassination Plot",
            "url": "https://www.zimeye.net/2025/02/14/chamisa-survives-mnangagwa-covid-assassination-plot/",
            "content": "ByMunacho Gwanada-Opposition politician Nelson Chamisa narrowly escaped an assassination attempt orchestrated by Zimbabwes ruling ZANU PF during the COVID-19 pandemic.\n\nZimbabwes Central Intelligence Organisation (CIO) devised a plan in 2020 to eliminate Chamisa and frame his death as a consequence of the coronavirus.\n\nChamisa, who contested the 2018 presidential election and lost narrowly to President Emmerson Mnangagwa, was reportedly identified as the primary threat to ZANU PFs continued dominance.\n\nThe plan was, however, thwarted by internal resistance within the CIO.\n\nChamisa was not the only high-profile figure targeted during this period.\n\nSeveral military generals who played key roles in the 2017 coup that ousted longtime ruler Robert Mugabe and installed Mnangagwa also died under mysterious circumstances, particularly during the COVID-19 crisis.\n\nThese deaths fueled speculation of a systematic purge aimed at consolidating Mnangagwas grip on power by eliminating potential challengers within the military and intelligence sectors.\n\nAmong those who died under suspicious circumstances were:\n\nThese deaths coincided with Mnangagwas aggressive moves to sideline perceived threats within the security establishment.\n\nObservers noted a pattern where influential figures whohad the capability tochallenge Mnangagwas authority werebeing systematically removed.\n\nAccording to aShepherd Bushiri publicist, Former CIO Director-General Isaac Moyo reportedly resisted authorizing assassination plots against opposition figures, including Chamisa, which led to his eventual ousting.\n\nMoyo, a career diplomatwho had previously servedas Zimbabwes ambassador to South Africa, was perceived by some within the CIO as too lenient.\n\nHis subordinates accused him of being too nice and unwilling to engage in covert operations that could solidify Mnangagwas hold on power.\n\nAccording to the online news portal, Mnangagwa received intelligence assessments as early as 2020 criticizing Moyos leadership, particularly his refusal to authorize the elimination of political adversaries under the guise of COVID-19 deaths.\n\nOne such report, dated February 15, 2021, explicitly stated that Moyo had turned down two assassination operations targeting opposition leaders.\n\nThe plan, allegedly pushed by the CIOs operative division, proposed using the pandemic as a cover to eliminate key opposition figures without attracting international scrutiny.\n\nMoyos stance led to tensions within the agency. In a heated Joint Operations Command (JOC) meeting, his deputies openly confronted him, declaring, You are not an operative.Hewas further criticizedfor introducinginternal reforms that were unpopularamong CIO operatives, such as requiring them to surrender their identity cards at the end of each shift to curb abuses, demanding reports on excessive force, and restricting the carrying of weapons.\n\nBy January 2025, Mnangagwa had removed Moyo from his position, replacing him with Fulton Mangwanya, the former director-general of the Zimbabwe Parks and Wildlife Management Authority.\n\nThis movewas widely interpretedas Mnangagwa tightening his control over the intelligence services and ensuring that the CIO remained loyal to his rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwanada-Opposition politician Nelson Chamisa narrowly escaped an assassination attempt orchestrated by Zimbabwe’s ruling ZANU PF during the COVID-19 pandemic. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/chamisa-survives-mnangagwa-covid-assassination-plot/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Survives Mnangagwa Covid Assassination Plot\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        },
        {
            "title": "Kasukuwere: War Vets Are An Extension of the Military",
            "url": "https://www.zimeye.net/2025/02/14/kasukuwere-war-vets-are-an-extension-of-the-military/",
            "content": "The Reckoning of Zimbabwe: Saviour Kasukuweres Bold Stand Against Mnangagwas Rule\n\nThe echoes of history are loud, and Zimbabwe stands at a precarious moment. Former Minister Saviour Kasukuwere, once an insider of the ruling Zanu PF, now finds himself in exile, reflecting on the fate of his homeland. In a candid and unfiltered interview, Kasukuwere lays bare the state of the nation, the betrayal of the liberation ethos, and the emergence of a new resistance, led by war veterans and figures like Blessed Gezaknown in the struggle as Comrade Bombshell.\n\nAs the political landscape shifts towards the much-debated 2030 agenda, where President Emmerson Mnangagwa seeks an extended term beyond constitutional limits, Zimbabweans find themselves at a crossroads. The growing unrest within Zanu PF, the discontent among war veterans, and the fear of yet another coup all paint a familiar pictureone reminiscent of the events that led to Robert Mugabes ousting in 2017.\n\nA Nation Betrayed: The Fallacy of the New Dispensation\n\nKasukuwere does not mince words when describing Mnangagwas leadership during an interview with HSTVs Blessed Mhlanga. His accusations are damningcorruption, tribalism, economic decay, and state-sponsored violence. We have a dinosaur sitting on top of the country, he declares, highlighting how Mnangagwas greed has robbed Zimbabweans of hope. The presidents appetite for wealth, control, and absolute power has turned the country into a personal fiefdom.\n\nThe best women, the best cars, the most moneyhe wants it all. The industries are his, the gold is his, even the agricultural sector has been privatized to his farm, Kasukuwere says with clear disdain. His frustration is not just with Mnangagwas economic control but with his deliberate effort to erase national progress. Every sector in Zimbabwe is crumblinghealth, education, industry. Once a regional leader in literacy and agricultural self-sufficiency, Zimbabwe has now become a case study in regression.\n\nYet, as Mnangagwa consolidates power, he faces an unexpected rebellionnot from the opposition, but from within his own camp.\n\nThe Return of the War Veterans: Blessed Gezas Defiance\n\nOne of the most unexpected turns in Zimbabwes political climate is the emergence of Blessed Geza, or Comrade Bombshell, as a voice of resistance. Kasukuwere sees Geza as a critical figure in the struggle against Mnangagwas prolonged rule.\n\nThe war veterans are an extension of the defense forces, Kasukuwere reminds his audience. When they speak, the state must listen. And Geza has spokenloudly and without fear.\n\nHis demands? Accountability. An end to corruption. Justice for the fallen generals. And most controversially, the immediate resignation of Mnangagwa.\n\nGezas critique goes beyond personal grievances; he speaks to the core betrayal of the liberation struggle. The ideals that led thousands to the battlefieldsland, economic independence, and equalityhave been reduced to personal gain for a few elites. Instead of empowering the veterans who fought for Zimbabwes independence, Mnangagwa has marginalized them, reducing their contributions to cheap political tokens.\n\nKasukuwere warns that ignoring these calls for change is a dangerous gamble. The war veterans were instrumental in removing Mugabe, and they have the capacity to challenge Mnangagwa. A dead man can rise, he says cryptically, hinting that history has a way of repeating itself.\n\nThe Corruption Nexus: A Nation Held Hostage\n\nOne of Kasukuweres most explosive allegations is the complete capture of Zimbabwes economy by a network of corrupt officials. He details how Mnangagwa personally interferes in government procurement, suspending laws to allow unchecked looting.\n\nHow does a president get involved in the procurement of goats, oil, and even water boreholes? he asks incredulously. A leader must govern, not run a marketplace.\n\nHe points to the scandal of the presidential goat scheme, where millions of dollars were allegedly siphoned under the guise of an agricultural initiative. Instead of facing justice, Mnangagwa has remained silent, treating the allegations as minor inconveniences rather than national betrayals.\n\nThe judiciary, too, has been weaponized. Kasukuwere himself is a victim, having been forced into exile under false charges. His decision to challenge Mnangagwa in the 2023 elections was met with an immediate legal blockade, exposing the complete breakdown of democracy in Zimbabwe.\n\nZimbabwe is now a mafia state, he states bluntly. Laws only apply to the powerless.\n\nThe 2030 Agenda: A Power Grab Disguised as Development\n\nAt the heart of Zimbabwes political crisis is Mnangagwas push to remain in power until 2030. This, according to Kasukuwere, is nothing more than a self-serving illusion.\n\nThe 2030 agenda is a UN framework, not a Zanu PF manifesto, he points out. It was never meant to be an excuse for dictatorship.\n\nHe criticizes the ruling partys obsession with blind loyalty, where any dissent is dismissed as treasonous. Mnangagwas factional supporters have branded all critics as either G40 remnants or Chamisa sympathizers, conveniently ignoring legitimate grievances.\n\nYet, Kasukuwere believes this strategy will backfire. You cannot silence an entire nation, he warns. Sooner or later, the people will rise.\n\nA Glimpse into the Future: Will Another Coup Happen?\n\nZimbabweans are asking the inevitable question: Is another coup on the horizon?\n\nThe war veterans call for Mnangagwas resignation, combined with growing dissatisfaction within the military, suggests that history may indeed repeat itself. The same forces that toppled Mugabe in 2017 could once again turn against the regimethis time against a leader who once benefited from their support.\n\nKasukuwere, however, is cautious. He does not explicitly endorse a coup, but he acknowledges that Mnangagwas rule is becoming increasingly untenable.\n\nThe courts legalized the 2017 coup, he reminds Zimbabweans. If the military were to intervene again, would it be illegal? Or would it simply be the continuation of a precedent?\n\nConclusion: A Nation at a Crossroads\n\nSaviour Kasukuweres interview is more than just political rhetoricit is a warning. Zimbabwe cannot afford another decade of economic collapse, political repression, and social decay.\n\nThe resistance is growing. The war veterans have spoken. The corruption is exposed. And the people are watching.\n\nThe fate of Zimbabwe now rests on whether Mnangagwa listensor if he repeats the mistakes of his predecessor.\n\nEither way, change is coming. And this time, Kasukuwere promises, we will never allow this to happen again.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Reckoning of Zimbabwe: Saviour Kasukuwere’s Bold Stand Against Mnangagwa’s Rule The echoes of history are loud, and Zimbabwe stands … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/14/kasukuwere-war-vets-are-an-extension-of-the-military/\">Continue reading<span class=\"screen-reader-text\"> \"Kasukuwere: War Vets Are An Extension of the Military\"</span></a></p>",
            "time": "09:07",
            "date": "16 Feb 2025"
        }
    ]
}