{
    "news": [
        {
            "title": "Zimbabwean Official Joins South Africa’s AFCON 2025 Technical Setup",
            "url": "https://www.zimeye.net/2025/12/11/zimbabwean-official-joins-south-africas-afcon-2025-technical-setup/",
            "content": "Sports Correspondent  South Africa has reinforced its technical bench ahead of the 2025 Africa Cup of Nations by bringing in Zimbabwean match analyst Tinashe-Shingai Mukandatsama, who is currently attached to Mamelodi Sundowns.\n\nThe South African Football Association (SAFA) confirmed the appointment on Wednesday, signalling a push to strengthen Bafana Bafanas analytical departments before the continental tournament. In a statement posted on its website, SAFA said: Senior Performance Analyst Sinesipho Mali will also not be alone in Morocco as Under-20 World Cup analyst Tinashe-Shingai Mukandatsama has joined his department.\n\nBafana Bafana will compete in Group B at AFCON, where they are set to face Egypt, Angola, and Zimbabwe. Their opening match is scheduled for 22 December 2025 against Angola.\n\nSouth Africa will wrap up their group-stage campaign with a highly anticipated clash against the Zimbabwe Warriors on 30 December.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – South Africa has reinforced its technical bench ahead of the 2025 Africa Cup of Nations by bringing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/zimbabwean-official-joins-south-africas-afcon-2025-technical-setup/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Official Joins South Africa’s AFCON 2025 Technical Setup\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "Munetsi, Billiat Out Of Warriors AFCON Squad",
            "url": "https://www.zimeye.net/2025/12/11/munetsi-billiat-out-of-warriors-afcon-squad/",
            "content": "Sports Correspondent -ZIFA confirmed on Thursday that several key players will miss out on Zimbabwes squad for the upcoming Africa Cup of Nations (AFCON) in Morocco.\n\nNotable absentees include former Mamelodi Sundowns star Khama Billiat, Wolverhampton Wanderers midfielder Marshall Munetsi, as well as Jordan Zemura, Thando Ngwenya, and Tinotenda Kadewere.\n\nDespite these omissions, the Warriors squad still boasts a number of foreign-based talents such as Marvelous Nakamba, Daniel Msendami, and Tawanda Chirewa. Zimbabwe has been drawn in Group B, where they will face Egypt, Angola, and South Africa.\n\nWarriors coach Marian Mario Marinica remains optimistic, emphasizing the teams preparation: Sharpening focus. Building belief. The Warriors rise with purpose as AFCON approaches.\n\nWarriors squad\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent -ZIFA confirmed on Thursday that several key players will miss out on Zimbabwe’s squad for the upcoming Africa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/munetsi-billiat-out-of-warriors-afcon-squad/\">Continue reading<span class=\"screen-reader-text\"> \"Munetsi, Billiat Out Of Warriors AFCON Squad\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "Police Wary Of Rising Murder Cases At Beer Drinking Places",
            "url": "https://www.zimeye.net/2025/12/11/police-wary-of-rising-murder-cases-at-beer-drinking-places/",
            "content": "By A Correspondent  The Zimbabwe Republic Police (ZRP) has expressed alarm over a surge in deadly incidents linked to disputes at bars and beer halls nationwide. Commissioner Paul Nyathi, speaking on Tuesday, 9 December, warned that minor arguments are increasingly turning into lethal confrontations.\n\nOn 1 December, Taurai Hungwe, 29, was fatally stabbed in the chest with an okapi knife by a man known only as Prosper during a nightclub altercation in Beitbridge. Hungwe was rushed to Beitbridge District Hospital but died on 3 December. The suspect remains at large.\n\nJust three days later, 27-year-old Kudakwashe Mudyanevana was attacked with an axe at a bottle store in Claremont Business Centre, Fort Rixon. The assault, allegedly carried out by a man named Tshuks and four accomplices, led to Mudyanevanas death en route to Filabusi Hospital. Police are still searching for the suspects.\n\nOn 5 December, Leonard Chidhoma, 45, was killed in Chibhabhawabha, Battlefields, by two unidentified men who accused him of spreading false information about them. His body was discovered in his room the following day.\n\nIn Bulawayo on 7 December, 26-year-old Mongiwehtu Godnows Dube was killed after an argument with Keith Dube at a sports bar in Magwegwe North, reportedly stemming from spilt beer during a snooker game.\n\nThat same day in Mantiya Village, Lower Gweru, 26-year-old Tinotenda Gibson Madanhire allegedly struck 52-year-old Richard Sibanda multiple times on the head with a stone during a drinking dispute at a funeral. Sibanda later died from his injuries, and Madanhire has been arrested.\n\nCommissioner Nyathi called on the public to exercise restraint, resolve conflicts peacefully, and avoid violent behaviour.\n\nHe urged citizens to act responsibly and immediately report any suspicious or aggressive conduct to the police.\n\nZRP\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Republic Police (ZRP) has expressed alarm over a surge in deadly incidents linked to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/police-wary-of-rising-murder-cases-at-beer-drinking-places/\">Continue reading<span class=\"screen-reader-text\"> \"Police Wary Of Rising Murder Cases At Beer Drinking Places\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "Tungwarara Speaks On Co-option Into Zanu PF Central Committee",
            "url": "https://www.zimeye.net/2025/12/11/tungwarara-speaks-on-co-option-into-zanu-pf-central-committee/",
            "content": "Tinashe Sambiri In a statement on Wednesday,  Paul Tungwarara, Special Investment Advisor on Investments to President Mnangagwa, expressed gratitude for being recommended for co-option into the ZANU PF Central Committeea move critics argue reflects the partys tendency to reward loyalty over merit.\n\nI am deeply humbled and honoured by the decision of the Manicaland Province to recommend me for co-option into the ZANU PF Central Committee. This expression of confidence from my home province is something I did not expect, and I receive it with a profound sense of gratitude and responsibility, Tungwarara said, emphasizing his allegiance to the party rather than addressing broader public concerns.\n\nShould the recommendation be endorsed by the ZANU PF leadership, Tungwarara pledged to serve with unwavering commitment and loyalty, signaling continued alignment with a system critics describe as prioritizing political patronage over effective governance.\n\nI fully understand the weight of this responsibility and pledge to uphold the values and principles of our revolutionary Party, he added, underlining the focus on party interests rather than the challenges facing ordinary Zimbabweans.\n\nTungwarara further emphasized his dedication to advancing the vision and developmental agenda of His Excellency, the President and First Secretary of ZANU PF, Cde Dr. Emmerson Dambudzo Mnangagwa, a statement observers say illustrates the concentration of power and loyalty within the party elite.\n\nTogether, we will continue to build a prosperous, empowered, and united Zimbabwe. Forward with the peoples revolution! 2030 NdeyaEmmerson! Pamberi neZANUPF, he concluded, in remarks some analysts describe as heavy on rhetoric but light on addressing the countrys pressing social and economic issues.\n\nTungwarara now stands as a visible example of ZANU PFs practice of rewarding loyalty, raising concerns about whether competence or political allegiance will drive key decisions in Zimbabwes governance.\n\nPaul Tungwarara\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– In a statement on Wednesday, Paul Tungwarara, Special Investment Advisor on Investments to President Mnangagwa, expressed gratitude for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/tungwarara-speaks-on-co-option-into-zanu-pf-central-committee/\">Continue reading<span class=\"screen-reader-text\"> \"Tungwarara Speaks On Co-option Into Zanu PF Central Committee\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "Fake Doctorates Are Now Zimbabwe’s Silent Crisis",
            "url": "https://www.zimeye.net/2025/12/11/fake-doctorates-are-now-zimbabwes-silent-crisis/",
            "content": "By Shelton Muchena| The dawn broke over Harare with the softness of a psalm, yet beneath the morning calm lay a discordant truth.In a nation where titles glitter brighter than the work behind them, a quiet industry had risen an altar of paper crowns, worn by those who sought honour without labour. The year was 2025, and Zimbabwe was awakening to its own manufactured chorus of scholars.\n\nChaplain Thandiwe Ruvimbo Phiri, a respected officer within the Zimbabwe Prison and Correctional Services, found herself unexpectedly illuminated by this awakening. Just four days earlier, she had proudly graduated as part of the Class of 2025 from Christ Life Bible Institute, receiving a Doctor of Philosophy degree that promised prestige and authority. But the institute that awarded it was not registered to grant such a credential in Zimbabwe. When regulators confirmed that Christ Life Bible Institute held no authority to confer degrees, particularly at the doctoral level, questions surged from the shadows to the centre of national scrutiny.\n\nChrist Life Bible Institute was no newcomer to quiet controversy. It existed on the borders of legitimacy, with glossy brochures, travelling lecturers and a collection of supposed international partners whose credibility dissolved under investigation. Its catalogue of degrees from bachelors programmes to doctorates was ambitious. Its academic standards, however, appeared almost ethereal.\n\nYet Chaplain Phiri was not the only figure draped in uncertain regalia. A growing list of high-ranking officials had been linked to similarly unverified theological qualifications. Among them was a senior cabinet official, Minister of Information Communication Technology, Postal and Courier Services of Zimbabwe Hon Tatenda Annastacia Mavetera, whose doctoral title had fuelled debate both online and within party corridors. Another prominent name was celebrity pastor and businessman Dr Elias Mandoga, who had once been the subject of scrutiny by regional news outlets after claiming an honorary doctorate from a foreign Christian university that did not appear on any internationally recognised academic register.\n\nThese figures were part of a wider constellation. Over the past decade, investigative publications have uncovered clusters of influential personalities lawmakers, pastors, business executives, councillors and civil servants who adorned themselves with doctorate titles from shadowy institutions across Africa, Asia and the United Kingdom. Many of these establishments offered fast-track theological doctorates, requiring little more than a brief online submission and a modest fee.\n\nZimbabwes regulatory body, the Zimbabwe Council for Higher Education, had long warned against unregistered institutions. The warnings were stern, the lists were public, yet the allure of unearned prestige proved irresistibly magnetic. Titles became status symbols. Doctorates became political currency. Honour eclipsed merit.\n\nThe international community took notice. Educational watchdogs in South Africa, Kenya and the United Kingdom documented the rise of transnational degree mills that targeted professionals seeking accelerated status. Regional academic networks began raising questions about how such degrees affected cross-border hiring, public trust and the global perception of Zimbabwean scholarship.\n\nFor Chaplain Phiri, her freshly minted doctorate conferred at a ceremony adorned with hymns, candles and embroidered gowns now sat at the centre of an unfolding international inquiry. Her degree had promised elevation, yet it opened a gateway into a sprawling ecosystem of unregulated institutions, questionable affiliations and individuals eager to claim titles without the years of rigorous study they implied.\n\nThe story was no longer about one chaplain. It had become a mirror reflecting a nations quiet complicity. Fake doctorates were not merely individual transgressions; they were a structural phenomenon born of ambition, vanity and the erosion of academic culture.\n\nAs global educational agencies examined the influence of degree mills across Africa, and as Zimbabwes press dug deeper into the swelling roster of title-holders, the country faced a moment of reckoning. Would it continue to embrace paper crowns, or would it demand the integrity that true scholarship required?\n\nIn the midst of this, Christ Life Bible Institute remained unregistered, unverified and unaccountable. Yet its graduates continued to surface in pulpits, boardrooms and government offices, their titles echoing through the system like hymns sung in the wrong key.\n\nZimbabwe, once proud of its academic heritage, now stood at a crossroads. The world was watching. And the question remained unresolved: In a kingdom of paper crowns, who would choose to wear the weight of real gold?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena| The dawn broke over Harare with the softness of a psalm, yet beneath the morning calm lay … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/fake-doctorates-are-now-zimbabwes-silent-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Fake Doctorates Are Now Zimbabwe’s Silent Crisis\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "When the Music Fell Silent: The Last Chord of Senior Lecturer Nicholas Zakaria",
            "url": "https://www.zimeye.net/2025/12/11/when-the-music-fell-silent-the-last-chord-of-senior-lecturer-nicholas-zakaria/",
            "content": "By Shelton Muchena| The news moved through the college corridors like a cold wind at dawn, slow at first, then rising into a sharp, breath-stealing gust. Senior Lecturer Nicholas Zakaria, the man whose guitar once stitched together generations of musicians, had played his final note. He would not walk into the lecture theatre today, nor tomorrow, nor ever again.\n\nOnly months earlier, Bob Nyabinde, the beloved headmaster, had left the college, his departure already leaving a hollow echo in the halls. Students had whispered then of change, of uncertainty, of a ship without its captain. Yet one man had remained at the helm, steady and unshaken. Zakaria.\n\nFor years, he held the fort with a strength that did not shout, but rather sang. His presence had been the quiet pulse of the institution, a mentor, a father figure, a custodian of the craft. His guitar was not an instrument; it was a compass. And now that compass lay still.\n\nStudents gathered in small clusters across the campus grounds, some leaning against walls, others sitting on the worn benches outside the music studio. Their faces bore the same expression: directionless, delinquent, and forlorn. The rhythm of learning had slipped. The melody of guidance had gone. Without those who taught them the craft, they were like a choir unsure of its key.\n\nYet amid the mourning, a whisper of celebration began to rise.\n\nFor what is grief, if not the final standing ovation for a life lived in service?\n\nNicholas Zakaria did not merely teach music; he shaped musicians. He nurtured some of the greatest sons and daughters ever to grace Zimbabwes soundscape. His hands, graceful yet firm, moulded talent with a patience only a true steward could possess. Every plucked string, every corrected chord, every story he told in the dim glow of the studio lights became a seed planted in the future of the nations music.\n\nToday, we weep. But we also remember.\n\nWe remember the man who taught that music was not simply heard, but felt. We remember his warm laughter echoing down the stairwell. We remember his lessons stretching beyond melody and harmony, into character, purpose, and dignity.\n\nAs he once said in Zviri Mudzimba, Ultimately, we all stand before Ambuye Mulungu. And now Nicholas Zakaria stands before his God, guitar in hand, spirit unburdened.\n\nLet us not silence the music in our grief. Let us carry it forward.\n\nHang your guitar on the studio door and go well, Nicholas Zakaria. Your final chord still vibrates in the hearts you trained.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena| The news moved through the college corridors like a cold wind at dawn, slow at first, then … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/when-the-music-fell-silent-the-last-chord-of-senior-lecturer-nicholas-zakaria/\">Continue reading<span class=\"screen-reader-text\"> \"When the Music Fell Silent: The Last Chord of Senior Lecturer Nicholas Zakaria\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "Dr Paul Tungwarara Enter Presidential Succession Race",
            "url": "https://www.zimeye.net/2025/12/11/dr-paul-tungwarara-enter-presidential-succession-race/",
            "content": "By Shelton, Muchena & Desmond Nleya  International Correspondent Collective\n\nHARARE  The ZANU-PF succession race has escalated with the entry of Dr. Paul Tungwarara, once known primarily as President Emmerson Mnangagwas Special Presidential Investment Advisor.\n\nInitially, Dr Tagwirei seemed to be the sole favourite of the President, but Tungwaearas entry into politics complicated his prospects.\n\nInsiders said that this week, the party read a riot to party officials who are said to be using money to divide the party.\n\nThis explosive narrative, first circulating on social media platform X and now confirmed by multiple sources, charts Tungwararas ascent from business influencer to central actor in Zimbabwes ruling party power matrix, stirring questions about democratic integrity, elite capture, and the future of the nations leadership.\n\nIn recent months, Tungwarara, a Dubai-based entrepreneur and founder of the Prevail International Group, has solidified his political clout within Zimbabwes ruling ZANU-PF party.\n\nOn 7 December 2025, he was co-opted into the ZANU PF Central Committee at a provincial coordination meeting in Mutare. Party youth and branch leaders reportedly campaigned vigorously for his elevation, bolstered by targeted funding and local empowerment gestures that insiders describe as strategic political investment. The committee seat, vacated following a reshuffle, was filled by Tungwarara in a move that not only quietly signals elite consolidation but also fuels speculation that he, alongside other powerful businessmen such as Kudakwashe Tagwirei, is positioning himself as a kingmaker in Zimbabwes evolving succession narrative.\n\nTungwararas public profile has not been without turbulence. He has been implicated in political dialogue surrounding corruption and governance. A leaked corruption dossier presented to the ZANU PF Politburo by Vice-President Constantino Chiwenga directly named Tungwarara among a network of controversial businessmen accused of siphoning state resources, a charge that has deepened internal party rifts. In September, amid swirling rumours he fled impending arrest, Tungwarara took to the media to insist his travel to Dubai was personal, a visit to celebrate his newborn child, underscoring both the political heat he faces and his calculated attempts to shape his narrative.\n\nMoreover, his role in high-visibility presidential schemes, from borehole drilling initiatives to urban construction projects, has drawn both praise for development contributions and criticism for opaque tender processes and uneven delivery. Zimbabwe gears up towards the 2028 general election, a constitutionally anchored contest that is already shadowed by debate over term extensions and leadership succession within ZANU-PF. As the ruling party debates extending President Emmerson Mnangagwas tenure, figures like Tungwarara and Tagwirei have become central to internal power plays that could shape the next presidential race.\n\nTungwarara represents a new archetype in Zimbabwean politics, the business-political hybrid who wields economic capital to secure political influence. While he has not publicly declared formal presidential ambitions, the trajectory of his career, the level of grassroots mobilisation behind him, and his rapid institutional elevation suggest a strategic pivot towards national leadership potential Political analysts say this reflects broader trends across Africa, where business leaders increasingly blur the lines between commerce and political power, testing democratic systems resilience and raising urgent questions about transparency, accountability, and representation.\n\nThis is more than a local succession story; it is a lens into how power is negotiated in modern states where economic elites cross into governance. Zimbabwes path could influence similar dynamics in other emerging democracies grappling with elite influence, internal party struggles, and the future of leadership transitions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton, Muchena & Desmond Nleya — International Correspondent Collective HARARE — The ZANU-PF succession race has escalated with the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/dr-paul-tungwarara-enter-presidential-succession-race/\">Continue reading<span class=\"screen-reader-text\"> \"Dr Paul Tungwarara Enter Presidential Succession Race\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "Comedian Kapfupi Alleges Wife Ran Away With Boyfriend",
            "url": "https://www.zimeye.net/2025/12/11/comedian-kapfupi-alleges-wife-ran-away-with-boyfriend/",
            "content": "Tinashe Sambiri Epworths well-known comedian Freddy Manjalima, famously known as Kapfupi, has confirmed the end of his marriage to Mai Nga, but insists he will only give his full account once she publicly shares hers. Speaking to H-Metro, the entertainer kept his cards close, stressing that he wants fairness before revealing details.\n\nI am going to divulge it all to you after you ask her about it, he said. Shes my childrens mother. We need to hear from her about where I went wrong. I am still waiting for them because I have the full proof, ndine ma V11.\n\nWhile refusing to go deep into specifics, Kapfupi strongly hinted that infidelity played a role in the breakdown of the relationship. According to him, the situation deteriorated after Mai Nga allegedly walked out of the marriage.\n\nShe is the one who has the reason as to why she ran away from me, he claimed. Ndovane yese inini ndichatsinhira mashoko aMwari, ndisinganyepe kana zvandibata, live kana zvichida court, ndiripo ndine zita racho rechikomba chacho, ndichakupawo chokwadi because handingakunyepereyi. She must narrate all about how bad I was. I have everything about her cheating and the names and details of her boyfriend.\n\nKapfupi further alleged that the man he accuses of being involved with Mai Nga had threatened him with legal action. Unfazed, the comedian said he was ready to defend himself without any legal representation.\n\nTo the public I say I do not need any lawyer, ndichazvimiririra ndega, he insisted. I will stand in court on my own because I am my own lawyer. Yes, I know that I do not have money, handina mari vakatora vane zvikwanisiro, saka lawyer ndini in this case. Ndoita lawyer kuti ndiri kunyepa here? Kana ndiri wrong bhoo, vabvunzei tinzwe zvedu isu.\n\nThe comedian maintained he was prepared to face any legal process and urged that both sides of the story be heard before conclusions are made.\n\nKapfupi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Epworth’s well-known comedian Freddy Manjalima, famously known as Kapfupi, has confirmed the end of his marriage to Mai … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/comedian-kapfupi-alleges-wife-ran-away-with-boyfriend/\">Continue reading<span class=\"screen-reader-text\"> \"Comedian Kapfupi Alleges Wife Ran Away With Boyfriend\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "“Captured” Chiefs Praise Mnangagwa After Receiving Cash, Vehicles…",
            "url": "https://www.zimeye.net/2025/12/11/captured-chiefs-praise-mnangagwa-after-receiving-cash-vehicles/",
            "content": "Tinashe Sambiri At the 2025 Annual Chiefs Conference in Harare on Wednesday, President Emmerson Mnangagwa handed out vehicles, cellphones and cash to traditional leaders, a move that critics say exposes government favoritism while ordinary citizens continue to suffer.\n\nWhile chiefs praised the Second Republics inclusive rule, observers argue that these handouts primarily benefit a small elite. President of the National Chiefs Council Senator Chief Mtshane Khumalo said, We applaud your genuine gesture. Those developments have trickled down as economic dividends. The said dividends have also benefited traditional leaders in various ways, overlooking the persistent struggles of most Zimbabweans.\n\nLocal Government and Public Works Minister Daniel Garwe claimed that all chiefs were rallying behind President Mnangagwa and praised the vehicles for improving mobility. Critics, however, question whether perks for a handful of leaders can ever reflect genuine national progress while thousands of villages remain under-resourced.\n\nDeputy President of the Council of Chiefs Chief Fortune Charumbira added, We are grateful for the continued support that we have always received from President Mnangagwa. We are grateful and we are overwhelmed by his support.\n\nSome civil society observers warn that the display of loyalty risks being perceived as political patronage, prioritizing elite comfort over the real needs of the population. This is just another display of rewarding loyalty instead of addressing real national challenges, one human rights observer commented. It leaves the impression that the government cares more for those in positions of authority than for the people at large.\n\nWith over 35,000 village heads, 550 headmen, and 310 chiefs in the country, the lavish handouts highlight the stark contrast between elite privileges and the hardships faced by ordinary Zimbabweans, casting doubt on the claimed inclusivity of the Second Republic.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– At the 2025 Annual Chief’s Conference in Harare on Wednesday, President Emmerson Mnangagwa handed out vehicles, cellphones and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/captured-chiefs-praise-mnangagwa-after-receiving-cash-vehicles/\">Continue reading<span class=\"screen-reader-text\"> \"“Captured” Chiefs Praise Mnangagwa After Receiving Cash, Vehicles…\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        },
        {
            "title": "Alick Macheso Pays Tribute To Own Mentor  Nicholas “Madzibaba” Zakaria",
            "url": "https://www.zimeye.net/2025/12/11/alick-macheso-pays-tribute-to-own-mentor-nicholas-madzibaba-zakaria/",
            "content": "By A Correspondent  Alick Macheso has issued a touching eulogy following the death of his iconic mentor and sungura legend, Nicholas Madzibaba Zakaria, who passed away on Thursday morning.\n\nThe Orchestra Mberikwazvo frontman said the news had left him devastated, describing Zakaria as a father figure and the backbone of his musical upbringing.\n\nVadikani hama kumativi mana epasi rose, muzuva ra nhasi izuva ratabaiwa panyama nhete, ronda risingapori, ronda rinorwadza isu vararami, he said as he mourned the late maestro.\n\nMacheso reflected on the crucial role Zakaria played in shaping both his career and the broader sungura tradition. Nekurasikirwa na Baba vedu Madzibaba Zakaria, vaiva mbereko nezambuko redu mumimhanzi. Pasi rese takotamisa huso hwedu, misodzi ichiyerera pamatama nekurasikirwa ne gamba redu.\n\nHe emphasised the difficulty of accepting the loss, despite understanding that death is a divine inevitability. Hongu tinozviziva kuti rufu chitsidzo chavo Mwari asi nzira yacho inorwadza mukurasikirwa ne umwe wedu wepamoyo.\n\nThe sungura star added that Zakarias musical legacy will remain an enduring part of Zimbabwes artistic story. Mabasa avo, pamwe nenziyo dzavo, zviichazova nhorowondo yedu nevamwe vachazobarwa pasi rino.\n\nMacheso said he would continue to update fans as the family navigates the mourning period. Hama neshamwari pamwe nemadzisahwira, handina akawanda panguva ino, zvizhinji tichakupai mukufamba kwenguva.\n\nWrapping up his tribute, Macheso offered his condolences to Zakarias family and paid his final respects: Ndakamirira mhuri dzose, ndinoti zororai murugare Baba.\n\nNicholas Madzibaba Zakaria with Alick Macheso during heydays \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Alick Macheso has issued a touching eulogy following the death of his iconic mentor and sungura … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/11/alick-macheso-pays-tribute-to-own-mentor-nicholas-madzibaba-zakaria/\">Continue reading<span class=\"screen-reader-text\"> \"Alick Macheso Pays Tribute To Own Mentor  Nicholas “Madzibaba” Zakaria\"</span></a></p>",
            "time": "06:50",
            "date": "12 Dec 2025"
        }
    ]
}