{
    "news": [
        {
            "title": "Sex Scandal US Televangelist Dies",
            "url": "https://www.zimeye.net/2025/07/02/sex-scandal-us-televangelist-dies/",
            "content": "By A Correspondent Sex scandal Yesteryear US televangelist Jimmy Swaggart has died.\n\nHe was 90.\n\nSwaggart was one of the United States most influential televangelists during the 1980s until a scandal involving a prostitute brought his soaring career to an abrupt halt.\n\nJimmy Swaggart Ministries confirmed his death via Facebook. His family expressed gratitude to the medical staff at Baton Rouge General Medical Center in Louisiana. The cause of death was not disclosed.\n\nAt the height of his career as a fiery Pentecostal preacher, Swaggart reached an estimated global audience of 200 million. That influence came crashing down in 1988 when he tearfully confessed to his congregation, without offering specifics, that he had sinnedfollowing revelations of his involvement with a sex worker.\n\nBorn on March 15, 1935, in the racially segregated backwaters of Ferriday, Louisiana, Swaggart grew up alongside two cousins who also rose to famerock n roll legend Jerry Lee Lewis and country music star Mickey Gilley.\n\nImmersed from an early age in Pentecostalisms fervent, emotional style of worship, Swaggart claimed to have received a divine calling at age nine: You will preach my Gospel all over the world. You will even take it to Africa, he said God told him.\n\nHe left school early, doing manual labor before marrying 15-year-old Frances Anderson at age 17. Inspired by the rise of revivalists like Oral Roberts, Swaggart began preaching on street corners and in rural churches. By 1969, he had launchedThe Camp Meeting Hourradio show, and by 1973, his sermons were airing on television, catapulting him to stardom.\n\nA staunch conservative, Swaggart often stirred controversy with his attacks on Catholics, Jews, and the LGBTQ+ community. He became a leading figure in the rise of the U.S. religious right, using his platform to push for public policy grounded in biblical doctrine. His international crusades took him to Latin America and even apartheid-era South Africa, where he drew crowds in places like Soweto.\n\nThe New York Times reported that his 1988 scandal was exposed by rival preacher Marvin Gorman, who supplied compromising photos and claimed Swaggart had falsely accused him of adultery.\n\nIn February that year, a sobbing Swaggart stood before the congregation at his Family Worship Center in Baton Rouge, begging for forgiveness. However, the Assemblies of God defrocked him after he refused a proposed suspension.\n\nFurther damage to his reputation came in 1991 when California police found him with another prostitute following a traffic stop. Though he initially announced plans to step down, he later told his congregation, The Lord told me its flat none of your business.\n\nSwaggart, who had once railed against pornography and immorality, drew fresh backlash in 2004 for declaring on his TV show that if a gay man approached him sexually, Im going to kill him and tell God he died  a remark he later dismissed as a joke.\n\nAlthough his influence waned after the scandals, his ministry endured in a diminished form. He continued to appear on cable TV occasionally, with his son Donnie playing a central role in keeping the ministry alive.\n\nSwaggart is survived by his wife Frances and their son Donnie.\n\nSource  Reuters\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Sex scandal Yesteryear US televangelist Jimmy Swaggart has died. He was 90. Swaggart was one of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/sex-scandal-us-televangelist-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Sex Scandal US Televangelist Dies\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "Chatunga Goes Scot-Free",
            "url": "https://www.zimeye.net/2025/07/02/chatunga-goes-scot-free/",
            "content": "By Crime and Courts Reporter A Concession Magistrate Monday freed the late former President Robert Mugabes son, Bellarmine Chatunga Mugabe, on US$200 bail along with his two bodyguards, following allegations of a violent assault on mine security guards in Mazowe.\n\nThe three are facing five counts of assault stemming from an incident at Ultimate Mine on June 25, where they allegedly attacked security personnel while pursuing illegal gold miners.\n\nChatunga is jointly charged with Petee Fredson and Tinashe Mupawo. Other members of his security team,saidto have participated in the attacks, are still at large.\n\nAccording to court documents, the accused confronted the guardsNtandoyokuza Nyathi, Philip Chipara, Elvis Bvumbe, Collen Muchemwa, and Waddington Mutadzaaccusing them of protecting the fleeing miners.\n\nOne of the suspects reportedly fired a gunshot before the group launched a brutal assault using fists, booted feet, wooden logs, a sjambok, and an iron bar.\n\nOne guard was allegedly forced to carry a sack of gold ore to the accuseds base, where the assault continued. The victims sustained multiple injuries and were treated athospitalafter reporting the matter topolice.\n\nThe assaults allegedly included handcuffing and beating at least two guards, with attacks continuing even after attempts to intervene.\n\nThe matter is being handled at the Concession Magistrates Court as investigations continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – A Concession Magistrate Monday freed the late former President Robert Mugabe’s son, Bellarmine Chatunga Mugabe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/chatunga-goes-scot-free/\">Continue reading<span class=\"screen-reader-text\"> \"Chatunga Goes Scot-Free\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "Dynamos FC Dodge FIFA Transfer Ban After Settling Player Debts",
            "url": "https://www.zimeye.net/2025/07/02/dynamos-fc-dodge-fifa-transfer-ban-after-settling-player-debts/",
            "content": "Sports Correspondent\n\nFaltering Harare giants Dynamos FC have narrowly avoided a FIFA-imposed transfer ban after settling outstanding salaries owed to former Ghanaian players Emmanuel Paga and Frederick Ansah-Botchway.\n\nThe club had been given a 45-day ultimatum by FIFA in May to clear the debts  US$8,500 owed to Paga and US$10,000 to Ansah-Botchway  or face a ban on all transfer activity.\n\nSpeaking toNewsDay, Dynamos executive member in charge of marketing, David Chikomo, confirmed the payments had been made.\n\nIts true that we have paid our dues to our former players Emmanuel Paga and Frederick Ansah-Botchway, said Chikomo. It was an issue that was troubling us as a club, considering how much we want to improve our fortunes in the second half of the season.\n\nChikomo added that the club can now fully participate in the mid-season transfer window and hopes this marks a turning point for the struggling side.\n\nThe news comes as a welcome boost for Dynamos, who have endured a disappointing first half of the campaign. Sitting 17th on the league table with just 15 points from 17 matches, the Glamour Boys are hoping to reinforce their squad in a bid to escape the relegation zone.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Faltering Harare giants Dynamos FC have narrowly avoided a FIFA-imposed transfer ban after settling outstanding salaries owed to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/dynamos-fc-dodge-fifa-transfer-ban-after-settling-player-debts/\">Continue reading<span class=\"screen-reader-text\"> \"Dynamos FC Dodge FIFA Transfer Ban After Settling Player Debts\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "Nico Williams’ Barcelona Transfer Uncertain Due To Contract Clause Dispute…",
            "url": "https://www.zimeye.net/2025/07/02/nico-williams-barcelona-transfer-uncertain-due-to-contract-clause-dispute/",
            "content": "Sports Correspondent\n\nNico Williams highly anticipated move to Barcelona has hit yet another snag, with negotiations now stalling due to a new contractual disagreement.\n\nDespite the Athletic Club winger agreeing in principle to leave Bilbao for Barcelona in a deal worth 58 million, complications continue to plague the transfer. According to Mundo Deportivo, the latest issue revolves around a specific clause that Williams is insisting on including in his contract.\n\nThe 22-year-old Spanish international reportedly wants certain guarantees as part of the deal  guarantees that Barcelona are currently unwilling to provide. This demand has led to a deadlock in talks, with neither party showing signs of compromise.\n\nMundo Deportivo notes that this clause surfaced in recent days and has become a significant sticking point, slowing what many expected to be a straightforward transfer.\n\nAs it stands, both Williams and Barcelona remain firm in their positions, leaving the deal hanging in uncertainty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Nico Williams’ highly anticipated move to Barcelona has hit yet another snag, with negotiations now stalling due to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/nico-williams-barcelona-transfer-uncertain-due-to-contract-clause-dispute/\">Continue reading<span class=\"screen-reader-text\"> \"Nico Williams’ Barcelona Transfer Uncertain Due To Contract Clause Dispute…\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "CIO Boss Rapes Lover’s Maid…",
            "url": "https://www.zimeye.net/2025/07/02/cio-boss-rapes-lovers-maid/",
            "content": "By A Correspondent\n\nA senior Central Intelligence Organisation (CIO) officer stationed in Gweru, Makopa Manyadze (45), is facing serious legal trouble after being accused of raping a 20-year-old maid employed by his girlfriend.\n\nThe case has sparked outrage, with Manyadze  reportedly the Deputy District Intelligence Officer and recently transferred to Gweru  spending the weekend in custody before appearing in court. He was brought before Gweru Regional Magistrate Christopher Maturure and remanded pending a bail hearing that took place on Monday, June 30, 2025.\n\nAlthough he has since been released on US$200 bail, the gravity of the allegations and his high-ranking position have drawn widespread attention. Human rights activists are calling for a transparent judicial process to ensure justice is served.\n\nCourt documents detail the alleged events, which unfolded on the morning of Monday, June 23, 2025. Around 7:00 AM, Manyadze reportedly phoned the young maid, who informed him that her employer  his girlfriend  was not at home. She also advised that there was no reason for him to visit.\n\nIgnoring the warning, the accused is said to have arrived at the residence at around 10:00 AM, entering the premises after the complainant opened the gate. Once inside, Manyadze allegedly instructed the maid to follow him into the house.\n\nIt is alleged that inside the kitchen, where there was a bed, he sat down and called the complainant to come closer. When she refused, he allegedly grabbed her by the waist and began fondling her, despite her resistance. He is then said to have thrown her onto the bed, forcibly undressed her, and raped her without protection.\n\nAfter the assault, the accused reportedly told the complainant to get dressed and see him out of the property.\n\nThe incident came to light after the maid confided in her twin sister in Bulawayo, who encouraged her to report it. Her mother later took the matter to the police, leading to Manyadzes arrest.\n\nThe case remains under investigation, with the public closely monitoring developments due to the sensitive nature of the allegations and the accuseds powerful position.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A senior Central Intelligence Organisation (CIO) officer stationed in Gweru, Makopa Manyadze (45), is facing serious legal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/cio-boss-rapes-lovers-maid/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Boss Rapes Lover’s Maid…\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "Judiciary Bows to Pressure, Cancels Judges’ Ideology Training After Lawyers Protest Threat",
            "url": "https://www.zimeye.net/2025/07/02/judiciary-bows-to-pressure-cancels-judges-ideology-training-after-lawyers-protest-threat/",
            "content": "By A Correspondent| The Judicial Service Commission (JSC) has cancelled a controversial capacity-building workshop for judges that was to be conducted in partnership with the Chitepo School of Ideology, following widespread outrage and threats of protest by the legal community.\n\nThe training, originally scheduled for July 4 and 5 at Rainbow Towers Hotel in Harare, was set to introduce judges to the Integrated Results-Based Management (IRBM) system. However, it emerged last week that the training would feature sessions led by officials from the ruling Zanu PFs Herbert Chitepo School of Ideology and the Central Intelligence Organisation, prompting a fierce backlash from lawyers and civil society.\n\nIn a memorandum dated July 2 and addressed to all heads of courts, the JSC Secretary confirmed the cancellation of the workshop, citing ongoing consultations with the Office of the President and Cabinet (OPC). The memo stated that the judiciary was re-evaluating the training content to ensure it aligns with the constitutional requirement of judicial independence.\n\nThe decision has been taken to cancel the IRBM training, with the view of coming up with a program content administered by the judiciary and suitable to the requirement for Judicial Independence, the JSC wrote.\n\nThe about-turn follows threats by the Law Society of Zimbabwe and independent lawyers to stage a protest march against what they described as an unconstitutional attempt to politicise the judiciary.\n\nCritics argued that exposing judges to Zanu PF ideological training would severely compromise their impartiality and independence. Some judges were reportedly also uncomfortable with the planned programme.\n\nThe JSC said new arrangements would be communicated in due course and instructed court heads to inform all judges of the cancellation.\n\nThe cancellation is being viewed as a rare victory for the legal fraternity and civic groups who had accused the government of attempting to erode judicial independence through ideological indoctrination.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Judicial Service Commission (JSC) has cancelled a controversial capacity-building workshop for judges that was to be … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/judiciary-bows-to-pressure-cancels-judges-ideology-training-after-lawyers-protest-threat/\">Continue reading<span class=\"screen-reader-text\"> \"Judiciary Bows to Pressure, Cancels Judges’ Ideology Training After Lawyers Protest Threat\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "Mnangagwa Admits Country’s Health System Is In Deep Crisis",
            "url": "https://www.zimeye.net/2025/07/02/mnangagwa-admits-countrys-health-system-is-in-deep-crisis/",
            "content": "By Tinashe Sambiri\n\nPresident Emmerson Mnangagwa has made a rare admission about the dismal state of Zimbabwes public healthcare system, describing it as disheartening and in urgent need of reform.\n\nSpeaking during hisopening remarks at ZANU PFs 384th Ordinary Session of the Politburoin Harare on Wednesday, Mnangagwa said he was personally disturbed by what he witnessed during a recent tour of Harares major public hospitals.\n\nRecently, I had the chance to tour the main public health facilities here in Harare. It was disheartening that the situation was allowed to deteriorate, he said.\n\nWhile calling for urgent corrective measures, the President fell short of taking direct responsibility for the crisis that has unfolded under his administration. Instead, he challenged all stakeholders  including government departments, the private sector, and ordinary citizens  to work together in rebuilding the sector.\n\nMore is expected from stakeholders. Blame-shifting will not get us anywhere. We must learn from our shortcomings and work hand in hand, as the public sector, private sector and individuals, to build our country, Mnangagwa said.\n\nDespite leading a government long criticised for underfunding health services, the Presidents remarks signal a recognition of the deep-rooted dysfunction. Zimbabwes healthcare system has been plagued by crumbling infrastructure, chronic drug shortages, underpaid staff, and an exodus of skilled medical professionals.\n\nCritics argue that mere calls for cooperation are insufficient without bold policy shifts and increased budgetary commitments from the very top. As one health union leader put it off record, We dont need statements  we need action. The government is the biggest stakeholder and must lead with serious investment, not rhetoric.\n\nMnangagwas comments may be viewed as a rare public concession, but many believe the time for words is long past. With hospitals in crisis and ordinary citizens bearing the brunt, pressure continues to mount for tangible reform in Zimbabwes healthcare system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri President Emmerson Mnangagwa has made a rare admission about the dismal state of Zimbabwe’s public healthcare system, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/mnangagwa-admits-countrys-health-system-is-in-deep-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Admits Country’s Health System Is In Deep Crisis\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "Chatunga Mugabe Brutal Assault Victim Speaks",
            "url": "https://www.zimeye.net/2025/07/02/chatunga-mugabe-brutal-assault-victim-speaks/",
            "content": "By A Correspondent\n\nChatunga Mugabe, son of the late former President Robert Mugabe, has been granted bail amounting to US$200 by the Concession Magistrates Court following his recent arrest on multiple charges.\n\nThe 28-year-old is facing seven counts of assault and malicious damage to property after he and his bodyguards allegedly launched a violent attack on mine workers in Mazowe last week.\n\nVictims of the assault have begun speaking out, detailing the brutality of the incident, which has drawn widespread condemnation.\n\nChatunga spent Monday night in police custody before his court appearance. The case has since raised fresh concerns over impunity and the use of violence by individuals connected to powerful political families.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chatunga Mugabe, son of the late former President Robert Mugabe, has been granted bail amounting to US$200 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/chatunga-mugabe-brutal-assault-victim-speaks/\">Continue reading<span class=\"screen-reader-text\"> \"Chatunga Mugabe Brutal Assault Victim Speaks\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "PFL Africa Heads to Johannesburg August 9 for Second Explosive Showdown",
            "url": "https://www.zimeye.net/2025/07/02/pfl-africa-heads-to-johannesburg-august-9-for-second-explosive-showdown/",
            "content": "Sports Correspondent,JOHANNESBURG After a groundbreaking debut in Cape Town, theProfessional Fighters League (PFL)is set to return to South Africa with its secondPFL Africaevent, this time at theBig Top Arena, Carnival City in JohannesburgonSaturday, August 9. The spotlight shifts to theFeatherweight and Welterweight divisions, where top African fighters will compete inFirst Round matchupsas the league continues its quest to crown the continents first-ever MMA champions.\n\nTickets for theJohannesburg showdown go on sale Thursday, June 12viaTicketPro, and fans are being urged to book early as excitement builds around the next chapter of this historic MMA tournament.\n\nCape Town was just the beginning, said PFL Africa officials. Johannesburg promises to take the intensity to the next level as elite African athletes enter the SmartCage to battle for glory, pride, and a place in the semifinals.\n\nHeadlining the August 9 card is a Featherweight First Round clash between two ofWest Africas finest:Patrick Ocheme (6-1)of Nigeria andMohamed Camara (5-2-1)of Guinea. With only one loss each and a fierce will to dominate, both fighters enter the cage with national pride and tournament survival on the line.\n\nIn the co-main event, Angolas rising starShido Boris Esperanca (9-1)who delivered an impressive victory in his PFL debutreturns to face Gambias seasoned veteranIbrahima Man (14-5)in a high-octaneWelterweight First Roundbattle.\n\nThe PFL Africa tournament, which spans four divisions, will feature32 fighters from 15 nationsin 2025. This ambitious initiative aims to elevate African MMA talent to global prominence while creating champions who will carry the continents banner in future PFL international seasons.\n\nFight fans across Africa can tune in live viaSuperSport(English) andCanal+(French), while global audiences can catch the action on thePFL App (U.S.)andDAZN(UK, France, and Ireland).\n\nSaturday, August 9  Big Top Arena, Carnival City\n\nAdditional fights will be announced in the coming weeks as PFL continues its mission to showcase Africas best on MMAs fastest-growing global stage.\n\nThe road to becoming thefirst-ever PFL Africa Championcontinuesand Johannesburg is the next battleground.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent, JOHANNESBURG – After a groundbreaking debut in Cape Town, the Professional Fighters League (PFL) is set to return … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/pfl-africa-heads-to-johannesburg-august-9-for-second-explosive-showdown/\">Continue reading<span class=\"screen-reader-text\"> \"PFL Africa Heads to Johannesburg August 9 for Second Explosive Showdown\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        },
        {
            "title": "Africa Makes MMA History as PFL Cape Town Delivers Explosive Debut Event July 19",
            "url": "https://www.zimeye.net/2025/07/02/africa-makes-mma-history-as-pfl-cape-town-delivers-explosive-debut-event-july-19/",
            "content": "Sports Correspondent,CAPE TOWN The world of Mixed Martial Arts (MMA) is set for a seismic shift as the Professional Fighters League (PFL) brings its elite global competition to African soil for the first time. OnSaturday, July 19, Cape Towns Grand Arena at GrandWest will host the inauguralPFL Cape Town event, making history as the continents first-ever global MMA showcase.\n\nThis milestone moment marks the launch of the2025 PFL Africa Tournament, beginning with First Round matchups in the Heavyweight and Bantamweight divisions. Each weight class will feature an eight-man bracket, spotlighting the continents emerging combat talent. These action-packed preliminaries will set the stage for a dramatic night of elite-level MMA as part of thePFL Champions Series, headlined by five high-stakes international bouts.\n\nPFL Cape Town is more than just a fight nightits a historic turning point for African MMA, said PFL officials in a statement. Were bringing top-tier global talent and a platform for African fighters to shine on the world stage.\n\nTickets for this groundbreaking event are already on sale viaTicketpro, with the action beginning at4:30 PM SASTfor PFL Africa tournament fights and8:30 PM SASTfor the Champions Series main card.\n\nHeadlining the night isundefeated Middleweight World Champion Johnny Pressure Eblen (16-0), who defends his belt and perfect record against Spains powerful contenderCostello The Spaniard van Steenis (16-3). The co-main event will seeWomens Flyweight phenom Dakota Dangerous Ditcheva (14-0)go toe-to-toe with Hawaiis striking specialistSumiko Lady Samurai Inaba (8-1).\n\nAdding more firepower to the card,former Bellator Featherweight World Champion AJ Mercenary McKee (22-2)returns to face Russian powerhouseAkhmed Magomedov (11-1)a rising star mentored by MMA legend Khabib Nurmagomedov.\n\nAnother must-watch bout features2024 PFL Heavyweight Champion Denis Goltsov (36-8)taking on Light Heavyweight World ChampionCorey Anderson (18-6), who moves up a division in this high-stakes clash of titans. Rounding out the Champions Series card,Artur Zaynukov (16-4)takes on Japanese wrestling specialist and RIZIN standoutTakeshi Izumi (6-3)in a thrilling lightweight showcase.\n\nThePFL Africa Tournamentkicks off earlier in the evening, featuring fierce first-round matchups across both weight divisions:\n\nBantamweight First Round Bouts:\n\nHeavyweight First Round Bouts:\n\nWomens Strawweight Showcase:\n\nThe PFL has promised a U.S. broadcast partner announcement soon, allowing international fans to witness this historic African debut live.\n\nSaturday, July 19  8:30 PM SAST / 2:30 PM EST\n\nAs PFL brings the global MMA spotlight to Cape Town, African fans and fighters alike will witness a new era for the sportone where homegrown talent steps into the cage alongside world champions, under the brightest lights the continent has ever seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent, CAPE TOWN – The world of Mixed Martial Arts (MMA) is set for a seismic shift as the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/02/africa-makes-mma-history-as-pfl-cape-town-delivers-explosive-debut-event-july-19/\">Continue reading<span class=\"screen-reader-text\"> \"Africa Makes MMA History as PFL Cape Town Delivers Explosive Debut Event July 19\"</span></a></p>",
            "time": "09:34",
            "date": "03 Jul 2025"
        }
    ]
}