{
    "news": [
        {
            "title": "Sikhala Says Opposition Legislators Were Served With Alcohol At Precabe Farm",
            "url": "https://www.zimeye.net/2025/01/14/sikhala-says-opposition-legislators-were-served-with-alcohol-at-precabe-farm/",
            "content": "By A Correspondent| Former Zengeza West legislator Job Sikhala has said legislators who visited President Emmerson Mnangagwas farm over the weekend were served with alcohol before they started singing songs campaigning for the Zanu PF leader to remain in power beyond 2030.\n\nPosting on X, Sikhala slammed the opposition legislators led by self-styled CCC Interim Secretary General Sengezo Tshabangu for pushing stomach politics at the expense of the suffering masses.\n\nMusure mokunwa zvinodhaka vakatanga kuimba zvisina basa. Selfish stomach politics!!! said Sikhala.\n\nOpposition legislatora aligned to Tshabangu were guests at Mnangagwas Kwekwe farm where they endorsed the 2030 agenda.\n\nThe move has been widely condemned by citizens who accused Mnangagwa of using the opposition to push his move to extend his term of office.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Former Zengeza West legislator Job Sikhala has said legislators who visited President Emmerson Mnangagwa’s farm over the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/sikhala-says-opposition-legislators-were-served-with-alcohol-at-precabe-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Sikhala Says Opposition Legislators Were Served With Alcohol At Precabe Farm\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Why do Wicknell and ED seem always copying Nelson Chamisa’s shirts and trousers?",
            "url": "https://www.zimeye.net/2025/01/14/why-do-wicknell-and-ed-seem-always-copying-nelson-chamisas-shirts-and-trousers/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "UK Relaxes Visa Restrictions for AI Experts, Creating Opportunities for African IT Talent",
            "url": "https://www.zimeye.net/2025/01/14/uk-relaxes-visa-restrictions-for-ai-experts-creating-opportunities-for-african-it-talent/",
            "content": "UK Unveils Bold AI Action Plan, Relaxing Visa Restrictions for Experts to Boost Growth\n\nThe United Kingdom has unveiled a transformative plan to revolutionize its Artificial Intelligence (AI) sector, with the announcement of the AI Opportunities Action Plan yesterday (13 January 2025). The governments ambitious strategy aims to drive economic growth, enhance public services, and position the UK as a global leader in AI innovation. Central to the plan is the relaxation of visa restrictions, which will attract top international AI talent and create a thriving ecosystem for the technology.\n\nAI at the Heart of National Renewal\n\nThe governments strategy seeks to integrate AI into industries and public services, promising significant productivity gains. Experts estimate the plan could add up to 47 billion annually to the UK economy over the next decade.\n\nPrime Minister Keir Starmer described the initiative as a turning point for the country:Artificial Intelligence will drive incredible change in our nation. From boosting productivity to improving public services, this plan ensures Britain becomes the world leader in AI, creating jobs, increasing investment, and raising living standards.\n\nKey Measures in the AI Action Plan\n\nThe action plan outlines 50 measures to accelerate AI adoption and innovation. Highlights include:Relaxed Visa Rules for AI Talent: Graduates from top AI institutions, such as the Indian Institutes of Technology and Carnegie Mellon University, will benefit from streamlined pathways to work in the UK, addressing previous immigration barriers.AI Growth Zones: Special zones will fast-track planning permissions for AI infrastructure. The first zone is set to open in Culham, Oxfordshire, with others planned for regions primed for economic revitalization.Public Sector Transformation: AI will reduce administrative tasks in public services, allowing workers to focus on delivering frontline support. AI will be used in hospitals to diagnose illnesses faster, improve road conditions by detecting potholes, and streamline teaching workloads.Infrastructure Investment: Major tech companies have committed 14 billion to AI infrastructure. Vantage Data Centres, Nscale, and Kyndryl are investing heavily to develop data centers and facilities, creating over 13,250 jobs across the UK.Supercharging Computing Power: Plans include increasing public compute capacity twentyfold, starting with the construction of a new supercomputer to handle complex AI applications.National Data Library: A secure public data repository will be established to support AI development while maintaining data privacy and security.\n\nIndustry and Talent at the Forefront\n\nThe relaxed visa policies aim to attract world-class talent, fueling the UKs AI ambitions. Industry leaders have welcomed the plan, viewing it as a decisive step toward making the UK a hub for AI innovation.\n\nVantage Data Centres plans to invest 12 billion in data campuses, creating 11,500 jobs. Nscale will establish the largest sovereign AI data center in Essex, while Kyndryl will create 1,000 AI-related jobs in Liverpool over the next three years.\n\nMatt Clifford, a key advisor to the government on AI, said:This plan puts the UK at the forefront of AI innovation, unlocking its potential to grow the economy, improve lives, and make Britain a global hub for AI investment.\n\nA Vision for the Future\n\nThe AI Opportunities Action Plan represents a commitment to innovation, economic growth, and public service transformation. By addressing visa barriers, supporting infrastructure development, and fostering talent, the UK is poised to lead the global AI revolution.\n\nThe initiative is expected to reshape the economy, create thousands of jobs, and improve public services, ensuring Britain remains a leader in artificial intelligence for years to come.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "UK Unveils Bold AI Action Plan, Relaxing Visa Restrictions for Experts to Boost Growth The United Kingdom has unveiled a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/uk-relaxes-visa-restrictions-for-ai-experts-creating-opportunities-for-african-it-talent/\">Continue reading<span class=\"screen-reader-text\"> \"UK Relaxes Visa Restrictions for AI Experts, Creating Opportunities for African IT Talent\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Only 33 CCC MPs Attended Precabe Farm Gig Out Of Over 105 | FULL LIST",
            "url": "https://www.zimeye.net/2025/01/14/only-33-ccc-mps-attended-precabe-farm-gig-out-of-over-105-full-list/",
            "content": "The following is the Unique Categorized Full List of CCC representatives compiled by ZimEye, of those who attended the Precabe farm function at the weekend plus those who didnt.\n\nOnly 34 representatives (MPs, Senators) travelled to Emmerson Mnangagwas farm. A few are recorded as having sent apologies and the rest just did not attend.\n\nCLARIFICATIONI've been made aware of a circulating list claiming I apologized for not attending the Precabe event. This is entirely false. I did not give an apology as I have no affiliation with this event or it's host party ZANU P.F.pic.twitter.com/gisFmqIYic\n\nThe categories are as follows-\n\nAttendants1. F. Ncube2. N. Batitsa3. C. Chibota4. M. Gwabeni5. T. Khupe6. J. Makombe7. J. Makuvire8. D. Marikano9. S. Maseko10. C. Moyo11. L. Ncube12. S. Munemo13. S. Mureyani14. B. Nyandoro15. T. Rungwave16. L. Sibanda17. O. Sibanda18. S. Chapfudza19. T. Kabondo20. T. Kunaka21. M. Kupfuma22. M. Manyengavana23. K. Matibiri24. M. Mdhluri25. G. Mupande26. N. Mlotshwa27. S. Ndebele28. M. Ngwena29. K. Phulu30. S. Tshabangu31. J. Bonda32. T. Chikomo33. T. Byumo\n\nApologies34. P. Dube35. N. Mguni36. S. Matsunga37. P. Chitimbe38. Y. Moyo39. S. Mahlangy40. T. Muzoda\n\nNot-Attendants.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The following is the Unique Categorized Full List of CCC representatives compiled by ZimEye, of those who attended the Precabe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/only-33-ccc-mps-attended-precabe-farm-gig-out-of-over-105-full-list/\">Continue reading<span class=\"screen-reader-text\"> \"Only 33 CCC MPs Attended Precabe Farm Gig Out Of Over 105 | FULL LIST\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Popular Ex-ZBC Cameraman Dies Of Flu",
            "url": "https://www.zimeye.net/2025/01/14/popular-ex-zbc-cameraman-dies-of-flu/",
            "content": "By Munacho Gwamanda- Close relatives of the former Zimbabwe Broadcasting Corporation (ZBC) cameraman Solomon Chinhara, who died, Monday said the journalist died of flu.\n\nChinhara died in an ambulance en route to the hospital from his plot along Plumtree Road in Matabeleland South on Monday morning.\n\nHis passing marked the end of a chapter in the history of a man who contributed to ZBCs golden era when it stood as the pride of Zimbabwe.\n\nKnown for his commitment and excellence, Chinhara was part of a team that shaped the broadcasters legacy as a trusted voice for the nation.\n\nLast October, Chinhara celebrated 51 years of marriage with his wife, Alice Chinhara Khoza.\n\nThe milestone event, held at their West Acre Farm in Plumtree, was attended by family, friends, neighbours, and members of their church.\n\nDuring its peak in the late 20th century, ZBC symbolised excellence in national broadcasting.\n\nIt was not only a source of reliable news but also a hub of talent that cultivated careers like Chinharas, whose camera work captured the nations triumphs and challenges.\n\nHowever, in recent decades, ZBC has faced significant challenges.\n\nOnce renowned for its professionalism and robust programming, the state broadcaster has struggled under political and economic pressures.\n\nAccusations of political bias, declining resources, and an exodus of talent have tarnished its reputation, leaving it a shadow of its former self.\n\nThe deterioration of ZBC mirrors the broader challenges facing Zimbabwes media landscape, where professionals like Chinhara once thrived.\n\nHis death is a poignant reminder of a time when ZBC embodied the hopes and dreams of a young nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Close relatives of the former Zimbabwe Broadcasting Corporation (ZBC) cameraman Solomon Chinhara, who died, Monday said the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/popular-ex-zbc-cameraman-dies-of-flu/\">Continue reading<span class=\"screen-reader-text\"> \"Popular Ex-ZBC Cameraman Dies Of Flu\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Valerio Is Cruel: Kerina",
            "url": "https://www.zimeye.net/2025/01/14/valerio-is-cruel-kerina/",
            "content": "By Kerina Mujati | This man is CRUEL and his name is Phillip Valerio Sibanda.  It must be known and be on record that he was the Army Commander that ORDERED  Army tanks onto the streets of Harare in November 2017 not Chiwenga, why is he not ORDERING the Army tanks now for Emmerson Dambudzo Mnangagwa?\n\nIf Phillip Valerio Sibanda ordered army tanks for an elderly Mugabe, why is he protecting Emmerson Dambudzo Mnangagwa who is a looter, rapist, ritualist, murderer, paedophile, fake a Munhumutapa violating our Constitution with his dangerous and deranged Son Sean abusing the Army uniform? The Air Force under Perence Shiri did not participate they were just FORCED OBSERVERS of the coup.\n\nIn 2018 Chiwenga was no longer Commander Defence Forces or Commander in Chief (President). Chiwenga had no legal basis to deploy or give instructions to shoot civilians on the streets. The 2018 shootings were and are a responsibility of Commander in Chief  Emmerson Dambudzo Mnangagwa and Commander Defence Forces Phillip Valerio Sibanda.\n\nTill this day the recommendations of the 2018 Motlanthe Commission has not been attended too as the culprits Emmerson and Valerio are the ones who must be held accountable. Can Zimbabweans who should be protected by the Army, were shot in cold blood by Army commanded by Valerio Sibanda and his thugs in uniform andnoone is answerable to these murders? This cannot be wished away. Chamisa equally insulted the deceased that they were stupid in demonstrating for the delayed election results.  Zimbabweans, do not be fooled that Phillip Valerio Sibanda is an upright man he is crooked and enabling Mnangagwas grip on power and the Mafidhi Dynasty.\n\nI demand that the Motlanthe Commission must be looked at as mhosva hairove, power is temporary and borrowed. Valerio Sibanda, cha ED kunyangara fesi zvese nemoyo killing Zezurushence it is easy for you to deploy Army tanks on the streets of Harare. I am seeing and you cant fool all kuuraya vanhu kuda kuita Gukurahundi mu Harare,ana Satan. Valerio Sibanda the Boko Haram of Zimbabwe. Zimu Dissident remunhu,bloody murderer. Protecting one man and his family at the expense of millions of Zimbabwean, is that why you are being paid by Taxpayers?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Kerina Mujati | This man is CRUEL and his name is Phillip Valerio Sibanda. It must be known and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/valerio-is-cruel-kerina/\">Continue reading<span class=\"screen-reader-text\"> \"Valerio Is Cruel: Kerina\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "What’s ED Doing At State House?",
            "url": "https://www.zimeye.net/2025/01/14/whats-ed-doing-at-state-house/",
            "content": "Harare  Kenyan opposition leader Raila Odinga met with Zimbabwean President Emmerson Mnangagwa yesterday at State House in Harare to seek Zimbabwes support for his candidacy as the next African Union Commission (AUC) chairperson. Mr. Odinga is one of three candidates vying for the top AU post, alongside Djiboutis Foreign Affairs Minister Mahamoud Ali Youssouf and Somalias Fawzia Yusuf Adam.\n\nSpeaking after the meeting, Mr. Odinga expressed optimism about Zimbabwes backing, given President Mnangagwas current role as the Chairperson of the Southern African Development Community (SADC). I have come to announce my candidature and to also ask for support from Zimbabwe and SADC by extension. I am happy to have been received very well by the President, he said.\n\nIn a post on his X (formerly Twitter) account, Mr. Odinga shared his appreciation for the warm reception, stating: We landed in Harare, Zimbabwe today to a warm reception courtesy of H.E President Emmerson Mnangagwa @edmnangagwa. Its been a pleasure sharing with the President my vision for Africa and discussing my candidature for the AUC Chairmanship.\n\nA Regional Push for Eastern Africa\n\nThe position of AU Commission chairperson is set to rotate to Eastern Africa, following institutional reforms aimed at improving transparency, regional representation, and meritocracy in the AUs leadership selection process. Past chairpersons have come from the western, central, and southern regions of Africa, making this an opportunity for Eastern Africa to take the lead.\n\nMr. Odinga, a seasoned politician and a well-known advocate for Pan-Africanism, has been traveling across the continent to lobby for support. His visit to Harare comes as part of his broader campaign, with plans to meet leaders from other Southern African nations to solidify regional backing.\n\nVision for Africa\n\nDuring his meeting with President Mnangagwa, Mr. Odinga highlighted his vision for a united and self-reliant Africa. We have shared experiences with other nations. We know where we are coming from and where we want to go. Africa will only be developed by Africans themselves, he said.\n\nHe emphasized the importance of leveraging Africas abundant natural resources and its young, dynamic population to drive transformation and development. We have 55 states in Africa, and we are looking at how these countries can be integrated so that we benefit from the resources on our continent, he added.\n\nUpcoming Election\n\nThe new AU Commission chairperson will be elected via secret ballot by the AU Assembly at the 38th AU Summit, scheduled to take place on February 25 in Addis Ababa, Ethiopia. The election process reflects the AUs commitment to gender parity and regional balance, with Eastern Africa producing the chairperson and North Africa expected to fill the deputy chairpersons post.\n\nAs the current SADC Chairperson, President Mnangagwa holds significant sway in influencing the regions position on the election. Whether Zimbabwe and the broader SADC bloc will back Mr. Odinga remains to be seen.\n\nThis visit underscores the high stakes and strategic importance of the upcoming AU elections, as the continent prepares to chart its course toward greater integration, development, and unity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – Kenyan opposition leader Raila Odinga met with Zimbabwean President Emmerson Mnangagwa yesterday at State House in Harare to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/whats-ed-doing-at-state-house/\">Continue reading<span class=\"screen-reader-text\"> \"What’s ED Doing At State House?\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Tshabangu MPs At Precabe | FULL LIST",
            "url": "https://www.zimeye.net/2025/01/14/tshabangu-mps-at-precabe-full-list/",
            "content": "Precabe Attendance List  12 January 2025\n\n34 CCC MPs who were in attendance:\n\n1.Hon. Francisca Ncube\n\n2.Hon. Nyasha Batitsa\n\n3.Hon. Constance Chihota\n\n4.Hon. Melphiner Gwabeni\n\n5.Hon. Dr. Thokozani Khupe\n\n6.Hon. Dr. Josiah Makombe\n\n7.Hon. Juliana Makuvire\n\n8.Hon. Diana Marikano\n\n9.Hon. Samukeliso Maseko\n\n10.Hon. Charles Moyo\n\n11.Hon. Lungile Ncube\n\n12.Hon. Sen. Spive Munemo\n\n13.Hon. Samantha Mureyani\n\n14.Hon. Bridget Nyandoro\n\n15.Hon. Tsungirayi Rungwave\n\n16.Hon. Sen. Linda Sibanda\n\n17.Hon. Ottilia Sibanda\n\n18.Hon. Sen. Sam Chapfudza\n\n19.Hon. Sen. Theresa Kabondo\n\n20.Hon. Sen. Tambudzai Kunaka\n\n21.Hon. Sen. Media Kupfuma\n\n22.Hon. Sen. Moses Manyengawana\n\n23.Hon. Sen. Kudakwashe Matibiri\n\n24.Hon. Sen. Maxwell Mdhluri\n\n25.Hon. Sen. Grace Mupande\n\n26.Hon. Sen. Nonhlanhla Mlotshwa\n\n27.Hon. Sen. Sisasenkosi Ndebele\n\n28.Hon. Sen. Maggie Ngwena\n\n29.Hon. Sen. Kucaca Phulu\n\n30.Hon. Sen. Sengezo Tshabangu\n\n31.Hon. Lovejoy Sibanda\n\n32.Hon. Joseph Bonda\n\n33.Hon. Truswell Chikomo\n\n34.Hon. Sen. Tawanda Bvumo\n\nApologies:\n\n35. Hon. Maureen Kademaunga\n\n36. Hon. Nomvula Mguni\n\n37. Hon. Susan Matsunga\n\n38. Hon. Pamela Chitumbe\n\n39. Hon. Vusumuzi Moyo\n\n40. Hon. Sichelesile Mahlangu\n\n41. Hon. Libion Sibanda\n\n42. Hon. Linyani Sibanda\n\n43. Hon. Sen. Tapfumanei Muzoda\n\n44. Hon. Prince Dube\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Precabe Attendance List – 12 January 2025 34 CCC MPs who were in attendance: 1. Hon. Francisca Ncube 2. Hon. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/tshabangu-mps-at-precabe-full-list/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu MPs At Precabe | FULL LIST\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Zion Christian Church Pastor Forces Self On Daughter",
            "url": "https://www.zimeye.net/2025/01/14/zion-christian-church-pastor-forces-self-on-daughter/",
            "content": "By A Correspondent\n\nA shocking and disturbing case has emerged in Alexandra, where a 49-year-old pastor, reportedly a leader at the Zion Christian Church (ZCC), has allegedly impregnated his 13-year-old daughter.\n\nAccording to sources, the family was approached for questioning, but they claimed to have resolved the matter internally, without involving the police. The fathers response to the allegations was that he was unaware of the pregnancy.\n\nIn a bizarre and alarming twist, it is alleged that the father attempted to terminate the pregnancy by giving his daughter church tea. Fortunately, the attempt was unsuccessful.\n\nThis developing story raises serious concerns about child abuse, exploitation, and the failure of the family and potentially the church to report and address the issue. As more information becomes available, this story will continue to unfold.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking and disturbing case has emerged in Alexandra, where a 49-year-old pastor, reportedly a leader at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/zion-christian-church-pastor-forces-self-on-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Zion Christian Church Pastor Forces Self On Daughter\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Tyson Blasts Dambudzo",
            "url": "https://www.zimeye.net/2025/01/14/tyson-blasts-dambudzo/",
            "content": "By A Correspondent\n\nFormer Zanu PF national political commissar and Generation 40 leader, Saviour Kasukuwere, has vowed to return to Zimbabwe and directly challenge President Emmerson Mnangagwa over his bid to extend his presidency beyond the constitutional limit, which ends in 2028.\n\nKasukuwere is urging Mnangagwa to call for a referendum on the matter. Let him call for a referendum on this rubbish. We will land in Harare and defeat this satanic arrangement. We have enough forces to defeat this nonsense, Kasukuwere said, expressing his readiness to confront the president head-on.\n\nKasukuwere further condemned Mnangagwas actions, describing them as desperate acts of criminals who think they can hoodwink the masses of our people. He emphasized that such moves would be met with resistance and vowed to fight against any unconstitutional attempt to extend Mnangagwas rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Zanu PF national political commissar and Generation 40 leader, Saviour Kasukuwere, has vowed to return to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/tyson-blasts-dambudzo/\">Continue reading<span class=\"screen-reader-text\"> \"Tyson Blasts Dambudzo\"</span></a></p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        }
    ]
}