{
    "news": [
        {
            "title": "Mnangagwa’s Gun Handling Blunder Fuels Debate On His Military-Training-Credentials",
            "url": "https://www.zimeye.net/2025/05/11/mnangagwas-gun-handling-blunder-fuels-debate-on-his-military-training-credentials/",
            "content": "By Investigations Desk | Harare & Moscow Bureau\n\nA photograph of President Emmerson Mnangagwa awkwardly handling a firearm during a foreign ceremony in Belarus has gone viralrekindling longstanding doubts about his liberation war credentials, particularly in light of recent remarks by a respected war veteran.\n\nThe image, taken in what appears to be a ceremonial setting involving Russian officials, shows Mnangagwa gripping an assault rifle with his finger near the trigger, in a crowded room of dignitaries. His posture and orientation of the weapon appear inconsistent with basic firearm safety protocols, raising both security concerns and symbolic questions about the legacy he claims to represent.\n\nA Dangerous GripWhats Wrong with This Image?\n\nExperts and veterans alike have pointed out three glaring violations of standard firearm safety: Finger on the trigger: A basic error for any trained fighter; it breaks Rule #1 of gun safety. Unclear muzzle direction: The barrel isnt pointed toward the ground or a clearly safe zone. Unvetted handling: Theres no visual assurance the weapon was decommissioned or cleared.\n\nThe ceremonial context doesnt negate the optics. In fact, for a head of stateespecially one claiming liberation war credentialssuch visual missteps are symbolic red flags.\n\nKaren Kazingizi: Mnangagwa Never Fought in the Liberation Struggle\n\nThis incident has taken on sharper political meaning following a 2019 press conference bold statement by Cde Karen Kazingizi, a seasoned former guerrilla combatant.\n\nEmmerson Mnangagwa didnt fight in the liberation struggle, Kazingizi recently declared. He was only handpicked by Robert Mugabe to displace and divide real fighters.\n\nHer comment, widely shared across veteran networks, reflects deepening rifts within ZANU PFs liberation war generation, many of whom believe Mnangagwa has falsely projected himself as a wartime field commander when in fact he served in administrative or intelligence-support roles outside the combat zones.\n\nA senior male war veteran advised ZimEye on Sunday saying, It is the shoulder that holds it in position.\n\nYou can not hold a gun like that. The hand will be pushed away or injured.\n\nFreedom Fighter or Political Infiltrator?\n\nMnangagwa has long used the rhetoric of war heroism to fortify his image. His infamous nickname The Crocodile has been marketed as a symbol of wartime resilience. But critics argue it stems more from post-war political maneuvering and internal purges than any battlefield command.\n\nKazingizis statement, now paired with this firearm gaffe, presents a visual metaphor of someone performing the image of a soldierwithout the grounding of real frontline experience.\n\nSymbolism Matters\n\nIn a post-conflict society like Zimbabwe, where legitimacy is still tied to liberation narratives, optics such as this are not benign. Weaponry is sacred in war veteran culturea symbol of sacrifice, discipline, and memory. Mishandling it, especially on a foreign stage, is not just a technical errorits a political affront.\n\nFinal Thought\n\nMnangagwa may have held a gun in Moscow, but questions remain: Did he ever hold one in Chimurenga? Did he ever fire it in the name of Zimbabwes liberationor only in pursuit of power?\n\nThe gun is symbolicbut as veterans like Kazingizi remind the nation, symbols must be earned, not posed with.-ZimEye.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigations Desk | Harare & Moscow Bureau A photograph of President Emmerson Mnangagwa awkwardly handling a firearm during a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/mnangagwas-gun-handling-blunder-fuels-debate-on-his-military-training-credentials/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Gun Handling Blunder Fuels Debate On His Military-Training-Credentials\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Happy Women’s Day",
            "url": "https://www.zimeye.net/2025/05/11/happy-womens-day-2/",
            "content": "The Gukurahundi Victims and Survivors are remembered in Zimbabwe. Ibhetshu LikaZulu honors them all as we mark the World Womens Day.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Gukurahundi Victims and Survivors are remembered in Zimbabwe. Ibhetshu LikaZulu honors them all as we mark the World Women’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/happy-womens-day-2/\">Continue reading<span class=\"screen-reader-text\"> \"Happy Women’s Day\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Happy Mothers Day",
            "url": "https://www.zimeye.net/2025/05/11/happy-mothers-day-2/",
            "content": "Happy Mothers Day to all the Gukurahundi Genocide Victims and Survivors. Happy Mothers Day to Women who reside at Mkhonyeni Village in Tsholotsho North. The fearless Women gather every year to hold a memorial service for more than 20 women whose bones lie in an unmarked graves. The Fifth Brigade shot and burnt them in four grass thatched huts in the presence of their children who continue calling for justice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Happy Mother’s Day to all the Gukurahundi Genocide Victims and Survivors. Happy Mother’s Day to Women who reside at Mkhonyeni … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/happy-mothers-day-2/\">Continue reading<span class=\"screen-reader-text\"> \"Happy Mothers Day\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Mnangagwa Now An Airborne President Amid Secretive, Costly Foreign Trips",
            "url": "https://www.zimeye.net/2025/05/11/mnangagwa-now-an-airborne-president-amid-secretive-costly-foreign-trips/",
            "content": "By A Correspondent-President Emmerson Mnangagwa has left Moscow for Belarus following his participation in Russias 80th Victory Day commemorations held at the Kremlins Red Square on Friday. His next stop, Belarus, further signals deepening ties with Eastern European authoritarian states under the guise of economic cooperation.\n\nMnangagwas foreign trips, often kept secret until he lands, continue to drain millions in taxpayers money. The costs of travel for the presidiumincluding chartered jets, accommodation, and delegationsremain undisclosed to Parliament and the public, raising accountability concerns. Critics have labelled him the Airborne President, more seen abroad than solving pressing domestic crises.\n\nIn Moscow, Mnangagwa met President Vladimir Putin to reaffirm Zimbabwes alignment with Russias anti-Western bloc. Putin praised Zimbabwes support in multilateral forums and urged practical implementation of bilateral deals. Mnangagwa, in turn, lauded Russias wartime sacrifices and promised to deepen ties in mining, agriculture, and manufacturing.\n\nHowever, beneath the ceremonial diplomacy lie deeper geopolitical interests. Mnangagwa has adopted Russia and Belarus as models for governancemarked by military dominance, surveillance, and media control. His admiration for Belarusian President Alexander Lukashenko has led to several opaque deals involving his wife, Auxillia Mnangagwa, including alleged arms-for-minerals arrangements and agricultural machinery acquisitions that bypass parliamentary scrutiny.\n\nZimbabwes trade with Russia reached US$7.4 billion in 2024 against imports worth US$9.5 billion, reflecting a US$2.1 billion trade deficit. While authorities tout export opportunities in citrus, berries, and oilseeds, little benefit trickles down to the average Zimbabwean amid rising inflation and unemployment.\n\nMnangagwas frequent foreign visits, coupled with autocratic influences and non-transparent deals, continue to isolate Zimbabwe from democratic reforms. His governments obsession with global alliances over local development reveals a regime more concerned with elite survival than people-centered progress.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa has left Moscow for Belarus following his participation in Russia’s 80th Victory Day commemorations held … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/mnangagwa-now-an-airborne-president-amid-secretive-costly-foreign-trips/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Now An Airborne President Amid Secretive, Costly Foreign Trips\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Caps United Snatch Point",
            "url": "https://www.zimeye.net/2025/05/11/caps-united-snatch-point/",
            "content": "Sports Correspondent\n\nMWOS fought back to earn a 2-2 draw against a nine-man TelOne side in a Castle Lager Premier Soccer League Matchday 11 clash at Ngoni Stadium on Saturday.\n\nTelOne opened the scoring in the 9th minute through Eriya Mafirenyika and extended their lead just after the break with a goal from Milton Chimedza in the 47th minute.\n\nMWOS sparked their comeback shortly after the hour mark, with Innocent Zambezi narrowing the deficit in the 53rd minute. TelOne had a golden opportunity to reestablish their two-goal cushion, but Washington Navaya missed a penalty ten minutes later.\n\nTheir situation worsened when both Allen Chapinduka and Kudakwashe Nyakudanga received red cards, reducing TelOne to nine men. MWOS capitalized on the advantage, and Arthur Banda netted the equalizer in the 87th minute, preserving their unbeaten streak, now at eleven games.\n\nIn other matches, CAPS United drew 1-1 with Herentals, while Ngezi Platinum and ZPC Kariba ended 2-2.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent MWOS fought back to earn a 2-2 draw against a nine-man TelOne side in a Castle Lager Premier … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/caps-united-snatch-point/\">Continue reading<span class=\"screen-reader-text\"> \"Caps United Snatch Point\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Ammara Brown Announces Pregnancy in Heartwarming Family Reveal",
            "url": "https://www.zimeye.net/2025/05/11/ammara-brown-announces-pregnancy-in-heartwarming-family-reveal/",
            "content": "Harare  11 May 2025\n\nBy Showbiz Reporter | ZimEye | Celebrated Zimbabwean singer and actress Ammara Brown has publicly announced her pregnancy, revealing that she is expecting a daughter in a touching and intimate social media video released just 43 minutes ago.\n\nDressed in a white embroidered maternity gown, Ammara is seen gently cradling her baby bump in a serene garden setting, accompanied by her son and a man presumed to be her partner. The heartwarming video also includes an ultrasound scan, confirming the joyous news.\n\nIn a deeply personal caption, Ammara wrote:\n\nTo have a wonderful daughter growing inside me, a magnificent son who loves boundlessly, and the love of my life right beside me My blessings overwhelm me. I wish this for every mother out there.\n\nThe news has sparked an outpouring of love and congratulations from fans and fellow artists across the region, with the announcement already garnering thousands of likes and hundreds of heartfelt comments.\n\nKnown for her powerful voice and emotive performances, Ammara Brown continues to inspire her followersnot just through music, but through moments of motherhood and authenticity.\n\nMore to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 11 May 2025 By Showbiz Reporter | ZimEye | Celebrated Zimbabwean singer and actress Ammara Brown has publicly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/ammara-brown-announces-pregnancy-in-heartwarming-family-reveal/\">Continue reading<span class=\"screen-reader-text\"> \"Ammara Brown Announces Pregnancy in Heartwarming Family Reveal\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Mnangagwa Coaxes Zimbabwean Students In Russia With Empty Rhetoric",
            "url": "https://www.zimeye.net/2025/05/11/mnangagwa-coaxes-zimbabwean-students-in-russia-with-empty-rhetoric/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa attended Russias 80th Victory Day commemorations at Red Square in Moscow this past weekend and later addressed Zimbabwean students studying in the country.\n\nIn his remarks, Mnangagwa repeated familiar promises of support, telling students that the government is committed to their welfare and integration into Zimbabwes economic development efforts.\n\nThe government will continue to take care of its citizens and create an environment for them to thrive, he said, echoing sentiments he has shared at similar student engagements abroad.\n\nHe highlighted the role of science, technology, and innovation in national growth, calling on students to embrace these fields. We need your knowledge and expertise back home to build our country. The future of Zimbabwe lies in the hands of skilled and innovative young people, he stated.\n\nThe students took the opportunity to raise concerns around mutual recognition of qualifications, government support mechanisms, and access to start-up funding. However, Mnangagwa offered few concrete solutions, instead reaffirming broad commitments without clear timelines or actionable plans.\n\nAs has become customary during his international visits, the presidents meeting with students served more as a symbolic gesture than a forum for tangible engagement, with students leaving with more reassurances than results.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa attended Russia’s 80th Victory Day commemorations at Red Square in Moscow this past weekend … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/mnangagwa-coaxes-zimbabwean-students-in-russia-with-empty-rhetoric/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Coaxes Zimbabwean Students In Russia With Empty Rhetoric\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Man Brutally Kills Brother Over “Dog Fight Dispute”",
            "url": "https://www.zimeye.net/2025/05/11/man-brutally-kills-brother-over-dog-fight-dispute/",
            "content": "By A Correspondent\n\nA shocking incident has rocked the community of Ziyapenduka Village in Chipinge, as 48-year-old Amos Nduna stands accused of brutally murdering his brother over a long-standing feud sparked by clashes between their dogs. The brothers animosity, fueled by their pets constant fights, ultimately led to a tragic confrontation.\n\nAccording to police reports, the fateful day began with a confrontation between the brothers while they were on their way to their properties. The encounter, triggered by a fight between their dogs, initially seemed to have been diffused. However, tensions escalated later that day when Nduna followed his brother to his banana plantation. It was there that the accused allegedly attacked his brother with a machete, striking him multiple times.\n\nThe victims body was discovered the following day by his household helper, who had grown concerned after finding the house locked. A search of the banana plantation led to the gruesome discovery of the deceased in a pool of blood. The helper immediately reported the incident to the police, leading to Ndunas apprehension and the recovery of the alleged murder weapon.\n\nNduna appeared before Magistrate Cathrine Dzivanyika at the Chipinge Magistrate Court on May 8th, 2025, facing charges under Section 47 of the Criminal Law Codification and Reform Act Chapter 9:23. Prosecutor Tanaka Mufudza represented the State during the court proceedings. The accused has been remanded in custody until May 22nd for routine remand.\n\nThe Zimbabwe Republic Police have urged the public to seek mediation and professional assistance to resolve conflicts peacefully, emphasizing the importance of avoiding tragic outcomes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking incident has rocked the community of Ziyapenduka Village in Chipinge, as 48-year-old Amos Nduna stands … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/man-brutally-kills-brother-over-dog-fight-dispute/\">Continue reading<span class=\"screen-reader-text\"> \"Man Brutally Kills Brother Over “Dog Fight Dispute”\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Picture: Is Mnangagwa Telling Putin ‘ Geza Wandinetsa?’",
            "url": "https://www.zimeye.net/2025/05/11/picture-is-mnangagwa-telling-putin-geza-wandinetsa/",
            "content": "ZimEye on X\n\nShamiso Dee on WhatsApp, Sunday, May 11, 2025: Mnangagwa says to Putin, Geza wandinetsa?\n\nDo you think Shamiso Dees remark is a fair reflection of reality?\n\nShamiso Dee on WhatsApp, Sunday, May 11, 2025: Mnangagwa says to Putin, Geza wandinetsa?Do you think Shamiso Dees remark is a fair reflection of reality?pic.twitter.com/yxLqcXua3m\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ZimEye on X… Shamiso Dee on WhatsApp, Sunday, May 11, 2025: Mnangagwa says to Putin, “Geza wandinetsa?” Do you think … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/picture-is-mnangagwa-telling-putin-geza-wandinetsa/\">Continue reading<span class=\"screen-reader-text\"> \"Picture: Is Mnangagwa Telling Putin ‘ Geza Wandinetsa?’\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        },
        {
            "title": "Condoms Clog Masvingo Sewage System, Mayor Raises Alarm",
            "url": "https://www.zimeye.net/2025/05/11/condoms-clog-masvingo-sewage-system-mayor-raises-alarm/",
            "content": "By A Correspondent\n\nMasvingo City Mayor, Councillor Aleck Tabe, has sounded the alarm over a growing sanitation crisis in the cityused condoms are clogging the sewage system.\n\nIn a statement released on Friday, Mayor Tabe expressed deep concern about the improper disposal of condoms, which he says is contributing to frequent sewage blockages in Zimbabwes oldest city.\n\nVagari vemuguta reMasvingo varikurasira macondom muma sewage kana vapedza kumashandisa, izvo zvirikunzeresa kubhaja kwemasewage muguta, said Tabe, addressing the issue in Shona.\n\nTranslated, he noted: Residents of Masvingo are throwing used condoms into the sewage system after use, which is causing blockages in the citys sewer lines.\n\nThe mayor urged residents to act responsibly. We urge residents to dispose of condoms in bins, he added. We cant control these issues of leisure and intimacy.\n\nTabe suggested that the problem is being exacerbated by the presence of six institutions of higher learning in and around the city, pointing to high levels of sexual activitycommonly referred to as mjoloas a contributing factor.\n\nCity engineers and sanitation workers have reportedly been battling recurring blockages, straining already stretched municipal resources.\n\nThe city council is expected to launch a public awareness campaign in the coming weeks, encouraging responsible waste disposal and safer hygiene practices among residents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo City Mayor, Councillor Aleck Tabe, has sounded the alarm over a growing sanitation crisis in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/11/condoms-clog-masvingo-sewage-system-mayor-raises-alarm/\">Continue reading<span class=\"screen-reader-text\"> \"Condoms Clog Masvingo Sewage System, Mayor Raises Alarm\"</span></a></p>",
            "time": "06:13",
            "date": "12 May 2025"
        }
    ]
}