{
    "news": [
        {
            "title": "Mnangagwa Extends Pensionable Service for ZRP Officers from 20 to 30 Years",
            "url": "https://www.zimeye.net/2024/12/30/mnangagwa-extends-pensionable-service-for-zrp-officers-from-20-to-30-years/",
            "content": "In a controversial decision, President Emmerson Mnangagwa announced on Monday that the pensionable service period for officers of the Zimbabwe Republic Police (ZRP) would be increased from 20 years to 30 years. This new policy will take effect from January 1, 2025.\n\nThe change was confirmed by Zanu PFs Operation Restore Legacy page, which shared the news with the public:\n\nGood news for Zimbabwe Republic Police  ZRP. President Emmerson Dambudzo Mnangagwa has increased pensionable service for police from 20 years to 30 years, starting on January 1, 2025.\n\nThis move has raised questions about its implications for the ZRP and the broader political landscape in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In a controversial decision, President Emmerson Mnangagwa announced on Monday that the pensionable service period for officers of the Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/mnangagwa-extends-pensionable-service-for-zrp-officers-from-20-to-30-years/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Extends Pensionable Service for ZRP Officers from 20 to 30 Years\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Another #Mazion4ED Official In Horror Crash",
            "url": "https://www.zimeye.net/2024/12/30/another-mazion4ed-official-in-horror-crash/",
            "content": "By James Gwati Another official, this time with the Mazionfor EDmovement has reportedlybeen involvedin a serious car accident en route to Bulawayo.\n\nThe Mazio4eD official had an accident on the same day the #Vapostori4Ed was also involvedin an accidentwhile mobilising people for President Mnangagwa in Bulawayo.\n\nSources close to the incident say the official (name with-held) was heading to preparations for the National Thanksgiving Day, a government-declared event championed by President Emmerson Mnangagwa.\n\nSocial media platforms are now flooded with images of the mangled vehicle, raising concerns about the officials condition.\n\nThe National Thanksgiving Day, which Mnangagwa introduced after his rise to power through a military coup in 2017, has become a strategic tool in his political arsenal.\n\nHeld annually in Bulawayo, the event is positioned as a day of intercession for national prosperity and blessings, emphasising the role of faith in Zimbabwes development.\n\nHowever, critics argue that the day serves as a veneer for Mnangagwas 2030 Agenda, a campaign to solidify his rule while sidelining political rivals, including Vice President Constantino Chiwenga.\n\nMnangagwa has leveraged religious platforms to bolster his legitimacy.\n\nKey allies like Reverend Andrew Wutawunashe, founder of the Faith for Nation Campaign, have played pivotal roles in this strategy.\n\nWutawunashe Sunday even composed a song praising Mnangagwa, declaring him the nations leader until 2030.\n\nSuch actsare seenas direct endorsements of Mnangagwas agenda, further entrenching his influence within the religious sector.\n\nEfforts to contact Madzibaba Moses Gwasarira, the national chairperson of Vapostori and Zion for ED, for comment were unsuccessful.\n\nGwasarira had attended the Sunday event, where Mnangagwas religious-political alliance wason full display.\n\nZimEye is working to confirm details of the accident with law enforcement authorities, but theincident has already sparked speculation about its timing, given the intensifying power struggles between Mnangagwa and Chiwenga.\n\nThe Spokesperson of Vapostori &Mazion for ED Madzibaba Obey Mapuranga had an accident on his way to Bulawayo for the advance mobilization of the Prayer Day, also Madzibaba Owen Velvet had an accident on his way back from Bulawayo due to heavy rains. The 2 Patriots came out alive.pic.twitter.com/ljw5sSpsd8\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati– Another official, this time with the Mazion for ED movement has reportedly been involved in a serious car accident en route … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/another-mazion4ed-official-in-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Another #Mazion4ED Official In Horror Crash\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "ZIFA Polls: Mliswa Blasts Tagwirei for Attempting To Hijack Football",
            "url": "https://www.zimeye.net/2024/12/30/zifa-polls-mliswa-blasts-tagwirei-for-attempting-hijack-football/",
            "content": "Sports Correspondent\n\nFormer Norton MP and ex-Democratic Movement for Zimbabwe (Dembare) fitness trainer, Temba Mliswa, has strongly criticized businessman Kuda Tagwirei for allegedly attempting to take control of Zimbabwean football. Mliswa, who was recently disqualified from the ZIFA presidential elections, claimed that powerful cartels are using the ZIFA elections as a platform to advance their own interests.\n\nMliswa stated, Its unfortunate that the ZIFA elections have become an arena for cartels to flex their power and influence, redirecting the course of Zimbabwean football for their own benefit.\n\nWhile acknowledging Tagwireis success as a businessman and his potential to be a great sponsor for local teams, Mliswa accused him of misusing his power to manipulate the football sector.\n\nKuda has been an astute businessman and could be a great sponsor, funding and supporting local teams, Mliswa continued. However, he has abused that power to try and influence the entire football sector, using proxies like Magwizi and his company, Sakunda.\n\nMliswa warned that this kind of influence sets a dangerous precedent that could harm the long-term development of Zimbabwean football. He pointed out that while Delta has been involved in local football for years, they have never tried to manipulate the sport for their own private interests or supported specific candidates for office.\n\nKuda Tagwirei is my mzukuru and I will always speak frankly with him, Mliswa added.\n\nThis approach is wrong. It would be more prudent and beneficial if he focused on sponsoring the sport. However, this sudden involvement in corporate social work appears to be aimed at supporting a specific candidate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Norton MP and ex-Democratic Movement for Zimbabwe (Dembare) fitness trainer, Temba Mliswa, has strongly criticized businessman Kuda … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/zifa-polls-mliswa-blasts-tagwirei-for-attempting-hijack-football/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Polls: Mliswa Blasts Tagwirei for Attempting To Hijack Football\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "The Importance of Emotional Control for Safe Driving",
            "url": "https://www.zimeye.net/2024/12/30/the-importance-of-emotional-control-for-safe-driving/",
            "content": "Driving requires more than just the physical ability to operate a vehicle; it demands total concentration and a sense of calm. How you feel behind the wheel can significantly impact your safety and that of others on the road. Whether youre feeling relaxed, anxious, or hot-tempered, your emotions affect your judgment, reaction times, and overall driving behavior.\n\nIts essential to recognize the profound influence emotions have on your driving and actively work to control them. Emotional reactions can alter your decision-making process, leading to dangerous maneuvers or poor judgment. For example, anxiety might cause you to overreact or hesitate, while anger could lead to aggressive driving and reckless behavior. Stress can cloud your focus, increasing the likelihood of mistakes.\n\nThe key to maintaining safety on the road lies in emotional regulation. Regardless of the emotional state youre in, never allow your feelings to dictate your actions behind the wheel. Losing control can lead to dangerous situations, not only putting yourself and your passengers at risk but also endangering other drivers and pedestrians.\n\nHere are a few strategies for managing emotions while driving:\n\nBy recognizing the link between emotions and driving behavior, and by taking steps to manage your stress, you can significantly reduce the risk of accidents. Remember, driving is a responsibility that requires a clear mind and a calm demeanor. Never let emotions take the wheel.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Driving requires more than just the physical ability to operate a vehicle; it demands total concentration and a sense of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/the-importance-of-emotional-control-for-safe-driving/\">Continue reading<span class=\"screen-reader-text\"> \"The Importance of Emotional Control for Safe Driving\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Mystery Surrounds Death Of Zim Soldier",
            "url": "https://www.zimeye.net/2024/12/30/mystery-surrounds-death-of-zim-soldier/",
            "content": "By A Correspondent\n\nA tragic incident has shaken the small village of Msasane in Zimunyama, Plumtree, after Unity Sikhokho, a Zimbabwe National Army (ZNA) soldier, died allegedly from poisoning.\n\nAccording to eyewitnesses, Sikhokho consumed beer laced with poison at Mqegula shops in Plumtree. The soldier, who was based in Gweru, had been socializing at the local establishment when he unknowingly ingested the tainted drink.\n\nSikhokho reportedly fell ill shortly after consuming the beer and passed away. The circumstances surrounding his death are still unclear, and local authorities have launched an investigation.\n\nThe close-knit community of Msasane is in mourning, and the incident has raised concerns about safety at public drinking spots.\n\nCommunity members are calling for swift action to bring the perpetrators to justice if foul play is confirmed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident has shaken the small village of Msasane in Zimunyama, Plumtree, after Unity Sikhokho, a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/mystery-surrounds-death-of-zim-soldier/\">Continue reading<span class=\"screen-reader-text\"> \"Mystery Surrounds Death Of Zim Soldier\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Two Chivayo-Donated Cars Crash on Same Day",
            "url": "https://www.zimeye.net/2024/12/30/two-chivayo-donated-cars-crash-on-same-day/",
            "content": "By A Correspondent\n\nTwo vehicles donated by controversial Zanu PF businessman Wicknell Chivayo were involved in separate accidents on the same day, sparking questions about the source of the tycoons wealth.\n\nAccording to a report from the Zanu PF Operation Restore Legacy Facebook page, the accidents involved two prominent individuals connected to the religious and political circles.\n\nThe spokesperson for Vapostori and Mazion for President Emmerson Mnangagwa, Madzibaba Obey Mapuranga, was involved in an accident while traveling to Bulawayo for the advance mobilization of the Prayer Day event. The report states that the accident occurred as Mapuranga made his way to the city.\n\nThe second accident involved Madzibaba Owen Velvet, who was traveling back from Bulawayo. Velvets car was reportedly caught in heavy rains, which led to the crash.\n\nThe Facebook page, known for its affiliation with Zanu PF, expressed concern about the incidents, with a post reading: The Spokesperson of Vapostori and Mazion for ED Madzibaba Obey Mapuranga had an accident on his way to Bulawayo for the advance mobilization of the Prayer Day, also Madzibaba Owen Velvet had an accident on his way back from Bulawayo due to heavy rains. Sir Wicknel vapamhai futi, a statement made in reference to Chivayos involvement in donating the cars.\n\nThe accidents have raised eyebrows regarding the true origin of Wicknell Chivayos wealth, a subject that has been widely debated in Zimbabwe due to his controversial business dealings. Chivayo, known for his ties to the ruling Zanu PF party, has faced scrutiny over various financial dealings, with critics questioning the legitimacy of his wealth.\n\nThe accidents involving his donated vehicles are likely to intensify public curiosity surrounding his business empire and the sources behind his generous contributions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two vehicles donated by controversial Zanu PF businessman Wicknell Chivayo were involved in separate accidents on the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/two-chivayo-donated-cars-crash-on-same-day/\">Continue reading<span class=\"screen-reader-text\"> \"Two Chivayo-Donated Cars Crash on Same Day\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Opposition MP Reveals Shocking Food Crisis",
            "url": "https://www.zimeye.net/2024/12/30/opposition-mp-reveals-shocking-food-crisis/",
            "content": "By A Correspondent\n\nHon. Mutsa Murombedzi, the opposition proportional representation MP for Mashonaland West, has expressed her concerns over the growing food crisis in her home area.\n\nBelow is her statement:\n\nSunday in the village began with a moment of reflection and community connection at church. Later, I applied AN fertilizer in the fields to combat a stubborn worm that is damaging crops. Villagers have shared that the worm is becoming more resistant due to changing climate conditions, and they have resorted to using Surf detergent as a remedy.\n\nIn the afternoon, I joined some women fishing in the leftover ponds of Mupfure, balancing children on their backs while they sought food for their families. Hunger is a pressing issue, but they remain hopeful that a full Mupfure flood will bring better catches.\n\nUnfortunately, it was a no-catch day for me, but it is through conversations like these, hearing their stories of resilience, that I find inspiration and a deeper understanding of their daily struggles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Hon. Mutsa Murombedzi, the opposition proportional representation MP for Mashonaland West, has expressed her concerns over the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/opposition-mp-reveals-shocking-food-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition MP Reveals Shocking Food Crisis\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Vapostori For ED Member In Terrible Accident",
            "url": "https://www.zimeye.net/2024/12/30/vapostori-for-ed-member-in-terrible-accident/",
            "content": "By A Correspondent\n\nTwo vehicles donated by controversial Zanu PF businessman Wicknell Chivayo were involved in separate accidents on the same day, sparking questions about the source of the tycoons wealth.\n\nAccording to a report from the Zanu PF Operation Restore Legacy Facebook page, the accidents involved two prominent individuals connected to the religious and political circles.\n\nThe spokesperson for Vapostori and Mazion for President Emmerson Mnangagwa, Madzibaba Obey Mapuranga, was involved in an accident while traveling to Bulawayo for the advance mobilization of the Prayer Day event. The report states that the accident occurred as Mapuranga made his way to the city.\n\nThe second accident involved Madzibaba Owen Velvet, who was traveling back from Bulawayo. Velvets car was reportedly caught in heavy rains, which led to the crash.\n\nThe Facebook page, known for its affiliation with Zanu PF, expressed concern about the incidents, with a post reading: The Spokesperson of Vapostori and Mazion for ED Madzibaba Obey Mapuranga had an accident on his way to Bulawayo for the advance mobilization of the Prayer Day, also Madzibaba Owen Velvet had an accident on his way back from Bulawayo due to heavy rains. Sir Wicknel vapamhai futi, a statement made in reference to Chivayos involvement in donating the cars.\n\nThe accidents have raised eyebrows regarding the true origin of Wicknell Chivayos wealth, a subject that has been widely debated in Zimbabwe due to his controversial business dealings. Chivayo, known for his ties to the ruling Zanu PF party, has faced scrutiny over various financial dealings, with critics questioning the legitimacy of his wealth.\n\nThe accidents involving his donated vehicles are likely to intensify public curiosity surrounding his business empire and the sources behind his generous contributions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two vehicles donated by controversial Zanu PF businessman Wicknell Chivayo were involved in separate accidents on the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/vapostori-for-ed-member-in-terrible-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Vapostori For ED Member In Terrible Accident\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Several Injured In Kombi Horror Crash",
            "url": "https://www.zimeye.net/2024/12/30/several-injured-in-kombi-horror-crash/",
            "content": "By Courts and Crime Reporter- At least 14 passengers were injured after a Nissan Caravan Kombi was involved in an accident.\n\nThe accident happened on Friday along Lyton Road.\n\nPolice said the kombi, with 18 passengers on board, veered off the road and landed in a ditch.\n\nThe injured victimswere takento Sally Mugabe Hospital for treatment.\n\nThe ZRP said:\n\nPolice in Mbare are investigating a serious road traffic accidentwhich occurredalong Lyton Road, Harareon27/12/24.14passengers were injured when a Nissan Caravan Kombi with 18 passengers on board veered off the road and landed in a ditch. The injured victimswere takento Sally Mugabe Hospital for treatment.\n\nA Toyota Hiace, commonlyreferred to asa Caravan in Zimbabwe, typically has a passenger capacity of 15 to 16 seats.\n\nHowever, it has become common forkombisto be overloaded, with each vehicle often carrying at least 20 passengers when considered full.\n\nEven at police roadblocks, overloadedkombisare typically allowed to pass.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Courts and Crime Reporter- At least 14 passengers were injured after a Nissan Caravan Kombi was involved in an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/several-injured-in-kombi-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Several Injured In Kombi Horror Crash\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        },
        {
            "title": "Zim’s Finest Journo & Comms Strategist Dies",
            "url": "https://www.zimeye.net/2024/12/30/zims-finest-journo-comms-strategist-dies/",
            "content": "By James Gwati- Aspiring academic, veteran journalist and communications specialist Tawanda Chisango has died.\n\nHe was 44.\n\nThe African Leaders Malaria Alliance (ALMA)Chief of Communications passed away on Friday, 20th December 2024, at his home in the capital.\n\nTawanda was one of the pioneer students of Media and Society Studies at Midlands State University.\n\nHis close associates say he was in the process of enrolling for his PhD in Strategic communications by the time of his death.\n\nThe Zimbabwe journalism fraternity has lost one of the sharpest brains in the industry, and the void he has left will be difficult to fill.\n\nTawanda is survived by his loving wife, two sons, and a daughter.\n\nIn a statement, his employer, African Leaders Malaria Alliance (ALMA), said the humble Tawanda died while surrounded by his family.\n\nSaid ALMA:\n\nIt is with deep sorrow that we announce the sudden and untimely passing of our esteemed colleague, Mr. Tawanda Chisango, Chief of Communications at the African Leaders Malaria Alliance (ALMA).\n\nTawandas loss is not only a deeply personal tragedy for the ALMA family but also a significant loss to the global health community, particularly in the fight against malaria.\n\nAs ALMAs Chief of Communications, Tawanda was a driving force behind our communication and advocacy efforts, helping to elevate malaria elimination and broader health priorities to the highest levels of government.\n\nHis work facilitated high-level engagements with Heads of State and Government, championing the Malaria Elimination agenda and accountability for the health of those left behind.\n\nHis tireless dedication was pivotal to successfully amplifying ALMAs health ambition in the region; and on the global stage.\n\nBeyond his professional accomplishments, Tawanda was a kind-hearted, warm, and supportive colleague whose gentle presence enriched the lives of everyone he worked with.\n\nHe was a true team player, always willing to lend a hand or a word of encouragement.\n\nHis exceptional work ethic, attention to detail, and creative approach to communication set a high standard that we all aspired to emulate.\n\nWe are deeply grateful for the many lessons he imparted during his time with us.\n\nTawandas career spanned impactful roles at the African Union Commission, UNAIDS, World Vision, and more.\n\nAt the AU Commission, he served as a Programme Advocacy and Partnerships Expert, where he played a role in advancing health diplomacy and fostering collaboration with Heads of State and other key stakeholders to address HIV, TB, malaria, and broader development goals.\n\nHis ability to connect health priorities with high-level advocacy was unmatched, leaving a lasting legacy.\n\nOur thoughts and prayers are with them during this unimaginable time.\n\nMay the Lord grant them strength and comfort as they navigate this profound loss.\n\nAs we mourn Tawandas passing, we also celebrate his remarkable life and the impact he made.\n\nHis kindness, humility, and commitment to improving the lives of Africans will continue to be reflected in our work and his legacy.\n\nMay his warm and gentle soul rest in eternal peace.\n\nRest in power Tawanda Chisango. You will be deeply missed but never forgotten.\n\nZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati- Aspiring academic, veteran journalist and communications specialist Tawanda Chisango has died. He was 44. The African Leaders … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/zims-finest-journo-comms-strategist-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Zim’s Finest Journo & Comms Strategist Dies\"</span></a></p>",
            "time": "20:25",
            "date": "30 Dec 2024"
        }
    ]
}