{
    "news": [
        {
            "title": "Nakacinda Neglected Edgar Lungu Leading To His Death Before Shifting To Blame Other People?",
            "url": "https://www.zimeye.net/2025/06/07/nakacinda-neglected-edgar-lungu-leading-to-his-death-before-shifting-to-blame-other-people/",
            "content": "Pictures loading\n\n[WATCH] Patriotic Front secretary-general Raphael Nakacinda says Zambia is in mourning, following the passing of former President Edgar Lungu on Thursday in SA, where he was receiving medical treatment. Nakacinda says the death of the 68-year-old former statesman could have beenpic.twitter.com/OrDBhN8ibx\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Pictures loading",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "Tshabangu Renames Harare Roads",
            "url": "https://www.zimeye.net/2025/06/07/tshabangu-renames-harare-roads/",
            "content": "By Municipal Reporter-The Harare City Council, led by Mayor Jacob Mafume, has sparked public debate after announcing a sweeping renaming of key roads in the capital  a move that some say reflects growing political alignment with the ruling ZANU-PF party.\n\nThe council, now under the influence of the Sengezo Tshabangu-led faction of the Citizens Coalition for Change (CCC), has renamed at least 18 major roads, replacing colonial and historic names with those of prominent local and international political figures, some closely associated with the liberation struggle and post-independence governance.\n\nAccording to an official post by the City of Harare, the new names include:\n\nWhile the renaming of roads is not unusual in post-colonial Zimbabwe, the decision has drawn scrutiny due to its political overtones, especially in light of recent comments by Tshabangu suggesting the construction of arotating statue of President Emmerson Mnangagwaat the newly commissionedTrabablas Interchange.\n\nYes, I said that in recognition of President Mnangagwas good work on this massive Trabablas Interchange, Tshabangu told journalists. Its good that a rotating statue that gives everyone an all-round view of the country be erected at the interchange. As the official opposition, we propose that.\n\nTshabangus remarks have been widely condemned by opposition supporters and civil society actors, who see them as a clear departure from his mandate to hold the ruling party to account. Many observers interpreted the statement as ablatant act of political bootlicking, unbecoming of a self-declared opposition leader.\n\nThe call for a presidential monument, coupled with the naming of a major road after Mnangagwa Enterprise Road is now ED Mnangagwa Road has deepened suspicions that Tshabangus CCC faction is working in concert with ZANU-PF interests.\n\nPolitical analyst Tawanda Moyo commented, Its no longer about symbolic gestures. This is about political realignment masquerading as civic recognition. Tshabangus actions suggest hes abandoning the watchdog role of the opposition in favor of personal or factional gain.\n\nWhile infrastructure development such as the Trabablas Interchange is often praised across the political divide, critics argue thatTshabangus tone and timingare alarming, particularly as Zimbabwe faces mounting international criticism over repression, economic collapse, and the shrinking of democratic space.\n\nFor many, these developments reflect a broader crisis in opposition politics, wherefragmentation, co-optation, and lack of principled leadershipare undermining efforts to challenge authoritarian rule.\n\nAs of now, there has been no official government response to Tshabangus statue proposal. But the controversy continues to intensify, raising difficult questions aboutthe independence, integrity, and future of opposition politics in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Municipal Reporter-The Harare City Council, led by Mayor Jacob Mafume, has sparked public debate after announcing a sweeping renaming … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/tshabangu-renames-harare-roads/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Renames Harare Roads\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "Zimbabwe Warriors Fall…",
            "url": "https://www.zimeye.net/2025/06/07/zimbabwe-warriors-fall/",
            "content": "By A Correspondent\n\nThe Zimbabwe Warriors suffered a disappointing 2-0 defeat to Burkina Faso in their first international friendly match on Friday, held at the Stade El Bachir in Mohammdia, Morocco.\n\nDespite hopes of a strong performance as part of the teams preparations for upcoming competitive fixtures, the Warriors struggled to find rhythm and failed to recover after conceding two early goals.\n\nAlthough the Warriors pushed to get back into the match, their efforts were undermined by persistent errors and a lack of cohesion in midfield.\n\nThe match exposed key areas of concern for Zimbabwe, including defensive frailties and limited attacking options. However, with more international fixtures lined up, the Warriors will be looking to regroup, learn from their mistakes, and build toward a more solid team performance.\n\nThis fixture was part of Zimbabwes ongoing effort to re-establish themselves on the international stage following their return to FIFA-sanctioned competitions.\n\nFans remain hopeful that this loss will serve as a valuable lesson for the technical team as they continue to fine-tune the squad ahead of future challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Warriors suffered a disappointing 2-0 defeat to Burkina Faso in their first international friendly match … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/zimbabwe-warriors-fall/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Warriors Fall…\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "COSAFA Cup Group A South Africa 2 Zimbabwe 0",
            "url": "https://www.zimeye.net/2025/06/07/cosafa-cup-group-a-south-africa-2-zimbabwe-0/",
            "content": "COSAFA Cup Group ASouth Africa 2-0 Zimbabwe#YoungWarriors#CosafaCuppic.twitter.com/3V0mNUGTg7\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "Latest On Mai Jeremia Case",
            "url": "https://www.zimeye.net/2025/06/07/latest-on-mai-jeremia-case-2/",
            "content": "By A Correspondent\n\nThe case involving popular socialite Ashley Masendeke, widely known as Mai Jeremia, has entered a critical phase as it moves through the Zimbabwean judicial system.\n\nOn Friday, Mai Jeremia broke her silence in an emotional post to her followers on social media.\n\nDear friends and family, I hope I find you well. I would like to thank you deeply for your love and support, she wrote. I had taken a break from speaking much about the rape case I reported one month ago. The time has come for the judiciary system to examine my case and give a judgement verifying available evidence and facts. Handina bakatwa, handina uta nemuseve  ndinofamba naJesu chete. May justice be served.\n\nShe added that those wishing to attend the trial are welcome to do so. The proceedings are scheduled for 13 June at 9:00 AM at Rotten Row Magistrates Court in Harare.\n\nTwo men, Thabo Blessing Dube (27) of Chitungwiza and Martin Charlie (25) of Manresa, are facing serious charges in the case.\n\nThey are accused of gang raping Mai Jeremia in an incident reported last month.\n\nThe pair recently appeared before Harare regional magistrate Marehwanazvo Gofa .\n\nThe case has drawn widespread attention, partly due to Mai Jeremias strong public presence and also because of its broader implications in the fight against gender-based violence in Zimbabwe.\n\nHer statement, I walk only with Jesus, has been embraced by many who see her bravery as a call for justice and healing.\n\nAs the court date approaches, various womens rights groups and concerned citizens have expressed interest in attending or supporting the case, emphasizing the need for a transparent and survivor-focused legal process.\n\nAll eyes will now be on the upcoming 13 June hearing, where the judiciary is expected to begin examining the evidence, and possibly, take the first real steps toward justice in a case that has sparked national debate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The case involving popular socialite Ashley Masendeke, widely known as “Mai Jeremia,” has entered a critical phase … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/latest-on-mai-jeremia-case-2/\">Continue reading<span class=\"screen-reader-text\"> \"Latest On Mai Jeremia Case\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "Tshabangu Calls For Erection Of Mnangagwa Statue At Trabablas Interchange",
            "url": "https://www.zimeye.net/2025/06/07/tshabangu-calls-for-erection-of-mnangagwa-statue-at-trabablas-interchange/",
            "content": "By A Correspondent\n\nControversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has sparked widespread criticism after proposing the erection of a statue of President Emmerson Mnangagwa at the recently completed Trabablas Interchange in Harare.\n\nTshabangus remarks have been interpreted by many as a shocking show of allegiance to the ruling ZANU-PF leader  a move viewed by some as a blatant act of political bootlicking coming from a figure who claims to represent the official opposition.\n\nSpeaking on the matter, Tshabangu said:\n\nYes, I said that in recognition of President Mnangagwas good work that he did on this massive Trabablas Interchange. Its good that a rotating statue that gives everyone an all-round view of the country be erected at the interchange. As the official opposition, we propose that.\n\nThe proposal has stirred debate within political circles and on social media, with critics questioning Tshabangus motives and the implications of an opposition leader praising and promoting the glorification of a sitting president through state-sponsored symbolism.\n\nWhile infrastructure development is often acknowledged across party lines, Tshabangus call has raised eyebrows due to its timing and tone  particularly at a moment when Zimbabwe is facing criticism over economic hardship, suppression of dissent, and shrinking democratic space.\n\nAnalysts have pointed out that the statement could further erode public trust in the oppositions ability to hold the ruling party accountable, with one commentator describing the move as a calculated alignment with power rather than principle.\n\nAs of now, there has been no formal government response to Tshabangus proposal, but the debate continues to intensify regarding the independence and integrity of Zimbabwes opposition politics.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has sparked widespread criticism after proposing the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/tshabangu-calls-for-erection-of-mnangagwa-statue-at-trabablas-interchange/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Calls For Erection Of Mnangagwa Statue At Trabablas Interchange\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "ZANU PF Promises Gutu East Voters Wealth: “We Will Empower All of You”",
            "url": "https://www.zimeye.net/2025/06/07/zanu-pf-promises-gutu-east-voters-wealth-we-will-empower-all-of-you/",
            "content": "By A Correspondent\n\nAfter more than four decades of unfulfilled promises in rural development, the ruling ZANU PF party has once again pledged to uplift villagers  this time by vowing to make them rich through empowerment initiatives aligned with President Emmerson Mnangagwas Vision 2030.\n\nSpeaking at a campaign rally in Gutu East last weekend ahead of the June 14 by-election, ZANU PF national political commissar Munyaradzi Machacha struck an optimistic tone, promising transformation and prosperity.\n\nDont worry, we will empower all of you in line with President Emmerson Mnangagwas 2030 vision, said Machacha.\n\nWe are confident of winning the partys confidence ahead of the June 14 by-election. The energy is electric as we mobilise for victory, standing firm in our commitment to the people and the vision for progress.\n\nThank you, His Excellency President Dr ED Mnangagwa, for your unwavering leadership and commitment to the people.\n\nThe bold promises come amid mounting criticism over the ruling partys failure to deliver meaningful development in rural communities over the past 45 years. Analysts have called the latest rhetoric a recycled campaign tactic, especially in constituencies like Gutu East, where access to basic services such as clean water, healthcare, and employment remains limited.\n\nDespite public scepticism, ZANU PF is banking on strong rural voter support and what it describes as grassroots mobilisation to secure victory in the upcoming by-election.\n\nWhether the promises of wealth and empowerment will translate into actual change  or simply fade like those of past campaigns  remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent After more than four decades of unfulfilled promises in rural development, the ruling ZANU PF party has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/zanu-pf-promises-gutu-east-voters-wealth-we-will-empower-all-of-you/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Promises Gutu East Voters Wealth: “We Will Empower All of You”\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "“Drop the Charges, Adopt Him”: Public Urges VP’s Wife Miniyothabo Chiwenga to Show Mercy on Teen Thief",
            "url": "https://www.zimeye.net/2025/06/07/drop-the-charges-adopt-him-public-urges-vps-wife-miniyothabo-chiwenga-to-show-mercy-on-teen-thief/",
            "content": "Harare  7 June 2025.\n\nPicturesof a teenager getting convicted over theft of USD15,000 owned by VP Chiwengas wife, within 6 months of the 2nd Lady posing on camera with the nations biggest convicted fraudster currently swindling millions of dollars, Wicknell Chivayo, do not seem to make sense.\n\nBy Showbiz Reporter | ZimEye | A growing chorus of voices is calling on Zimbabwes Second Lady, Colonel Miniyothabo Baloyi Chiwenga, to show mercy on 18-year-old Succeed Mukaro, who was convicted this week of breaking into her Borrowdale shop and stealing cellphones worth US$15,000.\n\nMukaro, a teenager from Domboshava, pleaded guilty before Harare provincial magistrate Ethel Chichera after being apprehended while attempting to sell the stolen devices. He now awaits sentencing.\n\nBut public opinion is sharply divided. While the state proceeds with the case, many citizens online are pleading for compassion, asking the Vice Presidents wife to drop the charges and consider rehabilitating the youth instead of incarcerating him.\n\nIf I were Miniyothabo Baloyi Chiwenga, I would drop the charges, adopt Succeed Mukaro, and possibly employ him, wrote one commenter, Sekuru Sithole Makumbe, in a widely shared Facebook thread.\n\nA Cry for Mercy or a Slippery Slope?\n\nOthers in the thread pushed back, arguing that theft should not be excused regardless of circumstance.\n\nSo how many thieves have you adopted so far? asked Adrian Koto Chikambure.People need to be responsible for their actions he made his bed, let him lie on it, added Patty Moosheryeequa.\n\nStill, Sekuru Sithole stood firm, urging Zimbabweans to think beyond the crime itself and reflect on the systemic poverty and youth unemployment that may have driven the teenager to act out of desperation.\n\nDid he commit the crime out of greed or survival? The same money that couldve employed youths like Mukaro was looted  Gwanda Solar Project money, looted funds now buying luxuries. But we jump to punish a boy for phones while real criminals roam free.\n\nHis comments drew comparisons between Mukaros situation and Zimbabwes broader socio-economic collapse, where elite-connected tenderpreneurs live in luxury, and youths struggle to survive.\n\nThe Case for Restorative Justice\n\nSome advocates now call on the Second Lady  a senior officer in the Zimbabwe Defence Forces and respected figure in both military and business circles  to set a national example of restorative justice.\n\nThey argue that rehabilitation, mentorship, and employment might not only change Mukaros life but spark a conversation about how the state can redirect wayward youth without condemning them permanently.\n\nAn Open Letter to the Second Lady\n\nDear Colonel Miniyothabo Baloyi Chiwenga,\n\nSucceed Mukaro has erred. He has confessed. He is young. He is broken.\n\nBut what this moment calls for is not just the firmness of law, but the power of mercy. You have the ability to turn a court case into a national case study in redemption over retribution.\n\nA single act of grace could reframe Zimbabwes justice narrative  and transform a convicted boy into a reformed man, a future builder.\n\nSigned,The People of Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 7 June 2025. Pictures of a teenager getting convicted over theft of USD15,000 owned by VP Chiwenga’s wife, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/drop-the-charges-adopt-him-public-urges-vps-wife-miniyothabo-chiwenga-to-show-mercy-on-teen-thief/\">Continue reading<span class=\"screen-reader-text\"> \"“Drop the Charges, Adopt Him”: Public Urges VP’s Wife Miniyothabo Chiwenga to Show Mercy on Teen Thief\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "No Bail For Owner Of Killer Pitbulls",
            "url": "https://www.zimeye.net/2025/06/07/no-bail-for-owner-of-killer-pitbulls/",
            "content": "By A Correspondent\n\nMike Mapinga, the 40-year-old owner of four aggressive dogs linked to a deadly attack in Bluffhill, Harare, will remain in custody for at least another week after withdrawing his bail application.\n\nMapinga, who is facing culpable homicide charges, appeared before Harare regional magistrate Mrs Marehwanazvo Gofa. His legal representative, Mr Stephen Chikotora, told the court that the defense was putting the bail application on hold to focus on another legal matter involving Mapinga currently being handled in a different court.\n\nThe fatal incident took place on May 31, when Mapingas three Pit Bulls and a Rottweiler allegedly mauled a neighbour to death. According to the State, Mapinga acted negligently by releasing the unmuzzled dogs into the yard of his rented property, which is only enclosed by a low brick-and-mortar wall. After releasing the animals, it is alleged that Mapinga went back to his bedroom, leaving them unsupervised.\n\nThe decision to cancel the bail bid means Mapinga will remain behind bars as investigations and court proceedings continue. The case has drawn significant public attention, with many calling for stricter regulations around the ownership of dangerous dog breeds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mike Mapinga, the 40-year-old owner of four aggressive dogs linked to a deadly attack in Bluffhill, Harare, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/no-bail-for-owner-of-killer-pitbulls/\">Continue reading<span class=\"screen-reader-text\"> \"No Bail For Owner Of Killer Pitbulls\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        },
        {
            "title": "Prof Lumumba’s Words While Meeting Mnangagwa Family Today",
            "url": "https://www.zimeye.net/2025/06/07/prof-lumumbas-words-while-meeting-mnangagwa-family-today/",
            "content": "I sit at a breakfast table in Harare in Zimbabwe. The tea that I consume will not be English breakfast, but Kericho tea from Kenya and coffee highly from Ethiopia. And when we do that, then we create jobs.  As I conclude, as I was flying from Addis Ababa to Harare last night, I sat next to a young Zimbabwean who is involved in artificial intelligence in Dubai. Hes been there for three years. I think he is here.  And I asked him whether he is actually intelligent. He said, Im very intelligent. And to me, the most amazing thing is that hes in that space, but hes conscious that he must make a contribution. So hes trying to spread his tentacles here.  to bring the things that he has learned in that space to come and have them done here. And I conclude with what you said. This thing must be cascaded to rural Africa. It must not be a rare thing held in big conference centers. It must make sense to the people in general.  This girl is a Soweto girl and she has a story to tell.  Ill tell it. Because these stories must be told. Because they inspire others. So thank you very much. I look forward to our interaction beyond these engagements. And dont take it for granted. This gentleman here, we say hello to each other at least not once every week. That is the camaraderie that has now come to exist.  You as the Minister for Foreign Affairs, Assistant Minister, you have a big speech to walk about, to spread this gospel, and we wish you that. Thank you very much.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I sit at a breakfast table in Harare in Zimbabwe. The tea that I consume will not be English breakfast, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/07/prof-lumumbas-words-while-meeting-mnangagwa-family-today/\">Continue reading<span class=\"screen-reader-text\"> \"Prof Lumumba’s Words While Meeting Mnangagwa Family Today\"</span></a></p>",
            "time": "06:20",
            "date": "08 Jun 2025"
        }
    ]
}