{
    "news": [
        {
            "title": "Chivayo Publishes Childhood Pictures",
            "url": "https://www.zimeye.net/2025/11/26/chivayo-publishes-childhood-pictures/",
            "content": "How did i miss this story ??Zvazvadai pane andidenha yangu mhinduro inobva mu gate guru saka inokurumudza\n\nCONGRATULATIONS DUDLEY HALL SCHOOL nhasi chimuti chiri kwenyu1 million USD is ready for you to use immediately. My condition are as follows \n\nThe money will be transferred within 7 days after receiving a written confirmation that all my conditions have been accepted and construction can commence without any further delays. Your bus can be collected on Sunday 14 December at Johane Masowe Gwanzura branch kwa Madzibaba Moses. The Driver and whoever is collecting must wear white t-shirt and khaki shorts if theres a woman a white dress and a white dhuku\n\nCOURAGE BROTHER DO NOT STUMBLE, THOUGH THY PATH BE DARK AT NIGHT, THERES A STAR TO GUIDE THE HUMBLETRUST IN GOD AND DO THE RIGHTAMEN\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The controversial tenderpreneur Wicknell Chivayo has published his childhood pictures saying briefly: How did i miss this story? Zvazvadai pane … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/chivayo-publishes-childhood-pictures/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Publishes Childhood Pictures\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "What Innovation When Country Is Drowning In Economic Instability? Citizens Dismiss Mavetera’s ICT Project",
            "url": "https://www.zimeye.net/2025/11/26/what-innovation-when-country-is-drowning-in-economic-instability-citizens-dismiss-maveteras-ict-project/",
            "content": "Tinashe Sambiri Zimbabwes Minister of ICT, Hon. Tatenda Mavetera, on Tuesday officially commissioned the new Innovation Hub at TelOne, describing it as a state-of-the-art facility designed to nurture creativity and empower young innovators. The launch coincided with the graduation of TelOne students, whom Mavetera said represented a new generation of ICT professionals ready to shape the future.\n\nWhile the event was framed as a milestone in Zimbabwes digital transformation journey, some observers have criticized the timing and relevance of the project, given the countrys ongoing economic and technological challenges.\n\nBuilding a fancy hub is all well and good, but most young people in Zimbabwe still struggle with access to basic internet and electricity, said one ICT sector analyst who asked not to be named. This feels more like a PR exercise than a meaningful step toward real digital transformation.\n\nAnother critic added, Its hard to celebrate innovation when the country is drowning in economic instability. Hubs and graduations wont put food on peoples tables or fix the broken infrastructure that young innovators actually need.\n\nDespite the criticism, Minister Mavetera praised the hubs potential, saying it would accelerate Zimbabwes shift toward a knowledge-driven economy and foster skills development in the ICT sector.\n\nHowever, for many Zimbabweans, the excitement over the Innovation Hub is tempered by skepticism. Observers argue that while institutional growth is important, projects like this may appear disconnected from the everyday struggles faced by the nations youth, who are grappling with unemployment, limited resources, and a struggling digital ecosystem.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zimbabwe’s Minister of ICT, Hon. Tatenda Mavetera, on Tuesday officially commissioned the new Innovation Hub at TelOne, describing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/what-innovation-when-country-is-drowning-in-economic-instability-citizens-dismiss-maveteras-ict-project/\">Continue reading<span class=\"screen-reader-text\"> \"What Innovation When Country Is Drowning In Economic Instability? Citizens Dismiss Mavetera’s ICT Project\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "Mnangagwa Appears Competing with VP Chiwenga In Offloading Car Donation To Greatman",
            "url": "https://www.zimeye.net/2025/11/26/mnangagwa-appears-to-compete-with-vp-chiwenga-in-offloading-car-donation-to-greatman/",
            "content": "Is this a competition-war with Chiwengas wife or what? Emmerson Mnangagwa is dishing out Mahindra cars and wheelchairs to Greatman and other disabled people, as reported today by @djollah_7 | the development comes within days of Greatman receiving other donations from the Vice Presidents wife, Minnie Baloyi who has been denounced by some including Mnangagwa-campaigner, Sabhuku Temba Mliswa. | what could be happening here?\n\nIs this a competition-war with Chiwengas wife or what? Emmerson Mnangagwa is dishing out Mahindra cars and wheelchairs to Greatman and other disabled people, as reported today by@djollah_7|  the development comes within days of Greatman receiving other donations from the Vicepic.twitter.com/WnI9yMwlOH\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Is this a competition-war with Chiwenga’s wife or what? Emmerson Mnangagwa is dishing out Mahindra cars and wheelchairs to Greatman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/mnangagwa-appears-to-compete-with-vp-chiwenga-in-offloading-car-donation-to-greatman/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Appears Competing with VP Chiwenga In Offloading Car Donation To Greatman\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "Mnangagwa Donates Brand New Motor Vehicles To Greatman, Chipo Muchegwa",
            "url": "https://www.zimeye.net/2025/11/26/mnangagwa-donates-brand-new-motor-vehicles-to-greatman-chipo-muchegwa/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwa on Wednesday handed over brand new motor vehicles to artists Greatman, Chipo Muchegwa, Mitchell, and Tindo GP during a ceremony held at State House.\n\nThe meeting, which brought together artists with disabilities and young people with creative minds, was organised with the help of Youth Minister Tino Machakaire and DJ Ollah.\n\nAccording to those who attended the event, the gesture was presented as part of the governments push to promote inclusion. President Mnangagwa this morning gifted Greatman, Chipo Muchegwa, Mitchell and Tindo GP with vehicles at State House, reinforcing the national vision of leaving no one and no place behind, a statement shared during the event said. The message added that the donation aimed to celebrate inclusion and empowerment for people living with disabilities, ensuring every citizen has the opportunity to move forward.\n\nZanu PF online activist Cleopas Mukungunugwa also confirmed the development, writing on Facebook: Earlier today, President Emmerson Dambudzo Mnangagwa handed over vehicles and fifty wheelchairs to disability ambassadors at State House. Greatman Music.\n\nThe donation was widely shared across social media, drawing mixed reactions as the country continues to debate the role of government support for artists and persons with disabilities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa on Wednesday handed over brand new motor vehicles to artists Greatman, Chipo Muchegwa, Mitchell, and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/mnangagwa-donates-brand-new-motor-vehicles-to-greatman-chipo-muchegwa/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Donates Brand New Motor Vehicles To Greatman, Chipo Muchegwa\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "Paul Mwazha Burial Set For Manicaland",
            "url": "https://www.zimeye.net/2025/11/26/paul-mwazha-burial-set-for-manicaland/",
            "content": "By A CorrespondentThe family of the African Apostolic Church founder, Archbishop Paul Mwazha, has announced that the burial of the cleric will be atChirasautain Manicaland this Sunday.\n\nThis is a rejection of government attempts to inter Mwazha at the National Heroes Acre, a burial site ZANU PF routinely uses to project political power.\n\nMwazhas family announced that the revered clericdeclared a national hero by President Emmerson Mnangagwawould not be laid to rest at the national shrine.\n\nInstead, they insisted on a private burial in keeping with church and family traditions.\n\nWhile it is not unusual for families of declared national heroes to choose private burial sites, Mwazhas case stands out because ZANU PF had aggressively moved to control the funeral, consistent with the partys long-established practice of hijacking funerals of influential figures to extract political capital. Over the years, the ruling party has used high-profile burials to reinforce loyalty, sanitise its public image, or symbolically claim ownership of prominent national figures.\n\nFor Mwazha, the political exploitation had become increasingly visible. In recent months, he had been publicly courted by senior ZANU PF officials ahead of key political events.\n\nHe also received a luxury car and large cash gifts from businessman and convicted fraudster Wicknell Chivayo, widely regarded as one of the ruling partys chief funders and propagandists.\n\nThe gestures fuelled perceptions that the church leader was being instrumentalised to bolster ZANU PFs appeal among religious communities.\n\nFamily spokesperson Dr Masimba Mwazha confirmed the burial arrangements, signalling the familys resolve to reclaim control of the funeral.\n\nThe body of the national hero will leave Harare on Saturday for Chikomba District, where everyone will be gathered. The body will depart for Chirasauta on Sunday for burial at a private function, he said.\n\nArchbishop Mwazha died last Thursday and was promptly conferred national hero status by Mnangagwa, who praised his contribution to the growth of African independent churches and his spiritual influence on millions.\n\nZANU PF National Chairperson Oppah Muchinguri-Kashiri, accompanied by CIO Minister Lovemore Matuke, visited the Mwazha family home in Hatfield to convey the Presidents condolence message and the conferment of national hero status.\n\nArchbishop Mwazha played an important role during the liberation struggle and post-independence in promoting peace and Christianity, she said.\n\nBorn on 25 October 1918 at Holy Cross Mission in Chirumanzu, Mwazha rose to become one of the most influential leaders of African Independent Churches. His life story, punctuated by accounts of divine encounters, shaped a religious movement that touched millions.\n\nHis burial away from the Heroes Acre is a rare but powerful assertion of family and church autonomyone that quietly rebuffs the ruling partys attempt to turn his death into yet another political spectacle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The family of the African Apostolic Church founder, Archbishop Paul Mwazha, has announced that the burial of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/paul-mwazha-burial-set-for-manicaland/\">Continue reading<span class=\"screen-reader-text\"> \"Paul Mwazha Burial Set For Manicaland\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "Tagwirei Accused of Using Wealth to Dismantle ZANU PF Structures",
            "url": "https://www.zimeye.net/2025/11/26/tagwirei-accused-of-using-wealth-to-dismantle-zanu-pf-structures/",
            "content": "By Desmond Nleya and Shelton Muchena| Business tycoon Kudakwashe Tagwirei is facing renewed accusations of having used his financial influence to systematically weaken ZANU PFs internal structures, with opposition leaders warning that the ruling party is being transformed into a network of personal loyalists aligned to President Emmerson Mnangagwa.\n\nOpposition leader Charlton Hwende said on Tuesday that Tagwireis growing political role had contributed to the disintegration of ZANU PFs long-standing organisational framework.\n\nPosting on X, Hwende wrote: Chakanwirwa ichi chinhu! The destruction of structures was a well-calculated move. So sad.\n\nHis remarks referred to what he described as choreographed rallies linked to Tagwirei and the ever-expanding network of Mnangagwa-affiliated organisations.\n\nMeanwhile, Tagwireis growing public profile has also sparked legal and ethical questions. The businessman has recently been seen travelling in convoys of unregistered vehicles without number plates, behaviour critics say resembles that of a head of state.\n\nProminent lawyer and former opposition spokesperson Fadzayi Mahere took to X to challenge Transport Minister Felix Mhona over the matter.\n\n*Good morning Minister @MhonaFelix.\n\nIn addition, the rise of ED affiliates, many of which now operate with greater visibility and influence than official ZANU PF structures, had diluted the authority of the ruling partys organs.\n\nAnalysts have echoed this sentiment, saying the recent reshuffles, demotions, and sidelining of several senior officials and politburo members indicate that the party is being reshaped into a personalised political vehicle.\n\nThe question is how ED affiliates will continue to flourish after Mnangagwa relinquishes power, one analyst noted. The signs point to attempts at creating a political dynasty that outlives his presidency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Desmond Nleya and Shelton Muchena| Business tycoon Kudakwashe Tagwirei is facing renewed accusations of having used his financial influence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/tagwirei-accused-of-using-wealth-to-dismantle-zanu-pf-structures/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Accused of Using Wealth to Dismantle ZANU PF Structures\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "From Open for Business to a Nation Gripped by Corruption",
            "url": "https://www.zimeye.net/2025/11/26/from-open-for-business-to-a-nation-gripped-by-corruption/",
            "content": "By Shelton Muchena| In 2017 the second Republic was born with the mantra Zimbabwe is open for business.This message went along with the phrase  the voice of people is the voice of God..but to day as Zimbabwe marks its anniversary the voice of people is now falsely translated as vision 2030.\n\nBack in 2017, Mnangagwas ascent to power was framed as the dawn of a new era. The global world was informed that Zimbabwe was open for business, ready to attract foreign investment, and eager to leave behind the shadows of economic isolation, bad governance and political turmoil. However, as the years have passed, the bright promises have dimmed into a harsh reality.\n\nToday, the nation grapples with cancerous corruption epidemic that has tainted almost every layer of governance. While Mnangagwa once positioned himself as a champion against corruption, the past years proved an endless growing list of scandals, allegations, and systemic entanglement that has made it clear: the country is not truly open for business. Instead, it is increasingly open to a cycle of patronage, mismanagement, and unchecked separation of power.\n\nThe irony is not lost on many that the same man who once invoked the constitutionalism to topple Mugabe is now battling the very corruption he once denounced. It is a bitter twist of fate that the fight against graft has become a struggle for the very soul of the nation.\n\nMoreover, the relationship between Mnangagwa and his Vice President, Constantino Chiwenga, has also been thrown into the spotlight. Recent events, including the controversial airport video circulating on social, have highlighted the deepening rift and lack of coordination at the highest levels of government. This breakdown in communication and trust only underscores the instability that continues to plague Zimbabwe.\n\nAs the nation reflects on these years since the so-called new dawn, it is clear that the promises of 2017 have not been fully realised. Instead of an open, transparent, and thriving business environment, Zimbabwe faces entrenched corruption and political instability.\n\nThe battle against corruption is far from over, and the journey toward a truly open-for-business Zimbabwe remains fraught with challenges. Yet, the nations resilience and the hopes of its people continue to demand better, even as the battle for integrity and genuine reform rages on.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena| In 2017 the second Republic was born with the mantra “Zimbabwe is open for business”.This message went … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/from-open-for-business-to-a-nation-gripped-by-corruption/\">Continue reading<span class=\"screen-reader-text\"> \"From Open for Business to a Nation Gripped by Corruption\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "Willdale Threatens 7 000 Mt Hampden Residents With Overnight Eviction",
            "url": "https://www.zimeye.net/2025/11/26/willdale-threatens-7-000-mt-hampden-residents-with-overnight-eviction/",
            "content": "At least 7,000 families many of them long-standing ZANU-PF supporters have been ordered to leave Old Willdale Compound in Mount Hampden with residents accusing Willdale Bricks of using threats, political pressure and police intimidation to force them out.\n\nIn a video circulating on social media, Willdale Bricks Chief Executive Officer Nyasha Matonda is heard telling the families that they must vacate the compound by Wednesday morning.\n\nHe warns that those who fail to comply will face police action.\n\nKindly take note, as youre aware that we have an eviction order which says you should vacate this area. We are giving you until tomorrow morning or else the police will unleash violence on you, Matonda said.\n\nHe went on to tell the residents that they should vote for a proper government accusing their MP, Kudakwashe Mananzva of misleading them by encouraging them to remain on the property.\n\nFrom tomorrow, you are going to learn where to put your vote. You should vote for proper leadership, Matonda added.\n\nResidents insist they have nowhere else to go and are relying on government assurances that no one will be left homeless.\n\nWilldale Bricks recently secured a High Court order allowing it to reclaim the land, which the company once used for clay extraction but now describes as overrun by illegal brickmakers.\n\nThe firm hopes to sell the Mt Hampden land valued at US$3 million to revive its struggling operations and is considering developing the 123.6-hectare property into housing stands and an industrial park.\n\nZvimba East MP Kudakwashe Mananzva said he had engaged government ministries in an effort to halt or delay the mass eviction.\n\nAs your MP, I have approached the relevant ministry and they are seized with the matter, he said. This caring ZANU-PF-led government is committed to ensuring every affected family is resettled in safe and dignified conditions.\n\nHe urged residents not to panic, saying provincial authorities had already visited the area and that government was working to secure alternative accommodation in line with Vision 2030s pledge to leave no one and no place behind.\n\nWitnesses say the attempted eviction involved Matonda, Willdales security officer Mr Mawarire and a convoy of police officers led by Harare Province Deputy Commissioner Masimba, Assistant Disposal Officer Masawi of Harare Suburban, Chief Inspector Chirambiwa of ZRP Marlborough and members of the Police Support Unit.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "At least 7,000 families many of them long-standing ZANU-PF supporters have been ordered to leave Old Willdale Compound in Mount … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/willdale-threatens-7-000-mt-hampden-residents-with-overnight-eviction/\">Continue reading<span class=\"screen-reader-text\"> \"Willdale Threatens 7 000 Mt Hampden Residents With Overnight Eviction\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "Which tree was voted Tree 🌴 Of The Year?",
            "url": "https://www.zimeye.net/2025/11/26/which-tree-was-voted-tree-%f0%9f%8c%b4-of-the-year/",
            "content": "loading\n\nWhich tree was voted Tree  Of The Year?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "loading",
            "time": "21:07",
            "date": "26 Nov 2025"
        },
        {
            "title": "JUST IN: Mwazha Snubs National Heroes Acre",
            "url": "https://www.zimeye.net/2025/11/26/just-in-mwazha-snubs-national-heroes-acre/",
            "content": "By A CorrespondentAfrican Apostolic Church founder Archbishop Paul Mwazha has been buried atChirasautain Manicaland after his family rejected government attempts to inter him at the National Heroes Acre, a burial site ZANU PF routinely uses to project political power.\n\nMwazhas family announced that the revered clericdeclared a national hero by President Emmerson Mnangagwawould not be laid to rest at the national shrine.\n\nInstead, they insisted on a private burial in keeping with church and family traditions.\n\nWhile it is not unusual for families of declared national heroes to choose private burial sites, Mwazhas case stands out because ZANU PF had aggressively moved to control the funeral, consistent with the partys long-established practice of hijacking funerals of influential figures to extract political capital. Over the years, the ruling party has used high-profile burials to reinforce loyalty, sanitise its public image, or symbolically claim ownership of prominent national figures.\n\nFor Mwazha, the political exploitation had become increasingly visible. In recent months, he had been publicly courted by senior ZANU PF officials ahead of key political events.\n\nHe also received a luxury car and large cash gifts from businessman and convicted fraudster Wicknell Chivayo, widely regarded as one of the ruling partys chief funders and propagandists.\n\nThe gestures fuelled perceptions that the church leader was being instrumentalised to bolster ZANU PFs appeal among religious communities.\n\nFamily spokesperson Dr Masimba Mwazha confirmed the burial arrangements, signalling the familys resolve to reclaim control of the funeral.\n\nThe body of the national hero will leave Harare on Saturday for Chikomba District, where everyone will be gathered. The body will depart for Chirasauta on Sunday for burial at a private function, he said.\n\nArchbishop Mwazha died last Thursday and was promptly conferred national hero status by Mnangagwa, who praised his contribution to the growth of African independent churches and his spiritual influence on millions.\n\nZANU PF National Chairperson Oppah Muchinguri-Kashiri, accompanied by CIO Minister Lovemore Matuke, visited the Mwazha family home in Hatfield to convey the Presidents condolence message and the conferment of national hero status.\n\nArchbishop Mwazha played an important role during the liberation struggle and post-independence in promoting peace and Christianity, she said.\n\nBorn on 25 October 1918 at Holy Cross Mission in Chirumanzu, Mwazha rose to become one of the most influential leaders of African Independent Churches. His life story, punctuated by accounts of divine encounters, shaped a religious movement that touched millions.\n\nHis burial away from the Heroes Acre is a rare but powerful assertion of family and church autonomyone that quietly rebuffs the ruling partys attempt to turn his death into yet another political spectacle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — African Apostolic Church founder Archbishop Paul Mwazha will be buried at Chirasauta in Manicaland, this Sunday, after his family rejected … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/26/just-in-mwazha-snubs-national-heroes-acre/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Mwazha Snubs National Heroes Acre\"</span></a></p>",
            "time": "21:07",
            "date": "26 Nov 2025"
        }
    ]
}