{
    "news": [
        {
            "title": "Top Video Journalist Dies",
            "url": "https://www.zimeye.net/2025/09/20/top-video-journalist-dies/",
            "content": "By A Correspondent Freelance journalist and acclaimed videographer James Jemwa has died.\n\nHe was struck by a car in central Harare on Saturday night.\n\nMISA Harare Advocacy Committee chair, Mlondolozi Ndlovu, confirmed the tragedy, saying Jemwa was hit near the NSSA building along Second Street.\n\nI received a call from the police this morning saying that his body is at Parirenyatwa Hospital, Ndlovu toldZimEye.\n\nNdlovu recalled spending the previous evening with Jemwa and several other journalists in the city. What is painful is that we were together, sharing laughs until around 7 PM. He was in a jovial mood. Little did we know that was the last time we would see him alive.\n\nJemwa was widely respected for his skill behind the camera and his dedication to the craft.\n\nHe worked as a freelancer and fixer for international broadcasters, including Al Jazeera, earning a reputation as one of Zimbabwes finest visual storytellers.\n\nUnder the late President Robert Mugabe regime, Jemwa was repeatedly targeted for his work.\n\nOn 27 June 2016, he was arrested while filming citizens queuing outside banks in central Harare.\n\nBarely two months later, he was detained again, this time spending a week in Chikurubi Maximum Prison.\n\nHe was eventually granted bail alongside more than 60 protestors arrested during demonstrations in the capital.\n\nReports at the time suggested that soldiers were among those who assaulted and detained him, a reflection of the dangers he faced simply for documenting events.\n\nJust a day before his Chikurubi ordeal, Jemwa had been arrested with fellow journalists Garikai Chaunza, Christopher Mahove, Khumbulani Zamuchiya and Edward Gweshe while covering protests against thenVice President Phelekezela Mphokos continued stay at the Rainbow Towers Hotel.\n\nThey were later released without charge after intervention by the Media Lawyers Network.\n\nTo colleagues, Jemwa was more than a journalist.\n\nHe was a friend, a professional whose lens captured the struggles and resilience of Zimbabweans in moments of great hardship.\n\nHis passing leaves a void in the media fraternity, one made heavier by the knowledge that he gave so much  and risked even more, in service of truth.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Freelance journalist and acclaimed videographer James Jemwa has died. He was struck by a car in central … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/20/top-video-journalist-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Video Journalist Dies\"</span></a></p>",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "Dr Mavaza says: Nguwaya Can Never Be Part Of Zviganandas",
            "url": "https://www.zimeye.net/2025/09/20/dr-mavaza-says-nguwaya-can-never-be-part-of-zviganandas/",
            "content": "Looking at National Projects and National Looting\n\nBy Dr Masimba Mavaza | In a stormy and dramatic week in Zimbabwe, a plea for the arrest of fraudsters and national looters made headlines. This followed a year of brazen corruption carried out without accountability or even a shred of shame. Those implicated in corruption openly and boastfully admitted to being the architects of Zimbabwes decline. The nation watched as the country slid into chaos, with a few individuals flaunting money in a provocative manner. Zimbabweans were insulted when the so-called ZVIGANANDAS sneered: So what will you do about it?\n\nA corrupt class of untouchables has emerged, leaving the country feeling vulnerable. This culture of untouchability became deeply entrenched in Zimbabwes socio-political fabric, especially associated with Chivayo and Tagwirei, thriving on tenders and gold. These wealthy elites shield themselves while ostracizing and suppressing those who dare to speak the truth.\n\nOrdinary struggling citizens are mocked as fools for failing to secure tenders, while idle individuals are rewarded with cars and cash. Never in history has money been so abusedhanded out to reward idleness and arrogance.\n\nThe corrupt system of dirty donations has been falsely branded as support for ZANU PF. As party leaders failed to act, the perpetrators began shamelessly name-dropping the party to justify their deeds. On the surface, these appeared as donations, but in reality, they were cover for looting on an unprecedented scale.\n\nCaste Systems of Corruption\n\nIn this new Zimbabwean order, a caste system of corruption has emerged. Certain elitesthe Zviganandasare untouchable, facing no accountability despite their excesses. Meanwhile, laws meant to fight corruption are either ignored or selectively enforced.\n\nThe result has been swelling egos and unchecked arrogance. The Zviganandas extend their influence beyond looting into politics, reshaping stigma and shame into symbols of power.\n\nYet many Zimbabweans have resisted. Communities, though lacking support from those in power, continue to show resilience and push for social change. Still, dismantling corruption disguised as philanthropy is a complex challenge requiring multifaceted approaches.\n\nHuman dignity and equalitycore to human rightsare eroded as those who should speak up are silenced with donations and political pressure.\n\nNational Projects vs Personal Looting\n\nThe Zviganandas have no real industry or development to show. Their activities are self-enrichment schemes masquerading as investments. In contrast, national projects differ greatly in purpose, scope, and impact. They are large-scale initiatives serving public needs, often funded by government or international institutions, and designed to improve infrastructure, healthcare, and education.\n\nThis brings us to the Geo Pomona initiative. Unlike the Zviganandas ventures, Geo Pomona is self-sustaining, not funded by government, and directly contributes to national development.\n\nNational projectslike Geo Pomonaimpact broad segments of the population. They create tangible benefits from the ground up. Examples include roads, power plants, and public health initiatives. Personal projects, like those of Chivayo and Tagwirei, are narrow and self-serving, designed to showcase wealth rather than address public needs. Worse, they are often funded by public money but serve private gain.\n\nNguwayas Geo Pomona is a true national project, aligned with national goals, and cannot be compared to the selfish ventures of the Zviganandas.\n\nGeo Pomonas Achievements\n\nGeo Pomona has transformed Zimbabwes waste management landscape. In 2022, it took over Harares notorious Pomona dumpsite and turned it into a modern facility with new roads, electrical systems, advanced security, and even a FIFA-certified soccer pitch.\n\nThe company plans to expand waste management services across Zimbabwes nine provinces, backed by cabinet authority granted in 2022. It is also working on a waste-to-energy plant expected to generate 1622 megawatts of electricity.\n\nGeo Pomonas work has received international recognition. Dilesh Nguwaya has been honored with doctorates from the International Institute of Philanthropy and the City University of Paris, and recognized by the Leaders Without Borders Development Centre in the UK. These honors highlight the difference between genuine investment and the looting synonymous with Chigandarism.\n\nGeo Pomona emphasizes sustainable public-private partnerships, cutting-edge waste management technology, job creation, and climate resilience.\n\nFraudsters vs Investors\n\nIt is dangerous to paint Nguwaya with the same brush as the Zviganandas. Fraudsters and investors are worlds apart.\n\nFraudsters: thrive on deception, illicit profits, lack of transparency, and national harm. They enrich themselves through lies and scams.\n\nInvestors: engage in legitimate, transparent financial ventures with risks and accountability. They aim for sustainable returns while contributing to development.\n\nZviganandarism is the definition of investment fraudquick, unsustainable, and deceitful. Proper investment, like Geo Pomona, is regulated, transparent, and nationally beneficial.\n\nConclusion\n\nLabelling Dilesh Nguwaya as a Zvigananda is both unfair and factually wrong. Geo Pomona is a national project with visible achievements, aligned with Zimbabwes development goals. Zviganandas, on the other hand, are looters cloaked in fake philanthropy.\n\nNguwaya can never be part of them.\n\nWould you like me to also tighten it further for newspaper/editorial style (shorter sentences, punchier delivery), or keep it in this expanded opinion-piece tone?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Looking at National Projects and National Looting By Dr Masimba Mavaza | In a stormy and dramatic week in Zimbabwe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/20/dr-mavaza-says-nguwaya-can-never-be-part-of-zviganandas/\">Continue reading<span class=\"screen-reader-text\"> \"Dr Mavaza says: Nguwaya Can Never Be Part Of Zviganandas\"</span></a></p>",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "Tagwirei in US$3.2 Billion Corruption Scam",
            "url": "https://www.zimeye.net/2025/09/20/tagwirei-in-us3-2-billion-corruption-scam/",
            "content": "By A Correspondent Vice President Constantino Chiwenga has accused petroleum mogul Kudakwashe Tagwirei of masterminding a US$3.2 billion corruption scam that has not only drained Zanu PF coffers but also entrenched a shadowy network of loyalty within the party.\n\nThe allegations, laid bare in a dossier Chiwenga presented at a fiery politburo meeting on Wednesday, centred on a secret 45 percent Zanu PF stake in Sakunda Holdings, reportedly held in trust by President Emmerson Mnangagwa, Kembo Mohadi and Patrick Chinamasa. According to Chiwenga, the stake yielded nothing for the party, with Tagwirei instead diverting billions to build patronage structures through flamboyant figures Wicknell Chivayo, Delish Nguwaya and Scott Sakupwanya.\n\nHe said the party had never received a cent, one insider revealed. Instead, the billions were used to capture Zanu PF structures, with the complicity of the trustees.\n\nChiwenga demanded Tagwirei and his allies  collectively dubbed theZvigananda be arrested, alleging Mnangagwa himself was the ultimate beneficiary. He cited Chivayos recent donation of US$1 million and ten luxury vehicles to provincial leaders as evidence of illicit influence.\n\nPresidential spokesman George Charamba attempted to downplay the claims, saying the vehicles belonged to the party, inadvertently strengthening Chiwengas argument that the so-called gifts were part of an orchestrated capture.\n\nThe meeting quickly descended into personal attacks when State Security Minister Lovemore Matuke accused Chiwenga of plotting to unseat Mnangagwa. Chiwenga shot back, reminding him of his role in 2017: If I removed Mugabe and invited Mnangagwa back, what makes Matuke think I now want to remove him undemocratically?\n\nMnangagwa, visibly unsettled, appointed a committee led by Obert Mpofu, Oppah Muchinguri and Chinamasa to investigate the matter, and insiders said he even considered cancelling his UN General Assembly trip to contain the fallout.\n\nBy Thursday, the cracks widened. Mnangagwa skipped his usual pre-briefing with Chiwenga and Mohadi before addressing the central committee, where he appeared to dampen loyalists push for a 2030 agenda to extend his rule:\n\nIt is of critical importance that we introspect as a party with the bigger objective that our party wins the 2028 harmonised general elections.\n\nThe showdown exposes Zanu PFs deepest fault line: Mnangagwas dependence on wealthy oligarchs to bankroll the party versus Chiwengas opposition to extending his presidency beyond 2028. Some of Mnangagwas allies, fearing prosecution under a Chiwenga presidency, are even floating Tagwirei as a possible successor.\n\nIssuing a veiled warning to his financiers, Mnangagwa told the central committee: Those splashing money without traceable sources should be arrested. The comment came barely 24 hours after Chiwengas dossier had named theZviganandaas corrupt financiers who have captured both state and party institutions.\n\nAs Zanu PF heads into its October conference, the revelations set the stage for a bruising power struggle  pitting a military-backed vice president against a president increasingly insulated by oligarchs and his own family.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Vice President Constantino Chiwenga has accused petroleum mogul Kudakwashe Tagwirei of masterminding a US$3.2 billion corruption scam … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/20/tagwirei-in-us3-2-billion-corruption-scam/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei in US$3.2 Billion Corruption Scam\"</span></a></p>",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "Discord in ZANU PF as Mnangagwa Declares Elections to Go Ahead in 2028",
            "url": "https://www.zimeye.net/2025/09/20/discord-in-zanu-pf-as-mnangagwa-declares-elections-to-go-ahead-in-2028/",
            "content": "By A Correspondent\n\nHarare  Deep divisions have emerged within ZANU PF after President Emmerson Mnangagwa insisted that Zimbabwes harmonised elections will proceed in 2028, despite growing calls from party hardliners to postpone the polls.\n\nAddressing the 127th Ordinary Session of the Central Committee at the ZANU PF Headquarters on Thursday, Mnangagwa urged party structures to begin preparing for the elections. His remarks, however, exposed a widening rift within the party, as some influential figures are believed to be lobbying for a delay to extend Mnangagwas grip on power.\n\nIt is important that we introspect as a party of the bigger picture that we must win the 2028 harmonised elections. The Central Committee must have robust and frank discussions to foster solutions in unity to realise our common vision, Mnangagwa said.\n\nWhile he tried to present a united front, insiders suggest that the presidents words were a thinly veiled attempt to silence dissenting voices within the party. Hardliners argue that the economic crisis, global shocks and internal instability make holding elections in 2028 risky for ZANU PFs survival.\n\nMnangagwa pointed to infrastructure development, youth and women empowerment, and rural modernisation as evidence that his Vision 2030 remains on course. But critics within the party dismiss these claims as empty rhetoric, saying the majority of Zimbabweans are yet to see any tangible benefits.\n\nOur national vision 2030 is now on course, Mnangagwa declared, a statement many in the partys ranks reportedly received with scepticism.\n\nThe presidents insistence on pressing ahead with the 2028 elections highlights a growing discord within ZANU PF, with factions pulling in different directions as the succession debate continues to haunt the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – Deep divisions have emerged within ZANU PF after President Emmerson Mnangagwa insisted that Zimbabwe’s harmonised … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/20/discord-in-zanu-pf-as-mnangagwa-declares-elections-to-go-ahead-in-2028/\">Continue reading<span class=\"screen-reader-text\"> \"Discord in ZANU PF as Mnangagwa Declares Elections to Go Ahead in 2028\"</span></a></p>",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "School Head Jailed For Having S*x With Minor…",
            "url": "https://www.zimeye.net/2025/09/20/school-head-jailed-for-having-sx-with-minor/",
            "content": "By A Correspondent\n\nA 57-year-old headmaster from Magunje, Hurungwe, was recently sentenced to three years in jail by the Karoi Magistrates Court for having sexual intercourse with a 14-year-old minor who is a Form 2 student.\n\nThe circumstances of the case are that, sometime in May 2024, the school head approached the minor and asked for her phone number, which she gave him.\n\nThe offender then called the victim that same evening, complimented her beauty, and promised her heaven on earth if she agreed to be his wife.\n\nThe following day, the offender called the victim to his office and forced her to go with him to his stand where he parked his vehicle, removed her clothes, and had protected sexual intercourse with her at the back of his car.\n\nSince that day, the two had multiple sexual encounters, especially during weekends, until April 2025, when the victims sister discovered a new cellphone and a bunch of pills and informed the pairs mother.\n\nThe victim was taken to the police, where she revealed the multiple sexual encounters with the offender.\n\nThe school head was sentenced to an effective 3 years in prison.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 57-year-old headmaster from Magunje, Hurungwe, was recently sentenced to three years in jail by the Karoi … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/20/school-head-jailed-for-having-sx-with-minor/\">Continue reading<span class=\"screen-reader-text\"> \"School Head Jailed For Having S*x With Minor…\"</span></a></p>",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "Chivayo Blows US5 Mill Buying Smaller Chopper Than The One Own Body Couldn’t Enter",
            "url": "https://www.zimeye.net/2025/09/20/chivayo-blows-us5-mill-buying-smaller-chopper-than-the-one-own-body-couldnt-enter/",
            "content": "After failing to enter through EDs chopper, Mr Wicknell Chivayo has just announced hes purchasing my own helicopter, which (pictured) is smaller. Do you think Chivayo is wise by blowing public money purchasing the H120 Colibri worth USD5mill; and not joining Pastor Gs gym?\n\nPICTURES LOADING HELOW\n\nAfter failing to enter through EDs chopper,  Mr Wicknell Chivayo has just announced hes purchasing my own helicopter, which (pictured) is smaller. Do you think Chivayo is wise by blowing public money purchasing the H120 Colibri helicopter, worth USD5 million; and not joiningpic.twitter.com/dDvTUMINqS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "PICTURES LOADING HELOW",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "🇬🇧 BREAKING NEWS: British Royal Visits UK Farm of Zimbabwean Journalist-Turned-Farmer",
            "url": "https://www.zimeye.net/2025/09/19/%f0%9f%87%ac%f0%9f%87%a7-breaking-news-british-royal-visits-uk-farm-of-zimbabwean-journalist-turned-farmer/",
            "content": "By A Correspondent | ZimEye | UNITED KINGDOM  19 September 2025  A British royal has paid a surprise visit to a thriving UK farm owned by a Zimbabwean journalist-turned-farmer, marking one of the most high-profile endorsements yet of diaspora-driven agriculture.\n\nThe visit took place yesterday at the maize and mixed-produce farm, which the former journalist David Mwanaka established after leaving the media industry. The property now produces maize, sweetcorn and a variety of vegetables for UK markets.\n\nThe royal party toured the fields, grain silos and greenhouses and viewed the farms irrigation systems and crop-rotation areas. Photographs show the royal walking among rows of maize and inspecting storage facilities alongside farm staff..\n\nThe farm, located in Cambridge, has become a model of sustainable, large-scale food production and diaspora success. Its owner  once a hard-hitting scribe covering politics and corruption scandals back home in Harare  has transformed his career into one of the most inspiring agricultural stories in the Zimbabwean diaspora.\n\nDuring the tour, the royal guest was shown the farms cutting-edge irrigation systems, grain storage silos and organic rotation plots. The visit included a walk through vast maize fields, an inspection of greenhouses producing high-value horticulture, and a closed-door briefing with local council officials on how diaspora farmers can boost Britains food security.\n\nIts an extraordinary example of skills transfer, said a royal spokesperson. The farm shows how a new life in the UK can lead to innovation, investment and community benefit.\n\nLocal officials said the farm now supplies maize meal, sweetcorn, and a variety of horticultural products to several supermarket chains and community food banks. It also employs more than 40 seasonal and permanent staff, many of them from migrant backgrounds.\n\nObservers note the symbolism of the visit: a British royal recognising not just a success story, but also the potential of Africa-to-UK skills migration at a time of heated debate over immigration and food self-sufficiency.\n\nThe visit ended with a tree-planting ceremony and the unveiling of a plaque commemorating the spirit of transnational entrepreneurship.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | UNITED KINGDOM – 19 September 2025 — A British royal has paid a surprise … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/%f0%9f%87%ac%f0%9f%87%a7-breaking-news-british-royal-visits-uk-farm-of-zimbabwean-journalist-turned-farmer/\">Continue reading<span class=\"screen-reader-text\"> \"🇬🇧 BREAKING NEWS: British Royal Visits UK Farm of Zimbabwean Journalist-Turned-Farmer\"</span></a></p>",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "LIVE “Mnangagwa Threatens To Resign”",
            "url": "https://www.zimeye.net/2025/09/19/live-mnangagwa-threatens-to-resign/",
            "content": "video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "Baba Jukwa Confirms ‘ED Is Assassinating Chiwenga Anytime” Allegation | FULL Print",
            "url": "https://www.zimeye.net/2025/09/19/baba-jukwa-confirms-ed-is-assassinating-chiwenga-anytime-allegation-full-print/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:00",
            "date": "21 Sep 2025"
        },
        {
            "title": "Chiwenga Drops Tagwirei Corruption Bomb",
            "url": "https://www.zimeye.net/2025/09/19/chiwenga-drops-tagwirei-corruption-bomb/",
            "content": "By A Correspondent Zimbabwes ruling party is in turmoil after Vice President Constantino Chiwenga tabled an explosive dossier accusing President Emmerson Mnangagwas allies of looting billions and capturing Zanu PF.\n\nThe confrontation unfolded at a stormy politburo meeting on Wednesday, where Chiwenga accused petroleum tycoon Kudakwashe Tagwirei of siphoning US$3.2 billion from a secret Zanu PF stake in Sakunda Holdings. The 45 percent shareholding, allegedly held in trust by Mnangagwa, Kembo Mohadi, and Patrick Chinamasa, had yielded nothing for the party. Instead, Chiwenga claimed, Tagwirei used the funds to entrench loyalty networks, working through flamboyant benefactors Wicknell Chivayo, Delish Nguwaya and Scott Sakupwanya.\n\nHe said the party had never received a cent, one insider revealed. Instead, the billions were used to capture Zanu PF structures, with the complicity of the trustees.\n\nChiwenga demanded the immediate arrest of Tagwirei and his associates  collectively branded theZvigananda. He further charged that Mnangagwa himself was the ultimate beneficiary of the scheme. The dossier cited Chivayos recent donation of US$1 million and ten luxury vehicles to provincial leaders as proof of illicit influence.\n\nIn a telling contradiction, presidential spokesman George Charamba insisted the vehicles were party property, undermining Chivayos boast that they were personal gifts and bolstering Chiwengas claims.\n\nThe clash turned personal when State Security Minister Lovemore Matuke accused Chiwenga of plotting to seize power. Chiwenga snapped back, reminding him of his role in Mnangagwas 2017 return from exile: If I removed Mugabe and invited Mnangagwa back, what makes Matuke think I now want to remove him undemocratically?\n\nMnangagwa, visibly shaken, set up a committee led by Obert Mpofu, Oppah Muchinguri and Chinamasa to probe the claims. Yet insiders said the president even considered cancelling his UN General Assembly trip to contain the fallout.\n\nBy Thursday, tensions were spilling over. Breaking tradition, Mnangagwa skipped the customary pre-briefing with Chiwenga and Mohadi before a central committee meeting. In his speech, he appeared to temper loyalists calls for a 2030 agenda to extend his rule:\n\nIt is of critical importance that we introspect as a party with the bigger objective that our party wins the 2028 harmonised general elections.\n\nThe split underscores Zanu PFs deepest fault line: Mnangagwas reliance on wealthy allies to bankroll the party versus Chiwengas resistance to extending his presidency beyond 2028. Many of Mnangagwas loyalists, fearing arrest under a Chiwenga presidency, are pushing for him to stay, with Tagwirei even touted by some as a successor.\n\nAddressing the central committee, Mnangagwa issued a thinly veiled warning to his benefactors: Those splashing money without traceable sources should be arrested. The remark came barely 24 hours after Chiwengas dossier named the Zvigananda as corrupt financiers who have captured both state and party institutions.\n\nAs Zanu PF heads into its October conference, the confrontation has set the stage for a bruising power struggle at the very top  pitting the military-backed vice president against a president increasingly shielded by oligarchs and his own family.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe’s ruling party is in turmoil after Vice President Constantino Chiwenga tabled an explosive dossier accusing President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/chiwenga-drops-tagwirei-corruption-bomb/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Drops Tagwirei Corruption Bomb\"</span></a></p>",
            "time": "06:00",
            "date": "21 Sep 2025"
        }
    ]
}