{
    "news": [
        {
            "title": "JUST IN: Gata Declared National Hero",
            "url": "https://www.zimeye.net/2025/07/05/just-in-gata-declared-national-hero/",
            "content": "By A Correspondent-ZESA Holdings executive chairperson, Sydney Gata has been declared a national hero and is set to be buried at the National Heroes Acre on Wednesday.\n\nGata passed away in Harare on Thursday after a short illness.He was 79.Permanent Secretary in the Ministry of Home Affairs and Cultural Heritage Ambassador Raphael Faranisi confirmed the latest development to The Herald Online.\n\nGata, from Mutema communal lands under Chief Mutema, was not only a towering technocrat but also a close ally of President Emmerson Mnangagwa. Married to Mnangagwas second wife, Gata operated at the heart of Zimbabwes patronage networks, often leveraging his proximity to power to secure personal and family interests.Despite holding prestigious postsZESA CEO in the 1980s and 1990s, Executive Chairman from 2019, and international advisory roleshis career was tainted by accusations of looting public resources, nepotism, and abuse of office. Under his watch, Zimbabwes energy crisis worsened, with rolling blackouts and ballooning debt becoming the norm, while he lived in luxury and retained power.In his home constituency of Mutema-Musikavanhu, locals accuse Gata of imposing his wife, Angeline Gata, as MP and using his influence to dominate local politics. Her candidacy divided ZANU-PF structures, and critics say the couple used fear and state resources to suppress dissent.During the June 14 by-election in Ward 5, over 1,200 voters were assisted under suspicious claims of illiteracymany reportedly being teachers and civil servants. This, locals say, was political coercion disguised as support.Gata was also accused of displacing villagers for personal land expansion, further alienating communities. Many in Chipinge feared confronting him, citing his deep ties to Mnangagwa and the resulting political protection.Despite a few voices praising his developmental contributions, including the proposed Gazaland University, the broader view in Chipinge is that Gata embodied the worst excesses of Zimbabwes post-independence eliteabuse of power, political gatekeeping, and economic exclusion.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-ZESA Holdings executive chairperson, Sydney Gata has been declared a national hero and is set to be buried … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/just-in-gata-declared-national-hero/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Gata Declared National Hero\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Mnangagwa Declares Own Relative Sydney Gata A National Hero",
            "url": "https://www.zimeye.net/2025/07/05/mnangagwa-declares-own-relative-sydney-gata-a-national-hero/",
            "content": "Tinashe Sambiri\n\nZanu PF leader President Emmerson Mnangagwa has controversially declared the late ZESA Holdings Executive Chairperson, Dr. Sydney Gata, a national hero.\n\nDr. Gata, who passed away in Harare on Thursday after a short illness at the age of 79, will be laid to rest at the National Heroes Acre on Wednesday.\n\nThe announcement was confirmed by Permanent Secretary in the Ministry of Home Affairs and Cultural Heritage, Ambassador Raphael Faranisi.\n\nMnangagwa, who is related to the late technocrat, paid glowing tribute during a statement on Saturday, saying,Dr. Gata was a visionary leader in the energy sector. His dedication to public service and development of critical infrastructure deserves national recognition. We have lost a committed patriot.\n\nCritics, however, have raised eyebrows over the declaration, pointing to Gatas familial ties to the president and a controversial tenure at the helm of ZESA, marred by allegations of nepotism and mismanagement. One Harare resident said on condition of anonymity,We dont dispute that Gata served, but many people are asking if this is a reward based on merit or bloodlines.\n\nAnother ZESA employee, speaking anonymously, added:He had his achievements, yes, but there were serious issues at ZESA. Declaring him a hero will not sit well with everyone.\n\nDespite the controversy, preparations are already underway for the burial at the National Heroes Acre. State media has since begun running tributes praising Gatas contribution to the energy sector, particularly during the early years of Zimbabwes independence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Zanu PF leader President Emmerson Mnangagwa has controversially declared the late ZESA Holdings Executive Chairperson, Dr. Sydney Gata, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/mnangagwa-declares-own-relative-sydney-gata-a-national-hero/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Declares Own Relative Sydney Gata A National Hero\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Fluminense Edge Al Hilal 2-1, Advance to FIFA Club World Cup Semifinals",
            "url": "https://www.zimeye.net/2025/07/05/fluminense-edge-al-hilal-2-1-advance-to-fifa-club-world-cup-semifinals/",
            "content": "Sports Correspondent\n\nIn a thrilling quarterfinal match at the FIFA Club World Cup 2025, Fluminense secured a hard-fought 2-1 victory over Al Hilal at the Camping World Stadium in Orlando, Florida.\n\nThis win marks a significant milestone for the Brazilian side, as they become the first team to advance to the semifinals of the tournament.\n\nThe match began with a moment of brilliance from Matheus Martinelli, who scored a precise strike in the 40th minute to give Fluminense a well-deserved 1-0 halftime lead.\n\nAl Hilal responded quickly in the second half, with Marcos Leonardo capitalizing on a defensive lapse to level the score in the 51st minute.\n\nHowever, the decisive moment came in the 70th minute when substitute Hrcules delivered a composed finish to restore Fluminenses lead. The Brazilian side held firm in the closing stages, repelling Al Hilals attempts to equalize and securing a vital 2-1 win.\n\nWith this victory, Fluminense now awaits the winner of the Chelsea vs Palmeiras clash in the semifinals, which promises to be a thrilling showdown. The Brazilian sides resilience and tactical prowess have earned them a spot in the next round, and they will look to continue their fairy-tale run in the tournament .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a thrilling quarterfinal match at the FIFA Club World Cup 2025, Fluminense secured a hard-fought 2-1 victory … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/fluminense-edge-al-hilal-2-1-advance-to-fifa-club-world-cup-semifinals/\">Continue reading<span class=\"screen-reader-text\"> \"Fluminense Edge Al Hilal 2-1, Advance to FIFA Club World Cup Semifinals\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Tagwirei Unstoppable, Claims Killer Zivhu",
            "url": "https://www.zimeye.net/2025/07/05/tagwirei-unstoppable-claims-killer-zivhu/",
            "content": "By A Correspondent\n\nControversial Zanu PF politician Killer Zivhu has declared that business mogul Kudakwashe Tagwirei is an unstoppable force in Zimbabwean politics, despite internal resistance within the ruling party.\n\nTagwireis bid to join the Zanu PF Central Committee was reportedly blocked by Vice President Constantino Chiwenga, amid concerns over the businessmans growing influence.\n\nSources within the party suggest that Tagwireis political rise has created visible tensions at the top.\n\nBut Zivhu, never one to shy away from controversy, came out swinging in defence of Tagwirei on Thursday.\n\nThis guy is UNSTOPPABLE! Many rely on his mercy, and hes a proven goal-getter, Zivhu wrote. No one, not even Chivayo, can stop his mission. He can mobilize 3/4 of the country in 72 hours. We can criticize him all night, but at dawn, well still face reality.\n\nZivhus comments have reignited debate over Tagwireis role in both politics and the economy, with critics warning that his unchecked influence signals the deep entanglement of business and political power in Zimbabwe.\n\nDespite growing factional tensions, Zivhus statement signals that Tagwirei still commands significant loyalty within the partys ranks.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF politician Killer Zivhu has declared that business mogul Kudakwashe Tagwirei is an unstoppable force … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/tagwirei-unstoppable-claims-killer-zivhu/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Unstoppable, Claims Killer Zivhu\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "I Am Better Than Geza, Claims Tshabangu",
            "url": "https://www.zimeye.net/2025/07/05/i-am-better-than-geza-claims-tshabangu/",
            "content": "By A Correspondent\n\nControversial Citizens Coalition for Change (CCC) self-imposed Secretary General Sengezo Tshabangu has stirred outrage after launching a brazen attack on war veteran and outspoken government critic Blessed Geza, claiming he is more effective in challenging the Emmerson Mnangagwa regime.\n\nTshabangu, widely viewed as a Zanu PF proxy used to destabilize the opposition, made the comments in a statement on Thursday that many critics have slammed as both disrespectful and delusional.\n\nThis old man [Geza] is useless. As opposition in Zimbabwe, we will make sure that we remove Zanu and its useless people from power, Tshabangu said.\n\nThe statement has drawn a swift backlash, especially given that Geza  unlike Tshabangu  has consistently challenged the Mnangagwa administration without being linked to any suspicious political maneuvering. Notably, Geza is credited with frustrating the controversial Mnangagwa 2030 presidential ambition campaign, a feat Tshabangu has never come close to achieving.\n\nPolitical analysts and CCC supporters have dismissed Tshabangus remarks as the desperate rhetoric of a man propped up by Zanu PF to weaken the opposition from within.\n\nAnyone who believes Tshabangu represents real opposition is either nave or complicit. The man has been front and center in recalling elected MPs to give Zanu PF an edge  and now he dares insult a real patriot like Geza, said one online user.\n\nObservers say Tshabangus public statements often mirror Zanu PF talking points, leading many to question his credibility and allegiance.\n\nDespite the backlash, Tshabangu has doubled down on his claims, positioning himself as a key figure in what he calls the real opposition, even as his actions continue to undermine the democratic movement in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Citizens Coalition for Change (CCC) self-imposed Secretary General Sengezo Tshabangu has stirred outrage after launching a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/i-am-better-than-geza-claims-tshabangu/\">Continue reading<span class=\"screen-reader-text\"> \"I Am Better Than Geza, Claims Tshabangu\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Tshabangu Demands Dialogue With Advocate Nelson Chamisa",
            "url": "https://www.zimeye.net/2025/07/05/tshabangu-demands-dialogue-with-advocate-nelson-chamisa/",
            "content": "By Tinashe Sambiri\n\nEmbattled Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu, whose political credibility continues to spiral amid accusations of being a Zanu PF enabler, has made a public plea for dialogue with the partys former leader, Advocate Nelson Chamisa.\n\nTshabangu, whose role in recalling elected CCC MPs helped tilt power in favour of Zanu PF, is now calling for unity talks  a move many see as a desperate attempt to revive his shattered image.\n\nIn a statement posted on X (formerly Twitter), Tshabangu said:\n\nWithout a clear plan and roadmap, ambiguity wont take us anywhere. As Zimbabwes opposition, our solution lies in dialogue  sitting at a round table to discuss differences and unite with one voice.\n\nAnything less is a waste of time as well still find it difficult to beat Zanu PF.\n\nThe irony of Tshabangus call for dialogue has not gone unnoticed. Many within the opposition and civil society believe Tshabangu is responsible for sowing division within the CCC at the behest of Zanu PF interests. His unilateral recalls of MPs and councillors created instability within the opposition and have left many questioning whether he is truly committed to democratic change.\n\nAdvocate Nelson Chamisa, who stepped away from CCC after Zanu PF allegedly hijacked its structures, has shown no interest in entertaining Tshabangus overtures.\n\nWe are not under pressure to negotiate with anyone. They say they are in charge, let them lead, Chamisas aide said yesterday, dismissing Tshabangus calls as political noise.\n\nAnalysts say Tshabangus latest move is a clear sign he is politically cornered, with his influence waning and public trust all but eroded. Calls for Chamisa to return and reconstitute a new, independent movement have been growing louder, leaving Tshabangu isolated within a fractured opposition.\n\nWhile Tshabangu insists on dialogue as a path forward, many Zimbabweans continue to view him as a symbol of betrayal  a man whose actions handed Zanu PF the upper hand and weakened the prospects of genuine opposition unity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Embattled Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu, whose political credibility continues to spiral amid … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/tshabangu-demands-dialogue-with-advocate-nelson-chamisa/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Demands Dialogue With Advocate Nelson Chamisa\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Zim Men Now Shunning Marriage Due to Economic Hardships, Survey Reveals",
            "url": "https://www.zimeye.net/2025/07/05/zim-men-now-shunning-marriage-due-to-economic-hardships-survey-reveals/",
            "content": "By A Correspondent\n\nA growing number of Zimbabwean men are choosing to remain unmarried, with many citing harsh economic conditions and shifting societal expectations as major deterrents, according to the latest 2025 Zimbabwe Demographic and Health Survey (ZDHS).\n\nThe survey  conducted by the Zimbabwe National Statistics Agency (Zimstat) in partnership with the Ministry of Health and Child Care  revealed that 45 percent of eligible men in Zimbabwe have never been married, reflecting the effects of deepening financial strain and changing cultural attitudes toward marriage.\n\nThe ZDHS indicated that most young men feel overwhelmed by the pressure to meet traditional expectations of being providers, especially in a context marked by high unemployment and unstable incomes. In such conditions, many now view marriage as an economic burden.\n\nThe survey also found that traditional gender roles are increasingly being challenged by a society where women are becoming more financially independent and empowered. This shift has added to the complexity of modern relationships, particularly among urban youth.\n\nOne observer said, How do I get married when I can barely afford rent or groceries? Marriage these days is a luxury.\n\nThe data was collected against a backdrop of rising poverty, persistent inflation, and a stagnant job market  conditions that have left many Zimbabwean youths uncertain about the future.\n\nThe survey further indicated that Western influences, especially through digital media platforms, are reshaping how marriage is perceived. It is now more commonly viewed as a lifestyle choice rather than a necessary rite of passage.\n\nAs Zimbabwe continues to grapple with economic uncertainty, the ZDHS suggests that the traditional family unit is facing a steady transformation, with marriage no longer holding the same social urgency or appeal among men as it once did.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A growing number of Zimbabwean men are choosing to remain unmarried, with many citing harsh economic conditions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/zim-men-now-shunning-marriage-due-to-economic-hardships-survey-reveals/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Men Now Shunning Marriage Due to Economic Hardships, Survey Reveals\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "2008 Zanu PF Attack Victim Dies After 17 Years of Suffering",
            "url": "https://www.zimeye.net/2025/07/05/2008-zanu-pf-attack-victim-dies-after-17-years-of-suffering/",
            "content": "By A Correspondent\n\nTakaendesa Chisese, a Gutu man who was left mentally unstable after a brutal 2008 political attack by over 200 Zanu PF youths, has died  bringing to a close a long and painful chapter of suffering and neglect.\n\nChisese, once known as a hardworking and devoted family man, never recovered after the violent invasion of his home at the height of Zimbabwes post-election turmoil.\n\nNeighbours say he lived the remainder of his life in torment, unable to work or support his family.\n\nHe was never the same after that day, said one neighbour, speaking on condition of anonymity. They beat him so badly, and from then on, he was just lost. He would roam aimlessly, barely speaking. It was heartbreaking to watch.\n\nAnother resident described his decline as a symbol of Zimbabwes unresolved trauma:Chiseses life became a symbol of black-on-black suppression. We saw how politics destroyed not just his body, but his mind and dignity.\n\nChisese died last night after 17 years of severe mental illness and poor health. Despite having once provided for his family and ensured his children went to school, he died a pauper.\n\nHe will be buried at Muwandi Village near Gonye Township in Gutu, with locals expressing concern over the dire state of his funeral arrangements.\n\nEven finding food for mourners will be a struggle, one villager admitted.\n\nChiseses death has rekindled painful memories in the community  a stark reminder of the silent, long-term casualties of political violence in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Takaendesa Chisese, a Gutu man who was left mentally unstable after a brutal 2008 political attack by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/2008-zanu-pf-attack-victim-dies-after-17-years-of-suffering/\">Continue reading<span class=\"screen-reader-text\"> \"2008 Zanu PF Attack Victim Dies After 17 Years of Suffering\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Tagwirei Co-option, Mnangagwa In Panic Meetings",
            "url": "https://www.zimeye.net/2025/07/05/tagwirei-co-option-mnangagwa-in-panic-meetings/",
            "content": "By A Correspondent  President Emmerson Mnangagwa was forced into a flurry of internal meetings last week after the controversial co-option of his close ally, businessman Kuda Tagwirei, into Zanu PFs Central Committee sparked internal dissent and unrest within the ruling party.\n\nTagwireis elevation, orchestrated by Mnangagwa loyalists pushing the Presidents Vision 2030 agenda, bypassed the normal endorsement process by the PolitburoZanu PFs highest decision-making body.\n\nSources said the move was never formally approved, ignitingquietrevolt among senior officials who view Tagwireis influence as emblematic of cronyism and elite capture within the party.\n\nTagwirei, known for his controversial control over key economic sectors through opaque deals, has long been accused of benefiting from preferential access to state contracts and financial support under Mnangagwas rule.\n\nHis appointmentintothe Central Committeea powerful organ that shapes party policy outside Congresshas raised alarm even among some in the Presidents inner circle, who fear further erosion of Zanu PFs institutional integrity.\n\nIn response, Mnangagwa convened a series of emergency meetings, including Thursdays Central Committee session and Fridays National Consultative Assembly, seeking to contain the fallout.\n\nDuring his address, the President emphasised discipline, unity, and development, steering clear of directly referencing Tagwireis appointment.\n\nHowever, sources revealed that behind closed doors, Mnangagwa met with Vice Presidents Chiwenga and Mohadi,andparty Chair Oppah Muchinguri to address factional concerns.\n\nObservers say the meetings aimed to stabilise party structures ahead of the 2025 Peoples Conference and maintain a faade of cohesion as internal tensions over succession and elite patronage simmer.\n\nTagwireis fast-tracked elevation reflects the deepening entrenchment of Mnangagwas loyalistsand the intensifying struggle over control of Zanu PF as 2030 draws closer.\n\nZanu PF spokesperson Chris Mutsvangwa who is also opposed to Tagwireis elevation could not be reached for comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa was forced into a flurry of internal meetings last week after the controversial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/tagwirei-co-option-mnangagwa-in-panic-meetings/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Co-option, Mnangagwa In Panic Meetings\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        },
        {
            "title": "Chipinge Community Spits On Mnangagwa Brother’s Grave",
            "url": "https://www.zimeye.net/2025/07/05/chipinge-community-urinates-on-mnangagwa-brothers-grave/",
            "content": "By A Correspondent-The Chipinge community had no kind words for the late Executive Chairman of the Zimbabwe Electricity Supply Authority (ZESA), mourning the death of Sydney Zukuzo Gata, who passed away on Thursday evening.\n\nGata died at a private hospital in Harare after being admitted earlier in the week with chest pains. He hailed from the Mutema communal area under Chief Mutema.\n\nNationally, Gata was a towering but controversial figurewidely regarded as a key member of President Emmerson Mnangagwas inner circle and a prominent beneficiary of Zimbabwes post-liberation patronage system.\n\nHe was also married to President Mnangagwas second wife.\n\nWhile his career was distinguished by powerful appointments and international roles, it was also tainted by long-standing allegations of corruption, nepotism, and the misuse of public institutions for personal and political gain.\n\nDespite official tributes, Gatas legacy in his home district is far from universally celebrated. Many residents in Chipinge remember him less for his philanthropy and more for the power he wielded to influence politics, control land, and silence dissent.\n\nKnown locally asChigananda, Gata was accused of using his proximity to Mnangagwa and his tribal identity to dominate the MutemaMusikavanhu constituency, where his wife serves as the areas MP and Deputy Minister of Primary and Secondary Education.\n\nIn Ward 5, Gata was accused of displacing villagers through controversial land takeovers. During the June 14 by-election in the ward, activists allegedly loyal to Gata and his wife reportedly harassed voters, with over 1,200 people being assisted to vote under the pretext of illiteracyan improbable claim that reportedly included qualified teachers.\n\nMany viewed the imposition of his wife as a political candidate as undemocratic, and her presence deepened divisions within ZANU-PF. Locals say few dared to speak against the Gata family, citing fear of political reprisals and their close links to the presidency.\n\nDr. Gatas career trajectory was remarkable. He was the first Black General Manager of the Electricity Supply Commission (ESC), serving from 1981 to 1985. He later became ZESAs Chief Executive Officer and board member during the late 1980s and 1990s. His controversial reappointment as Executive Chairman in 2019 was met with public skepticism as ZESA grappled with worsening load shedding and financial mismanagement.\n\nInternationally, Gata held respected positions, including a term as Deputy Chair of the Studies Committee of the World Energy Council from 1992 to 1994. He also served in advisory roles with the African Development Bank and Integrated Energy Systems Limited (UK).\n\nThough many in Chipinge were deeply critical of his legacy, others mourned him as a son of the soil who never severed ties with his roots.\n\nWard 23 Councillor Shingai Gapara said all local activities had been suspended to honor the Gata family.\n\nIn honoring his legacy and respecting the Gata family, we have suspended all gatherings and programs in Ward 23 of Chipinge Rural. May we find strength in our collective grief and support one another during this difficult period,he said.\n\nCommunity activist Oliver Chikumba, who broke the news of Gatas death, remembered him warmly:\n\nThe giant has fallen. A man of few words and more action. The nation has been robbed. Dr. Engineer Sydney Zukuzo Gatayour legacy will forever be cherished. Rest in power, Mutape.\n\nAcademic and consultant Dr. Robbert Matikiti called him a hero who has left behind a good legacy, while members of the United Church of Christ in Zimbabwe (UCCZ) also paid tribute to his development work and spiritual leadership.\n\nGata was instrumental in championing the proposed Gazaland University (GU) project in Chipinge. According to Mr. Phillimon Mlambo, Chairperson of the GU Taskforce, Gata helped conceptualize an Agriculture Centre of Excellence and pushed for the projects realization.\n\nDr. Gata was one of our greatest advocates and cheerleaders for Gazaland University. In his honor, we are even more determined to make GU a reality,Mlambo said.\n\nDr. Gata is survived by his wife, Hon. Angeline Gata, their children, and grandchildren. Funeral and burial arrangements will be announced in due course.\n\nAs Zimbabwe reflects on a life that intersected power, privilege, and patronage, Chipinge remains divided. To some, he was a loyal son and visionary. To others, he symbolized a system of political control, economic exclusion, and elite entitlement that they continue to rejecteven in death.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Chipinge community had no kind words for the late Executive Chairman of the Zimbabwe Electricity Supply Authority … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/05/chipinge-community-urinates-on-mnangagwa-brothers-grave/\">Continue reading<span class=\"screen-reader-text\"> \"Chipinge Community Spits On Mnangagwa Brother’s Grave\"</span></a></p>",
            "time": "21:28",
            "date": "06 Jul 2025"
        }
    ]
}