{
    "news": [
        {
            "title": "Just In: Air Force of Zimbabwe Pilot Dies In Fighter Aircraft Crash",
            "url": "https://www.zimeye.net/2025/05/30/just-in-air-force-of-zimbabwe-pilot-dies-in-fighter-aircraft-crash/",
            "content": "By A Correspondent\n\nThe Zimbabwe Defence Forces (ZDF) has announced the tragic death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube following the crash of an Air Force of Zimbabwe (AFZ) F-7 fighter jet on Friday, May 30.\n\nAccording to a statement released by ZDF spokesperson Colonel Alphios Makotore, the incident occurred in the Wazheri area along the Gweru-Mvuma Road during a routine training mission. A dark cloud has engulfed the Zimbabwe Defence Forces family, said Makotore. An Air Force of Zimbabwe F-7 fighter aircraft crashed in the Wazheri general area As a result of the crash, the pilot, Squadron Leader (retired) Ritswanetsi Vuyo Ncube, lost his life.\n\nSquadron Leader Ncube, a veteran pilot who had returned from retirement to continue serving in the Air Force, was actively involved in the training of young fighter pilots at Josiah Tungamirai Air Force Base. His passion for aviation and unwavering commitment to national duty had earned him deep respect within the ranks.\n\nIn a heartfelt tribute, Commander of the Zimbabwe Defence Forces, General Philip Valerio Sibanda, described the late pilot as a proficient and highly experienced pilot. He added, The Zimbabwe Defence Forces have learnt, with heavy hearts, of the passing on of Squadron Leader Ncube Our thoughts and prayers are with the family of the deceased pilot. I want to extend my deepest condolences to the family and friends of the deceased for this sad loss.\n\nAuthorities have since launched an investigation to determine the cause of the crash.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Defence Forces (ZDF) has announced the tragic death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/just-in-air-force-of-zimbabwe-pilot-dies-in-fighter-aircraft-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Just In: Air Force of Zimbabwe Pilot Dies In Fighter Aircraft Crash\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Zim Soccer Star In Paternity Storm",
            "url": "https://www.zimeye.net/2025/05/30/zim-soccer-star-in-paternity-storm/",
            "content": "By Sports Reporter-Zimbabwean footballer and former Soccer Star of the Year, Kudakwashe Mahachi, is embroiled in a dramatic courtroom battle with his ex-wife, Marita Ndlovu, over the paternity of one of their childrena case that has quickly escalated into a fierce legal confrontation.\n\nTensions flared when Mahachis lawyer issued a stern warning in court, stating that if DNA results prove Mahachi is not the biological father, Marita could face criminal charges for allegedly providing false information.\n\nProviding false information to the court is a serious criminal offence, the lawyer declared. If the DNA test shows Mahachi is not the father, we will not hesitate to pursue charges of perjury and misrepresentation.\n\nBut Marita was quick to hit back. She told the court that if the DNA results confirm Mahachi as the father, she would seek compensation for defamation of character, accusing him of tarnishing her name and putting their children through public humiliation.\n\nThis is about more than just money, Marita told the magistrate. Its about my dignity and the well-being of my children. If he is indeed the father, I deserve justice for the falsehoods he has spread about me.\n\nThe magistrate ordered a DNA test to conclusively determine the childs paternity and directed Mahachi to cover the cost of the procedure.\n\nWhat began as a maintenance dispute has now transformed into a high-stakes battle over truth, trust, and personal honour. With both sides standing their ground, the case has gripped public attention.\n\nThe magistrate is expected to make a formal ruling soon, but the DNA results may ultimately decide the fate of this family dispute.\n\nB Metro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter-Zimbabwean footballer and former Soccer Star of the Year, Kudakwashe Mahachi, is embroiled in a dramatic courtroom battle … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/zim-soccer-star-in-paternity-storm/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Soccer Star In Paternity Storm\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "FC Wangu Mazodze Threaten To Pull Out Of Eastern Region Division One League",
            "url": "https://www.zimeye.net/2025/05/30/fc-wangu-mazodze-threaten-to-pull-out-of-eastern-region-division-one-league/",
            "content": "Sports Correspondent\n\nWangu Mazodze FC has announced its intention to withdraw from the Eastern Region Division One League, citing what it calls victimization by league authorities.\n\nThe Masvingo-based club made the declaration in an official statement, expressing dissatisfaction with disciplinary action taken against them, including charges and fines for allegedly inciting crowd trouble during matches.\n\nIn a strongly worded ultimatum to the leagues board, the club demanded that the charges be rescinded by June 2, 2025, or they would follow through with their decision to pull out of the competition.\n\nIn the event that reason does not prevail, the budget allocated for the 2025 football season will be redirected to promote social football in our communities, read the statement.\n\nThe club also revealed that they had already engaged the Executive Committee Chairman in an attempt to resolve the matter.\n\nWe have engaged the Executive Committee Chairman, and if the baseless charges are not withdrawn by the close of business on June 2, 2025, we will automatically withdraw from the Pacific Storm Eastern Region Soccer League without further notice, the statement concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Wangu Mazodze FC has announced its intention to withdraw from the Eastern Region Division One League, citing what … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/fc-wangu-mazodze-threaten-to-pull-out-of-eastern-region-division-one-league/\">Continue reading<span class=\"screen-reader-text\"> \"FC Wangu Mazodze Threaten To Pull Out Of Eastern Region Division One League\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Judge Weeps As Nyokayemabhunu Case Postponed to June 10",
            "url": "https://www.zimeye.net/2025/05/30/judge-weeps-as-nyokayemabhunu-case-postponed-to-june-10/",
            "content": "By A CorrespondentThe case of Zimbabwean activist Wellington Masiwa, popularly known as Nyokayemabhunu, was postponed to June 10 following a court appearance in South Africa on Friday.\n\nMasiwas legal team indicated that both the defence and the state presented their heads of argument, prompting the magistrate to adjourn the matter.\n\nIt was okay. I argued for the heads of arguments. The state presented their heads of arguments as well. The case was adjourned to 10 June, said a member of Masiwas legal team.\n\nThe lawyer revealed that further consultations with Masiwa were necessary, particularly concerning personal matters, but the state pushed back against the defences application.\n\nI needed to consult with Mr. Masiwa. I needed to ask him questions over his first wife, and the children. The state refused to accept the application they said there has to be new evidence, the lawyer explained. Yes, I do accept they are receiving new evidence, but I still confirmed completing the new application itself. I still proceeded, I still raised my defence and I just hope that the magistrate makes a very informed decision  in terms of the Constitution, in terms of dignity, freedom, and his rights. I really hope that the magistrate passes this decision.\n\nAccording to the defence, the magistrate appeared emotionally affected at some point during the proceedings.\n\nThe issue is this man has been locked up for about 47 days. He has a right to freedom; he has a right to see his family. Hes a human being, the lawyer argued passionately. This is why I argued like that. This is why I argued that he should have gotten his freedom. He shouldnt be locked up in a foreign country. I have raised these points. I believe that he should be with his family while awaiting trial.\n\nThe defence is now awaiting the magistrates ruling on the matter, which is expected to take into account the constitutional rights and humanitarian concerns raised during the hearing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A CorrespondentThe case of Zimbabwean activist Wellington Masiwa, popularly known as Nyokayemabhunu, was postponed to June 10 following a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/judge-weeps-as-nyokayemabhunu-case-postponed-to-june-10/\">Continue reading<span class=\"screen-reader-text\"> \"Judge Weeps As Nyokayemabhunu Case Postponed to June 10\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Trent Alexander-Arnold Joins Real Madrid FC",
            "url": "https://www.zimeye.net/2025/05/30/trent-alexander-arnold-joins-real-madrid-fc/",
            "content": "Real Madrid C. F. and Liverpool FC have reached an agreement to sign Trent Alexander-Arnold for the next six seasons, from 1 June 2025 to 30 June 2031.\n\nThe 26-year-old England international joins the club after winning nine trophies with Liverpool: Champions League (1), Club World Cup (1), Uefa Super Cup (1), Premier League (2), FA Cup (1), League Cup (2), and Community Shield (1).\n\nAlexander-Arnold, who has spent his entire playing career at Liverpool, has been a full international since 2018 with England, playing in two World Cups (2018 and 2022) and one European Championship (2024).\n\nOn an individual level, he has been included once in the FIFA FIFPro World XI (2020), twice in the UEFA Champions League team of the season (2018/19 and 2021/22) and three times in the Premier League dream team (2018/19, 2019/20 and 2021/22). He was also voted the best young player of the Premier League 2019/20.\n\nAlexander-Arnold will be playing for Real Madrid in the Club World Cup, which will be held in the United States from 14 June.\n\nSource: Real Madrid FC\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Real Madrid C. F. and Liverpool FC have reached an agreement to sign Trent Alexander-Arnold for the next six seasons, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/trent-alexander-arnold-joins-real-madrid-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Trent Alexander-Arnold Joins Real Madrid FC\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Wave of Violence Grips Masvingo as Another Man Assaulted and Left for Dead",
            "url": "https://www.zimeye.net/2025/05/30/wave-of-violence-grips-masvingo-as-another-man-assaulted-and-left-for-dead/",
            "content": "A Masvingo man is recovering in hospital after he was brutally assaulted, robbed, and abandoned near the Chevron Hotel late last night. The victim, who was reportedly intoxicated after a night out at a club in the Central Business District (CBD), was discovered unconscious early this morning.\n\nAfter regaining consciousness, the man managed to make his way to Masvingo Central Police Station, where authorities referred him to Masvingo Provincial Hospital for treatment.\n\nThis latest attack comes amid growing concern over a surge in violent crimes in the city. Less than a week ago, Mike Bhungeni, a student at Masvingo Polytechnic, was fatally stabbed by armed robbers near Ndarama High School. Just hours after that fatal incident, another individual was stabbed at the same location and is currently fighting for his life at Masvingo Provincial Hospital.\n\nThe recent spate of violence has sparked fear among residents, with calls for increased police patrols and heightened security measures in crime-prone areas. Source : Masvingo Mirror\n\nA drunk Masvingo man was severely assaulted, robbed and left for dead near Chevron Hotel last night whilst coming from a club in the CBD. The man regained consciousness this morning and was taken to Masvingo Central Police Station where he was referred to Masvingo Provincialpic.twitter.com/2KnBzXkMuq\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Masvingo man is recovering in hospital after he was brutally assaulted, robbed, and abandoned near the Chevron Hotel late … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/wave-of-violence-grips-masvingo-as-another-man-assaulted-and-left-for-dead/\">Continue reading<span class=\"screen-reader-text\"> \"Wave of Violence Grips Masvingo as Another Man Assaulted and Left for Dead\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "𝐌𝐈𝐒𝐀 𝐫𝐞𝐠𝐢𝐨𝐧𝐚𝐥 𝐝𝐢𝐫𝐞𝐜𝐭𝐨𝐫 𝐚𝐩𝐩𝐨𝐢𝐧𝐭𝐞𝐝 𝐭𝐨 𝐀𝐟𝐫𝐢𝐜𝐚𝐧 𝐔𝐧𝐢𝐨𝐧 𝐖𝐨𝐫𝐤𝐢𝐧𝐠 𝐆𝐫𝐨𝐮𝐩 𝐨𝐧 𝐀𝐈",
            "url": "https://www.zimeye.net/2025/05/30/%f0%9d%90%8c%f0%9d%90%88%f0%9d%90%92%f0%9d%90%80-%f0%9d%90%ab%f0%9d%90%9e%f0%9d%90%a0%f0%9d%90%a2%f0%9d%90%a8%f0%9d%90%a7%f0%9d%90%9a%f0%9d%90%a5-%f0%9d%90%9d%f0%9d%90%a2%f0%9d%90%ab%f0%9d%90%9e/",
            "content": "Dr Tabani Moyo\n\nMISA Regional Secretariat Director, Dr Tabani Moyo Snr , has been appointed as member of the African Union (AU) Working Group on Artificial Intelligence.\n\nWe accept the responsibility thrust upon our shoulders with humility and honour in service of the peoples of Africa and the diaspora. This is a recognition of the work we have done at MISA Regional Office, the chapters and networks that we serve in different capacities, said Dr Moyo\n\nWe are grateful for the depth and cordial working relationship we have with the Ministry of ICT (Information Communication Technology), Postal and Courier Services in Zimbabwe. Through our strategic partnership and engagements, our expertise has been spotlighted.\n\nHe expressed gratitude to MISAs symbiotic relationships with the African Union Commission (AUC), the Southern African Development Community (SADC), and UNESCO, particularly the Regional Office for Southern Africa (UNESCO-ROSA), and the organisations entire stakeholder chain.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dr Tabani Moyo MISA Regional Secretariat Director, Dr Tabani Moyo Snr , has been appointed as member of the African … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/%f0%9d%90%8c%f0%9d%90%88%f0%9d%90%92%f0%9d%90%80-%f0%9d%90%ab%f0%9d%90%9e%f0%9d%90%a0%f0%9d%90%a2%f0%9d%90%a8%f0%9d%90%a7%f0%9d%90%9a%f0%9d%90%a5-%f0%9d%90%9d%f0%9d%90%a2%f0%9d%90%ab%f0%9d%90%9e/\">Continue reading<span class=\"screen-reader-text\"> \"𝐌𝐈𝐒𝐀 𝐫𝐞𝐠𝐢𝐨𝐧𝐚𝐥 𝐝𝐢𝐫𝐞𝐜𝐭𝐨𝐫 𝐚𝐩𝐩𝐨𝐢𝐧𝐭𝐞𝐝 𝐭𝐨 𝐀𝐟𝐫𝐢𝐜𝐚𝐧 𝐔𝐧𝐢𝐨𝐧 𝐖𝐨𝐫𝐤𝐢𝐧𝐠 𝐆𝐫𝐨𝐮𝐩 𝐨𝐧 𝐀𝐈\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Bankers Blame Cash Hoarders For Killing Economy",
            "url": "https://www.zimeye.net/2025/05/30/bankers-blame-cash-hoarders-for-killing-economy/",
            "content": "By A Correspondent\n\nHARARE  The Bankers Association of Zimbabwe (BAZ) has issued a stark warning about the devastating effects of private cash hoarding, accusing the countrys wealthiest individuals of undermining the national economy by keeping billions of dollars outside the formal financial system.\n\nIn a scathing critique of Zimbabwes shadow banking culture, Sibongile Moyo, the newly appointed BAZ president and managing director of Nedbank Zimbabwe, painted a grim picture of how a few cash-rich individuals have become de facto banks, hoarding funds in vaults, safes, and even under mattresses.\n\nA lot of money is circulating outside the formal banking system. I think individuals have almost become like banks themselvesprobably holding more money than what we hold in the banks, Moyo said. That money is effectively not working for the economy because its sitting outside the formal channelwe cant use it to lend.\n\nThe impact is massive. Zimbabwes entire formal banking sector holds just US$3.3 billion in deposits, a figure dwarfed by the suspected volume of unbanked wealth. Of that US$3.3 billion:\n\nUS$1.9 billion (58%) is already committed to loans,\n\n30% is locked in statutory reserves and regulatory requirements,\n\nleaving just 12% available for everyday banking operations, including interbank settlements and liquidity needs.\n\nSo look, the entire market only has US$3.3 billion of deposits, which is a very small pool from which to lend, Moyo emphasized. We are already lending most of it, and what remains cannot support meaningful growth or economic transformation.\n\nAccording to Moyo, the core of the issue lies not only in hoarding but also in the structure of deposits, which are mostly short-term and volatile.\n\nThere is no capacity to lend long-term because more than 70% of deposits are current accountspeople who want their money the next day. You cant transform that into long-term assets, she said.\n\nAdding to the challenge, Zimbabwes capital and bond markets are shallow, forcing banks to act as the sole intermediaries of long-term finance, despite being ill-equipped for such a role.\n\nWith limited local funding options, the banking sector has resorted to external lines of credit to try and bridge the gap. But this is neither sustainable nor ideal, especially for an economy already facing credibility challenges in the global financial market.\n\nBAZ is now calling for urgent policy measures to incentivize formal banking, restore trust, and address the root causes of hoardingchief among them being economic uncertainty, lack of confidence in the financial system, and regulatory loopholes that allow hoarders to operate with impunity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – The Bankers Association of Zimbabwe (BAZ) has issued a stark warning about the devastating effects … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/bankers-blame-cash-hoarders-for-killing-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Bankers Blame Cash Hoarders For Killing Economy\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Zivhu Praises Chigananda Chivayo, Says Controversial Businessman Is Charismatic",
            "url": "https://www.zimeye.net/2025/05/30/zivhu-praises-chigananda-chivayo-says-controversial-businessman-is-charismatic/",
            "content": "By A Correspondent\n\nOutspoken Zanu PF official Killer Zivhu has stirred fresh controversy after publicly showering praise on Wicknell Chivayo, describing the embattled businessman as a charismatic and influential figure with strategic value far beyond Zimbabwes borders.\n\nIn a statement issued Wednesday, Zivhu  no stranger to provocative political commentary  defended Chivayos growing public profile, despite widespread criticism over his extravagant spending and opaque business dealings.\n\nLets face it, Wicknell is a master planner with influence across Africa, Asia, and parts of Europe, said Zivhu.\n\nThe Zimbabwean government seeks his expertise, and many African nations highly regard him. His endorsement carries weight in international deal-making.\n\nChivayo, known for his controversial government tenders and flashy philanthropy, has divided public opinion in recent months. While some praise his donations to public figures and institutions, others question the source and transparency of his wealth.\n\nZivhu, however, was unapologetic in his admiration, calling Chivayo a vital asset to Zimbabwes diplomatic and business interests.\n\nHis comments come amid growing scrutiny over how state contracts are awarded and the rising power of politically connected businessmen.\n\nIn the same statement, Zivhu also reaffirmed his allegiance to President Emmerson Mnangagwa, asserting that ED remains the only viable leader for Zimbabwes foreseeable future.\n\nED is the only capable person to continue as president. For the time being, we dont have any other candidate until 2035, Zivhu declared. Chamisa has chances only if he joins ZANU-PF and replaces ED by 2035. This is a reality that pains many people, but they cant do anything about it.\n\nThe remarks are likely to provoke political backlash, especially as opposition leader Nelson Chamisa continues to gain support from Zimbabwes youth and urban electorate. Zivhus suggestion that Chamisa would need to join ZANU-PF to ever become president highlights the entrenched political dominance of the ruling party  and the limited avenues for electoral change in the current landscape.\n\nBoth Chivayo and Zivhu remain lightning rods for controversy, frequently trending on social media and dominating public discourse. This latest endorsement has once again brought to the fore questions about power, money, and the future of leadership in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Outspoken Zanu PF official Killer Zivhu has stirred fresh controversy after publicly showering praise on Wicknell Chivayo, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/zivhu-praises-chigananda-chivayo-says-controversial-businessman-is-charismatic/\">Continue reading<span class=\"screen-reader-text\"> \"Zivhu Praises Chigananda Chivayo, Says Controversial Businessman Is Charismatic\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Chipo Tracks Down Alleged Phone Thief with Help from ZRP Cops",
            "url": "https://www.zimeye.net/2025/05/30/chipo-tracks-down-phone-thief-with-help-from-zrp-cops/",
            "content": "Norton | Friday, 30 May 2025\n\nBy Dorrothy Moyo | ZimEye | Zimbabwean musician Chipochashe Muchegwa has expressed overwhelming joy after police in Norton successfully arrested one of the suspects who stole her mobile phones and wheelchair charger.\n\nTaking to social media, Chipo announced:\n\nHEY GUYS MURISEI I COME HERE WITH GREAT JOY TO TELL U THAT MBAVHA YAKABA MA PHONE AND MY WHEELCHAIR CHARGER YAKAWANIKWA YAKABATWA.\n\nShe revealed that her belongings were recovered following a coordinated operation by officers at ZRP Norton Urban Police Station. The suspects, identified as Mashak Chalmers and Nyasha Chibwe, allegedly stole her phones and essential charger. Chalmers has since been arrested while Chibwe remains at large but is being pursued.\n\nChipo detailed how the Officer in Charge at Norton Urban assigned Assistant Chief Inspector Jowa, who then tasked Inspector Masadza, Sergeant Musipe, Sergeant Gururwa, Constable Ncube, and Constable Chirongwe to the case.\n\nMA OFFICERS AYA VAKASHANDA NDATI SIKU NESIKATI PANGA PASINGARARWE NDATI, she wrote, commending the tireless and passionate effort of the officers involved.\n\nThe musician, known for her powerful voice and advocacy, praised the polices professionalism and called for this level of commitment to be extended to all citizens facing crime.\n\nDai ndaikwanisa kuvatenda handizive kuti ndaivatenda nei mapurisa aya chido chavo nebasa chakanyanyisa. Ahoy Norton Urban Police , she wrote in a heartfelt tribute.\n\nThe case has been brought before the Norton Magistrates Court. Police continue their search for the second suspect, and further updates are expected.\n\nEND\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Norton | Friday, 30 May 2025 By Dorrothy Moyo | ZimEye | Zimbabwean musician Chipochashe Muchegwa has expressed overwhelming joy … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/30/chipo-tracks-down-phone-thief-with-help-from-zrp-cops/\">Continue reading<span class=\"screen-reader-text\"> \"Chipo Tracks Down Alleged Phone Thief with Help from ZRP Cops\"</span></a></p>",
            "time": "21:26",
            "date": "31 May 2025"
        }
    ]
}