{
    "news": [
        {
            "title": "Magaya Falls",
            "url": "https://www.zimeye.net/2024/12/24/magaya-falls/",
            "content": "By Sports Reporter- The Ethical Committee of ZIFA has dismissed the scandalous and self-proclaimed prophet, Walter Magaya, from contesting the ZIFA presidential elections.\n\nCAPS United owner Farai Jere and former Norton MP Themba Mliswa also lost their presidential bids.\n\nThe disqualifications were announced on Tuesday, citing Article 85(9) of the ZIFA Statutes, 2024, which outlines eligibility criteria for candidates.\n\nHowever, the football governing body did not disclose specific reasons for their ineligibility.\n\nMagayas attempt to enter the football administration has been controversial, given his history of scandals in both business and religious circles.\n\nCritics questioned his suitability for the role, pointing to past allegations of financial impropriety, unfulfilled promises in his ventures, and dubious spiritual claims.\n\nHis disqualification adds to a growing list of setbacks for the preacher-turned-entrepreneur.\n\nZIFA released the names of candidates who successfully met the eligibility requirements.\n\nAmong the presidential hopefuls are Marshall Gore, Philemon Machana, and Nqobile Magwizi. Vice-presidential candidates include Mavis Gumbo, Kennedy Ndebele, and Omega Sibanda.\n\nThis election marks a critical juncture for ZIFA as the association aims to rebuild its tarnished image and restore credibility in Zimbabwean football governance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter- The Ethical Committee of ZIFA has dismissed the scandalous and self-proclaimed prophet, Walter Magaya, from contesting the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/magaya-falls/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Falls\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Suspect Killed By Mob",
            "url": "https://www.zimeye.net/2024/12/24/suspect-killed-by-mob/",
            "content": "Bulawayo, Zimbabwe  Police have issued a stern warning to residents following a tragic case of mob justice in Lobengula suburb that resulted in the death of a man accused of theft. Authorities have arrested two suspects, Advice Dibula (36) and Khulekelani Mhlanga (43), in connection with the incident, which occurred in the early hours of December 21, 2024.\n\nThe deceased, whose identity remains unknown, was allegedly part of a group of four men accused of assaulting and robbing Dibula of his Samsung A23 mobile phone and earphones. The incident escalated when Dibula and Mhlanga retaliated, fatally attacking the alleged thief.\n\nBulawayo deputy police spokesperson Assistant Inspector Nomalanga Msebele urged the public to refrain from taking the law into their own hands, emphasizing the need to report crimes to the nearest police station.\n\nTaking the law into ones hands often leads to tragic outcomes. Criminal matters should be handled by the police to prevent unnecessary loss of life, said Assistant Inspector Msebele in a statement.\n\nDetails of the Incident\n\nAccording to police reports:\n\nThe deceased and his three companions assaulted Dibula and his friends near Lobengula West suburb.\n\nThe group forcibly took Dibulas phone and earphones during the attack.\n\nDibula and Mhlanga retaliated, resulting in severe injuries to the deceased.\n\nThe injured man was taken to Mpilo Hospital, where he was pronounced dead upon arrival.\n\nThe suspects were arrested shortly after the incident and remain in police custody.\n\nLegal Context and Case Law on Mob Justice\n\nThis incident highlights the dangers of mob justice, a recurring issue in many communities. The law requires due process and the presumption of innocence for all accused individuals. Below are five key legal precedents emphasizing the illegality of mob justice:\n\n1.S v. Nyirenda (1989)\n\nIn this case, the court condemned mob justice after a group of villagers assaulted a suspected thief, leading to his death. The court ruled that no individual or group has the right to mete out punishment outside the confines of the law.\n\n2.Moyo v. The State (1994)\n\nA group attacked a man they suspected of livestock theft, resulting in severe injuries. The Supreme Court ruled that mob actions undermine the rule of law and emphasized that only the judiciary can administer justice.\n\n3.S v. Chokuda (2001)\n\nThe court convicted individuals involved in a mob beating that led to a suspects death. The judge noted that mob justice not only violates the rights of the accused but also jeopardizes community safety by escalating violence.\n\n4.S v. Banda (2008)\n\nThis case involved the killing of a suspected burglar by neighborhood watch members. The court ruled that even those intending to protect their community must act within the law, stating that vigilantism cannot replace lawful law enforcement.\n\n5.Mutasa v. The State (2017)\n\nIn this case, a mob fatally attacked a suspected thief. The court stressed the need for restraint and urged communities to work with law enforcement rather than resort to extrajudicial measures, describing mob justice as a violation of the fundamental principles of justice.\n\nPolice Appeal to the Public\n\nAssistant Inspector Msebele reiterated the importance of allowing law enforcement to handle criminal matters. We urge residents to remain calm and report any apprehended suspects to the nearest police station. Mob justice only leads to unnecessary tragedies, as witnessed in this case, she said.\n\nThe police are continuing their investigations and have urged anyone with information about the incident or the deceaseds identity to come forward.\n\nKey Takeaway\n\nMob justice not only undermines the rule of law but often results in irreversible tragedies. This case serves as a stark reminder of the importance of allowing due process to take its course, as communities work alongside law enforcement to address crime. ZIANA\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo, Zimbabwe — Police have issued a stern warning to residents following a tragic case of mob justice in Lobengula … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/suspect-killed-by-mob/\">Continue reading<span class=\"screen-reader-text\"> \"Suspect Killed By Mob\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "$36,000 Gold Bricks Stolen",
            "url": "https://www.zimeye.net/2024/12/24/36000-gold-bricks-stolen/",
            "content": "Bindura, Zimbabwe  Authorities are investigating a daring armed robbery at a Bindura mine where eight unidentified suspects made away with gold-loaded carbon valued at US $36,000.\n\nThe incident occurred on December 22, 2024, when the suspects, armed with a rifle, attacked a security guard on duty before breaking into the carbon room and stealing eleven 50-kilogram bags of gold-loaded carbon. The Zimbabwe Republic Police (ZRP) confirmed the robbery in a statement on X (formerly Twitter), urging anyone with information to report to their nearest police station.\n\nGold-loaded carbon, while appearing unremarkable, is a critical element in the gold extraction process. It is used to trap and hold gold particles from dissolved ore, making it an efficient and cost-effective method of recovering the precious metal. The stolen carbon holds significant value as it contains gold that can be refined into its pure form.\n\nDetails of the Incident\n\nAccording to the ZRP, the suspects executed the heist after overpowering the security guard, leaving them unharmed but shaken. The gang then gained access to the carbon room, where they stole the gold-laden material, which is essential in gold recovery operations.\n\nAuthorities have launched a manhunt for the suspects and are appealing to the public for information. Anyone with information to report at any nearest Police Station, the ZRP stated.\n\nUnderstanding the Value of Gold-Loaded Carbon\n\nGold-loaded carbon is a crucial intermediary in the gold mining process, often utilized in methods like Carbon-in-Leach (CIL) or Carbon-in-Pulp (CIP) to efficiently extract gold from ore. The porous nature of the carbon allows it to capture and hold tiny particles of gold, which can later be recovered and refined.\n\nThe stolen gold-loaded carbon can yield significant quantities of refined gold, making it a lucrative target for criminals.\n\nAppeal to the Public\n\nThe ZRP is calling on individuals with information about the robbery or those who notice suspicious activity related to gold-loaded carbon to come forward. The stolen material, while not immediately recognizable as valuable to the untrained eye, is an essential asset in gold recovery operations.\n\nAuthorities are intensifying their investigation and increasing patrols in mining regions to prevent further incidents of this nature.\n\nThis robbery highlights the growing risks facing mining operations and the critical need for enhanced security measures to protect valuable resources in the sector.- Ziana\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bindura, Zimbabwe — Authorities are investigating a daring armed robbery at a Bindura mine where eight unidentified suspects made away … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/36000-gold-bricks-stolen/\">Continue reading<span class=\"screen-reader-text\"> \"$36,000 Gold Bricks Stolen\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Grief As Bulawayo Man Is Electrocuted While Picking Mangoes",
            "url": "https://www.zimeye.net/2024/12/24/grief-as-bulawayo-man-is-electrocuted-while-picking-mangoes/",
            "content": "A joyful Saturday morning in Bulawayos Sizinda suburb turned into a heartbreaking tragedy when a 39-year-old man, Oscar Mapurisa, was electrocuted by a high-voltage overhead cable while picking mangoes from a neighbors tree.\n\nMapurisas day had begun on a cheerful note, with a breakfast braai and drinks with his girlfriend at a local spot. However, his life was cut short when he decided to pick mangoes from a nearby tree, just a few meters from his home.\n\nIn a tragic sequence of events, Mapurisa climbed the tree and used a wire to reach for the fruit, unknowingly hooking it onto an overhead Zesa cable. The accidental contact resulted in his electrocution, leaving the community in shock and grief.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A joyful Saturday morning in Bulawayo’s Sizinda suburb turned into a heartbreaking tragedy when a 39-year-old man, Oscar Mapurisa, was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/grief-as-bulawayo-man-is-electrocuted-while-picking-mangoes/\">Continue reading<span class=\"screen-reader-text\"> \"Grief As Bulawayo Man Is Electrocuted While Picking Mangoes\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Winky D’s Birmingham Night of Energy and Reflection: Review By Mr Smooth",
            "url": "https://www.zimeye.net/2024/12/24/winky-ds-birmingham-night-of-energy-and-reflection-review-by-mr-smooth/",
            "content": "The much-anticipated Winky D DiBigman event held on December 21, 2024, in Birmingham promised a night of electrifying entertainment, and it deliveredthough not without a few areas for improvement. The evening kicked off smoothly, with organized entry lines for VIP and general attendees, efficient security, and ample bars spread across two floors. The DJs set the tone with stellar performances, energizing the crowd before Quonfuzed and the Gaffa himself, Winky D, took center stage.\n\nWhile the crowd was only about 70% capacity, the energy was palpable as fans lit up the floor with phone lights, capturing the legendary artists set that ran from 1:36 AM to 3:33 AM. Yet, beyond the music, this event underscored the recurring challenges faced by Zimbabwean music events in the diaspora.\n\nFrom long bar queues and a lack of female representation among artists and DJs to the absence of innovative stage performances, the event highlighted areas that need urgent attention to keep the music scene fresh and inclusive. Despite these criticisms, the night served as a fitting year-end celebration, driven by Winky Ds unmatched artistry and the dedication of fans and promoters alike.\n\nThis review by Mr Smooth calls on eventorganizers to embrace diversity, elevate stage experiences, and prioritize fan engagement to ensure Zimbabwean music events reach their full potential on the global stage. As Mr. Smooth aptly puts it, We need more inclusivity, creativity, and innovation to truly honor the rich tapestry of Zimbabwean talent.\n\nFULL TEXT: REVIEW OF THE Winky D DiBigman event Birmingham 21/12/24- LIVE REVIEW 23/12/24 7 pm UK TIMEThe event was advertised for 10 PM and doors opened at 10 and all sailed well with security control very good 2 queues one for VIP and the other one normal . The VIP had 2 bars and the downstairs had 3 \n\nDJ was on point on his time and came MC @janief who was on point and replaced by @mc Taliban. There was also if correct about 2 or more DJs . These DJs were on set for set swapping till about or just after 12 am when Qounfuzed came open up and he did his stint followed by another MC dj compo \n\n0136 enter the Gaffa and he woed the crowd song after song till 0333 he left .Generally I can say there was a good crowd but wasnt full maybe 70% full . You can just imagine the Gaffa has his fans as the downstairs floor was full of phone lights for photos.\n\nThe turnout was better and generally a good event mixed ages . A good event to close the year-Good job for promoters advertising more on tick tok and instagram. Also good to know and notice the promoters were good following the timeline as much as they can and was good see a few of them on the floor-\n\nOn vendor for food Heart of Africa and they had food stalls both floors and food  quality and hygiene and customer service is flawless these would recommend if you see them and a variety of different dishes .\n\nMR SMOOTH REVIEW1-Venue was generally clean but toilets and general inside is poor and some lighting was out.2-service at the bar was taking north of 30 minutes waiting as there was only 3 staff on each bar and very busy.3-The flier was not fully informative on who was performing and no timeline on Artists performance-4-Once again no FEMALE line up on artists-DJs and MCs5-no upcoming or local talent involved-6-Winky D is an incredible artist but the event lacked stage excitement and surprise could say compare to the recent Chris Brown was full of innovation- dancing and captivating on fans both on the event or watching-7- lack of meet and greet with fans and seems.an appear disappear act always-Fans needs shown some love back once in a while.\n\nMR SMOOTH RECONMENDATIONS1-advertising has to be done on all platforms and time promoters start coming on the front or someone who can continuously give updates as fans lack information LIVE NOT POSTS !2- on stage -a stage performance manager has to be approved for each event different artist to make it interesting3-Everyone working for an event should do a live engagement with fans so we know you coming this includes artists and am comparing to Chris Brown also 50 cent and Mary J. Bligewho are coming June next year but personally promote all platforms themselves \n\nMy review is that we are regressing and happy fill up our events with Zimbabweans majority one area- I have hardly seen any Ndebele people on our events and the only white Artist I seen is Gemma Griffiths despite that there are loads in ZIM.\n\nThe recycling of same artists is becoming monotonous- abhorrent and boring WE NEED MORE FEMALES AND MORE DIVERSITY ON MCS DJS AS most washed out no diversity and hogging everything not giving any other upcoming a chance to progress aso the people you say are the big guys actually killing our music industry-\n\nOn the other hand despite Mr Smooth supporting all events and real constructive criticism- I WON AN AWARD FOR BEING A MENTAL HEALTH CHAMPION thanks to Zuwa Re. NONE OF THESE PROMOTERS AND THE CREW OF DJS AND MCS CONGRATULATED ME MAYBE JEALOUS OR INNA CULT OF LOYALTY TO HONESTY AND COWBOY PACT \n\nAll I know is my quest for improvement is there and am glad to say some of the promoters now respect what I do yet no credit yet but will not stop but will keep rising-\n\nOn Events  Promoters need to have managers or consultants who advise them as they take everything on their own hence a lot of mistakes/\n\nStall food prices on events are extortionate passed to fans due to promoters charging over 150O for a table so vendors will need recourse their money . An onboard review needs done and capped.\n\nTHANK YOU TO ALL THE FANS WHO CAME TO ATTEND GOD BLESS YOU .\n\nI know am loved and hated but with my experience on events would welcome any promoter or subordinates come do a live with me or can come to their page talk constructively how we need improvement-\n\nToo many events piled on same dates upcoming and no surprise same line up DJs and MCs ALL MALE and ARTISTS line up all MALE \n\nWHERE IZ OUR FEMALE ARTISTS????Yebolady Ipapo SisonkeNtsu MachokotoZimfest LiveLadyzim PageStatus 100 PromotionsChichi MadodaShe Millionaire Ladies Business ExpoIcmf ZimbabweTamy MoyoWinkyD Gaffa FansZimlinkupZimCanada realitiesBusi MhlangaPelagia MutakeChihera Nisha MusaThemba The Honourable Tanyah TsotsiClara and Kate musicTholakele Ruteno NgcoboOur Care Home  Gain Healthcare Vatete YeuBrian Marlon KaswaSheila Bvuurr-GaynorearGROUND AFRICATilder Live ZimZimEyeEzra Tshisa SibandaLatria BluesDJ MelDJ Sanchez africaEmpres TrishaKikky BadassShashlChipaz PromotionsFeli Nandi ChipendoTapiwanache ChdukaAll Zimbabweans in UKKiller T\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The much-anticipated Winky D DiBigman event held on December 21, 2024, in Birmingham promised a night of electrifying entertainment, and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/winky-ds-birmingham-night-of-energy-and-reflection-review-by-mr-smooth/\">Continue reading<span class=\"screen-reader-text\"> \"Winky D’s Birmingham Night of Energy and Reflection: Review By Mr Smooth\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Daylight Robbery at Chikurubi Prison",
            "url": "https://www.zimeye.net/2024/12/24/daylight-robbery-at-chikurubi-prison/",
            "content": "By A Correspondent\n\nIn a shocking incident, a 26-year-old prison officer, Tafadzwa Finani, was attacked and robbed while on duty at Chikurubi Female Prison. The armed robber, wielding an iron bar, struck Finani twice, causing her to collapse and lose some front teeth.\n\nThe incident occurred around 10 am when Finani was guarding the prison garden. The robber demanded she hand over her valuables, making off with her Samsung A03 cellphone and US$260 in cash. He escaped into the nearby bush, leaving Finani to be rushed to the hospital.\n\nHarare Deputy Provincial Police Spokesperson Assistant Inspector Faith Mapisa confirmed the incident, stating that police are investigating an armed robbery case. The total value of stolen goods amounts to US$360 .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a shocking incident, a 26-year-old prison officer, Tafadzwa Finani, was attacked and robbed while on duty … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/daylight-robbery-at-chikurubi-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Daylight Robbery at Chikurubi Prison\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Mutsvangwa’s A Sophistical 2030 Rhetorician",
            "url": "https://www.zimeye.net/2024/12/24/mutsvangwas-a-sophistical-2030-rhetorician/",
            "content": "AN OPINION\n\nTHIRD TERM AGENDA\n\nBy Reason Wafawarova\n\nThe nefarious claim that there is such a thing as a ZANU PF Bulawayo Conference Resolution endorsing a Third Term for President ED Mnangagwa is playing the fandango dance with facts.\n\nIt is based on a farrago of confusion created by the puerile exuberance of vainglorious verbosity by the likes of Cde Christopher Mutsvangwa and adopted for magnification by isolated political desperados like Supa Mandiwanzira; and this has created a phantasmagoria of conflicting images of an imaginary illusory visionary leader being raucously pushed into office against his will by a mesmerised populace  itself a dreamland illusion around an unassuming President whose departure is most certainly the most awaited for thing ever to happen to Zimbabwean humanity.\n\nCde Mutsvangwa is a sophistical rhetorician often inebriated with the exuberance of his own verbosity, most of the time drawing at the thread of his verbosity finer than the staple of his argument, certainly providing to his listeners more comical entertainment than information.\n\nHe just told us that he was the indisputable arbiter of intellectual excellence at the war rear in Mozambique when he joined in the middle of the armed struggle in 1975, and his academic accolade was dropping out of university to join the village herdboys in fighting down the colonial empire.\n\nLet me not digress. All that happened in Bulawayo is Obert Mpofu calling Goodwills Masimirembwa to greet delegates on behalf of Harare Province. Masimirembwa then added to his slogan 2030 VaMnangagwa vanenge vachipo! The chant was then repeated by provincial chairpersons from Mashonaland East, Mashonaland West, Masvingo, Matebeleland North, Matebeleland South and the Midlands.\n\nIt is this comical sloganeering drama that is being elevated to the level of a conference resolution, clearly taking ordinary ZANU PF members who did not attend the conference for manipulable fools.\n\nThere was no unanimity in Bulawayo, and that is why Patrick Chinamasa cleared the air by saying the matter of a third term did not arise because it essentially was a national referendum matter, not a partisan agenda.\n\nHave a good day fellow Zimbabweans as we watch this foolishly organised choreography celebrated by its inner circle foot soldiers as a complex political strategy  mooted by half drunk half a dozen men at a certain farm in KweKwe some time in 2023.\n\nKwedu Classics\n\nYour story our story\n\nReason Wafawarova\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "WHEN MEER SLOGANS ARE ELEVATED TO CONFERENCE RESOLUTIONS AN OPINION THIRD TERM AGENDA  By Reason Wafawarova The nefarious claim that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/mutsvangwas-a-sophistical-2030-rhetorician/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa’s A Sophistical 2030 Rhetorician\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Mnangagwa Performs U-turn On Mugabe Liberation War Credentials",
            "url": "https://www.zimeye.net/2024/12/24/mnangagwa-performs-u-turn-on-mugabe-liberation-war-credentials/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has made a significant shift in his stance on Robert Mugabes role in Zimbabwes liberation war. Previously, Mnangagwa had downplayed Mugabes contributions, but on Sunday, he acknowledged the late leaders efforts in promoting national unity.\n\nMnangagwas change of heart was evident in his speech commemorating the 37th anniversary of the Unity Accord, a landmark agreement signed by Mugabe and Joshua Nkomo that paved the way for peace, stability, and unity in Zimbabwe. Mnangagwa recognized the significance of this accord, calling it a cornerstone of Zimbabwes national identity and progress .\n\nIn his address, Mnangagwa emphasized the importance of unity, urging Zimbabweans to reject division, tribalism, and self-hate. He also highlighted the governments efforts to translate the principles of unity into tangible progress through grassroots development, land empowerment initiatives, and the pursuit of Vision 2030.\n\nThis shift in Mnangagwas stance may be seen as an attempt to heal old wounds and promote national unity, especially on the anniversary of the Unity Accord.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has made a significant shift in his stance on Robert Mugabe’s role in Zimbabwe’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/mnangagwa-performs-u-turn-on-mugabe-liberation-war-credentials/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Performs U-turn On Mugabe Liberation War Credentials\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Veteran Musician Clive Malunga Says Zanu PF Agents Intimidating Him",
            "url": "https://www.zimeye.net/2024/12/24/veteran-musician-clive-malunga-says-zanu-pf-agents-intimidating-him/",
            "content": "By A Correspondent\n\nVeteran musician and liberation war hero Clive Malunga has accused Zanu PF agents of intimidating him after he criticized President Emmerson Mnangagwas Vision 2030 plan.\n\nSpeaking out over the weekend, Malunga boldly predicted that Mnangagwa would not remain in power beyond 2028, citing increasing political tensions and Zimbabwes deepening economic crisis.\n\nFollowing my recent submission about Mnangagwas 2030 issue, some Zanu PF agents are criticizing and intimidating me for exercising my democratic right to freedom of expression, Malunga posted on X (formerly Twitter).\n\nBut Ill never withdraw, and thats it. Im ready to stand my ground against anything that comes my way.\n\nMalunga, a vocal critic of the current regime, went further in his condemnation of the president.\n\nYes, I clearly said itMnangagwa wont see 2030 or even 2026 because he isnt God, and he wasnt appointed by God to be President of Zimbabwe, he stated.\n\nIn fact, Mnangagwa is a useless coward. Ive got nothing to fear, and here is meZimbabwe is boiling while hes busy creating his dynasty. To hell with him.\n\nMalungas comments highlight growing discontent with the governments leadership amidst ongoing challenges facing the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran musician and liberation war hero Clive Malunga has accused Zanu PF agents of intimidating him after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/veteran-musician-clive-malunga-says-zanu-pf-agents-intimidating-him/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran Musician Clive Malunga Says Zanu PF Agents Intimidating Him\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        },
        {
            "title": "Mozambique Night Demos Over “Election Rigging”",
            "url": "https://www.zimeye.net/2024/12/24/mozambique-night-demos-over-election-rigging/",
            "content": "Below are various videos posted by activists inside Mozambique on Monday night, soon after the announcement of contested election results whose pronouncement has triggered demonstrations across the country after Frelimo partys Daniel Chapo who was congratulated pre-emptively by Emmerson Mnangagwa last month was declared winner.\n\nFrelimo headquarters in Lugela, Zambzia province set on fire#FreeMozambique#MozambiqueProtestspic.twitter.com/Z9ZGja46sa\n\nRomoza Quelimane interprovincial transport terminal, Zambzia province pic.twitter.com/ylTIHXoVp6\n\nThe city of Beira at the moment!Similarly, other cities in Tete are under tension.#MozambiqueElections#MozambiqueProtestspic.twitter.com/zgK1Fll0tr\n\nThe city of Beira at the moment!Similarly, other cities in Tete are under tension.#MozambiqueElections#MozambiqueProtestspic.twitter.com/zgK1Fll0tr\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Below are various videos posted by activists inside Mozambique on Monday night, soon after the announcement of contested election results … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/24/mozambique-night-demos-over-election-rigging/\">Continue reading<span class=\"screen-reader-text\"> \"Mozambique Night Demos Over “Election Rigging”\"</span></a></p>",
            "time": "06:09",
            "date": "24 Dec 2024"
        }
    ]
}