{
    "news": [
        {
            "title": "Police Confirm The Death Of 12 People Near Mnangagwa Farm",
            "url": "https://www.zimeye.net/2025/05/27/police-confirm-the-death-of-12-people-near-mnangagwa-farm/",
            "content": "By A Correspondent The Zimbabwe Republic Police has confirmed the death of 12 people following a horrific road traffic accident involving a fuel tanker, a pirate taxi (commonly known as amushikashika), and a small lorry near Sebakwe River in Kwekwe on Monday.\n\nThe deadly collision occurred along the Harare-Bulawayo Highway, just under 20kilometresnortheast of the Sebakwe River bridge, near the turn-off to Precabe FarmPresident Emmerson Mnangagwas privately owned agricultural estate.\n\nThe farm, located approximately 17km from the river when travelling toward Harare from Kwekwe, has long been associated with the presidents business interests in livestock and crop production.\n\nAccording to eyewitnesses, the three vehicles were travellingin close proximitywhen the crash occurred.\n\nIt is alleged that one vehicleattempted a risky overtakingmanoeuvre, triggering a chain reaction that led to the deadly pile-up.The presence of the fuel tanker significantly worsened the impact, with all three vehicles sustaining extensive damage.\n\nPrecabe Farm, owned by Mnangagwa since the late 1980s, has been a subject of public interest for years due to its strategic location along one of Zimbabwes busiest highways and its proximity to key transport routes.\n\nThe site of Mondays accident lies in a known trafficblackspot, where reckless driving and overloaded vehicles are a regular occurrence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– The Zimbabwe Republic Police has confirmed the death of 12 people following a horrific road traffic accident … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/police-confirm-the-death-of-12-people-near-mnangagwa-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Police Confirm The Death Of 12 People Near Mnangagwa Farm\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Chaos at Celebrations: Car Rams Into Liverpool FC Victory Parade Crowd, 65 Injured, Man Arrested",
            "url": "https://www.zimeye.net/2025/05/27/chaos-at-celebrations-car-rams-into-liverpool-fc-victory-parade-crowd-65-injured-man-arrested/",
            "content": "By A Correspondent\n\nA joyous occasion in Liverpool quickly turned into a scene of chaos and horror as a car ploughed into a crowd of celebrating football fans during Liverpool FCs Premier League victory parade. The incident, which occurred around 6pm on Monday, has left 65 people injured11 of whom remain hospitalizedprompting a major police investigation and widespread public concern.\n\nMerseyside Police confirmed the arrest of a 53-year-old man from West Derby on suspicion of attempted murder, dangerous driving, and drug-driving. He remains in custody and is being questioned by detectives. The suspect is believed to have tailgated an ambulance onto Water Street after security barriers were momentarily lifted to allow emergency responders through to aid a man suffering a suspected heart attack.\n\nThe temporary removal of the robust traffic controls in place for the parade has raised serious questions, with Liverpool Mayor Steve Rotheram calling for an urgent review of how the vehicle was able to access a restricted area teeming with fans.\n\nEyewitness accounts depict a terrifying moment. Fan Alex Todd, who was near the crash site, described the chaos as people surged into nearby businesses for safety. My little sister burst into tearsshe had been only a few metres from the car, he said.\n\nFour children were among those injured. The governments Criminal Injuries Compensation Authority (CICA) has opened access for victims to apply for support under the Criminal Injuries Compensation Scheme 2012.\n\nPolice have launched a comprehensive investigation, including reviewing CCTV footage and speaking with numerous witnesses and emergency responders. Detective Chief Superintendent Karen Jaundrill said, We are trying to get a full picture of exactly what happened.\n\nThe swift response of Merseyside Police and the North Western Ambulance Service has been widely praised. Assistant Chief Constable Jenny Simms commended emergency workers for running toward the danger to assist the injured. Their bravery and quick action undoubtedly prevented a more tragic outcome, she said.\n\nThe incident is not being treated as terrorism. However, it has prompted a complete step change in how police share information with the public, according to experts, drawing comparisons to previous criticisms around communication following other major incidents in the region.\n\nAs investigations continue, the community of Liverpooland the broader football worldremain united in shock and support. Former Liverpool captain Steven Gerrard expressed his sentiments, saying he was shocked, sickened and saddened by what transpired.\n\nWith the city still reeling, the focus now turns to accountability, recovery, and ensuring such a tragedy does not happen again during public celebrations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A joyous occasion in Liverpool quickly turned into a scene of chaos and horror as a car … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/chaos-at-celebrations-car-rams-into-liverpool-fc-victory-parade-crowd-65-injured-man-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos at Celebrations: Car Rams Into Liverpool FC Victory Parade Crowd, 65 Injured, Man Arrested\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Several Feared Dead In Crash Near Mnangagwa’s Precabe Farm",
            "url": "https://www.zimeye.net/2025/05/27/several-feared-dead-in-crash-near-mnangagwas-precabe-farm/",
            "content": "By A Correspondent Several people are feared dead following a horrific road traffic accident involving a fuel tanker, a pirate taxi (commonly known as amushikashika), and a small lorry near Sebakwe River in Kwekwe on Monday.\n\nThe deadly collision occurred along the Harare-Bulawayo Highway, just under 20 kilometres northeast of the Sebakwe River bridge, near the turn-off to Precabe FarmPresident Emmerson Mnangagwas privately-owned agricultural estate. The farm, located approximately 17km from the river when travelling toward Harare from Kwekwe, has long been associated with the presidents business interests in livestock and crop production.\n\nAccording to eyewitnesses, the three vehicles were travelling in close proximity when the crash occurred. It is alleged that one vehicle attempted a risky overtaking manoeuvre, triggering a chain reaction that led to the deadly pile-up. The presence of the fuel tanker significantly worsened the impact, with all three vehicles sustaining extensive damage.\n\nAuthorities had yet to release the exact death toll at the time of publishing, but emergency services remained at the scene late into the afternoon, with bodies reportedly being retrieved from the mangled wreckage.\n\nPrecabe Farm, owned by Mnangagwa since the late 1980s, has been a subject of public interest for years due to its strategic location along one of Zimbabwes busiest highways and its proximity to key transport routes. The site of Mondays accident lies in a known traffic blackspot, where reckless driving and overloaded vehicles are a regular occurrence.\n\nPolice are expected to issue a formal statement once families have been notified.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– Several people are feared dead following a horrific road traffic accident involving a fuel tanker, a pirate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/several-feared-dead-in-crash-near-mnangagwas-precabe-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Several Feared Dead In Crash Near Mnangagwa’s Precabe Farm\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Musona Inspires Al-Okhdood’s Last-Gasp Saudi League Survival",
            "url": "https://www.zimeye.net/2025/05/27/musona-inspires-al-okhdoods-last-gasp-saudi-league-survival/",
            "content": "Sports Correspondent\n\nZimbabwean forward Knowledge Musona played a key role as Al-Okhdood secured their place in the Saudi Pro League with a dramatic 3-2 comeback win over Al-Khaleej in their final match of the season on Monday.\n\nHeading into the game needing both a win and a favourable result elsewhere, Al-Okhdood left it late but delivered when it mattered. The team was trailing 2-1 in the 90th minute, but two late goals during an extended 20-minute stoppage time period sealed the stunning victory.\n\nThe result, combined with a crucial loss for relegation rivals Al-Wehda, ensured Al-Okhdood finished 15thjust one place above the drop zone.\n\nMusona, a consistent presence throughout the season, provided the assist for Al-Okhdoods first goal before being substituted in the 74th minute. His influence extended beyond the final day, as he also assisted in their previous matcha contribution that proved vital in the clubs survival.\n\nThe former Warriors captains leadership and creativity were instrumental in helping Al-Okhdood escape relegation in a dramatic end to their campaign.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean forward Knowledge Musona played a key role as Al-Okhdood secured their place in the Saudi Pro League … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/musona-inspires-al-okhdoods-last-gasp-saudi-league-survival/\">Continue reading<span class=\"screen-reader-text\"> \"Musona Inspires Al-Okhdood’s Last-Gasp Saudi League Survival\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Nees Names Warriors Squad for June Friendlies",
            "url": "https://www.zimeye.net/2025/05/27/nees-names-warriors-squad-for-june-friendlies/",
            "content": "Sports Correspondent\n\nWarriors coach Michael Nees has unveiled a youthful and experimental Zimbabwe national team squad ahead of upcoming international friendlies against Burkina Faso and Niger, scheduled for June 6 and 10 in Morocco.\n\nThe selection is notable for the absence of several senior players, with Nees choosing to rest key figures such as Andy Rinomhota, Marshall Munetsi, Knowledge Musona, and Tivonge Rushesha. Midfielder Marvelous Nakamba, who has recently returned to full fitness, has also been left out of the squad.\n\nIn their place, the coach has recalled goalkeeper Elvis Chipezeze and midfielder Jonah Fabisch, while forwards Tinotenda Kadewere and Bill Antonio return after recovering from injury.\n\nA major highlight is the first national team call-up for 19-year-old Sheffield Wednesday prospect Sean Fusire. Born in the UK to Zimbabwean parents, Fusire has pledged his allegiance to the Warriors, adding fresh energy to Neess transitional setup.\n\nThe squad reflects a focus on building depth and exploring new combinations as Zimbabwe prepares for upcoming competitions.\n\nFull Squad:\n\nGoalkeepers:Washington Arubi (Marumo Gallants), Elvis Chipezeze (Magesi), Marley Tavaziva (Brentford)\n\nDefenders:Teenage Hadebe (Cincinnati), Gerald Takwara (Al Minaa SC), Munashe Garananga (FC Copenhagen), Isheanesu Mauchio (Simba Bhora), Peter Muduhwa (Scotland), Godknows Murwira (Scotland), Emmanuel Jalai (Dynamos)\n\nMidfielders:Mthokozisi Msebe (Scotland), Khama Billiat (Scotland), Richard Hachiro (Ngezi Platinum), Jonah Fabisch (FC Aue), Donald Mudadi (Simba Bhora), Sean Fusire (Sheffield Wednesday), Daniel Msendami (Marumo Gallants), Bill Antonio (K.V. Mechelen)\n\nForwards:Prince Dube (Young Africans), Tawanda Maswanhise (Motherwell), Walter Musona (Scotland), Tawanda Macheke (TelOne FC), Tino Kadewere (Nantes)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors coach Michael Nees has unveiled a youthful and experimental Zimbabwe national team squad ahead of upcoming international … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/nees-names-warriors-squad-for-june-friendlies/\">Continue reading<span class=\"screen-reader-text\"> \"Nees Names Warriors Squad for June Friendlies\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Relief As Opposition MP Donates Furniture To Government School…",
            "url": "https://www.zimeye.net/2025/05/27/relief-as-opposition-mp-donates-furniture-to-government-school/",
            "content": "By A Correspondent -A storm is brewing at Ndarama High School after its headmaster, Oddy Matongo, came under fire for accepting a furniture donation from Masvingo Urban MP Advocate Martin Mureri, a member of the opposition Citizens Coalition for Change (CCC).\n\nWhile the donation  40 chairs and 40 desks sourced through the Constituency Development Fund (CDF)  was well-received by staff and students during a handover ceremony last week, sources at the school say senior ZANU PF officials in the province were enraged by the move.\n\nThe backlash, insiders reveal, has created tension between the school administration and ruling party figures, who reportedly claim the gesture undermines political protocol.\n\nThere is pressure from ZANU PF officials who feel the school has crossed a line by accepting help from an opposition MP without prior clearance. They are accusing the headmaster of promoting a political agenda, said a staff member at Ndarama who requested anonymity for fear of reprisal.\n\nThe donation followed an appeal by Matongo to the legislator, citing a critical shortage of desks that had left several students learning while seated on the floor. Mureri, speaking at the event, promised to provide an additional 14 chairs to cover the remaining shortfall.\n\nWe are here to serve our communities. Education should never be a victim of differences. Ndarama High School is well-known for excellence, Mureri said at the ceremony, which was attended by Deputy Mayor Daniel Mberikunashe and school development committee members.\n\nDespite this, school sources say the backlash from local political heavyweights has been swift and unforgiving, with attempts allegedly being made to summon Matongo for a disciplinary hearing and threats of administrative interference now looming.\n\nThis has become a political minefield, said a teacher at the school. We just want support for our learners, no matter where it comes from. But now the head is being treated like he committed a crime.\n\nEducation analysts have criticised the politicisation of development efforts in schools, arguing that such donations should be welcomed regardless of the donors political affiliation.\n\nIts disappointing to see education being weaponised, said one education policy expert.\n\nWe should be celebrating leaders who respond to community needs, not punishing them.\n\nFor now, the furniture remains in use at Ndarama High  but the controversy it sparked underscores the delicate balancing act educators must navigate in Zimbabwes highly politicised public sector.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent -A storm is brewing at Ndarama High School after its headmaster, Oddy Matongo, came under fire for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/relief-as-opposition-mp-donates-furniture-to-government-school/\">Continue reading<span class=\"screen-reader-text\"> \"Relief As Opposition MP Donates Furniture To Government School…\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Woman Kills Husband After Catching Him With Ex-Lover",
            "url": "https://www.zimeye.net/2025/05/27/woman-kills-husband-after-catching-him-with-ex-lover/",
            "content": "By A Correspondent\n\nA 25-year-old Mwenezi woman, Daisy Makanaka Moyo, has been sentenced to four years in prison after being convicted of culpable homicide for fatally stabbing her husband, Talent Golden Masuku (40), in a violent confrontation.\n\nThe High Court in Masvingo, presided over by Justice Sunsley Zisengwe, found that Moyo acted in a moment of emotional turmoil after discovering Masuku spending the night with his ex-wife, Shingirai Mativenga (44).\n\nThe court ruled the act as a crime of passion, citing Moyos visible remorse at the scene, where she reportedly knelt beside her husbands lifeless body and repeatedly called his name in an attempt to wake him.\n\nThe incident took place on July 10, 2024, at the homestead of Obey Matutu in Negari, Mwenezi, where Masuku and Mativenga had spent the night after reconnecting at a local business centre.\n\nThe two, who have three children, had recently rekindled their relationship following a year-long separation.\n\nAccording to testimony, Moyo tracked the couple to their location and confronted them early the following morning. She struck Mativenga with a log on the head and bit her under the chin before Masuku intervened to stop the assault. In the struggle that followed, Moyo turned on Masuku, striking him with the same log and fatally stabbing him in the back with a kitchen knife.\n\nRealising the gravity of her actions, Moyo reportedly tried to revive her husband and later threatened to attack Mativenga again.\n\nDuring the trial, Moyo claimed the stabbing occurred during a physical struggle and was not premeditated.\n\nThe matter was reported to police, and Masukus body was taken to Mwenezi District Hospital.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 25-year-old Mwenezi woman, Daisy Makanaka Moyo, has been sentenced to four years in prison after being … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/woman-kills-husband-after-catching-him-with-ex-lover/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Kills Husband After Catching Him With Ex-Lover\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Sad : 13 Feared Dead In Mushikashika , Fuel Tanker Crash",
            "url": "https://www.zimeye.net/2025/05/27/sad-13-feared-dead-in-mushikashika-fuel-tanker-crash/",
            "content": "By A Correspondent\n\nA devastating road traffic accident has occurred near the Sebakwe River in Kwekwe.\n\nThe people are feared dead \n\nThe accident involved a fuel tanker, a pirate taxi (mushikashika), and a small lorry.\n\nAccording to eyewitnesses, the collision happened when the vehicles were travelling in close proximity to each other.\n\nThe impact of the crash caused significant damage to all three vehicles, with the fuel tanker likely exacerbating the severity of the accident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating road traffic accident has occurred near the Sebakwe River in Kwekwe. The people are feared … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/sad-13-feared-dead-in-mushikashika-fuel-tanker-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Sad : 13 Feared Dead In Mushikashika , Fuel Tanker Crash\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "South African Actor Presley has died",
            "url": "https://www.zimeye.net/2025/05/27/south-african-actor-presily-dies/",
            "content": "    ,       -  ,       .\n\nHe rose to global fame in 2005 and later starred in hit TV drama The River as Cobra.Chweneyagae had recently hinted at retiring from acting to pursue other ventures.His death is a great loss to South African film and theatre.Source: Newzroom Afrika\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "𝐒𝐨𝐮𝐭𝐡 𝐀𝐟𝐫𝐢𝐜𝐚𝐧 𝐚𝐜𝐭𝐨𝐫 𝐏𝐫𝐞𝐬𝐥𝐞𝐲 𝐂𝐡𝐰𝐞𝐧𝐞𝐲𝐚𝐠𝐚𝐞, 𝐟𝐚𝐦𝐞𝐝 𝐟𝐨𝐫 𝐡𝐢𝐬 𝐫𝐨𝐥𝐞 𝐢𝐧 𝐭𝐡𝐞 𝐎𝐬𝐜𝐚𝐫-𝐰𝐢𝐧𝐧𝐢𝐧𝐠 𝐟𝐢𝐥𝐦 𝐓𝐬𝐨𝐭𝐬𝐢, 𝐡𝐚𝐬 𝐝𝐢𝐞𝐝 𝐚𝐭 𝐭𝐡𝐞 𝐚𝐠𝐞 𝐨𝐟 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/south-african-actor-presily-dies/\">Continue reading<span class=\"screen-reader-text\"> \"South African Actor Presley has died\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        },
        {
            "title": "Teachers Abandon Captured ZIMTA",
            "url": "https://www.zimeye.net/2025/05/27/teachers-abandon-captured-zimta/",
            "content": "By A Correspondent\n\nThe Zimbabwe Teachers Association (ZIMTA), the countrys oldest and once most influential teachers union, is facing growing dissatisfaction from educators who accuse it of being aligned with the ruling regime and failing to champion their plight.\n\nAcross the education sector, many teachers are reportedly cutting ties with the union, citing its perceived failure to fight for fair salaries and better working conditions, despite consistently deducting monthly union dues from their salaries.\n\nEducators argue that ZIMTA has grown increasingly detached from the realities faced by its members, accusing its leadership of living comfortably off union subscriptions while ordinary teachers remain trapped in poverty.\n\nThe growing sentiment is that the union has lost its independence and is no longer a credible voice for the teaching profession.\n\nMany teachers are now encouraging one another to terminate their membership and halt salary deductions to the union, using publicly available links shared via social media platforms to opt out.\n\nThey say its no longer viable to continue funding an organisation they believe has become ineffective and compromised.\n\nWere tired of feeding a system that doesnt serve us, said one teacher who spoke on condition of anonymity. We are better off using that money to buy basics rather than funding leaders who are silent while we starve.\n\nWhile ZIMTA has publicly denied the allegations of being captured or losing members en masse, insisting that any claims of mass resignations are driven by social media misinformation, the mood among teachers tells a different story.\n\nEducators are also expressing mounting frustration over their stagnant salaries, which remain far below the pre-2018 levels when they were earning around US$540 per month. With current earnings severely eroded by inflation and the depreciating local currency, many teachers now say industrial action is inevitable.\n\nPlans for a large-scale strike are reportedly gaining traction, with teachers threatening to paralyse the education sector until their demands are addressed.\n\nIf nothing changes soon, we are ready to shut down schools. This is no longer just about salariesits about restoring dignity to the teaching profession, said another teacher.\n\nShould the planned job action proceed, it could cause major disruptions to the school calendar and negatively affect student performance and national exam pass rates, further deepening the crisis in Zimbabwes education system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Teachers Association (ZIMTA), the country’s oldest and once most influential teachers’ union, is facing growing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/27/teachers-abandon-captured-zimta/\">Continue reading<span class=\"screen-reader-text\"> \"Teachers Abandon Captured ZIMTA\"</span></a></p>",
            "time": "09:46",
            "date": "28 May 2025"
        }
    ]
}