{
    "news": [
        {
            "title": "Bullets Part Ways with Pasuwa",
            "url": "https://www.zimeye.net/2024/12/28/bullets-part-ways-with-pasuwa/",
            "content": "By Sports Correspondent\n\nNyasa Big Bullets FC have opted not to renew the contract of Zimbabwean coach Kalisto Pasuwa, which is set to expire on December 31.\n\nThis decision follows Pasuwas inability to defend three out of the four trophies the team secured last year.\n\nA club official has confirmed that Pasuwa was informed of the decision last month, and his contract will not be extended.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Nyasa Big Bullets FC have opted not to renew the contract of Zimbabwean coach Kalisto Pasuwa, which … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/bullets-part-ways-with-pasuwa/\">Continue reading<span class=\"screen-reader-text\"> \"Bullets Part Ways with Pasuwa\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Accidents: 77 Killed",
            "url": "https://www.zimeye.net/2024/12/28/accidents-77-killed/",
            "content": "Harare, December 28, 2024 At least 77 people have lost their lives, and 401 others were injured in 1,211 road traffic accidents recorded across Zimbabwe during the holiday period from December 15 to yesterday, according to the Zimbabwe Republic Police (ZRP).\n\nThe grim statistics show an increase in fatalities compared to the same period last year when 71 people were killed and 393 others injured in 1,454 accidents.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi attributed many of the accidents to driver fatigue and negligence. Most road traffic accidents involved private vehicles where either drivers or passengers perished. The only major road traffic accident involving public service vehicles was recorded on December 22, 2024, when three buses collided, resulting in two fatalities, Comm Nyathi said.\n\nDaily Toll Highlights\n\nDecember 22, 2024: 106 accidents recorded, with seven fatalities and 38 injuries.\n\nChristmas Day: 104 accidents, leaving 13 dead and 16 injured.\n\nDecember 26, 2024: 87 accidents, resulting in 11 deaths and 40 injuries.\n\nComm Nyathi also highlighted an alarming trend of pedestrian-related accidents, emphasizing the need for drivers to be cautious, especially in built-up areas and residential zones.\n\nSafety Appeal to Motorists\n\nThe ZRP reiterated its call for motorists to adhere to road regulations, urging them to avoid speeding, reckless overtaking, and overloading vehicles. Above all, motorists are implored not to overload vehicles when travelling on the countrys roads. Errant drivers should be reported to the nearest police station or the National Complaints Desk, Comm Nyathi said, providing the hotline number 0242 703631 and WhatsApp line 0712 800 197 for public use.\n\nEnhanced Police Deployment\n\nTo ensure peace and safety during the festive season, the ZRP has increased its presence on major roads, residential areas, and public gathering spots. Measures include heightened roadblocks, traffic blitzes, and both motorized and cycle patrols.\n\nPolice have also issued a stern warning to motorcyclists riding without helmets and those carrying passengers unsafely. Crackdowns are underway on individuals involved in drug and substance abuse, as well as those violating regulations on fireworks and other celebratory gadgets.\n\nCall for Responsibility\n\nComm Nyathi urged transport operators and the general public to prioritize safety and security during the holiday period. As we approach the New Year celebrations, we call on all stakeholders to adhere to the law to ensure a peaceful and safe environment for everyone, he said.\n\nThe ZRP remains committed to enforcing road safety measures and maintaining public order as the festive season continues.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, December 28, 2024 – At least 77 people have lost their lives, and 401 others were injured in 1,211 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/accidents-77-killed/\">Continue reading<span class=\"screen-reader-text\"> \"Accidents: 77 Killed\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "No Mercy For Paedophiles",
            "url": "https://www.zimeye.net/2024/12/28/no-mercy-for-paedophiles/",
            "content": "By A Correspondent\n\nThe courts are sending a strong message to paedophiles who destroy childrens lives, with the recent incarceration of two men who were convicted and sentenced to 20 years imprisonment each. Protecting children against paedophiles is being prioritised by the courts, with lengthy custodial sentences being handed down.\n\nIn one recent case, a 32-year-old man was sentenced to 20 years in prison for raping his four-year-old niece. The abuse was reported by a neighbour who overheard the child telling a friend about the incident, leading to the mans arrest.\n\nAnother case involved a 24-year-old man from Mutare who was sentenced to 20 years in prison for drugging and raping a nine-year-old girl in his car. The offender kidnapped the child, forced her to drink alcohol, and then raped her. The girls mother discovered the abuse after noticing that her child had contracted a sexually transmitted disease.\n\nIn a particularly disturbing case, a 23-year-old man was arrested and arraigned in court for allegedly raping his one-year-old daughter. The man was left babysitting while his wife carried out household chores, and it is alleged that he removed the babys diaper and raped her once. The childs mother discovered the abuse when she entered the room and found her child lying on the floor, bleeding with her diaper removed. The accused was remanded in custody pending his trial, set for next month.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The courts are sending a strong message to paedophiles who destroy children’s lives, with the recent incarceration … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/no-mercy-for-paedophiles/\">Continue reading<span class=\"screen-reader-text\"> \"No Mercy For Paedophiles\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Mnangagwa “Plots ” Chiwenga Ouster",
            "url": "https://www.zimeye.net/2024/12/28/mnangagwa-plots-chiwenga-ouster/",
            "content": "By A Correspondent\n\nZimbabwean President Emmerson Mnangagwa has indicated that significant changes are on the horizon, with a Cabinet reshuffle expected soon.\n\nThe Zanu PF leader made these remarks during a recent interview with ZBC News at State House.\n\nSources suggest that Mnangagwa is preparing to restructure his Cabinet to reduce the influence of those perceived to be loyal to his deputy, Constantino Chiwenga.\n\nThis move is seen as part of an ongoing power struggle within the ruling party.\n\nNdiri kumirira kuti vanhu vapedze kufara ndozovaudza vanofanira kudzoka kubasa nevanofanira kugara kumba depending ne performance, Mnangagwa stated in the interview. In English, he said, I am waiting for people to finish celebrating, then I will tell them who should return to work and who should stay at home, depending on performance.\n\nThis statement has fuelled speculation that the reshuffle may be a calculated move to strengthen Mnangagwas grip on both the party and government by sidelining those whose allegiance may lie with Chiwenga.\n\nTensions have reportedly been rising within Zanu PF, with various factions vying for power and influence following the 2023 elections.\n\nAdditionally, with constitutional provisions stating that Mnangagwa is not expected to remain in office beyond 2028, these moves could also be seen as preparations for a transition of leadership.\n\nAs Zimbabweans await the reshuffle, Mnangagwas comments have set the stage for potential political shifts, with many closely monitoring the developments within the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean President Emmerson Mnangagwa has indicated that significant changes are on the horizon, with a Cabinet reshuffle … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/mnangagwa-plots-chiwenga-ouster/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa “Plots ” Chiwenga Ouster\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Courts Clamp Down on Paedophiles…",
            "url": "https://www.zimeye.net/2024/12/28/courts-clamp-down-on-paedophiles/",
            "content": "By A Correspondent\n\nThe courts are sending a strong message to paedophiles who destroy childrens lives, with the recent incarceration of two men who were convicted and sentenced to 20 years imprisonment each.\n\nProtecting children against paedophiles is being prioritised by the courts, with lengthy custodial sentences being handed down.\n\nIn one recent case, a 32-year-old man was sentenced to 20 years in prison for raping his four-year-old niece.\n\nThe abuse was reported by a neighbour who overheard the child telling a friend about the incident, leading to the mans arrest.\n\nAnother case involved a 24-year-old man from Mutare who was sentenced to 20 years in prison for drugging and raping a nine-year-old girl in his car.\n\nThe offender kidnapped the child, forced her to drink alcohol, and then raped her. The girls mother discovered the abuse after noticing that her child had contracted a sexually transmitted disease.\n\nIn a particularly disturbing case, a 23-year-old man was arrested and arraigned in court for allegedly raping his one-year-old daughter.\n\nThe man was left babysitting while his wife carried out household chores, and it is alleged that he removed the babys diaper and raped her once.\n\nThe childs mother discovered the abuse when she entered the room and found her child lying on the floor, bleeding with her diaper removed. The accused was remanded in custody pending his trial, set for next month.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The courts are sending a strong message to paedophiles who destroy children’s lives, with the recent incarceration … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/courts-clamp-down-on-paedophiles/\">Continue reading<span class=\"screen-reader-text\"> \"Courts Clamp Down on Paedophiles…\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Zim Veteran Batsman Shines",
            "url": "https://www.zimeye.net/2024/12/28/zim-veteran-batsman-shines/",
            "content": "Sports Correspondent\n\nZimbabwe delivered a commanding performance on the opening day of the Boxing Day Test against Afghanistan, finishing at 363 for 4 at Queens Sports Club on Thursday.\n\nVeteran batsman Sean Williams notched his fifth Test century, leading the charge for the hosts. Playing at his home ground, Williams showcased his full range of shots on a wicket that offered some turn. He utilized excellent footwork to dominate Afghanistans bowlers throughout the day.\n\nWilliams formed a crucial 143-run partnership for the sixth wicket with captain Craig Ervine, who was unbeaten on 56 at stumps.\n\nEarlier in the day, debutant Ben Curran provided a strong foundation for Zimbabwe with a quick-fire 64 off 71 balls. However, his opening partner, Joylord Gumbie, was dismissed early for 9. Takudzwanashe Kaitano made a solid start but was caught out for 45, while also providing vital support to Williams. Dion Myers added a brief but valuable cameo as well.\n\nZimbabwe made three debutants for the match  opening batsman Ben Curran, and bowlers Newman Nyamhuri and Trevor Gwandu  while veterans Victor Nyauchi and Richard Ngarava were left out.\n\nWith a strong foundation laid, Zimbabwe will look to build a significant total on day two before inviting Afghanistan to bat.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe delivered a commanding performance on the opening day of the Boxing Day Test against Afghanistan, finishing at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/zim-veteran-batsman-shines/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Veteran Batsman Shines\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Zimbabwe to Introduce Parole System in Effort to Decongest Prisons",
            "url": "https://www.zimeye.net/2024/12/28/zimbabwe-to-introduce-parole-system-in-effort-to-decongest-prisons/",
            "content": "By A Correspondent\n\nThe Zimbabwean government is set to introduce a parole system next year as part of efforts to reduce overcrowding in the countrys prisons. The local prison population currently stands at approximately 21,000, surpassing the facilities capacity of 17,000 inmates. In response, the government is developing strategies to improve prison conditions, aligning them with international standards.\n\nZimbabwe Prisons and Correctional Service (ZPCS) Commissioner General, Moses Chihobvu, confirmed that plans to implement the parole system are well advanced. The parole system is now at an advanced stage. What remains is benchmarking against countries with established programs and conducting awareness campaigns to inform the public, he stated.\n\nLegal experts have hailed the move as a significant step towards reforming the prison system, shifting the focus from punishment to rehabilitation and reintegration. According to lawyer Rungano Mahuni, the parole system allows offenders to serve part of their sentence before being considered for early release under specific conditions. This system offers inmates the opportunity to reintegrate into society while reducing the risk of further criminal behavior. When individuals spend time with habitual criminals in prison, it increases the likelihood of them adopting negative behaviors, Mahuni explained.\n\nAnother lawyer, Kudzai Tichawangana, added that the parole system would help alleviate prison overcrowding. After a thorough vetting process, deserving inmates could be granted early release, which would also create healthier conditions for those remaining in prison. Inmates would have the chance to return home and support their families while finishing their terms outside prison, Tichawangana said.\n\nThe proposed parole system would allow for the conditional early release of prisoners, subject to approval by the President, the State Parole Board, the Commissioner-General of Prisons, or the Minister of Prisons and Correctional Services. While on parole, prisoners will be supervised by parole officers but will enjoy more freedom and be allowed to return to their families. Key factors for consideration in granting parole include an inmates conduct, self-discipline, and industriousness while in prison.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwean government is set to introduce a parole system next year as part of efforts to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/zimbabwe-to-introduce-parole-system-in-effort-to-decongest-prisons/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe to Introduce Parole System in Effort to Decongest Prisons\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Venâncio Mondlane Latest Speech at 6pm Friday, “Arson, and Violence Is Being Done By Frelimo Govt | FULL TEXT",
            "url": "https://www.zimeye.net/2024/12/27/venancio-mondlane-latest-speech-at-6pm-friday-arson-and-violence-is-being-done-by-frelimo-govt-full-text/",
            "content": "Venncio Mondlane latest speech at 6pm Friday (transcribed by ZimEye)\n\nENGLISH  SHONA  PORTUGUESE\n\nAh, I understand what were going through. Good afternoon. Good afternoon, folks. Thank you very much. I see you here. Thank you. Good afternoon. How is your health? Cludia, Tom, Salgina, Vitor Machaba, Jssica Micas, Gildo, Livace, Confusothank you all very much. For those already connected to our live session, please share it with 30 or 40 people, or to 30 or 40 groups. Please share this, as today we have very important topics to discuss.\n\nWe are facing a critical situation in our country, and its essential to clarify the truth so people are not confused about the facts and what is happening to us Mozambicans. For those just joining, please share this live broadcast with at least 30 people. Share it with a minimum of 30 people so we can talk about Mozambique and its future.\n\nLets start. May God bless Mozambique and heal the wounds, pains, frustrations, tears, and dramas caused during this period of demonstrations, but especially over the years since God gave us an independent nation. May there be light for Mozambique, and may Mozambique truly become a great nation.\n\nWe now have 20,000 viewers live, so we can begin. What I want to talk about today is straightforward, broken into three points. First, there is no longer any doubtit is clear who the real murderer and terrorist of Mozambique is. It is none other than the Frelimo Party.\n\nThis truth has been revealed. Our peaceful protests have always targeted the institutions that manipulated election results and stole the peoples votes, not public or private property. During these peaceful protests, the police used tear gas, fired on demonstrators, and killed people. This is well-documented, from the earlier stages to the latest.\n\nCurrently, more than 4,000 people have been detained, and over 350 people have died. This ongoing repression shows who the true vandals and criminals are.\n\nThe situation has been manipulated. WhatsApp groups named SOS are spreading fake news about katana men in various neighborhoods. This is clearly a tactic to instill fear and distract us from the core issues: election fraud, justice, and accountability.\n\nThese so-called katana men are allegedly released from prison, armed, and directed to cause chaos. But this is not the work of protesters. It is manipulation by those in power. Why are these released prisoners targeting innocent neighborhoods instead of government institutions? This doesnt add up.\n\nMeanwhile, the policeso active against peaceful protestersnow claim to be powerless against these supposed katana (machete-violence) men. [The Katana men] This is manipulation to shift the narrative from electoral fraud to terrorism.\n\nThe international community is watching closely. News outlets like RTP, BBC, and Al Jazeera have highlighted the truth: Frelimo is orchestrating this chaos to distract and suppress dissent.\n\nWe are not fooled. The actions of vandalism, arson, and violence are not oursthey are tactics of the Frelimo government. Our fight remains focused on electoral justice and democracy.\n\nWe must stay united. Even though we face losses, we are close to a turning point. On Monday, we will announce decisive measures to intensify our struggle. This is the final phasethe tip of the spear.\n\nLet us not lose sight of our goals. This fight is not about destroying property; it is about truth, justice, and democracy. We aim to restore the rightful leadership of Mozambique.\n\nStay strong. Share this message widely. Monday will be a crucial day for our nation. Until then, let us remain focused and vigilant. May Mozambique emerge stronger and more united. A big hug and goodbye to all.- ZimEye\n\nSHONA:\n\nVenncio Mondlane Friday night 27 Dec 2024 speech- SHONA TRANSLATION:\n\n(ZimEye)Takatarisana nemamiriro ezvinhu akaoma munyika medu, uye zvakakosha kujekesa chokwadi kuti vanhu vasavhiringika pamusoro pechokwadi uye zviri kuitika kwatiri isu veMozambique. Kune avo vachangojoinha, ndapota govera iyi live nhepfenyuro nevanhu vanosvika makumi matatu.\n\nGoverana nevanhu vanosvika makumi matatu kuti titaure nezveMozambique neramangwana rayo. Hapasisina kupokana  zviri pachena kuti mhondi chaiyo negandanga rekuMozambique ndiani. Haasi mumwe kunze kweFrelimo Party. Chokwadi ichi chakazarurwa. Kuratidzira kwedu kune runyararo kwagara kwakanangana nemasangano akabiridzira zvakabuda musarudzo nekubira mavhoti evanhu, kwete midziyo yeruzhinji kana yemunhu. Mukuratidzira murunyararo uku, mapurisa akashandisa hutsi hunokachidza, kupfura varatidziri, uye kuuraya vanhu. Izvi zvakanyatsonyorwa, kubva pamatanho ekutanga kusvika kune ekupedzisira.\n\nPari zvino, vanhu vanodarika zviuru zvina vakavharirwa, uye vanhu vanopfuura mazana matatu nemakumi mashanu vafa. Kudzvinyirirwa kuri kuitika uku kunoratidza kuti vapambi vechokwadi nematsotsi ndivanaani.\n\nMamiriro acho akashandiswa. Mapoka eWhatsApp anonzi SOS ari kufambisa nhau dzenhema nezve varume vekatana munzvimbo dzakasiyana siyana. Iri izano riri pachena rekuisa kutya nekutitsausa kubva pazvinhu zvakakosha: hutsotsi hwesarudzo, kururamisira, nekuzvidavirira. Ava vanonzi varume vekatana vanobudiswa mujeri, vakapakata zvombo, uye vanotungamirirwa kuti vakonzere mhirizhonga. Asi aya haasi mabasa evaratidziri.\n\nKushandiswa nevari kutonga. Sei vasungwa ava vakasunungurwa vachinangana nenharaunda dzisina mhosva panzvimbo pemasangano ehurumende? Izvi hazvina kukwana. Zvichakadaro, mapurisaachirwisa zvikuru varatidziri vane rugarezvino anoti haana simba rokurwa naava vanonzi varume vekatana (vanorwisa mapanga. [Varume veKatana] Uku kunyengedza kushandura rondedzero kubva mukubiridzira musarudzo kuenda kuhugandanga.\n\nFrelimo iri kuronga nyonganyonga iyi kuvhiringa nekudzvanyirira vanopikisa. Hatina kunyengedzwa. Kuita zvekuparadza, kupisa nechisimba hazvisi zvedu  izano rehurumende yeFrelimo. Kurwira kwedu kunoramba kwakanangana nekururamisira kwesarudzo uye democracy. Tinofanira kuramba takabatana. Kunyange zvazvo takatarisana nokurasikirwa, tave pedyo nenguva yechinjo. NeMuvhuro, tichazivisa matanho akasimba ekuwedzera kurwisa kwedu. Ichi ndicho chikamu chokupedzisiramuromo wepfumo. Ngatisakanganwa zvinangwa zvedu. Kurwa uku hakusi kuparadza pfuma; ndezvechokwadi, kururamisira, uye democracy. Tine chinangwa chekudzoreredza hutungamiriri hwakakodzera hweMozambique. Gara wakasimba. Govera iyi meseji zvakanyanya. Muvhuro richava zuva rakakosha kurudzi rwedu.- ZimEye\n\nPORTUGUESE:\n\nAh, sei o que estamos a passar. Boa tarde. Boa tarde, boa. Boa tarde, boa. Muito obrigado. Estou a ver aqui. Obrigado. Muito boa tarde. Como est a sade? Cludia, Tom, Salgina, Vitor Machaba, Jssica Micas, Ok, Gildo, Livace, Confuso, muito obrigado. Olha, vocs que j esto ligados  nossa live neste momento podem partilhar esta mesma live para, como sempre, 30 pessoas, 40 pessoas, ou 30 grupos, ou 40 grupos. Portanto, faam essa partilha, porque hoje temos assuntos bastante importantes. Temos uma situao muito crtica no nosso pas, acho que  preciso esclarecer isto para que as pessoas no fiquem confusas em relao a qual  a verdade dos fatos e o que  que est a acontecer conosco com os sabicanos. Gostava que voc que se interligou agora a nossa live pudesse partilhar esta live para pelo menos 30 pessoas. Partilha a live para pelo menos 30 pessoas neste momento para falarmos sobre Moambique, o futuro de Moambique. Portanto, partilhe a live para pelo menos 30 pessoas. Quem est a entrar agora pode partilhar a live para no mnimo 30 pessoas. Portanto, partilhe a live para o mnimo de 30 pessoas. Voc que est a interligar-se agora, neste momento, na nossa pgina oficial do Facebook. Obrigado. Muito bem. Bom, acho que podemos iniciar a nossa live. Podemos iniciar a nossa live, que h de ser muito curta, que  no poder ver agora, poder ver depois. Que o Senhor abenoe Moambique, que o Senhor possa curar as feridas, as dores, as frustraes, as lgrimas, os dramas que foram causados durante este perodo das manifestaes, mas sobretudo durante o perodo que o Senhor nos deu uma ptria independente. que haja uma luz grande sobre o Moambique e que o Moambique de fato se torne uma grande nao no futuro. Muito bem, j estamos com 20 mil pessoas em direto, j podemos iniciar. O que  que eu queria falar hoje? Queria falar-vos hoje algo de trs pontos, muito simples. O primeiro ponto, para que fique claro para todo mundo,  que afinal, j no h dvidas, afinal ficou muito claro de quem  de fato o grande assassino, quem  de fato o grande terrorista de Moambique. O grande assassino de Moambique, o grande terrorista de Moambique  mais nem  menos do que o Partido Frelengo. Est mais do que claro, se algum tivesse dvidas, eu sei que ontem houve muito debate nas redes sociais, quem  culpado disto, quem no  culpado disto, mas acho que agora ficou muito claro, de fato, quem  o verdadeiro terrorista de Moambique. Comeamos com as nossas manifestaes pacficas, vocs lembram-se? Sempre dissemos, nosso alvo no so bens pblicos, nem so bens privados. Nosso alvo, exatamente, as instituies que manipularam os resultados, as instituies que roubaram os votos do povo. Dissemos isto desde o incio. E vocs lembram-se, ainda nas manifestaes pacficas, a polcia atirava sobre os manifestantes, lanava gs lacrimogneo, matava pessoas, e isto ns tentamos sempre recordar, das mortes de 92, mesmo no perodo da primeira etapa, da segunda etapa, da quarta etapa, a polcia sempre matou manifestantes, sempre disparou gs lacrimogneo. sempre esteve humilhando o povo.  por isso que hoje que estou vos falando, mesmo antes deste turbo V8 ser acionado pela professora doutora Lcia Ribeiro, j tnhamos quase 4 mil pessoas detidas. Ento, mais uma vez, afinal, j sabemos quem  o terrorista de Moambique. Afinal, j sabemos quem so, de facto, os verdadeiros vndalos em Moambique. J sabemos quem , de facto, o verdadeiro bandido em Moambique. Criou-se agora grupos de WhatsApp, chamados de SOS, temos a mesma voz. que diz que no bairro X h homens katanas, no bairro Y h homens katanas. H a mesma voz para vrios bairros, ouve-se em Lavella, ouve-se na Machava, ouve-se no Patrice. Ou essa pessoa est sendo atacada ao mesmo tempo e tem o poder da omnipresena, como Deus tem, de estar em vrios lugares ao mesmo tempo, mas est mais do que claro que isto  manipulao. Isto  manipulao. Os homens que saram da cadeia, nenhuma pessoa que se solta da cadeia no vai fugir para procurar iniciar uma vida, no vai fugir para se esconder, no vai fugir para bazar, como se diz. A pessoa sai da cadeia e j tem misso. e at j tem uma katana preparada para pegar na katana e comear a fazer aes. Vocs no esto a ver que tudo isto  um jogo. No esto a ver que tudo isto  o mesmo grupo que neste momento no quer que se fale mais da verdade eleitoral, no quer que se fale mais do roubo de votos, no quer que se fale mais das pessoas que foram assassinadas ao longo destas manifestaes todas, O mesmo grupo que no quer que se fale do acrdo do rubo sobre o povo. Querem desviar as atenes de todos ns para nos caminhar para um terrorismo. Querem aterrorizar a populao. Esses homens katanas, quem os viu? Esses homens katanas foram encontrados ontem. E ao mesmo tempo h homens katanas, mas o cernique est em todos os bairros a disparar ao ar de qualquer maneira. Portanto querem distrair-nos. Ns chegamos a esta fase depois de dois meses de manifestaes. Temos quase 350 pessoas que morreram. Temos 4 mil pessoas que esto detidas. Temos mais de 2 mil pessoas que esto feridas. No vamos chegar a esta fase. e seremos manipulados, brincarem connosco. Ns sabemos muito bem o que queremos. As manifestaes que ns quisermos fazer no tem nada a ver. com ir buscar um saco de arroz numa loja, ir buscar um celular noutra loja. Ns estamos  busca da verdade eleitoral, ns estamos  busca de justia em Moambique, ns estamos  busca de mudar este regime que desgraou este pas ao longo de 50 anos. Estes so os nossos objetivos. No vo nos meter agora objetivos na nossa cabea, que a nica coisa que existe  terror. Esses homens katana encontraram aonde as katanas. E mais, durante as nossas manifestaes, tnhamos polcia em tudo que  lugar, tnhamos blindados em tudo que  lugar. Agora, por causa de um punhado de homens catanas, a polcia no age. Quando se comeou a vandalizar as lojas, a polcia tambm no age. Queimou-se os bancos, a polcia tambm no age, no encontrou ningum. Pelo contrrio,  o prprio blindado da polcia que  usado at para arrebentar uma loja, para arrebentar um armazm, para depois chamar as pessoas famintas. Veja s. colocou-se as pessoas famintas durante muitos anos. No se d emprego s pessoas. No se d investimento s senhoras, aos jovens. Coloca-se a populao na misria. E quando a populao quer reclamar, quando a populao quer manifestar, rebentam a loja de um privado e dizem ao povo que entrem a e vo buscar arroz, vo buscar leo. Quer dizer, vtimas duas vezes. colocam-nos com fome, humilham-nos e ainda por cima rebentam o armaz de uma pessoa inocente e dizem que o povo deve entrar l para ir roubar. E eles prprios, a prpria polcia, nada faz. A polcia que, na altura das manifestaes pacficas, cantvamos o hino nacional, a polcia vinha. A cantarmos o hino nacional, disparava gs lacrimognico. Mas essa polcia no consegue dispersar pessoas que esto a entrar numa fbrica, pessoas que esto a entrar no armazm. E coisa curiosa, algumas das fbricas, alguns dos armazns, deles prprios, da Fralibo, no so tocados. Ento, se fomos ns, que soltamos os presos na Machava? Por que razo os presos que so soltos na Machava vo atacar nos bairros, se o nosso alvo  o governo? Por que que os presos da Machava no vo aos ministrios? Por que que os presos da Machava no vo  Presidncia da Repblica? Por que que os presos da Machava no vo s sedes do Partido Frelim? Por que que os presos da Machava no vo aos rgos eleitorais? Se somos ns manifestantes que libertamos os presos, ento os presos deviam cumprir as nossas ordens. Querem ir  presidncia, querem ir aos ministrios, querem ir aos rgos eleitorais, querem ir aos governos provinciais, querem ir aos governos distritais, querem ir s sedes do Partido Fernando. Mas todas as sedes esto intactas, o ministrio est intacto, a presidncia est intacta. Estes presos libertados por ns atacam a nossa prpria populao. Faz sentido gente? Vamos pensar um bocado. E agora organizaram jornadas de limpeza. Jornadas de limpeza para tentar limpar a nossa mente. As pessoas que morreram. Porqu que no h jornadas de assistncia s famlias das pessoas que morreram? Porqu que no h jornadas de assistncia s pessoas que esto feridas? Porqu que no h jornadas de assistncia s pessoas que esto detidas? Porqu que no h jornadas de esclarecer porqu que foram executados cem jovens? libertam jovens da cadeia, deixam jovens sarem e cem jovens, cem jovens mortos, disparados pela prpria polcia que os libertou. Tanto querem que a gente se esquea de tudo isto, que tudo isto  um jogo, para que a gente se esquea, que a gente se distraia, que a gente perca o nosso foco. Esto a humilhar, esto a aterrorizar a prpria populao. E ns no vamos perder o nosso foco por causa disso. J foi suficiente o diadonte, fizeram muitas manipulaes, jogaram muito com mensagens de um lado para o outro, mas o povo j compreendeu. Graas a Deus, estava a ver as reportagens da SIC em Portugal, da RTP em Portugal, da CMTV, vi da Al Jazeera, vi tambm da SMIC, vi da BBC. Graas a Deus, a comunidade internacional est a reportar com muita exatido o que est a acontecer no Moambique. esto a dizer claramente que  o partido Frelimo, o governo da Frelimo, que  um governo terrorista, que organizou a fuga dos presos, que ao mesmo tempo mandou executar 100 presos,  o mesmo que esto a organizar grupos de WhatsApp a mandarem mensagens falsas, at pem mulheres a gritar como se tivessem a ser atacadas num stio que so da OJM, que nunca foram vistas.  toda esta manipulao, todo o terror que querem colocar no povo, a gente j sabe como  que isto  feito. Os governos terroristas no mundo sempre usaram isto, sempre fizeram isto. Esta coisa de libertar presos, isto j vem de vrios pases, sobretudo governos de ditadura. Na Sria, com Bashar al-Assad, tambm fez-se isso. No Iraque, depois da invaso dos Estados Unidos, tambm se fez isso, libertaram-se presos. Na frica Sul, no tempo da apartheid, era normal libertar-se presos para criar escndalos. Na Colmbia, na altura, a Colmbia tinha aquele grupo ligado ao narcotrfico, tambm era normal libertar-se presos para se dizer que os presos vo fazer escndalo, vo aterrorizar a populao, para a populao parar de imitar pelos seus direitos, para a populao desistir. Eu recebi muitas mensagens, ah podemos desistir, no podemos desistir, ns temos, meus irmos, uma luta que tem um objetivo, mais de 300 pessoas que morreram, temos mais de 4 mil pessoas que ainda esto detidas, no sabemos se esto vivas ou se no esto vivas. Essa gangue da OJM que est a a andar na rua e diz que est a limpar, muitos deles so pagos. Vo l s cadeias visitar as pessoas que esto detidas, saber se ainda esto vivas ou se no esto vivas. Vo l dar assistncia de advogados s pessoas que neste momento esto a precisar de advogados. Vo l dar assistncia s famlias que perderam os seus filhos, assassinados pela prpria FRELIMO, que at hoje no sabemos se esto a ser enterrados, se no esto a ser enterrados, se esto a ser lanados pela vaga comum. Ento parem de fazer manipulao, de andar a tentar varer ruas, para enganar o povo, para tentar baralhar o povo. Ns no vamos perder o nosso foco, ns no vamos perder a ideia que temos de que estas manifestaes devem continuar at a reposio da verdade eleitoral, devem continuar at que se faa justia em Moambique. No vamos perder esse foco. Usem as mensagens que quiserem usar, tentem manipular como quiserem manipular, a verdade  que pelo menos hoje o povo j se apercebeu e o povo caiu na real. Da mesma maneira que andam a fazer reunies nos bairros agora. E veja s, quem est a fazer estas reunies? So as pessoas que foram eleitas exatamente com o roubo de votos. Vi a mensagem do municpio de Amat. Uma pessoa que foi eleita pelo roubo de votos, roubou na matola, no ganhou na matola. Chefes do quarteiro so os que recolhiam cartes, so os que fizeram fraude, so os que fizeram enchimento. Ento so estas mesmas pessoas que nos roubam, que esto l eleitas ilegalmente, que esto a chamar-nos para fazer reunio por causa de homens katanas, que esses homens katanas nem sequer foram vistos em lado nenhum. esses homens katanas que foram soltos exatamente pela prpria polcia. E a prpria polcia at hoje no fala de desenvolver nenhum inqurito, de organizar nenhum inqurito para esclarecer quem que libertou os presos, no est preocupado. A nica coisa que o Bernardino Rafael est preocupado  de mostrar ao povo que vem a terror, de que vo violar mulheres. de que vai haver assaltos  mo armada, de que vo matar pessoas, de que vai haver muito crime. Quer dizer, o prprio Bernardino Rafael tornou-se o porta-voz dos homens katana. Ele j no  o homem que garante a ordem e a segurana das pessoas. O Bernardino Rafael  porta-voz dos homens katana. Bernardino Rafael  porta-voz dos presos que fugiram da cadeia. Bernardino Rafael  porta-voz dos vndalos. Bernardino Rafael  porta-voz dos assassinos. Bernardino Rafael  porta-voz dos escuadres da morte. Bernardino Rafael  porta-voz daqueles que vo fazer o terrorismo. Alis, ele disse que h perigosos terroristas que foram soltos. Quer dizer, ele no pensa que o terrorista que fugiu, vai fugir para ele ter com a famlia ou sair fora do pas. Para o Bernardino Raffaello, o destino do terrorista  sair para ele fazer escndalos na populao. E at fez contas. Diz que se so mais ou menos 1.500 que fugiram, olha para a populao da cidade de Maputo e da cidade da Matola. Se eles cada um entrarem em 4 ou 5 casas, est a imaginar. O prprio comandante da polcia, que devia vir nos tranquilizar, que devia vir nos dar elementos de como aumentar a segurana. Ele  portavoz de terrorismo, de mensagens para meter o terror. E ele no esclarece como  que na cadeia central aquelas pessoas fugiram. Ele no diz se vai haver pessoas que so responsabilizadas. Ele no diz que aqueles que mataram 100 jovens que estavam l detidos, o que vai acontecer com eles. Ele no diz isto. Tudo manipulao. Graas a Deus, a Farlimo deu um tiro no prprio p. Toda a comunidade internacional agora est ciente de que de fato a FRELIMO  um movimento terrorista, que a FRELIMO  que est a criar assassinatos, a FRELIMO  que est a criar terror em Moambique. Olha para os noticirios internacionais, vo ver, morreram pessoas, mas a FRELIMO deu um tiro no prprio p. A imagem da FRELIMO a nvel internacional est totalmente manchada. Est totalmente manchada,  por isso que at hoje o governo dos Estados Unidos no reconheceu essa corda do Conselho Constitucional, a Inglaterra no reconheceu essa corda do Conselho Constitucional, a Unio Europeia no reconheceu essa corda do Conselho Constitucional, Portugal, hoje, j esto a mudar de discurso, porque tinham cometido uma GAF, esto a mudar porque toda a comunidade portuguesa est a dizer que o governo cometeu uma GAF, que no devia reconhecer os resultados. Ento, neste momento, at a SADC se tenha vindo a afirmar que a Frelimo e o candidato ganharam hoje, esto a ter outra perceo. Significa que a Frelimo est isolada. Entendam isso, vou lhes dizer, vocs esto a me ouvir. A Frelimos, do ponto de vista diplomtico, est isolada, porque est manchada, porque a Frelimos est mal vista, est vista como um grupo terrorista que assassina. Vejam s os jovens que foram, supostamente, Supostamente os jovens que foram apanhados depois de fugir. Colocar pessoas a andar como ces de gatas e a polcia atrs. Isso foi visto pela comunidade internacional. Ento, estes que esto agora na rua, vocs esto a limpar as ruas, dizem que querem voltar tudo ao normal. Vocs esto a limpar as ruas para legitimar este terrorismo, esta escravido. Por pessoas a andar de gatas que nem ces e a chutar as pessoas por detrs e depois de matar cem jovens a tiro.  isto que vocs querem que seja limpo? Aqui temos que esclarecer o nosso Isto ainda  um assunto para ns resolvermos. Ns ainda temos que continuar a manifestar, temos que continuar a repudiar, porque no  este pas que ns queremos para o futuro. Estamos a perder, sim, eu sei que estamos a perder. Estamos a parar as atividades, sim, mas no h nenhuma. revoluo, no h nenhum pas que j passou de um estgio para o outro sem haver perdas. Claro que havero perdas. Claro que essas perdas, j dissemos, no tm nada a ver com os manifestantes. Foram homens da Cernic que andaram a roubar os armazns, andaram a queimar os bancos, andaram a queimar caminhes, andaram a queimar fbricas e depois querer imputar isso aos prprios manifestantes. A mesma coisa tambm esto a fazer com que eles esto a ser soltos das cadeias. A culpa disto inteiramente  do Bernardino Rafael, a culpa disto  do Partido Frelimo. Isto est mais do que claro. E eu digo uma coisa, agora as pessoas podem no compreender, mas quando o Tribunal Penal Internacional comear a chamar estas pessoas para responderem pelos seus crimes, a toda a gente vai dizer que, ah, sim senhora, afinal tinham razo. Eles vo responder por estes crimes. So crimes contra a humanidade. No vamos perder de vista. preocuparmo-nos porque h um pneu que est na rua. No! Agora temos que nos preocupar com as pessoas que foram mortas, as pessoas que foram feridas, as pessoas que esto detidas, o roubo de votos, a verdade eleitoral. No podemos nos perder de vista. Ns continuamos com o nosso foco. Ontem, balearam o nosso coordenador na Zambsia, o Xadrec. Meteram-lhe dois tiros na barriga e um tiro na cabea. que ns esqueamos disto. Este  o mtodo da Fraligo.  isto que eles querem fazer. E estes jovens, vi alguns jovens a que so conhecidos na praa, dizem, no, temos que limpar a cidade. Vocs so to desumanos que depois de matarem tanta gente, assassinar tanta gente, vocs nem sequer falam disto. Nem sequer falam dos assassinatos dos nossos prprios irmos. Estes senhores so presos, esto detidos, foram usados como cobaias e foram assassinados. Vocs no falam disto. Esto a a dizer que temos que limpar a estrada, querem nos distrair, mas ns no vamos ficar distrados. Est claro, tudo o quanto aconteceu, arrombamentos, vandalismos,  culpa exclusiva do Partido Frelim porque  o mtodo deles. A soltura dos presos  culpa do Partido Frelim. A morte dos presos  culpa do Partido Frelim. Informaes falsas de homens katanas nos bairros  culpa do Partido Frelimo. Disparo escndalas nos bairros  noite  culpa do Partido Frelimo. Ns, as razes da nossa luta esto firmes. Ainda bem, estamos a ter mais apoio internacional agora, mais do que nunca. O que a Frelimo fez foi reforar a nossa prpria luta. Por isso vamos ficar firmes, no vamos vacilar, vamos continuar firmes e vamos para frente. Meus irmos, hoje, amanh, sbado, domingo, temos pessoas para enterrar, temos pessoas por visitar, temos pessoas para receber tratamento mdico e medicamentoso. A verdade  uma,  que ns vamos entrar numa fase, na reta final das nossas manifestaes. Ns no vamos parar. Sbado, domingo, vamos enterrar os nossos irmos, vamos cuidar dos feridos, vamos recolher mais sedo nas nossas casas. Queria recomendar nos bairros, jovens, ns sabemos quem vive nos nossos bairros. No vamos ficar em pnico, no nosso bairro ns sabemos quem  o nosso vizinho, quem vive na nossa rua. Vamos nos encontrar, vamos nos reunir, no para andar a perder tempo toda noite. Fiquemos com apitos, no por causa dos homens katana, por causa da polcia que anda a disparar de um lado para o outro. Esse  que tem que ser o nosso cuidado. A polcia que entra na casa das pessoas e dispara, como dispararam em Luiz Cabral, que meteram seis tiros a um jovem. No vamos perder o nosso foco, andando-nos a cansar, a perder tempo de um lado para o outro. Ns vamos retomar as nossas manifestaes em grande. Ao anncio das manifestaes finais, ou da reta final, aquilo que podemos chamar da ponta de lana. Na segunda-feira, ns vamos indicar qual  a ponta de lana, qual  a reta final, quais so as manifestaes que vo ser diferentes de tudo o quanto fizemos at hoje. Essas que aconteceram agora foram aes do Partido Fralimo que andaram a destruir as coisas. Ns vamos implementar as manifestaes que visam a verdade eleitoral, que visam a justia, que visam de fato Repormos a nossa democracia. Repormos quem verdadeiramente ganhou as eleies.  isso que ns queremos. Isso vamos fazer na segunda-feira. Por isso, segunda-feira no vamos ter nenhuma atividade em Moambique. Vamos ficar atentos. para indicarmos as medidas da fase ponta de lana, ou a fase da reta final. Estamos muito prximos meus irmos, at o dia 15 de janeiro, no  a altura para desistirmos. Aterrorizaram-nos, meteram-nos medos, mataram nossos irmos, sim, mataram-nos, mas estamos na reta final, no vamos desistir no. Ento, ns at o dia 15 temos muitas obrigaes, temos muitos compromissos. Na segunda-feira, meus irmos, vamos anunciar em concreto o que  que ns vamos fazer na reta final, na fase ponta de lana. E na segunda-feira no h nenhum trabalho. A nica coisa que ns vamos admitir so as nossas mamanas do setor informal. As nossas mamanas do setor informal, vamos permitir que elas se movimentem. Segunda-feira vamos ficar parados, vamos ficar atentos, quais so as medidas da ponta de lana. Na segunda-feira passada, ficamos atentos para ouvir a Lcia Ribeiro, o que ela tinha a dizer. O que ela teve a dizer, ns a seguir, vim com o prprio partido Fralim preparado para criar escndalos, fez o escndalo todo. Esta semana foi a semana do escndalo da Fralim. A prxima semana vamos indicar as medidas verdadeiramente daqueles que querem mudanas srias no pas, que no esto preocupados. Agora j sabemos. Isso de vandalizar loja, partir banco, isso no  conosco. Se algum fizer isso,  bom separar isso de ns. O nosso objetivo  a verdade eleitoral,  a democracia,  a questo da represso da justia. Ento na segunda-feira vamos indicar quais as medidas que ns vamos adotar na ponta final, ou na ponta de lana. Ponta de lana. Vamos indicar quais so essas medidas. E agora, em parte, foi positivo para todos ns, porque j sabemos qual  a atuao da Afralim, qual  a atuao da polcia da Afralim, j sabemos exatamente como  que eles manipulam as coisas, ento o povo vai ficar muito claro. do que  a manifestao da verdade eleitoral, o que  a manifestao do terrorismo da FRELIM, que usa a polcia para fazer esse terrorismo, que usa reclusos para fazer esse terrorismo. Na segunda-feira ns vamos indicar as medidas da ponta de lana, a reta final. Estamos prximos, faltam-nos muito pouco. No vamos desanimar, no godolemos, como dizem alguns. Tanto  isto, que eu queria deixar aqui muito bem claro. No desanimemos. Tudo no passou da manipulao do governo.  por isso que esto fugitivos. E  bom continuarem fugitivos. Porque a partir da segunda-feira, o nosso alvo vai ser um alvo muito certeiro. Muito certeiro. Esses ministrios. Governos Provinciais, Governos Distritais, rgos eleitorais, sedes do Partido Fralimo, Presidncia da Repblica, mas depois vamos explicar como  que vamos fazer isso. Portanto, no vo ser lojas, no vo ser supermercados, no vo ser fbricas, no vo ser caminhes, nada disso. Isso tudo j sabemos que agora vamos afastar tudo isso, porque nunca teve nada a ver conosco e agora est claro que foi o Partido Fralimo que fez isso. Ento, na segunda-feira, todos aqueles que querem o Moambique de fato democrtico, querem o Moambique livre da escravatura, vo assumir, vo adotar, vo receber as medidas do verdadeiro Moambicano revolucionrio para a fase ponta de lana. Meus irmos, e assim estivemos, em direto, a partir da pgina oficial de Venncio Molheni. para Moambique, tanto no pas como na dispora. Um forte abrao para todos. Um beijo e tchau!  ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Venâncio Mondlane latest speech at 6pm Friday (transcribed by ZimEye) ENGLISH – SHONA – PORTUGUESE Ah, I understand what we’re … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/venancio-mondlane-latest-speech-at-6pm-friday-arson-and-violence-is-being-done-by-frelimo-govt-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"Venâncio Mondlane Latest Speech at 6pm Friday, “Arson, and Violence Is Being Done By Frelimo Govt | FULL TEXT\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "BREAKING NEWS…50 Murdered During Christmas",
            "url": "https://www.zimeye.net/2024/12/27/breaking-news-50-murdered-during-chrismas/",
            "content": "By Crime and Courts-The police have raised alarm over the rise in murder cases during the Christmas holiday.\n\nIn a statement Friday, the police said 47 such murder caseswere recordedin four days nationwide.\n\nPosted the Police Friday:\n\nTheZimbabwe Republic Policeis concerned with the number of murder cases which arebeing recordedthroughout the country.47cases of murderhavebeen receivedduring the period20th December 2024 to 26th December 2024.\n\nTheZimbabwe Republic Policehas established that the murder cases are emanating from disputes atbeer drinkingbinges or sporting activities, family and community disputes during gatherings, attacks by unknown suspects while walking at night, the settling of scores during Christmas Day by individuals and groups, and fighting over girlfriends, among others.\n\nIn one of the caseswhichoccurred on25th December 2024at around1900 hoursatMachipisa Tuckshops, Mwenezi, Triangle,Mastard Chauke (22)had a misunderstanding withTongai Moyo, who had bumped into him during abeer drinkingspree.MastardChaukethrew a stone towardsTongai Moyo, which hitOstern Mangaru (29)on the chest instead. The victim fellonthe ground and died on the spot.\n\nIn another murder case which occurred on25th December 2024at around2100 hours,Learnmore Mudzengi (36)stabbedSydney Mudzengi (21)with a Colombian knife onceonthe chest atMusavezi Business Centre, Shurugwi.The suspect allegedly had a misunderstanding with the victim over a tokenwhichwent missingwhilstplaying pool.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts-The police have raised alarm over the rise in murder cases during the Christmas holiday. In a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/breaking-news-50-murdered-during-chrismas/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING NEWS…50 Murdered During Christmas \"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        },
        {
            "title": "Tongai Moyo Escapes Death",
            "url": "https://www.zimeye.net/2024/12/27/tongai-moyo-escapes-death/",
            "content": "By Crime and Courts Reporter-Tongai Moyo of Triangle,Mwenezi,narrowly escaped death on Christmas day during a beer-drinking spree after a stone thrown by his friend missed him and struck another man, killing him instantly.\n\nPolice said Mastard Chauke (22) had a heated misunderstanding with Tongai Moyo after being bumped into at Machipisa Tuckshops.\n\nIn a fit of rage, Chauke hurled a stone at Moyo, but it fatally hit Ostern Mangaru (29) on the chest. Mangaru collapsed and died on the spot.\n\nThe incidentwas highlightedby police while raising alarm over the rise in murder cases during the Christmas holiday, with 47 cases recorded nationwide.\n\nPosted the Police Friday:\n\nTheZimbabwe Republic Policeis concerned with the number of murder cases which arebeing recordedthroughout the country.47cases of murderhavebeen receivedduring the period20th December 2024 to 26th December 2024.\n\nTheZimbabwe Republic Policehas established that the murder cases are emanating from disputes atbeer drinkingbinges or sporting activities, family and community disputes during gatherings, attacks by unknown suspects while walking at night, the settling of scores during Christmas Day by individuals and groups, and fighting over girlfriends, among others.\n\nIn one of the caseswhichoccurred on25th December 2024at around1900 hoursatMachipisa Tuckshops, Mwenezi, Triangle,Mastard Chauke (22)had a misunderstanding withTongai Moyo, who had bumped into him during abeer drinkingspree.MastardChaukethrew a stone towardsTongai Moyo, which hitOstern Mangaru (29)on the chest instead. The victim fellonthe ground and died on the spot.\n\nIn another murder case which occurred on25th December 2024at around2100 hours,Learnmore Mudzengi (36)stabbedSydney Mudzengi (21)with a Colombian knife onceonthe chest atMusavezi Business Centre, Shurugwi.The suspect allegedly had a misunderstanding with the victim over a tokenwhichwent missingwhilstplaying pool.After committing the offence, the\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Tongai Moyo of Triangle, Mwenezi, narrowly escaped death on Christmas day during a beer-drinking spree after a stone … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/tongai-moyo-escapes-death/\">Continue reading<span class=\"screen-reader-text\"> \"Tongai Moyo Escapes Death\"</span></a></p>",
            "time": "06:32",
            "date": "28 Dec 2024"
        }
    ]
}