{
    "news": [
        {
            "title": "Road Safety A Collective Responsibility",
            "url": "https://www.zimeye.net/2024/12/18/road-safety-a-collective-responsibility-3/",
            "content": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls on every individual.\n\nWhile authorities play a crucial role in setting rules, providing infrastructure, and enforcing traffic laws, the safety of our roads depends on how each of us behaves behind the wheel or as a pedestrian.\n\nIts easy to assume that road safety is solely the responsibility of lawmakers and authorities, but the reality is that every person who uses the road contributes to creating a safer or more dangerous environment. Drivers, passengers, cyclists, and even pedestrians all have a part to play in ensuring that our roads remain safe for everyone.\n\nThe Importance of Safe Driving\n\nOne of the most significant contributors to road safety is the way we drive. Speeding, distracted driving, and driving under the influence of alcohol or drugs are all actions that put not only the driver but also other road users at serious risk. Being aware of road conditions, following traffic signals, wearing seat belts, and respecting speed limits are some of the simplest yet most effective ways to avoid accidents.\n\nDriving safely involves more than just adhering to the lawit means being conscious of other drivers and pedestrians, maintaining a safe distance, and reacting calmly in emergency situations. The decision to drive responsibly can prevent countless accidents and save lives.\n\nPedestrians and Cyclists: Sharing the Road\n\nRoad safety isnt just about cars. Pedestrians and cyclists also need to be vigilant and responsible. Pedestrians should use crosswalks, avoid jaywalking, and stay alert when walking near busy streets. Similarly, cyclists must wear helmets, signal their turns, and follow traffic rules to minimize the risk of accidents.\n\nEveryone, regardless of how they travel, plays a part in maintaining road safety. Drivers must be aware of pedestrians and cyclists, while pedestrians and cyclists should respect the rules designed to protect them.\n\nA Culture of Responsibility\n\nBuilding a culture of road safety starts with individuals taking responsibility for their actions. Whether you are driving, cycling, or walking, your behavior on the road can have a direct impact on others. Everyone should recognize that safety is not just a matter of personal well-being but also the well-being of everyone else on the road.\n\nConclusion\n\nRoad safety is not only about laws and regulations; it is about creating a culture where everyone takes responsibility for their actions. To ensure that roads are safe for everyone, we must all participatedrivers, pedestrians, cyclists, and law enforcement. The message is simple: Drive safely, save lives. Lets make road safety a shared priority for all.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/road-safety-a-collective-responsibility-3/\">Continue reading<span class=\"screen-reader-text\"> \"Road Safety A Collective Responsibility\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "Two Die in Honda Fit, Toyota Hilux Crash",
            "url": "https://www.zimeye.net/2024/12/18/two-die-in-honda-fit-toyota-hilux-crash/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has confirmed a fatal road traffic accident that occurred on December 16, 2024, at approximately 1:50 PM at the 156-kilometer peg along the Harare-Nyamapanda Road.\n\nTwo people lost their lives, and four others were injured when a Toyota Hilux, carrying one passenger, collided with a Honda Fit that had five passengers on board. The impact caused the Toyota Hilux to overturn onto its side, while the Honda Fit also flipped but landed on its wheels.\n\nThe authorities are investigating the cause of the crash.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has confirmed a fatal road traffic accident that occurred on December 16, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/two-die-in-honda-fit-toyota-hilux-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Two Die in Honda Fit, Toyota Hilux Crash\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "Mnangagwa Boasts of Feeding Entire Nation in 2024 As Nation Burns",
            "url": "https://www.zimeye.net/2024/12/18/mnangagwa-boasts-of-feeding-entire-nation-in-2024-as-nation-burns/",
            "content": "By A Correspondent\n\nZanu PF spokesperson Chris Mutsvangwa recently claimed that President Emmerson Mnangagwa successfully managed to feed the entire nation in 2024, despite numerous challenges.\n\nThis assertion, however, stands in stark contrast to the harsh realities faced by many Zimbabweans, who continue to grapple with economic hardship and daily struggles to meet basic needs.\n\nMutsvangwa made these remarks during a media briefing in Harare on Tuesday, where he outlined what he described as the governments successful food relief programme.\n\nHe emphasized that President Mnangagwa had overcome all odds to ensure that every citizen was fed, despite the economic challenges the country is facing.\n\nAgainst all odds, President Mnangagwa has managed to feed the entire nation in 2024. This is contrary to claims of starvation and suffering of citizens.\n\nThe food relief programme has been a huge success, Mutsvangwa said. He continued to praise the Presidents efforts, referring to the assistance provided to vulnerable groups across the country.\n\nMutsvangwas comments, however, have been met with skepticism by many, as the economic situation in Zimbabwe remains dire.\n\nRising inflation, unemployment, and food insecurity continue to affect a large portion of the population.\n\nMany citizens report that they are still struggling to access basic necessities, with food prices soaring and the cost of living escalating.\n\nIn his address, Mutsvangwa also took aim at critics of the governments relief efforts, saying, Naysayers have been put to shame. We thank the President for his resilience in the face of such challenges.\n\nHowever, opposition leaders and civil society groups have rejected Mutsvangwas claims, pointing out that while food aid may have reached some, large portions of the population remain unaddressed. These critics argue that the scale of the food crisis in Zimbabwe is far greater than the government admits, with the vast majority of citizens still experiencing food insecurity.\n\nAs the political rhetoric continues, many Zimbabweans are left wondering if the governments promises can match the lived reality of a nation still struggling to recover from years of economic decline.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF spokesperson Chris Mutsvangwa recently claimed that President Emmerson Mnangagwa successfully managed to feed the entire … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/mnangagwa-boasts-of-feeding-entire-nation-in-2024-as-nation-burns/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Boasts of Feeding Entire Nation in 2024 As Nation Burns\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "Parliament Is Hell Under Mnangagwa Regime, Opposition MP Reveals",
            "url": "https://www.zimeye.net/2024/12/18/parliament-is-hell-under-mnangagwa-regime-opposition-mp-reveals/",
            "content": "By Honourable Johnson Matambo MP Kuwadzana West\n\nThe effectiveness of Parliamentarians in Zimbabwe after the new dispensation has been a subject of debate.\n\nWhile the current administration promised a break from the past, the reality on the ground tells a different story.\n\nOne of the major challenges facing Parliamentarians is the lack of meaningful reforms.\n\nDespite promises of change, the ruling party has maintained a tight grip on power, limiting the ability of Parliamentarians to hold the executive accountable.\n\nThe delay in passing the Constitutional Amendment Bill (Number 2) is a case in point. This bill aimed to give credence to the establishment of provincial councils, a key aspect of the devolution agenda. However, its delay has stalled government efforts to implement this agenda.\n\nFurthermore, human rights abuses have continued unabated under the new dispensation. Parliamentarians have failed to effectively address these issues, with many critics arguing that they have been co-opted by the ruling party.\n\nThe Zimbabwe Human Rights NGO Forum has documented numerous cases of human rights abuses, including police brutality, forced disappearances, and restrictions on freedom of assembly and expression.\n\nDespite these challenges, Parliamentarians can still play a crucial role in promoting accountability and good governance. They can do this by:\n\nUltimately, the effectiveness of Parliamentarians in Zimbabwe will depend on their ability to assert their independence and promote the interests of their constituents. (Meta on the Effectiveness of the roles of Parliamentarians after the New Dispensation)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Honourable Johnson Matambo MP Kuwadzana West The effectiveness of Parliamentarians in Zimbabwe after the new dispensation has been a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/parliament-is-hell-under-mnangagwa-regime-opposition-mp-reveals/\">Continue reading<span class=\"screen-reader-text\"> \"Parliament Is Hell Under Mnangagwa Regime, Opposition MP Reveals\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "People Want Mnangagwa to Stay Beyond 2028: Mutsvangwa",
            "url": "https://www.zimeye.net/2024/12/18/people-want-mnangagwa-to-stay-beyond-2028-mutsvangwa/",
            "content": "By A Correspondent\n\nZanu PF spokesperson Chris Mutsvangwa has claimed that the people of Zimbabwe want President Emmerson Mnangagwa to remain in office beyond 2028.\n\nSpeaking to the media in Harare on Tuesday, Mutsvangwa argued that citizens have the right to call for Mnangagwa to extend his presidency beyond the constitutionally mandated two terms.\n\nMnangagwa is currently serving his second and final term according to Zimbabwes constitution, but Mutsvangwa insisted that many Zimbabweans, particularly Zanu PF supporters, want him to continue leading beyond 2028.\n\nYes, we are aware that the President respects the constitution, Mutsvangwa said. President Mnangagwa has already stated that he will not seek a third term. However, let me make it clearthe people have the right to urge him to stay in office. We are witnessing the great work he is doing.\n\nMutsvangwa added, The fact is, citizens have already expressed their desire for the President to stay beyond 2028.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF spokesperson Chris Mutsvangwa has claimed that the people of Zimbabwe want President Emmerson Mnangagwa to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/people-want-mnangagwa-to-stay-beyond-2028-mutsvangwa/\">Continue reading<span class=\"screen-reader-text\"> \"People Want Mnangagwa to Stay Beyond 2028: Mutsvangwa\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "JUST IN…..Sbusiso Lawrence Dies",
            "url": "https://www.zimeye.net/2024/12/18/just-in-sbusiso-lawrence-dies/",
            "content": "KwaZulu-Natal -The body of Sbusiso Lawrence, who confessed to killing his girlfriend in a social media video, was found hanging from a tree in the Malangeni area of Umzinto, on the KwaZulu-Natal south coast.\n\nOn Tuesday, police responded to reports of a murder in Umzinto where the body of a 25-year-old woman was discovered in the middle of the road with multiple stab wounds.\n\nPolice spokesperson Colonel Robert Netshiunda says,Reports indicate that the suspect fetched the woman, who was his girlfriend, from her home and it is suspected that the two had a domestic-related altercation which escalated to the murder.The suspects vehicle was found abandoned down the road from where the womans body was found, and blood on the front passenger seat suggested that the suspect killed the woman inside his vehicle. A manhunt was quickly launched and an intensive search by police led to the discovery of the suspects body which was hanging on a tree, in what is believed to be a suicide. Police are investigating a case of murder and an inquest docket will also be opened for further investigation, adds Netshiunda.-SABC\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "KwaZulu-Natal -The body of Sbusiso Lawrence, who confessed to killing his girlfriend in a social media video, was found hanging … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/just-in-sbusiso-lawrence-dies/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN…..Sbusiso Lawrence Dies\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "Mnangagwa Aide Blocks Gaffa Crossover Show",
            "url": "https://www.zimeye.net/2024/12/18/mnangagwa-aide-blocks-gaffa-crossover-show/",
            "content": "ByShowbiz Reporter-President Emmerson Mnangagwas business partner, Kudakwashe Tagwirei, controversially blocked Winky Ds annual New Years Eve show at the Harare International Conference Centre(HICC).\n\nThe move has reignited suspicions of Zanu PFs discomfort with the musicians socially conscious lyrics, often challenging the ruling partys governance.\n\nFor years, Winky D, affectionately known as Gaffa, has hosted his iconic crossover event at the HICC, using the platform to launch new albums.\n\nHowever, this year, Tagwireis Bridging Gaps Foundation secured the venue for a Seventh Day Adventist (SDA) Church event, sidelining the artist.\n\nReports reveal the foundation paid the Rainbow Tourism Group a staggering $245,000, which included booking 200 rooms for five days.\n\nSources close to the deal allege that Rainbow approached Tagwirei to fill the slot after deeming Winky Ds revenue-sharing agreement financially unviable.\n\nThis arrangement has fueled speculation of political interference, with Rainbow partially owned by the state and Tagwireis ties to Mnangagwa deepening public mistrust.\n\nWinky Ds legal representatives, Tsunga Law International, disclosed that the venue hadbeen reservedsince May 2024, with preparations already underway.\n\nDespite this, Rainbow opted to prioritize another event.\n\nThe decision has sparked outrage among fans, who accuse Rainbow and Tagwirei of orchestrating a political ploy to silence the artist.\n\nKnown for his hard-hitting critiques of corruption, inequality, and oppression, Winky D has long been a thorn in Zanu PFs side.\n\nHis music has faced censorship before, including a ZBC blacklist, and his latest album,Eureka Eureka, drew sharp rebukes from ruling party officials for its potent social commentary.\n\nAs uncertainty looms over Winky Ds plans for New Years Eve, fansare rallyingbehind the artist, viewing the move as yet another attempt to stifle artistic freedom in Zimbabwe.\n\nSpeculation is rife that Winky D may announce an alternative venue, continuing his tradition of using music as a platform for resistance.\n\n-Online\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-President Emmerson Mnangagwa’s business partner, Kudakwashe Tagwirei, controversially blocked Winky D’s annual New Year’s Eve show at the Harare … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/mnangagwa-aide-blocks-gaffa-crossover-show/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Aide Blocks Gaffa Crossover Show\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "Zimbabwe Launches New Carbon Market Framework to Tackle Climate Change",
            "url": "https://www.zimeye.net/2024/12/18/zimbabwe-launches-new-carbon-market-framework-to-tackle-climate-change/",
            "content": "Harare, Zimbabwe In a bold step toward combating climate change and fostering sustainable development, Zimbabwe has officially launched a comprehensive carbon market framework. The initiative, unveiled at a high-profile event at the COP29 climate conference in Balu Azerbaijan, aims to position the country as a leader in carbon market development while advancing national commitments under the Paris Agreement.\n\nThe new framework, developed in collaboration with international environmental experts and local stakeholders, provides a regulated platform for the development and trade of Article 6 compliant carbon credits.\n\nBuilding on the experience of other early movers like Ghana, Zimbabwes framework includes several first of their kind innovations including:\n\nThe framework introduces clear guidelines for verifying, registering, and trading carbon credits, ensuring transparency and alignment with international standards. Clear guidelines not only guide investors through the project development process, but streamline the steps needed for end users to purchase and use Article 6 eligible credits.\n\nIn addition to requiring all project developers to increase their investment in community development, the government has pledged to allocate the majority of all carbon market proceeds to the National Climate Fund (NCF) to finance national climate mitigation and adaptation initiatives.\n\nThe framework comes at a crucial moment, paving the way for existing projects to transition to Article 6 eligibility. By generating Article 6 eligible credits, local developers will not only be able to achieve higher profits but will be able to access new markets including CORSIA and national compliance markets abroad.\n\nWith this framework, Zimbabwe joins a growing list of African nations leveraging carbon markets to address climate change while creating economic opportunities. The countrys abundant natural resources and commitment to sustainability make it well-positioned to become a key player in the global carbon trading ecosystem. Environmentalists and economists alike have welcomed the initiative, noting its potential to balance environmental concerns with economic development.\n\nThe carbon market is expected to commence operations in 2024, with pilot projects already underway. Experts believe this could unlock millions of dollars in green investments while reinforcing Zimbabwes role in the fight against global climate change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, Zimbabwe — In a bold step toward combating climate change and fostering sustainable development, Zimbabwe has officially launched a comprehensive … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/zimbabwe-launches-new-carbon-market-framework-to-tackle-climate-change/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Launches New Carbon Market Framework to Tackle Climate Change\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "Guti loses US$20k to Makandiwa’s pastor in botched minerals deal",
            "url": "https://www.zimeye.net/2024/12/18/guti-loses-us20k-to-makandiwas-pastor-in-botched-minerals-deal/",
            "content": "By A Correspondent| UFIC church pastor and E-Ways Freight (pvt) Ltd director Kudakwashe Zvinokora has appeared in court on allegations of defrauding the late ZAOGA Ezekiel Gutis nephew Pheim Guti of his US$20000 in a botched minerals deal.\n\nZvinokora and his company, E-Ways Freight (pvt) Limited who were jointly charged when they appeared before a Harare magistrate and were granted free bail.\n\nHe was represented by Tafadzwa Byron Muvhami.\n\nZvinokoras company E-Ways Freight(pvt) Limited is a duly registered company in the business of mining, buying and selling minerals in Zimbabwe and exporting to other countries.\n\nlt is the States case that sometime in August 2024 complainant was looking for a business to invest in.\n\nThereafter he met accused number three, who is still at large, and he told him that he was in business of mining and exporting chrome together with Zvinokora.\n\nHe further stated that Zvinokora had a company which had a licence to export some minerals in South Africa.\n\nActing on the misrepresentation complainant got interested and decided to invest his money by paying USD 20 000 to the acussed persons for the purpose of buying chrome in Zimbabwe and exporting to South Africa for resell for a profit margin of 100%.\n\nlt is alleged that on August 6 2024 complainant paid a total of US$20000 to the accused person number two being represented by Zvinokora, and in turn was issued with a receipt confirming the receipt of the money by accused persons.\n\nThe arrangement was that the accused persons will pay the initial amount of US$20000 and plus 100% profit in one weeks time from the date of receipt of the money.\n\nlt is alleged that after one week the complainant made a follow up with E-Ways Freight (pvt) Limited but Zvinokora was now being evasive and his whereabouts were unknown.\n\nThe complainant then made a report to the police leading to his arrest.\n\nThe total value stolen is USD$20 000 and nothing wes recovered.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| UFIC church pastor and E-Ways Freight (pvt) Ltd director Kudakwashe Zvinokora has appeared in court on allegations … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/guti-loses-us20k-to-makandiwas-pastor-in-botched-minerals-deal/\">Continue reading<span class=\"screen-reader-text\"> \"Guti loses US$20k to Makandiwa’s pastor in botched minerals deal\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        },
        {
            "title": "Coup Suspicions Mount As Chiwenga Loyalists Snub Mnangagwa’s Cabinet Meetings",
            "url": "https://www.zimeye.net/2024/12/18/coup-suspicions-mount-as-chiwenga-loyalists-snub-mnangagwas-cabinet-meetings/",
            "content": "ByPolitical Reporter-Power struggles within the government have reached a boiling point, with President Emmerson Mnangagwa publicly expressing frustration over the conduct of some ministers and deputy ministers under his administration.\n\nThe growing tensions hint at deeper cracks in his relationship with Vice President Constantino Chiwenga, fueling speculation of a potential coup orchestrated by loyalists aligned with Chiwenga.\n\nDuring the last 2024 cabinet meeting held at State House, Mnangagwa lambasted absenteeism among senior government officials, describing the behaviour as untenable and a dereliction of duty.\n\nLet me, however, hasten to emphasise that Cabinet processes are anchored on the timely submission of vital documents and regular attendance by Ministers and officials, Mnangagwa stated. The worrisome tendency by Ministers and senior officials to absent themselves from meetings is untenable. Permanent Secretaries should ensure that in their absence, only directors and above should attend working party meetings.\n\nThe presidents remarks come amidst increasing reports of cabinet ministers allegedly loyal to Chiwenga snubbing key meetings, undermining Mnangagwas authority.\n\nSpeculation suggests that these absences are part of a coordinated effort to challenge Mnangagwas leadership ahead of Zanu PFs next elective congress.\n\nMnangagwa directed Chief Secretary to the President and Cabinet, Martin Rushwaya, to tighten monitoring of ministerial attendance starting in 2025.\n\nHe warned that ministers and senior officials who fail to comply risk dire consequences.\n\nThe president also criticised deputy ministers, accusing them of being poorly prepared and undermining his authority by failing to participate effectively in government operations.\n\nIn cases where Deputy Ministers are assigned, they should be adequately capacitated to enable active participation in the requisite deliberations. To this end, I direct that Deputy Ministers must now sign performance contracts in 2025, Mnangagwa announced.\n\nThese measures follow Mnangagwas earlier introduction of performance contracts for senior government officials as part of his Vision 2030 agenda to foster a culture of accountability and servant leadership.\n\nMnangagwa and Chiwenga have shared a tumultuous political relationship since the military-assisted transition that brought Mnangagwa to power in 2017.\n\nChiwenga, who played a pivotal role in that transition, has grown increasingly influential, with his allies occupying key government and security positions.\n\nObservers note that Chiwengas loyalists have become emboldened, with their defiance of Mnangagwas directives interpreted as challenging his grip on power.\n\nThe presidents remarks about errant ministers couldbe seenas aveiledwarning to Chiwenga and his faction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-Power struggles within the government have reached a boiling point, with President Emmerson Mnangagwa publicly expressing frustration over the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/coup-suspicions-mount-as-chiwenga-loyalists-snub-mnangagwas-cabinet-meetings/\">Continue reading<span class=\"screen-reader-text\"> \"Coup Suspicions Mount As Chiwenga Loyalists Snub Mnangagwa’s Cabinet Meetings\"</span></a></p>",
            "time": "18:43",
            "date": "18 Dec 2024"
        }
    ]
}