{
    "news": [
        {
            "title": "Analysts commend RBZ stance on liberalising the exchange rate",
            "href": "https://www.zbcnews.co.zw/analysts-commend-rbz-stance-on-liberalising-the-exchange-rate/",
            "content": "Story by Owen Mandovha\nTHE Reserve Bank of Zimbabwe’s (RBZ) willing buyer willing seller exchange rate system is bearing fruit, with the central bank leaving the market to determine the exchange rate.\nIn a statement released this Wednesday, the Reserve Bank of Zimbabwe (RBZ) clarified that it has no control over the referral exchange rate being used by economic agents, saying the rate is derived from the interbank market through the willing buyer willing seller system announced in the 2024 Monetary Policy Statement.\nAnalysts have weighed on the subject given that over the past six months, the exchange rate has remained relatively stable, and premiums have been gradually declining, pointing towards convergence between the interbank and parallel foreign exchange rates.\n“The interbank market has been used to determine the exchange rate by the central bank and what it means is that holders of foreign currency can set the price of foreign currency they have to the buyer using banks. There is no fixed exchange rate that is being done by the RBZ. It is essentially the market forces of supply and demand that is determining this rate,” economist, Mr Malone Gwadu said.",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Ran Mine resumes operations after environmental cleanup and safety upgrades",
            "href": "https://www.zbcnews.co.zw/ran-mine-resumes-operations-after-environmental-cleanup-and-safety-upgrades/",
            "content": "Story by Tapiwa Machemedze\nRAN Mine has resumed operations in Bindura after the completion of the environmental decontamination process and enactment of safety measures ordered by the Environmental Management Agency (EMA) Wednesday night.\nThis was a result of the slimes dam breach at the mine last month.\nEMA Mashonaland Central Environment and Publicity Officer, Mr Maxwell Mupotsa, said the civil protection unit met on Wednesday afternoon and assessed public safety measures put in place by the mine.\n“After continuous works done by Ran Mine to ensure such a calamity would not happen again, we have seen the directive ordering them to halt operations being removed after they met conditions of the order, comprising pollution abatement measures, safety ponds, and the need to change the slime dam using the old one which is away from the public so we are satisfied as an agency with the works done by Ran Mine,” Mr Mupotsa said.",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Construction industry urged to align with local authorities’ master plans",
            "href": "https://www.zbcnews.co.zw/construction-industry-urged-to-align-with-local-authorities-master-plans/",
            "content": "Story by Aifheli Mudau\nCONSTRUCTION industry stakeholders have been challenged to take advantage of local authorities’ master plans to contribute towards the government’s delivery of one million housing units by 2030.\nWith the construction industry set to grow by five percent by the end of this year, the Construction Industry Federation of Zimbabwe (CIFOZ) engagement held in Bulawayo this Friday was an eye-opener for stakeholders.\n“As a contractor, I learnt a lot from today’s gathering and what part I can take to contribute to the growth of the sector at the same time promoting my own growth,” a contractor said,\n“Events like these give us opportunities to know where we can hunt for tenders and how best the government can help us,” another contractor said.\nThe CIFOZ Secretariat challenged its embers to make use of local authorities’ master plans to identify opportunities.\n“We have to unite so that we can always help each other. Unity will also help us to meet the requirements and deliver the state of the art services to our clientele,” CIFOZ, Matabeleland Region Chairperson, Mr Bernice Richards said.",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Victoria Falls’ Mbano Manor Hotel earns global recognition in Time Magazine",
            "href": "https://www.zbcnews.co.zw/victoria-falls-mbano-manor-hotel-earns-global-recognition-in-time-magazine/",
            "content": "Story by Tichaona Kurewa\nMBANO Manor Hotel, in Victoria Falls, has been included in Time Magazine’s prestigious annual list of the World’s Greatest Places to visit in 2025.\nThe women-led five-star luxury hotel, which opened in 2020, secured a spot among the 100 featured global destinations.\n“For us to come second in the list of 100 for 2025 great places to visit is absolutely amazing. It is a credit to my team, a credit to the effort that we have put to market and sell not just Mbano but destination Victoria Falls,” Mbano Manor Hotel founder, Ms Matifadza Nyazema said.\n“We really hope that this feature in time is going to encourage even more tourists to come to the destination and I think it is definitely a huge recommendation and a huge endorsement not just on Mbano Manor Hotel but Victoria Falls as a destination,” the Marketing Executive for Mbano Manor Hotel, Ms Emma Nherera said.\nThe Hospitality Association of Zimbabwe (HAZ), is predicting a surge in international visitors on the back of this groundbreaking recognition.\n“This is definitely going to highlight Zimbabwe as a prime destination within the southern African region. It is going to boost our image and showcase that we do have quality establishments which also compete on the world market and we want to say congratulations to the Mbano team for such a sterling job which has been recognised on the international scene,” HAZ first vice president, Ms Emmah Katihvu said.",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Govt commends Zim’s business resilience at 2025 Business Expo",
            "href": "https://www.zbcnews.co.zw/govt-commends-zims-business-resilience-at-2025-business-expo/",
            "content": "Story by Stanley James, Business Editor\nTHE business community has been praised for its resilience despite local and global challenges, reflecting commitment to the national development agenda under the Second Republic.\nOfficially opening the third edition of the 2025 Zimbabwe Business Expo in Harare this Friday, Vice President Kembo Mohadi, who was represented by the Permanent Secretary in his office Dr Benson Dube, said the resilience by industry and commerce reflects commitment by Zimbabweans to work towards economic progress in line with national aspirations of yearly growth rates of above five percent.\n“This annual event serves as a testament to our nations unwavering commitment to fostering economic growth and innovation in all sectors, I would like to extend my heartfelt gratitude to each one of you for your attendance and for your continued dedication to the development of our beloved Zimbabwe,” Dr Dube said.\n“Reflecting on the remarkable journey of the Zimbabwe Business Expo, we recall the vision ignited by His Excellency, President Dr Emmerson Mnangagwa, it is his unwavering belief in our potential that has brought us here today.",
            "time": "09:07",
            "date": "15 Mar 2025"
        }
    ]
}