{
    "news": [
        {
            "title": "Mat North Investment Indaba pushes for private sector-led growth",
            "href": "https://www.zbcnews.co.zw/mat-north-investment-indaba-pushes-for-private-sector-led-growth/",
            "content": "Story by Mhlomuli Ncube\nUMGUZA-THE Government has re-emphasised the critical role of the private sector in national development through enhanced participation in key projects.\nNow in its second day, the Matabeleland North Investment Indaba 2025 has brought together stakeholders from across various sectors to explore investment opportunities in infrastructure, transport, mining, energy, and value addition.\nDelivering the keynote address, Minister of Finance and Economic Development, Professor Mthuli Ncube, underscored the importance of public-private partnerships in attaining the country’s developmental aspirations.\n“We are currently developing the NDS2, so we hope that the interactions from this Conference will also be an input into sharpening our second plan for the Republic,” he said.\nHe added that real economic transformation can only be achieved when the private sector becomes an active driver of national and provincial initiatives.\nOther delegates echoed the minister’s sentiments, underscoring the economic promise of Matabeleland North and the strategic importance of aligning capital markets with local projects.\n“This is an event which brings together various parties, project owners, and the capital markets and looking at the potential embedded in the region of Matebeleland North, it is a platform which will contribute to the unlocking of value in Matebeleland North,” Engineer William Gambiza said.\nWith a rich endowment of natural resources and a strategic geographic location, the province has been earmarked for major infrastructure development and industrialisation.\nBeitbridge Bulawayo Railway General Manager, Mr Khumbulani Mabvura, stressed the urgent need for investments in the rail sector to reduce pressure on road infrastructure.\n“The Victoria Falls Road, which the government is currently rehabilitating, may face deterioration again in the next two years due to the growing number of heavy trucks. We are seeking investment for our railway line along that corridor to protect our road infrastructure and increase value by transporting bulk goods via rail,” he said.\nMatabeleland North Minister of State for Provincial Affairs and Devolution, Honourable Richard Moyo, said the time for rhetoric is over, and the province is now pursuing actionable investment outcomes.",
            "time": "06:52",
            "date": "13 Jul 2025"
        },
        {
            "title": "Small-scale miners gear up for digital transformation through landmark deal",
            "href": "https://www.zbcnews.co.zw/small-scale-miners-gear-up-for-digital-transformation-through-landmark-deal/",
            "content": "Story by Theophilus Chuma\nTHE Artisanal and Small-scale mining sector is embracing the digital mining cadastre system, a requirement outlined in the recently gazetted Mines and Minerals Amendment Bill, targeting greater transparency and efficiency for thesector.\nThis follows a Memorandum of Understanding signed between the Zimbabwe Miners Federation (ZMF) and the Association of Mine Surveyors of Zimbabwe (AMSZ) in Harare this Thursday.\nIt is a deal of mutual agreement, which is expected to catapult artisanal and small-scale mining into a fully computerised sector for managing mining rights and operations under thesector, guided by the principles of the Mining Cadastre Information Management System (MCIMS).\nThe working arrangement agreed between ZMF and AMSZ targets to unlock benefits for the sector.\n“Our partnership with the Zimbabwe Miners Federation is a landmark agreement and supports access to credible mine surveying services, which they critically need for meeting formalisation requirements. Secondly, it supports the growth of this sector, our Minershave great potential to grow from small to medium and ultimately to large-scale miners. This is why we are ready to support this sector,” AMSZ president, Mr ShepherdGumbisaid.",
            "time": "06:52",
            "date": "13 Jul 2025"
        },
        {
            "title": "Business extravaganza in Matabeleland North attracts investors",
            "href": "https://www.zbcnews.co.zw/business-extravaganza-in-matabeleland-north-attracts-investors/",
            "content": "\nStory by Mhlomuli Ncube\nTHE Matabeleland North Provincial Investment Indaba kicked off in Umguza with potential investors having responded overwhelmingly to scout for business opportunities.\nWith representatives from all seven districts showcasing opportunities and seeking strategic partnerships, the conference has become a key platform for unlocking the province’s investment potential.\nLocal authority officials have described the Indaba as a vital avenue to promote their economic prospects to both domestic and international investors.\n“This platform offers us rare opportunities to showcase that we can harness and grow our economies at the local level,” Lupane Local Housing Director Board, Mr Freedom Sibanda said.\nHwange RDC Campfire Officer, Mr Xolisani Ncube said, the event is an important linkage to create and build businesses.\n“We are looking at this event as an important linkage to create and build businesses that will benefit our stakeholders and ratepayers,” he said.\n“This platform is marketing what we have. Our investors will then bring in capital which in turn will create opportunities and solutions for us as we work together,” Hwange Local Board CEO, Mr Ndumiso Mdlalose added.",
            "time": "06:52",
            "date": "13 Jul 2025"
        },
        {
            "title": "UAE becomes one of top ten global trade partners for Eurasian Economic Union",
            "href": "https://www.zbcnews.co.zw/uae-becomes-one-of-top-ten-global-trade-partners-for-eurasian-economic-union/",
            "content": "THE United Arab Emirates is now among the top ten global trading partners of the Eurasian Economic Union (EAEU), according to Andrey Slepnev, Minister in Charge of Trade at the Eurasian Economic Commission.\nSpeaking to the Emirates News Agency (WAM), a partner of TV BRICS, Slepnev said the recently signed Comprehensive Economic Partnership Agreement (CEPA) between the UAE and the EAEU is a “strategic milestone” that will deepen economic cooperation, diversify trade, and strengthen investment flows between the two sides.\n“The UAE is one of the most prominent trading partners for EAEU countries, with its share in the Union’s total foreign trade rising to two per cent,” he stated.\nTrade between the EAEU and the UAE has surged, with Union exports to the Emirates quadrupling in the past two years, while Emirati exports to EAEU markets have increased by over 50 per cent. Slepnev highlighted this as clear evidence of “the strength of economic ties between the two sides.”\n“The UAE is one of the most prominent trading partners for EAEU countries, with its share in the Union’s total foreign trade rising to two per cent,” he stated.\nTrade between the EAEU and the UAE has surged, with Union exports to the Emirates quadrupling in the past two years, while Emirati exports to EAEU markets have increased by over 50 percent.\nSlepnev highlighted this as clear evidence of “the strength of economic ties between the two sides.”\nThe CEPA aims to build on this momentum by eliminating customs barriers and broadening the range of traded goods.\nUnder the agreement, customs duties will be reduced on over 85 per cent of goods. Slepnev confirmed that this will lower tariffs on Union products in the UAE from five per cent to 0.6 per cent, and on Emirati goods in EAEU markets from 5.9 percent to 1.5 percent.\nProduct categories covered include metals, petrochemicals, transport equipment, wood products and processed agricultural goods from the EAEU, while the UAE will gain broader access for polymers  especially polyethylene and polypropylene as well as cosmetics and home appliances.",
            "time": "06:52",
            "date": "13 Jul 2025"
        },
        {
            "title": "Zimbabwe on track to halt cement imports as new plants take shape",
            "href": "https://www.zbcnews.co.zw/zimbabwe-on-track-to-halt-cement-imports-as-new-plants-take-shape/",
            "content": "Story byTamuka Charakupa\nZIMBABWE is edging closer to stopping cement imports after the setting up of various production plants across the country.\nChinese firm,Shungai Investment, is setting up a US$70 million cement plant in Chegutu, a developmentwhichis earmarked to catapult the country towards cement self-sufficiency status.\nThe plant is expected tostartfull production next year, with a projected output of800 000tonnes of cementannually.\nShuntai Investments (Pvt) Ltd Administration Manager, Mr YanBoconfirmed that his firm is seekingaSpecial Economic Zone status to operate competitively.\n“We are installing technologically-advanced machines and making use of locally available resources, so this means we are going to have minimum production cost, which translates to reduced retail price of a bag of cement. So far, we have already employed 300 local youths from Chegutu, and across all our operations, we are looking atabout4 000people in total. For the Chegutu plant, we have set up January of next year as our completion target.”\nChegutu District Development Coordinator, Mr Mark Kadaira, is impressed with the localised industrialisation drive, especially indrivingyouth empowerment.\n“This investment dovetails with the President’s mantra of leaving no one and no place behind. As a district, we are going to benefit a lot, especially in youth employment and the cheap availability of cement, whichobviouslyplays a part in infrastructure development.”\nThe Minister of Industry and Commerce, Honourable Mangaliso Ndlovu, said the government’s target is to improve the contribution of the manufacturing sector to the country’s Gross Domestic Product (GDP) from the current 14.5percentto 22percent.",
            "time": "06:52",
            "date": "13 Jul 2025"
        }
    ]
}