{
    "news": [
        {
            "title": "Port of Beira container volumes soar, powering Zim’s trade",
            "href": "https://www.zbcnews.co.zw/port-of-beira-container-volumes-soar-powering-zims-trade/",
            "content": "Story by Kenias Chivuzhe\nTHE Port of Beira continues to record increasing trade volumes, cementing its importance as an engine for accelerated economic growth for Zimbabwe and the region.\nContainer traffic at the port has soared from just over30 000containers in 1998 to more than400 000last year.This growth is largely attributed to Zimbabwe’s expanding economy, alongside increased trade flows from neighbouring Zambia, Malawi, and the eastern Democratic Republic of Congo.\nThe figures were revealed during a tour of the port by a Zimbabwean business delegation.Cornelder de Mozambique Chief Executive Officer, Jan de Vries, whose firm manages the port, highlighted Zimbabwe’s contribution to this growth.\n“We started in 1998, and we were doing30 000containers per year. Last year, we had412 000containers, and this year, we expect to grow even further,” he said.\n“This growth is fuelled by the port of Beira attracting more cargo from inland Zimbabwe, Zambia, Malawi and Eastern DRC due to thegrowthof these economies.Last year, the container terminalgrew by close to30percentin volumes,andthe general cargo terminal grew by 15percent.This year, we expect another modest growth, anduptonow, volumes areup, and weare looking at another 10 to 15percentgrowth this year.\n“From Zimbabwe, the volumes are very encouraging, and on the import side, we have seen more imports.Last year, wedid70 000containersintoZimbabwe, and on the export side, we saw a boom happening.We have alotof lithium productsthat are coming tothe port of Beira.We have also traditional commodities like chrome and granite, agricultural products like tea and tobacco.”\nTo keep up with the increasing volumes, the Port of Beira is undergoing expansion by adding storage space, new equipment, and modernising handling systems.\n“We are continuing to invest, and currently we are waiting for the arrival of new and bigger cranes that can handle even bigger vessels. They will be able to hold vessels that can bring10 000containers at once.We are also expanding our yardso that we can storemore containers.We want to continue serving the Zimbabwean market, which is very important for us,” added de Vries.\nZimbabwe’s head of the trade mission to Beira, Advocate Misheck Mugadza, reiterated the government’s commitment to upgrading Forbes Border Post to accelerate economic growth.\n“We arevery happyto be at the port of Beira,but,whatreallyexcited us is that the statistics we have been givenwhichhave exhibited that since the coming in of the Second Republic, ably led by Dr Emmerson Mnangagwa, Zimbabwe’s trade and economic development activities have quadrupled.",
            "time": "09:08",
            "date": "05 Jul 2025"
        },
        {
            "title": "Women entrepreneurs urged to explore regional and export markets",
            "href": "https://www.zbcnews.co.zw/women-entrepreneurs-urged-to-explore-regional-and-export-markets/",
            "content": "Story by Thubelihle Mhodi\nBULAWAYO-WOMEN in business are pushing for enhanced entrepreneurship and international marketing for economic growth.\nIn a powerful show of unity and ambition, women from diverse sectors gathered in Bulawayo this Thursday for a Common Market for Eastern and Southern Africa (COMESA) Federation of Women in Business engagement.\nThe meeting sought to foster business growth, self-sustenance, and opportunities for regional and global expansion.\nThe forum provided a platform for women to network, share experiences, and explore pathways towards building sustainable enterprises with potential for export.\n“Being part of this event is inspiring, having women telling their stories, and I have learnt that I can be anything I want to be, and with my small business, I can build something big,” a businesswoman said.\n“It is key to have systems in place so that the business can run even if you are not in attendance. It is a blessing to be here today because of the amount of wealth here, meeting people from different areas of experience, and age groups to grow,” a participant said.\n“The importance of systems to be able to do things remotely is an eye-opener for us as businesswomen. We have takeaways to challenge ourselves to get out of our comfort zones and do big things,” another businesswoman added.\nChairperson of the COMESA Federation of Women in Business, Edna Makurazhizha, emphasised the importance of entrepreneurship for women’s economic independence and regional trade integration.",
            "time": "09:08",
            "date": "05 Jul 2025"
        },
        {
            "title": "Zimbabwe-China reaffirm strategic ties to boost socio-economic growth",
            "href": "https://www.zbcnews.co.zw/zimbabwe-china-reaffirm-strategic-ties-to-boost-socio-economic-growth/",
            "content": "Story by Memory Chamisa\nHARARE – ZIMBABWE and China have expressed commitment to strengthening political and economic relations to foster socio-economic development.\nChina’s Ambassador to Zimbabwe, His Excellency Zhou Ding, paid a courtesy call on the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, at his Munhumutapa Office in Harare, this Wednesday.\nSpeaking after a closed-door meeting, the Chinese top diplomat noted the relations between the two governments in various fields of cooperation that have witnessed both economies benefiting.\n“Zimbabwe and China relations have weathered many storms, and we continue to partner with each other in various fields. We have had countless exchange programmes with the Media from Zimbabwe to China and vice versa. Zimbabwe has just launched its media policy that sees factual reportage, and we continue to join hands.\n“This year marks the 45th anniversary of the establishment of diplomatic relations between China and Zimbabwe. Since the establishment of diplomatic relations, China-Zimbabwe friendship has withstood the test of the evolving international landscape and remained rock-solid. China has always viewed the development of China-Zimbabwe relations from a strategic and long-term perspective, supports Zimbabwe in safeguarding its own interests and opposes external interference,” Ambassador Ding said.",
            "time": "09:09",
            "date": "05 Jul 2025"
        },
        {
            "title": "Zims tourism sector feels the pinch as global travel disruptions mount",
            "href": "https://www.zbcnews.co.zw/zims-tourism-sector-feels-the-pinch-as-global-travel-disruptions-mount/",
            "content": "Story by Tichaona Kurewa\nAS Zimbabwe’s tourism sector steadily recovers from the negative impact of the COVID-19 pandemic, renewed instability in the Middle East is threatening to slow progress towards pre-pandemic levels and beyond.\nTensions in the region are disrupting global air travel networks, affecting not only visitor numbers from the Middle East but also Zimbabwe’s broader connectivity with international markets.\nAccording to the 2024 Zimbabwe Tourism Authority (ZTA) Tourism Trends Statistics Report, a decline in bookings has already begun, with the potential to worsen if instability continues.\n“There have been noticeable cancellations and postponements, particularly among travellers with connections through Middle Eastern hubs. The report indicates an estimated decrease of about 15% in bookings from this market over the next quarter, reflecting concerns among potential travellers,” Hospitality Association of Zimbabwe vice president, Ms Emmah Kativu said.\nTourism operators are concerned that the geopolitical unrest is deterring visitors from countries directly affected, as well as those transiting through Middle Eastern cities.\n“We have also seen that Qatar has not been spared in these disputes. Qatar is a very strategic partner to Zimbabwe’s tourism sector, as most airlines connect through there. It serves as a hub for airlines from various global regions that bring clients to our country. As long as there is instability in Qatar, it becomes very difficult for people to connect to Zimbabwe. We are hopeful that world leaders will come together, reason together, and foster peace, peace that will help us attract more visitors to Zimbabwe and Southern Africa,” said Mr Clement Mukwasi, a tourism executive.\nThe Middle East serves as a critical aviation hub for Zimbabwe, with many travellers from Asia and Europe connecting through Doha, Dubai, and other major cities.\nDespite the challenges, tourism stakeholders are not sitting idle. The focus is now shifting toward strengthening ties with other regions and promoting Zimbabwe’s position as a safe and attractive destination.",
            "time": "09:09",
            "date": "05 Jul 2025"
        },
        {
            "title": "Zim-Moza companies explored joint trade and investment opportunities",
            "href": "https://www.zbcnews.co.zw/zim-moza-companies-explored-joint-trade-and-investment-opportunities/",
            "content": "Story by Kenias Chivuzhe\nMOZAMBIQUE – TRADE between Zimbabwe and Mozambique is on a growth trajectory, with business stakeholders from the two countries identifying key trade opportunities at a joint trade conference held in Beira, Mozambique, this Wednesday.\nSeveral Mozambican firms expressed interest in expanding operations into Zimbabwe, pointing to potential in key sectors such as agro-processing, logistics, energy, and construction.\n“We are interested in investing in the logistics sector in Zimbabwe. In Mozambique, we have a lot of investment opportunities in areas of agriculture and logistics where we can partner with Zimbabwean firms,” a Mozambican Business Community member said.\n“As a Mozambican business person, I feel there are opportunities in both countries and I already have an investments in Zimbabwe. I am, however, looking for partnerships with Zimbabweans in an area of agriculture. In Zimbabwe, you are very good in agriculture, and my idea is to bring technicians from Zimbabwe and enter into a partnership because there are a lot of opportunities here in Mozambique. There are trade opportunities in Zimbabwe, where some foods are coming all the way from Brazil. As for me, I am going to sell prawns to Harare. We have fish in our country, and there are a lot of dairy products in Zimbabwe,” another businessperson said.\nZimbabwean companies are equally eyeing opportunities across the eastern border, citing Mozambique’s fast-growing industries and infrastructure potential.\n“There are a lot of opportunities for transporters along the Beira Corridor including in construction, mining, and transport,” one Zimbabwean entrepreneur said.\n“JB Holdings is the only company in Zimbabwe that manufactures conveyor belts. We are in Botswana, and in Zambia, and we are exploring opportunities in Mozambique. We supply Tongaat Zimbabwe with conveyor belts, and we believe there is an opportunity here from Tongaat Mozambique,” a Zimbabwean Business Community member said.\nRepresenting ZimTrade, the country’s trade promotion body, Mr Admire Jongwe said Zimbabwe is keen to capitalise on growing trade ties with Mozambique.\n“Our economy is anchored on four main sectors that are manufacturing, agriculture, mining, energy, and tourism. We are here to seek the market for Zimbabwean products and at the moment, we are exporting US$7 billion worth of products and importing US$9 billion.\n“Mozambique is our fourth nation in terms of countries we export to. As a nation, our imports and exports from Mozambique have been increasing. In 2023, we exported US$400 million worth of products while we imported US$300 million worth of products from them. As Zimbabwe, we have been exporting construction materials, minerals, tobacco, and manufacturing substances to Mozambique. We have an opportunity to export processed foods. There are also opportunities in the building and construction industry.\n“We can also export cookies, biscuits, cereals, and other products. As of 2024, Mozambique imported US$218 million worth of iron and steel products, and with the coming in of Manhize, we can export more iron and steel products. Zimbabwe is also producing agricultural chemicals and horticultural products as a nation,” he said.\nThe Zimbabwean government welcomed the outcomes of the Beira conference, with plans to escalate trade engagements across the region.\n“We are pleased with the investment interest generated following these engagements. A lot of our people are seeking to invest in Mozambique, taking advantage of opportunities presented by the Beira Corridor. Some have successful businesses here already.\n“A lot of Mozambicans have expressed interest in investing in Zimbabwe. We are taking these initiatives higher, and we are not only engaging Mozambique, but we are going to engage in other regional countries such as South Africa, Zambia, and Malawi as we promote trade with other countries,” Head of Zimbabwe’s Trade Mission, Advocate Misheck Mugadza said.",
            "time": "09:09",
            "date": "05 Jul 2025"
        }
    ]
}