{
    "news": [
        {
            "title": "Gold reserve growth anchors ZiG currency stability",
            "href": "https://www.zbcnews.co.zw/gold-reserve-growth-anchors-zig-currency-stability/",
            "content": "Story by Owen Mandovha, Business Reporter\nHARARE – THE country’s economy is now reaping the fruits of President Emmerson Mnangagwa’s directive to grow reserves which has helped stabilise the local currency and create a foundation for future growth.\nIt is standard practice for a well-functioning economy to maintain a certain level of foreign currency and gold reserves essentially to provide an import cover for the country for a minimum of three months and in Zimbabwe’s case, vaults were virtually empty about two years before President Emmerson Mnangagwa gave a directive to mining companies to pay royalties in physical commodity.\nJust before the launch of the ZiG currency in April last year, 1.5 tonnes of reserves had been accumulated and when President Mnangagwa paid a surprise visit to the Reserve Bank of Zimbabwe this Thursday, he witnessed 3.4 tonnes of reserves.",
            "time": "20:41",
            "date": "21 Jun 2025"
        },
        {
            "title": "Botswana explores Zim’s waste management model at GeoPomona",
            "href": "https://www.zbcnews.co.zw/botswana-explores-zims-waste-management-model-at-geopomona/",
            "content": "Story by Owen Mandovha\nHARARE – THE Botswana Government has made a reciprocal benchmarking visit to the GeoPomona Waste Management Company following a similar visit embarked by the company to establish collaboration in waste management.\nThe delegation, led by Botswana’s Minister of Education, Honourable Justin Hunyepa, toured the GeoPomona facility to explore potential collaboration in waste management.\nHonourable Hunyepa expressed his intent to present the insights gained from the visit to Botswana’s Cabinet, aiming to replicate Zimbabwe’s successful waste management model in his home country.\n“I am going to share what I have learnt at this impressive project to Cabinet back home so that we can as well replicate the same in Botswana, since we are faced with similar challenges of waste management in and around the country. We are grateful for the opportunity presented to tour this facility.”\nBotswana Ambassador to Zimbabwe, Her Excellency Sarah Molosiwa mentioned that the visit resonates with President Duma Boko’s new thrust for councils to be innovative.\n“Our new government has encouraged our councils to be innovative and generate revenue and not rely on ratepayers and this project indeed resonates with what the new government can learn and replicate the same.”",
            "time": "20:41",
            "date": "21 Jun 2025"
        },
        {
            "title": "Govt begins consultative process for National Development Strategy 2",
            "href": "https://www.zbcnews.co.zw/govt-begins-consultative-process-for-national-development-strategy-2/",
            "content": "Story by Oleen Ndori, Foreign Desk Editor\nTHE government is undertaking consultative processes for the formulation of the National Development Strategy Two (2026-2030), which is expected to give further impetus to Zimbabwe’s journey towards attaining an upper-middle-income society by 2030.\nWith the National Development Strategy 1 (NDS1), which spans from 2021 to 2025, drawing to a close this year, preparations are already underway to shape the second phase of Zimbabwe’s economic transformation blueprint.\nPresenting the ten thematic areas that will guide NDS2 during a stakeholder engagement in Harare this Wednesday, the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, said the strategy would consolidate the progress made under NDS1 and sharpen focus on national priorities.\n“The National Development Strategy 2 will serve as the second five-year medium-term economic plan under the Second Republic, aimed at achieving Vision 2030. Following Cabinet’s approval of the NDS2 roadmap on September 17, 2024, the government has appointed chairpersons and co-chairpersons for each of the ten thematic working groups. These groups will consult widely across their domains to determine appropriate strategies and interventions aligned to national priorities,” Professor Ncube said.\nHe added that the consultations will adopt a participatory approach to promote inclusivity and national ownership of the strategy.\nChief Secretary to the President and Cabinet, Dr Martin Rushwaya, reinforced the government’s commitment to transparency and inclusiveness in the formulation process.\n“The successful implementation of NDS2 requires transformative leadership, alignment of goals across sectors, and collaboration from all stakeholders. President Emmerson Mnangagwa has directed that the consultative process be inclusive and comprehensive, capturing a wide range of voices from across the country, ensuring that no one and no place is left behind,” he said.\nHe further noted that NDS2 would establish a robust framework for aligning planning, budgeting, and execution of public investments.\nThe strategy will also define minimum service standards at all levels and adopt integrated results-based management principles.\nSpecific performance indicators will be used to measure progress and ensure the delivery of tangible development outcomes.\nStakeholders from the private sector, civil society, academia, and religious institutions attended the launch and welcomed government’s inclusive approach to policy formulation.\n“As stakeholders in the transport sector, we are pleased that our concerns will be addressed. It is encouraging that the government is engaging all sectors,” one participant said.",
            "time": "20:42",
            "date": "21 Jun 2025"
        },
        {
            "title": "Zim’s sugar industry eyes growth as Vision Group takes over Tongaat Hulett",
            "href": "https://www.zbcnews.co.zw/zims-sugar-industry-eyes-growth-as-vision-group-takes-over-tongaat-hulett/",
            "content": "Story by Gay Matambo\nCHIREDZI- ZIMBABWE’S sugar industry is poised for growth as new investors have joined the sector in a move meant to revitalise operations, while ensuring the industry’s long-term viability.\nVision Group, which includes investors from Zimbabwe and Pakistan, officially assumed its position as the new owner of Tongaat Hulett Zimbabwe after acquiring the agro-processing firm through a debt-to-asset swap transaction process.\nThe development comes at a time when the company was facing acute financial challenges that threatened sugar processing.\nSpeaking during a stakeholders’ engagement luncheon held at Hippo Valley Country Club this Tuesday, Vision Group Director, Mr Rutenhuro Moyo said they are committed to turning around the sugar industry in Zimbabwe, which is one of the lifelines of the country’s economy.\n“We want to stabilise operations as they are now. They have been unstable for a while since they went into business rescue in September 2022, which delayed capital programmes. We believe that is our first order of business. We think there is an opportunity to grow the business in terms of yields and area under cane, as well as innovate. We are also looking at possibilities to produce other by-products, such as carbon dioxide for the industry,” he said.\nThe coming on board of these investors is expected to drive strategic diversification while stabilising the company’s operations.\n“The Vision Group is African-owned. They have a vision to create an African agri-processing giant. They are committed long-term, with proven track records in African businesses. We are committed to transparency, open engagement, and generating strong financial returns for investors,” Chief Executive Officer for Vision Sugar, Mr Gavin Dalgeish said.\n“What is key right now is moving away from BRPs. With a new investor on board, we are liberated from negotiating with banks for credit lines. We can negotiate better terms with suppliers, rather than relying on cash-up-front deals that strain our cash flow due to lack of trust. Having a strong parent company allows us to focus on running operations effectively,” Tongaat Hulett Zimbabwe’s Chief Executive Officer, Mr Tendai Masawi noted.\nSugarcane outgrowers believe the sugar industry can return to profitability with proper management and transparency amongst key players in the sector.",
            "time": "20:42",
            "date": "21 Jun 2025"
        },
        {
            "title": "Youth-led telemedicine firm secures US$50k seed capital from NVCCZ",
            "href": "https://www.zbcnews.co.zw/youth-led-telemedicine-firm-secures-us50k-seed-capital-from-nvccz/",
            "content": "Story by Owen Mandovha\nHARARE-YOUNG Zimbabwean innovators have been urged to harness the opportunities presented by the National Venture Capital Company of Zimbabwe (NVCCZ) to transform their ideas into successful enterprises, as the Government intensifies support for youth-led innovation under its economic development strategy.\nThis comes as the NVCCZ, in collaboration with Old Mutual, disbursed US$50 000 in seed capital to KumbaCare, a youth-led telemedicine startup founded by Ms Agatha Mandovha, during an event held in Harare this Tuesday.\nKumbaCare offers a mobile-based healthcare platform tailored to serve rural and marginalised communities, enabling users to access health consultations for as little as US$1 per month, with benefits valued at US$30.\n“We came up with a solution that targets rural communities and underprivileged people by offering an affordable telemedicine solution using mobile platforms to seek health assistance from experts by just paying a dollar monthly but getting a US$30 package,” she said.\nThe NVCCZ was established as part of Government’s efforts to drive innovation and create employment by offering funding support to viable youth-led projects across sectors.\nNVCCZ Chief Executive Officer, Mr Tino Kambasha, emphasised that the initiative is a strategic intervention aimed at unlocking the potential of young entrepreneurs to contribute meaningfully towards national development.\n“We are here to solve support these young innovators who are determined to solve the country’s problems in our quest to attain an upper middle income society by 2030. We are working with young entrepreneurs through Old Mutual and this indeed is a new era to support entrepreneurship by Government,” he said.\nOld Mutual Zimbabwe, a key partner in the initiative, plays a pivotal role in identifying and nurturing promising ideas through its Innovation Hub, located in Harare.\n“We offer a platform where young people can develop their ideas and pitch them through structured innovation challenges. The most promising projects, such as KumbaCare, are then funded by NVCCZ,” group’s Marketing, Public Affairs and Sustainability Executive, Mrs Lilian Mbaiwa said.",
            "time": "20:42",
            "date": "21 Jun 2025"
        }
    ]
}