{
    "news": [
        {
            "title": "James Mharadze elected Chairperson of COMESA’s Yellow Card Scheme",
            "href": "https://www.zbcnews.co.zw/james-mharadze-elected-chairperson-of-comesas-yellow-card-scheme/",
            "content": "Story by Tichaona Kurewa\nZIMBABWEANS are increasingly occupying key roles in the region, with Mr James Mharadze recently elected as Chairperson of the Council of Bureaux for the Common Market for Eastern and Southern Africa (COMESA) Yellow Card Scheme.\nMharadze, an insurance practitioner, was elected at the ongoing 38th COMESA meeting of the Council of Bureaux of the Regional Third Party Motor Vehicle Insurance in Victoria Falls.\nActing COMESA Yellow Card Scheme Chairperson Mr Patrick Kusikwenyu indicated that the vote on Zimbabwe is a show of confidence in the Southern African country and its ability to lead the Yellow Card Scheme.\n“For starters, we have been in it from the beginning. We have a lot of understanding of the processes and how they work, but also, I think the guidance that we will also be able to give will be at the highest level. We want to see efficiency as we move into this new era, the year that we will be running.\n“We want to ensure that the governance structures of the Yellow Card continue to be strengthened. We also want to see the ability for the communication between countries to be much better. So Zimbabwe has just recently been elected and I think it is a very important position to hold,” he said.\nMr Charles Ndagijima, Past president from Burundi will deputise Mr Mharadze.\nMr Mharadze is a complete insurance professional with experience in both short-term insurance and life assurance industries comprising 21 years in general insurance and two years in the life assurance industry.\nHe has 23 years of professional experience, 14 of which are at senior management level, and will lead the regional board for a year.\nHe worked for AIG Zimbabwe, Zimnat Lion, Optimal Insurance, CBZ Life, and CBZ Insurance.\nCurrently, Mharadze is the General Manager and Principal Officer at CBZ Insurance.",
            "time": "08:28",
            "date": "03 Mar 2025"
        },
        {
            "title": "Economic stability on track as Zimbabwe’s inflation falls",
            "href": "https://www.zbcnews.co.zw/economic-stability-on-track-as-zimbabwes-inflation-falls-2/",
            "content": "\nStory by Stanley James\nZIMBABWE’s economic growth agenda is on track, with February figures reflecting progress towards stable prices and increased consumer spending.\nAccording to data from the Zimbabwe National Statistics Agency, Zimbabwe Gold inflation for February dropped by 10% points to 0,5% with the United States Dollar inflation rate also falling by the average of the same margins.\nThe agency states the trend means that prices as measured by the All Items Consumer Price Index increased by an average of 0,5%  between January 2025 and February 2025.\nThe drop in the inflation rate has set the tone for a promising outlook on price stability.\n“The latest data has really ignited that the stability can be managed and that there is that zeal by the relevant authorities to contain inflation,” said Confederation of Zimbabwe Industries Macroeconomics committee chairperson, Mr Jimmy Pscillos.\n“While a drop in inflation does not necessarily mean a fall in prices, the current data shows that the rate at which pricing is increasing in Zimbabwe during February this year declined by over 10% points.\n“This is a commendable element taking into account the needs of industry for a stable and predictable economic climate that fosters growth and lowers costs of doing business while boosting overall macroeconomic performance by key sectors of the economy at a time when we are expecting food inflation or prices to drop in the second quarter riding on gains emanating from the bumper harvest.”\nThe fall in inflation is also attributed to the tight monetary policy stance.\n“Such a trend can be maintained if the relevant authorities walk the talk in terms of commitment to stabilise the pricing models in the economy, while so far all looks to be good, there is the need to sustain the stability gains by focusing on long-term strategies to guard against the global and local shocks,” RBZ Monetary Policy committee member, Mr Persistence Gwanyanya said.",
            "time": "08:28",
            "date": "03 Mar 2025"
        },
        {
            "title": "Zimbabwe poised for economic growth, US Chamber of Commerce states at Victoria Falls Summit",
            "href": "https://www.zbcnews.co.zw/zimbabwe-poised-for-economic-growth-us-chamber-of-commerce-states-at-victoria-falls-summit/",
            "content": "Story by Tichaona Kurewa\nZIMBABWE is fast becoming a hub for investments, with the United States attesting to the country’s economic potential.\nSpeaking on the sidelines of the ongoing three-day United States Exchange Alumni Summit in Victoria Falls, American Chamber of Commerce in Zimbabwe, James Oliver attributed the coming in of the new dispensation in the Southern African country as the turning point.\n“I think the current administration has made it much more conducive to do business here. I’ll give you an example, ZIDA has been a wonderful asset for us as we began to get started, helping us navigate the special economic zones, even Vic Falls through the special opportunities that are here. So organisations like ZIDA, have made the investment process much easier. I can tell you the climate has changed to where people are interested here and not just from a mining perspective and some of the traditional businesses.”\nOliver’s sentiments were also echoed by the US Ambassador to Zimbabwe, Her Excellency Pamela Tremont who is prioritising attracting more investment into Harare.\nShe said, “Since I got here, I’ve been focused on improving the investment climate. Everybody I meet says, why are there not more American companies here? Why aren’t people investing in all these opportunities? And so, as soon as I hit the ground, I immediately started wondering that myself. Why is that? And of course, improving the investment climate to attract more, not just U.S. businesses, but businesses from around the world.”\nWith its rich natural resources, improving business climate, and strategic location, Zimbabwe is poised to become a hub for investors.\nOver 200 delegates from more than 10 countries in the Southern African region are attending the US Exchange Alumni Summit.",
            "time": "08:28",
            "date": "03 Mar 2025"
        },
        {
            "title": "Economic stability on track as Zimbabwe’s inflation falls",
            "href": "https://www.zbcnews.co.zw/economic-stability-on-track-as-zimbabwes-inflation-falls/",
            "content": "Story by Stanley James\nZIMBABWE’s economic growth agenda is on track, with February figures reflecting progress towards stable prices and increased consumer spending.\nAccording to data from the Zimbabwe National Statistics Agency, Zimbabwe Gold inflation for February dropped by 10% points to 0,5% with the United States Dollar inflation rate also falling by the average of the same margins.\nThe agency states the trend means that prices as measured by the All Items Consumer Price Index increased by an average of 0,5%  between January 2025 and February 2025.\nThe drop in the inflation rate has set the tone for a promising outlook on price stability.\n“The latest data has really ignited that the stability can be managed and that there is that zeal by the relevant authorities to contain inflation,” said Confederation of Zimbabwe Industries Macroeconomics committee chairperson, Mr Jimmy Pscillos.\n“While a drop in inflation does not necessarily mean a fall in prices, the current data shows that the rate at which pricing is increasing in Zimbabwe during February this year declined by over 10% points.\n“This is a commendable element taking into account the needs of industry for a stable and predictable economic climate that fosters growth and lowers costs of doing business while boosting overall macroeconomic performance by key sectors of the economy at a time when we are expecting food inflation or prices to drop in the second quarter riding on gains emanating from the bumper harvest.”\nThe fall in inflation is also attributed to the tight monetary policy stance.\n“Such a trend can be maintained if the relevant authorities walk the talk in terms of commitment to stabilise the pricing models in the economy, while so far all looks to be good, there is the need to sustain the stability gains by focusing on long-term strategies to guard against the global and local shocks,” RBZ Monetary Policy committee member, Mr Persistence Gwanyanya said.",
            "time": "08:28",
            "date": "03 Mar 2025"
        },
        {
            "title": "COMESA’s yellow card scheme sees 33% surge in issuance",
            "href": "https://www.zbcnews.co.zw/comesas-yellow-card-scheme-sees-33-surge-in-issuance/",
            "content": "Story by Tichaona Kurewa\nTHE 38th Common Market for Eastern and Southern Africa (COMESA) meeting of the Council of Bureaux of the Regional Third Party Motor Vehicle Insurance kicked off in Victoria Falls this Wednesday, amid revelations a phenomenal increase of 33 percent in yellow cards issuance was recorded last year compared to 2023.\nCOMESA Yellow Card Council of Bureau Chairperson, Mr Kusikwenyu told journalists on the sidelines of the COMESA meeting of the Council of Bureaux of the Regional Third Party Motor Vehicle Insurance that his organisation issued more than 600 000 yellow cards in 2024, as opposed to about 450 000 the previous year.\nOf these cards, over 70 000 were issued to vehicles exiting Zimbabwe.\nHe attributed the growth to ongoing efforts to raise awareness in member states on the benefits of the yellow card.\n“That growth has been because of the efforts of the council to grow the yellow card through conscientising the motorists on the benefits of the yellow card. Remember, the yellow card is a trade facilitation instrument, and it allows drivers that cross borders to be able to get compensation quickly if they’re involved in accidents outside the country,” he said.\nZimbabwe’s Insurance and Pensions Commission’s Ms Sibongile Siwela director noted the significance of the yellow card.",
            "time": "08:28",
            "date": "03 Mar 2025"
        }
    ]
}