{
    "news": [
        {
            "title": "Cabinet approves AI strategy to drive industrialisation",
            "href": "https://www.zbcnews.co.zw/cabinet-approves-ai-strategy-to-drive-industrialisation/",
            "content": "Story by Bruce Chahwanda\nCabinet has approved the Zimbabwe National Artificial Intelligence (AI) Strategy Framework as government seeks to propel economic growth through industrialisation by adopting latest technologies.\nWith the world increasingly becoming more digital, government crafted the Zimbabwe National Artificial Intelligence (AI) Strategy to promote the modernisation and industrialisation agenda.\nThe policy framework was announced by the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere at a post-Cabinet media briefing this Tuesday.\n”Cabinet wishes to advise that the Zimbabwe National Artificial Intelligence (AI) Strategy is also aligned to the Smart Zimbabwe 2030 Master Plan, and is aimed at driving economic growth through industrialisation by promoting the adoption of AI technologies in key sectors such as manufacturing, agriculture, mining, and services. The Strategy focuses on modernising Zimbabwe’s economy and transitioning from a resource-based economy to one driven by technology and innovation. It emphasises on developing digital infrastructure, such as high-capacity fiber networks and 5G technologies, as these are essential for enabling AI adoption across various sectors of the economy,” said Dr Muswere.\nCabinet also approved the Tourism and Hospitality Industry Policy to ensure availability of physical infrastructure for the sector.\n”The Policy is underpinned by six primary goals, as follows: utilization of innovative frameworks to accelerate tourism and hospitality industry development and promotion; strengthening human capacity development in the tourism and hospitality industry; developing a robust physical and digital infrastructure for the tourism and hospitality industry; strengthening a facilitatory legal and regulatory infrastructure for the tourism and hospitality industry; developing and utilising innovative and stable financing infrastructure for the tourism and hospitality industry; and fostering regional and international cooperation to grow the industry. The policy framework will be supported among others, by a robust institutional framework for coordination, monitoring and implementation modalities,” he said.",
            "time": "18:32",
            "date": "18 Dec 2024"
        },
        {
            "title": "Strong 2024 share transactions position Zimbabwe Stock Exchange for future growth",
            "href": "https://www.zbcnews.co.zw/strong-2024-share-transactions-position-zimbabwe-stock-exchange-for-future-growth/",
            "content": "Story by Stanley James\n\nThe Zimbabwe Stock Exchange (ZSE) has maintained its momentum as a vibrant platform for capital raising and investment returns after recording over ZiG1.8 billion in share transactions since April.\n\nThe ZSE has met its 2024 overall performance figures, showcasing a strong market performance despite challenges faced by listed companies.\n\nSince the introduction of the Zimbabwe Gold currency in April, the exchange has facilitated share transactions worth nearly ZiG2 billion. The total market capitalisation of listed companies has also surpassed ZiG83 billion, reflecting growing confidence in the market.\n\nAs a platform for trading shares and protecting investor interests through transparency and price discovery, the ZSE All Share Index has recorded a remarkable 165% gain since April.\n\nForeign investor participation has accounted for 15% of total share transactions, with interests focused on mining, construction, retail, agriculture, transport and distribution sectors.\n\nThe top five companies contributing to 85% of share transactions this year are Delta Corporation Limited, Econet Zimbabwe Limited, Ecocash Holdings Zimbabwe Limited, NMB and FBC.\n",
            "time": "18:32",
            "date": "18 Dec 2024"
        },
        {
            "title": "Retail and residential projects dominate real estate sector investments",
            "href": "https://www.zbcnews.co.zw/retail-and-residential-projects-dominate-real-estate-sector-investments/",
            "content": "Story by Stanley James, Business Editor\nMore than US$500 million has been invested in Zimbabwe’s real estate projects since January, dominated by retail and residential properties.\nStakeholders in the real estate sector are meeting in Harare for their annual three-day indaba to review operations and focus on the outlook, with presentations showing increased capital expenditure by investors.\n“This is a sector that is used to hedge against macro-economic issues so interest continue on a positive trajectory and indeed, while there are challenges, this is however not hindering overall strides in the value chains,” said real estate consultant, Mr Kura Chihota.\nZimbabweans abroad are also investing in the real estate sector.\n“The diaspora market is forming the basis of unlocking more returns to the investors. It is the appetite by the Zimbabweans to invest back home that has seen a lot being done by the diaspora market in as far as making decisions to inject capital in fixed assets that guarantee long term benefits is concerned,” noted Homelux Properties Managing Director, Mr Justin Machibaya.",
            "time": "18:32",
            "date": "18 Dec 2024"
        },
        {
            "title": "President Mnangagwa opens iron and steel indaba",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-opens-iron-and-steel-indaba/",
            "content": "Story by Tafara Chikumira\nPresident Emmerson Mnangagwa has officially opened the inuagural Iron and Steel Indaba in Kwekwe this Thursday, with the need to resuscitate the industry and consolidate current gains taking centre stage.\nThe indaba comes at a time government has made significant progress in growing the iron and steel industry that had been hit by the illegal sanctions that saw the closure of ZISCO steel company in 2008.\nThe inception of the Second Republic has, however, witnessed some massive growth in the iron and steel sector, with the establishment of Dinson Iron and Steel Company putting the country on the world map in the steel production matrix.\nOfficially opening the Indaba, President Mnangagwa highlighted the strides made in revitalising the iron and steel industry.\nHe noted that the iron and steel sector is critical for the growth of the national economy.",
            "time": "18:32",
            "date": "18 Dec 2024"
        },
        {
            "title": "Entrepreneurship and innovation key to achieving Vision 2030 goals",
            "href": "https://www.zbcnews.co.zw/entrepreneurship-and-innovation-key-to-achieving-vision-2030-goals/",
            "content": "Story by Mercy Bofu-Matinha\nGOVERNMENT has challenged the business community to take advantage of the conducive environment availed by the Second Republic to be innovative and expand their businesses.\nWith Masvingo province targeting an US$8 billion economy by the year 2030, government has challenged stakeholders to adopt a culture of innovation and maximise on production.\nMasvingo Minister of State for Provincial Affairs and Devolution Honourable Ezra Chadzamira made the remarks at the 3rd edition of the Masvingo Achievement Awards (MAA) where individuals, companies and institutions which performed well during the course of the year were honoured.\n“As a province, the economic performance for the year 2023, ZIMSTAT current statistics reflects that the real gross domestic product for Masvingo is more than 18 billion Zimbabwe Gold, contributing about 7 percent to the National GDP. It is our wish that we continue to put up measures that ensure growth of our GDP and that we meet our US$8 billion economy by 2030.”\nThose who were honoured paid tribute to government for the support through ensuring a conducive operating environment for businesses.",
            "time": "18:32",
            "date": "18 Dec 2024"
        }
    ]
}