{
    "news": [
        {
            "title": "Zim’s participation at Iran-Africa Conference a success, says VP Chiwenga",
            "href": "https://www.zbcnews.co.zw/zims-participation-at-iran-africa-conference-a-success-says-vp-chiwenga/",
            "content": "Story by Stanley James, Business Editor\nVICE President General (Retired) Dr Constantino Chiwenga has described Zimbabwe’s participation at the 3rd Iran-Africa Economic Conference as a success as it helped in bolstering bilateral ties and advancing the interest of the country in the global trade arena.\nOn the side-lines of the conference in Tehran, Iran, Vice President Chiwenga, met Iran President Dr Masoud Pezeshkian, his First Vice President, Dr Mohammad Reza Aref, top government officials, the private sector, diplomats, investors among others.\nSpeaking on the participation of Zimbabwe at the 3rd Iran-Africa Economic Conference, Dr Chiwenga said the nation benefited in terms of learning from Iran’s business, trade and economic development models.\n“Since we arrived, we have been involved in engagements from the leadership and companies that want to do business with Zimbabwe and what I can tell you is that we have benefitted a lot. The tractor project is now on course. We are happy with the technology that we have seen.”",
            "time": "20:43",
            "date": "30 Apr 2025"
        },
        {
            "title": "Zimbabwe-Iran pledge to deepen cooperation",
            "href": "https://www.zbcnews.co.zw/zimbabwe-iran-pledge-to-deepen-cooperation/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE and Iran have agreed to continue strengthening relations through the implementation of agreements on trade and investment.\nVice President General (Retired) Dr Constantino Chiwenga had an engagement with the Islamic Republic of Iran’s First Vice President Dr Mohammad Reza Aref in Tehran this Monday.\nAfter the meeting, Dr Chiwenga outlined Zimbabwe’s mission to consolidate ties with Iran.\n“Our relations with Iran started many years ago and we have come to strengthen those relations. We were discussing the issues from the President of Iran’s speech during the official opening of the 3rd Iran-Africa Economic Conference and our cooperation with the Islamic Republic of Iran. We have a joint commission in which we cooperate in many areas.”\nThe Islamic Republic of Iran’s First Vice President Dr Mohammad Reza Aref spoke on his country’s commitment to cooperate with Zimbabwe.\n“For over the past two decades, the two countries are fighting to achieve the objectives of freedom, we are backed by our people and it is the people who are supporting that mode. So, in terms of collaboration with Zimbabwe, we are indeed committed to further cooperation in many areas.”",
            "time": "20:43",
            "date": "30 Apr 2025"
        },
        {
            "title": "Zimbabwe strengthens diplomatic relations with the Vatican",
            "href": "https://www.zbcnews.co.zw/zimbabwe-strengthens-diplomatic-relations-with-the-vatican/",
            "content": "Story by Abigirl Tembo\nZIMBABWE is looking to deepen ties with the Vatican, with focus on promoting education, social justice and women empowerment.\nSpeaking after Pope Francis’s funeral, which was attended by Vice President General (Retired) Dr Constantino Chiwenga on Saturday, Zimbabwe’s top envoy to France and Vatican Ambassador Sekai Nzenza outlined the country’s plans to strengthen its ties with the Vatican.\nShe emphasised the crucial role the Catholic Church has played in Zimbabwe’s education system, citing its numerous schools and institutions that have provided quality education to millions of Zimbabweans over the years.",
            "time": "20:43",
            "date": "30 Apr 2025"
        },
        {
            "title": "From exclusion to empowerment, ZITF 2025 highlights indigenous innovation",
            "href": "https://www.zbcnews.co.zw/from-exclusion-to-empowerment-zitf-2025-highlights-indigenous-innovation/",
            "content": "Story by Peter Chivhima\nZIMBABWE’S independence continues to open doors of opportunities for indigenous business players as witnessed at the just-ended 65th edition of the Zimbabwe International Trade Fair in Bulawayo.\nBefore 1980, platforms such as the Zimbabwe International Trade Fair (ZITF) which was then known as the Central African Trade Fair, were largely dominated by the white minority.\nOpportunities for black Zimbabweans to innovate, produce and market their goods were limited, often stifled by a system that excluded them from mainstream economic activities.\nToday, things have changed and local entrepreneurs are now key players in shaping the national economy.\n“We are happy that independence has brought a lot to us and today we are here exhibiting our products freely, in the past it was difficult to get such opportunities because the white minority were the ones owning companies,” an exhibitor said.\n“We are grateful for the independence, we are now able to showcase our products, now able to discuss with other people who are into business on how to grow our business and how we can improve on our products as well,” a business owner said.\nThe Trade Fair is no longer a preserve for a few, but a celebration of Zimbabwe’s diverse and dynamic entrepreneurial spirit nurtured by the freedom and opportunities that independence made possible.",
            "time": "20:43",
            "date": "30 Apr 2025"
        },
        {
            "title": "Zim strengthens trade ties at the 7th Iran-Expo 2025",
            "href": "https://www.zbcnews.co.zw/zim-strengthens-trade-ties-at-the-7th-iran-expo-2025/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE this Monday joins over 100 nations at the seventh Iran-Expo 2025, which officially opened this Monday, marking a key step in strengthening economic and trade relations between the two countries.\nVice President General (Retired) Dr Constantino Chiwenga, who is leading the Zimbabwean delegation is attending the Expo and will also tour exhibition halls.\nHe will also be attending specialised and export development oriented meetings at the Iran-Expo 2025 including discussions to increase economic and trade relations between Zimbabwe and Iran.",
            "time": "20:43",
            "date": "30 Apr 2025"
        }
    ]
}