{
    "news": [
        {
            "title": "LPG prices fall 10% after VAT scrapping",
            "href": "https://www.zbcnews.co.zw/lpg-prices-fall-10-after-vat-scrapping/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe’s Sustainable Energy Plan has received a boost after the government scrapped Value Added Tax (VAT) on Liquefied Petroleum Gas (LPG), translating to a 10 percent reduction in the price of the commodity.\nThe removal of VAT for gas that was effected on the 1st of January this year has resulted in the Zimbabwe Energy Regulatory Authority (ZERA) slashing prices of the commodity by about 10 percent.\nZERA’s Chief Executive Officer, Mr Eddington Mazambani revealed that the move will reduce energy costs for Industry and Commerce.\nHe said, “It is true that the gas prices have been slashed, this is in response to the removal of the Value Added Tax, so we have gazetted the relevant prices and we anticipate the trend to continue subject to market conditions. While this is for January, we anticipate the trend to continue intact all the value chains have been informed or notified of the developments and we expect them to comply.”",
            "time": "20:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Calls for policy intervention grow as smuggled goods flood market",
            "href": "https://www.zbcnews.co.zw/calls-for-policy-intervention-grow-as-smuggled-goods-flood-market/",
            "content": "Story by Owen Mandovha, Business Reporter\nPlayers in the wholesale and retail sector have called for policy interventions to address viability challenges at a time when the market has been flooded by smuggled goods and informal traders on their doorsteps.\nThe Second Republic has created an environment for business to thrive with various players including the informal sector running successful business ventures.\nThe gains are, however, being set back by a glut of smuggled goods which have found their way into the informal market at cheaper prices.\nKey proponents of the Buy Zimbabwe initiative are convinced there is need for policy and regulatory interventions.\n“The situation obtaining here is clear, you have got big manufacturers who are doing very well in the same environment that these retailers and wholesalers are operating. The problem here is that laws favour the informal sector because big businesses have to comply with a lot of policies that are difficult and distort their pricing framework. So it’s not an economic issue but an issue of how government should reform policies that allow these companies to thrive,” Buy Zimbabwe’s Executive Director Mr Munyaradzi Hwengwere said.\nConfederation of Zimbabwe Retailers’ president, Dr Denford Mutashu concurred adding that there is need to cushion the formal sector.\n“Retailers have to sell in both currencies which does not apply to the informal sector hence manufacturers end up preferring to sell directly to the informal sector who sell in foreign currency so this provides an untenable situation for the formal retailers.”",
            "time": "20:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Manicaland province increases milk output",
            "href": "https://www.zbcnews.co.zw/manicaland-province-increases-milk-output/",
            "content": "Story by Kenias Chivuzhe\nThe drive to increase milk production to meet national demand of more than 150 million litres is on track, with Manicaland province recording a 27 percent increase after the introduction of the presidential silage programme in 2022.\nEfforts to increase national milk production are yielding positive results, with small-scale farmers playing an active role.\nCynara Dairy Farmers Cooperative in Mutasa South is one of the success stories under the Second Republic’s inclusive development agenda.\n“We started our operations in 2017 and our production was 4 600 litres and in 2024 we increased our production to 67 000 litres. We are looking forward to reach 300 000 litres by end of this year as we have increased our herd,” said chairperson of Cynara Dairy Farmers Cooperative, Francis Musunzuru.\nSmall-scale dairy farmers in the area have benefited from government support, which has given impetus to their milk production ventures.\n“We have partners selling affordable dairy calves to us at $100 each. We were also given an artificial insemination kit to grow our herd,” said a dairy farmer.\n“The presidential silage scheme is helping us a lot in improving the volume of milk we produce due to increased supply of feeds,” said a dairy farmer.\n“We are looking forward to growing our herd as we are being supported by the government,” said another dairy farmer.\n“We are happy with the support but we can produce more if our herd is increased. We are planning to produce feeds locally to reduce production costs,” said a dairy farmer.\nGovernment support has been the major driver of growth in the dairy sector.\n“Since the introduction of the presidential silage scheme, Manicaland province recorded 27 percent growth in terms of milk production. We want to thank the government and President Mnangagwa for supporting farmers to increase productivity,” Mutare regional chairperson of Zimbabwe Association of Dairy Farmers, Mrs Rudo Sithole said.",
            "time": "20:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Zim sets target of 40 tonnes of gold this year",
            "href": "https://www.zbcnews.co.zw/zim-sets-target-of-40-tonnes-of-gold-this-year/",
            "content": "\nStory by Stanley James, Business Editor\nZIMBABWE’s gold output is expected to reach 40 tonnes this year, driven by new investments, favourable operating environment and increased capacity.\nThe latest data by the country’s sole buyer of the precious metal, Fidelity Gold Refinery, shows that the output of the yellow mineral was over 36 tonnes last year compared to 30 tonnes in 2023.\nThe statistics have further raised hopes of increased production riding on artisanal miners, including new projects by large-scale gold mining companies.\n“The target is achievable, but, that depends on the long-term perspectives of the entire gold mining industry including the need for the government to provide support in the form of machinery including incentives to facilitate smooth payment modalities from Fidelity Gold Refiners .\n“Going forward the sector will continue to focus on expansionary projects to add value and boost output.\n“Optimism in the industry is high remember this is the sector where the small scale miners continue to play a pivotal role in deliveries so it is within that perspective where sustainable development hinges on continuous favourable policies that facilitate maximum production,” Zimbabwe Miners Federation chief executive officer, Mr Wellington Takavarasha said.",
            "time": "20:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Tourism sector revels in record-breaking festive season",
            "href": "https://www.zbcnews.co.zw/tourism-sector-revels-in-record-breaking-festive-season/",
            "content": "\nStory by Tichaona Kurewa\nTHE local tourism sector is celebrating a resounding success after a record-breaking festive season.\nThe Hospitality Association of Zimbabwe revealed to ZBC News this Saturday that accommodation facilities across the country reported occupancy rates exceeding 80%, a significant surge compared to previous years.\n“Occupancy was in excess of 80% for the period, but if you look at the major festive days, which is the Christmas days, 24 to 26, most properties recorded 100%. During that period, we also saw high volumes of people going into various properties, and the different operators had to come up with various ways to control the traffic. So yes, it was a success,” president of the Hospitality Association of Zimbabwe, Mr Brian Nyakutombwa said.\n“This year’s festive season has been a mixed bag. The diaspora market had suppressed numbers compared to last year, but the traditional domestic market, they did come with their numbers, which was very encouraging,” he said.\n“Personally, I can say the business was okay. We realised a slight hike in the number of clients that we normally have on a daily basis in the other months,” safari operator, Mr Charles Chakanya.\nTourism players noted the need to expedite rehabilitation of the Bulawayo-Victoria Falls Highway and the absence of traditional festivals such as the carnival as having stifled some potential travellers.",
            "time": "20:37",
            "date": "12 Jan 2025"
        }
    ]
}