{
    "news": [
        {
            "title": "Implementation of agreements tops Zim–Belarus mid-term review",
            "href": "https://www.zbcnews.co.zw/implementation-of-agreements-tops-zim-belarus-mid-term-review/",
            "content": "By Stanley James, Business Editor\nTHE Mid-Term Review of the Zimbabwe–Belarus Joint Permanent Commission on Cooperation (JPCC) commenced this Monday in Harare, with a particular focus on the implementation of previously signed agreements.\nThe three-day session seeks to assess the progress of bilateral cooperation, evaluate set targets, and address any challenges impeding the full realisation of joint initiatives.\nDuring the opening ceremony, Zimbabwe reiterated its commitment to strengthening its strategic alliance with Belarus.\n“The close relationship that exists between our leaders their Excellencies,  President Emmerson Mnangagwa and President Aleksandr Lukashenko, is the bedrock upon which the Zimbabwe,  Belarus partnership is built,” the Chief Director for Political Affairs in the Ministry of Foreign Affairs and International Trade, Mr Pearson Chigiji said.\n“We must seize this rare opportunity to engage at a strategic level, as it is through such engagements that we will chart a path towards tangible and mutually beneficial cooperation between our nations. We must ensure that what we agree today, not only on what was captured in written agreements but most importantly that it is implemented on the ground, failure to do so would render our deliberations unproductive and hollow. The agenda before us serves as a guide for our discussions. However it should not constrain us to these matters alone, let us remain open to discussing any other issues of mutual interest as our partnership continues to evolve,” he said.\nBelarus highlighted the importance of the JPCC in further enhancing investments in Zimbabwe.\n“A little over a year ago, the first session of the Joint Permanent Commission on Cooperation between the Republic of Belarus and the Republic of Zimbabwe was held here at the Rainbow Towers Conference Centre, it is very symbolic that our meeting takes place on the eve of the 45th anniversary of the Independence of Zimbabwe and the 80th anniversary of the victory over fascism in the Second World War,” Head of the Department of Africa and the Middle East, Mr Yuri Nikolaychik said.",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "ZAS, govt partner to boost the Agric sector",
            "href": "https://www.zbcnews.co.zw/zas-govt-partner-to-boost-the-agric-sector/",
            "content": "Story by Stanely James , Business Editor\nZIMBABWE’s agricultural sector has taken a step forward with the Zimbabwe Agricultural Society (ZAS) signing two key agreements with the government to boost productivity and economic growth.\nThe partnership aims to strengthen farming value chains, enhance productivity, and promote skills development.\n“ZAS has seen it more prudent to focus on the farming sector value chains riding on the farming sector growth and the need to boost production and scale up the needs of the economy, this is actually crucial taking into account what is happening in the economy whereby opportunities are being created to cement or bolster partnerships for the benefit of the overall value chains,” ZAS Chief Executive Officer, Mr Rufaro Gunundu said.",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Zimbabwe Showcases Investment and Tourism Potential at Expo 2025 Osaka",
            "href": "https://www.zbcnews.co.zw/zimbabwe-showcases-investment-and-tourism-potential-at-expo-2025-osaka/",
            "content": "Story by Oleen Ndori, Foreign Desk Editor\nEXPO 2025 Osaka has officially commenced in Kansai, Japan, bringing together over 150 countries under the theme, “Designing Future Societies for Our Lives.”",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Zim and Algeria strengthen bilateral ties and discuss ways to boost economic cooperation",
            "href": "https://www.zbcnews.co.zw/zim-and-algeria-strengthen-bilateral-ties-and-discuss-ways-to-boost-economic-cooperation/",
            "content": "Story by Fungai Jachi\nZIMBABWE and Algeria are set to deepen their bilateral relations, with renewed focus on enhancing cooperation in politics, trade, and economic development under the framework of the Joint Permanent Commission on Cooperation (JPCC).\nThis comes after a meeting between Algeria’s State Secretary for African Affairs, Honourable Selma Bakhta Mansouri, and Zimbabwe’s Minister of Foreign Affairs and International Trade, Professor Amon Murwira, in Harare.\nHonourable Mansouri expressed satisfaction with the current state of bilateral ties, describing them as historically rooted and strategically significant.\n“This visit was an occasion for me to discuss with the Honourable Minister the very good status of our bilateral relationship,” Honourable S Mansouri said.\n“Algeria and Zimbabwe have a very common historical relationship rooted in a common struggle against colonialism and the struggle and fight for liberation. I was really happy to meet with the Minister and to have an update on our bilateral relationship, both in the political, economic and other areas.",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Zim positions itself as a competitive tourism hub at World Travel Market Africa",
            "href": "https://www.zbcnews.co.zw/zim-positions-itself-as-a-competitive-tourism-hub-at-world-travel-market-africa/",
            "content": "Story by Farai Gwaze\nZIMBABWE is making a significant impact at the World Travel Market (WTM) Africa 2025, underway at the Cape Town International Convention Centre.\nLed by the Ministry of Tourism and Hospitality Industry and the Zimbabwe Tourism Authority, the country’s delegation features 15 key industry players showcasing their offerings.",
            "time": "08:44",
            "date": "15 Apr 2025"
        }
    ]
}