{
    "news": [
        {
            "title": "Govt launches the Midlands Investment Compendium to unlock provincial potential",
            "href": "https://www.zbcnews.co.zw/govt-launches-the-midlands-investment-compendium-to-unlock-provincial-potential/",
            "content": "Story by Tafara Chikumira\nTHE government has launched the Midlands Province Investment Compendium, a document which spells out the investment opportunities in the province.\nThe document outlines the low-hanging fruits that lie in all the local authorities within the Midlands Province, thereby marketing the province to realise its full potential.\nThe government says investors should take advantage of the business operating environment obtained in the country and make meaningful investments.\n“The launch of the Midlands Investment Compendium will be a new vehicle to provide a clear guideline to create new potential and investment in the region,” the Minister of Finance and Economic Development, Professor Mthuli Ncube said.\nDeputy Chief Secretary to the President and Cabinet, Mr Willard Manungo, said the investment conference comes at a good time when Zimbabwe is preparing to launch the National Development Strategy Two at the end of this year.\n“This investment conference provides a good opportunity for you as a province to prepare for NDS 2 as we conclude NDS1 in December. You need to prepare strongly for foreign investors. We need foreign direct investment for us to move forward as a country,” he said.\nThe Minister of Energy and Power Development, Honourable July Moyo called for more investment in energy projects.\n“There are vast opportunities in the energy sector. We are now going green and we would like investors to invest in solar energy and other power-generating projects.”\nThe Midlands Minister of State for Provincial Affairs and Devolution, Honourable Owen Ncube and ZANU PF Politburo member, Cde Andy Mhlanga urged investors to take advantage of the friendly investment policies that have been created by the Second Republic.",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Zim’s telecomms sector maintains growth",
            "href": "https://www.zbcnews.co.zw/zims-telecomms-sector-maintains-growth/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’S telecommunications sector has maintained growth in the first three months of this year driven by exchange rate stability, more subscribers and increased use of data by industry and commerce.\nData released at the 2025 Annual Telecommunications Conference indicate a resilient sector that sustained operations and viability due to stable costs.\nIt shows that internet or data usage continue to be the main driver of revenues for the sector.\nThe government and telecommunications sector players are happy with the development and continued expansion efforts.",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Tobacco trade surpasses US$130 Million as volumes begin to surge",
            "href": "https://www.zbcnews.co.zw/tobacco-trade-surpasses-us130-million-as-volumes-begin-to-surge/",
            "content": "Story by Owen Mandovha, Business Reporter\nTOBACCO valued at over US$130 million has so far been traded on both auction and contract floors since the beginning of the 2025 tobacco marketing season last month.\nVolumes are starting to pick up after a slow start to the season, with one of the auction floors operating in Harare recording the highest volumes this Friday since the beginning of the year.\n“Volumes are starting to go up and this Friday about 1 200 bales passed through our auction floors, which is the biggest figure that we have registered so far since the start of the season. We look forward to rising figures from now going forward,” Premier Tobacco Auction Floors’ sales manager, Mr Sam Garagba said.",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Midlands Province signals readiness for business growth and investment opportunities",
            "href": "https://www.zbcnews.co.zw/midlands-province-signals-readiness-for-business-growth-and-investment-opportunities/",
            "content": "Story by Courage Bushe\nTHE Midlands Province has sent out a clear message to prospective local and international investors that it is ready to do business and grow its provincial Gross Domestic Product.\nIn line with the country’s devolution agenda and ensuring that provinces grow their Gross Domestic Product, the Midlands Province is hosting a two-day investment conference in Gweru starting this Thursday.\nThe conference is being attended by potential investors, who were excited by business opportunities in the province.\n“We are happy the conference will provide a platform for business leaders and stakeholders to explore investment opportunities and contribute to the province’s development. This is a good initiative and commendable towards economic growth,” an attendee said.\n“As people who are into business, we are happy to learn about investment incentives, infrastructure development, and the province’s unique selling points. We can safely say that the government is walking the talk in decentralising things,” another added.",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "ZiG one year on: RBZ assesses progress and stability",
            "href": "https://www.zbcnews.co.zw/zig-one-year-on-rbz-assesses-progress-and-stability/",
            "content": "Story by Stanley James, Business Editor\nTHE Reserve Bank of Zimbabwe (RBZ) has expressed satisfaction with the performance of the Zimbabwe Gold (ZiG) currency, which marks one year since its introduction.\nLaunched on April 5, 2024, ZiG was introduced as a structured currency to address challenges affecting domestic currency stability. As the currency reaches its first anniversary, RBZ Governor Dr John Mushayavanhu reflects on its impact.The Road to ZiG: A Monetary Solution“The Zimbabwe Gold (ZiG) was introduced at a time when the economy was facing significant inflationary and exchange rate pressures from December 2023 to March 2024. The pressures resulted in the domestic currency losing its value, its desired properties of predictability, convertibility, transactional convenience, and reliability as a store of value.\n“The significant growth in inflationary pressures in the economy led to the depreciation of the local currency both on the interbank and parallel markets, such that banknotes became too small and inconvenient for the transacting public given the price levels in the economy. Such challenges, among others, necessitated the recalibration of the bank’s monetary policy framework, together with the reintroduction of a structured currency, the Zimbabwean Gold to restore price and exchange rate stability and expectations necessary to boost confidence in the local currency.\n“The economy also experienced challenges with small change for foreign currency transactions, compelling retailers to either use shop coupons or force customers to buy small items. The situation also saw some retailers, wholesalers, and banks refusing soiled or torn US dollar notes, further inconveniencing the transacting public.\n“The transition from the Zimbabwe Dollar to ZiG was smooth, as all the Zimbabwe Dollar balances in bank accounts were successfully converted to ZiG using a factor of 2,498.7242. To ensure a seamless process, the Reserve Bank also mandated banks to continue accepting deposits of Zimbabwe Dollar banknotes for a period of 21 days after 5 April 2024,” said Dr Mushayavanhu.ZiG Acceptance and PerformanceThe RBZ Governor highlighted how businesses and the public have embraced the new currency.\n“The ZiG currency has been fully embraced by businesses and accepted by the transacting public for both transactional and saving purposes. The countrywide outreach programmes to create awareness of the new currency also demonstrated that the general populace embraced the ZiG.\n“Basically, the acceptance of the local currency by the public has improved since 5 April. Before the introduction of ZiG, the economy was moving towards full dollarisation, with the US dollar increasingly dominating the weaker Zimbabwe Dollar. However, the ZiG’s domestic share in total transactions has increased to above 35% from less than 15% in 2023 and continues to grow as confidence improves.\n“Therefore, the economy has experienced relative stability since April 2024 on both the exchange rate and inflation fronts, notwithstanding the shock on the exchange rate experienced around August and September 2024. The parallel exchange rate premium, which was above 100% before the introduction of ZiG, has since narrowed to below 20% by March 2025,” he said.Building Reserves and Future PlansIn light of these developments, promoting the wider use of ZiG remains a key objective for the RBZ.\n“The Reserve Bank continues to accumulate reserves to provide adequate backing for ZiG stability. Currently, total reserve coverage for the ZiG amounts to over US$500 million, of which more than US$230 million are gold reserves. The current level of reserve coverage for the ZiG is equivalent to more than three times the total amount of the ZiG currency in circulation, which is quite a healthy situation to durably support the stability of the local currency.",
            "time": "09:28",
            "date": "05 Apr 2025"
        }
    ]
}