{
    "news": [
        {
            "title": "Business leaders dismiss protest calls, vow to maintain productivity",
            "href": "https://www.zbcnews.co.zw/business-leaders-dismiss-protest-calls-vow-to-maintain-productivity/",
            "content": "Story by Story by Stanley James, Business Editor\nZIMBABWE’s business community has reiterated that it will be business as usual on Monday, March 31, despite calls for protests, which have been widely dismissed as counterproductive.\nIndustry leaders stress that Zimbabwe cannot afford disruptions to economic activity and have urged citizens to remain peaceful.\nFollowing government assurances of stability, Confederation of Zimbabwe Retailers (CZR) President, Mr Denford Mutashu, told ZBC News this Friday that retail operations will continue uninterrupted.\n“The shops will be fully opened and we encourage the consumers to be fully aware that our operations have the full support of the security services, what we have learnt is that demonstrations have never ever worked instead they have crippled the operations of the economy so it is within our interest that business will be as usual,” Mr Mutashu said.\nOther business associations have also stressed the need for a peaceful environment with the Zimbabwe Miners Federation, saying Monday will be a normal working day.\nIn a statement, the federation urged its members to remain focused on the gains of Zimbabwe’s independence and defending the national sovereignty.",
            "time": "18:07",
            "date": "29 Mar 2025"
        },
        {
            "title": "Resilient industries drove Zim’s GDP growth",
            "href": "https://www.zbcnews.co.zw/resilient-industries-drove-zims-gdp-growth/",
            "content": "Story by Stanley James, Business Editor\nTHE Zimbabwe National Statistics Agency (ZISTAT) has revealed that the country’s economy grew by 2.09 percent during the fourth quarter of 2024, as the Second Republic continues to implement development-oriented policies.\nAccording to the latest Zimbabwe National Statistics Agency (ZIMSTAT) data gleaned by the ZBC News on Friday, Gross Domestic Product (GDP), which is the national output of goods and services was at over ZiG$106 billion in the last quarter of 2024 from ZWG108 billion in the third quarter.\nWhile the data shows that GDP for the fourth quarter slowed down to 2.09 percent from three percent the previous quarter, it is the resilience of industries that consolidated growth.\nThe top four industries that dominated GDP growth in the fourth quarter of 2024 are wholesale and retail, mining, manufacturing and agriculture.\nEconomists contend that the GDP rates reflect a resilient economy in the wake of climate change-induced drought, unfavourable global commodity prices, and local and external risks.",
            "time": "18:07",
            "date": "29 Mar 2025"
        },
        {
            "title": "David Whitehead Textiles rebounds after US$20 million investment",
            "href": "https://www.zbcnews.co.zw/david-whitehead-textiles-rebounds-after-us20-million-investment/",
            "content": "Story by Tamuka Charakupa\nKADOMA-based firm, David Whitehead Textiles says it is now competitively in business, following its revitalisation drive that started last year.\nThe firm says it is close to reaching its full production capacity following the capital injection of US$20 million last year by the Agri Value Chain Zimbabwe (AVCZ) towards the resuscitation of its Kadoma and Chegutu operations.\nNow operating at about 60 percent capacity, the installation of high-tech fabric manufacturing equipment has not only increased efficiency but also created employment opportunities for hundreds from the local community.\nDavid Whitehead Textiles Managing Director, Mr Rodreck Musiyiwa said the two plants are producing at least 400 tonnes of yarn and two million fabric per month.\n“We are close to meeting the local market since we are averaging around 400 tonnes of yarn and over two million fabric per month. In terms of employment, we have over 300 employees but the number is set to increase when we complete the revitalisation exercise.\n“We appreciate government support, especially in promoting local investments and value addition. The major focus is to supply raw materials to the local clothing companies and create jobs,” Mr Musiyiwa said.\nThe Deputy Minister of Lands, Agriculture, Water, Fisheries and Rural Development, Honourable Vangelis Haritatos said the government’s focus is now on promoting value addition.",
            "time": "18:07",
            "date": "29 Mar 2025"
        },
        {
            "title": "Regional Commodity Exchanges sign MOU to boost agricultural trade",
            "href": "https://www.zbcnews.co.zw/regional-commodity-exchanges-sign-mou-to-boost-agricultural-trade/",
            "content": "\nStory by Tichaona Kurewa\nIN a strategic move to enhance agricultural trade within the region, key commodity exchanges have signed a Memorandum of Understanding (MOU) to foster closer cooperation and integration.\nFollowing the success of the Southern African Power Pool (SAPP), which has been overseeing regional electricity trading since 1995, four major commodity exchanges have come together to streamline the trade of surplus and deficit commodities such as maize and wheat.\nThe signatories include the Agricultural Commodity Exchange for Africa (Malawi), the Zambian Agricultural Commodity Exchange (ZAMACE), the Zimbabwe Mercantile Exchange (ZMX), and the Tanzania Mercantile Exchange (TMX).\nThe MOU seeks to promote regional collaboration, improve market efficiency, enhance price discovery, increase liquidity, and create more opportunities for both farmers and traders.\nMalawi’s Agricultural Commodity Exchange for Africa CEO, Mr. Kristian Moller, highlighted the significance of the agreement.\n“It is great to sign this MOU today. We saw a specific case where Zimbabwe had excess wheat and Malawi had excess soybeans, and a swap made perfect sense. This led us to develop a modality for such trades. We then expanded the initiative to include ZAMACE and TMX, creating a unified framework for regional trade,” Mr Moller said.\nStakeholders believe the regional collaboration will significantly enhance market efficiency, improve price discovery, increase market liquidity, and create broader opportunities for farmers and traders.\nNedbank South Africa’s Head of Agricultural Commodities, Mr Zhann Meyer, emphasised the importance of cross-border trade for regional food security.\n“The signing of this MOU is crucial for cross-regional trade. It demonstrates the region’s recognition of the importance of trade and food security, not just nationally, but regionally. I’m hopeful that this MOU will unlock trade barriers and enhance food security across the region.”\n“This agreement addresses regional food security, which is paramount. We need to support each other through trade, and we are pleased to be moving in this direction and hope to attract investors to fund the procurement and trade of commodities like maize across borders,” Chairperson, Grain Millers Association, Mr Tafadzwa Musarara also added.",
            "time": "18:07",
            "date": "29 Mar 2025"
        },
        {
            "title": "Calls for investments made after study reveals massive untapped mining potential in Zim",
            "href": "https://www.zbcnews.co.zw/calls-for-investments-made-after-study-reveals-massive-untapped-mining-potential-in-zim/",
            "content": "Story by Stanley James, Business Editor\nA study commissioned by the Society of Mining Professors (SOMP) has revealed massive untapped mining projects in Zimbabwe, which can be sustained through investments in skills and technology.\nThe 14th SOMP Conference underway in Harare has seen mining experts acknowledging vast untapped opportunities in Zimbabwe that are open for investments.\n“Our findings show great potential in Zimbabwe’s resource extraction sector, going forward it is incumbent upon relevant stakeholders to sit together and share ideas in as much as what can be done to unlock more value in the mining industry,” SOMP Organising Committee Chairperson, Professor Godfrey Dzinomwa said.\n“The government has set parameters in as much as exploration is concerned, so this platform is an eye opener as far as the overall growth of the mining sector is concerned. The fact that there has been an increase in the global participants is a true reflection of how Zimbabwe’s mining industry remains attractive and viable,” the Minister of Mines and Mining Development, Honourable Winston Chitando said.",
            "time": "18:07",
            "date": "29 Mar 2025"
        }
    ]
}