{
    "news": [
        {
            "title": "Manicaland province increases milk output",
            "href": "https://www.zbcnews.co.zw/manicaland-province-increases-milk-output/",
            "content": "Story by Kenias Chivuzhe\nThe drive to increase milk production to meet national demand of more than 150 million litres is on track, with Manicaland province recording a 27 percent increase after the introduction of the presidential silage programme in 2022.\nEfforts to increase national milk production are yielding positive results, with small-scale farmers playing an active role.\nCynara Dairy Farmers Cooperative in Mutasa South is one of the success stories under the Second Republic’s inclusive development agenda.\n“We started our operations in 2017 and our production was 4 600 litres and in 2024 we increased our production to 67 000 litres. We are looking forward to reach 300 000 litres by end of this year as we have increased our herd,” said chairperson of Cynara Dairy Farmers Cooperative, Francis Musunzuru.\nSmall-scale dairy farmers in the area have benefited from government support, which has given impetus to their milk production ventures.\n“We have partners selling affordable dairy calves to us at $100 each. We were also given an artificial insemination kit to grow our herd,” said a dairy farmer.\n“The presidential silage scheme is helping us a lot in improving the volume of milk we produce due to increased supply of feeds,” said a dairy farmer.\n“We are looking forward to growing our herd as we are being supported by the government,” said another dairy farmer.\n“We are happy with the support but we can produce more if our herd is increased. We are planning to produce feeds locally to reduce production costs,” said a dairy farmer.\nGovernment support has been the major driver of growth in the dairy sector.\n“Since the introduction of the presidential silage scheme, Manicaland province recorded 27 percent growth in terms of milk production. We want to thank the government and President Mnangagwa for supporting farmers to increase productivity,” Mutare regional chairperson of Zimbabwe Association of Dairy Farmers, Mrs Rudo Sithole said.",
            "time": "20:35",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zim sets target of 40 tonnes of gold this year",
            "href": "https://www.zbcnews.co.zw/zim-sets-target-of-40-tonnes-of-gold-this-year/",
            "content": "\nStory by Stanley James, Business Editor\nZIMBABWE’s gold output is expected to reach 40 tonnes this year, driven by new investments, favourable operating environment and increased capacity.\nThe latest data by the country’s sole buyer of the precious metal, Fidelity Gold Refinery, shows that the output of the yellow mineral was over 36 tonnes last year compared to 30 tonnes in 2023.\nThe statistics have further raised hopes of increased production riding on artisanal miners, including new projects by large-scale gold mining companies.\n“The target is achievable, but, that depends on the long-term perspectives of the entire gold mining industry including the need for the government to provide support in the form of machinery including incentives to facilitate smooth payment modalities from Fidelity Gold Refiners .\n“Going forward the sector will continue to focus on expansionary projects to add value and boost output.\n“Optimism in the industry is high remember this is the sector where the small scale miners continue to play a pivotal role in deliveries so it is within that perspective where sustainable development hinges on continuous favourable policies that facilitate maximum production,” Zimbabwe Miners Federation chief executive officer, Mr Wellington Takavarasha said.",
            "time": "20:35",
            "date": "08 Jan 2025"
        },
        {
            "title": "Tourism sector revels in record-breaking festive season",
            "href": "https://www.zbcnews.co.zw/tourism-sector-revels-in-record-breaking-festive-season/",
            "content": "\nStory by Tichaona Kurewa\nTHE local tourism sector is celebrating a resounding success after a record-breaking festive season.\nThe Hospitality Association of Zimbabwe revealed to ZBC News this Saturday that accommodation facilities across the country reported occupancy rates exceeding 80%, a significant surge compared to previous years.\n“Occupancy was in excess of 80% for the period, but if you look at the major festive days, which is the Christmas days, 24 to 26, most properties recorded 100%. During that period, we also saw high volumes of people going into various properties, and the different operators had to come up with various ways to control the traffic. So yes, it was a success,” president of the Hospitality Association of Zimbabwe, Mr Brian Nyakutombwa said.\n“This year’s festive season has been a mixed bag. The diaspora market had suppressed numbers compared to last year, but the traditional domestic market, they did come with their numbers, which was very encouraging,” he said.\n“Personally, I can say the business was okay. We realised a slight hike in the number of clients that we normally have on a daily basis in the other months,” safari operator, Mr Charles Chakanya.\nTourism players noted the need to expedite rehabilitation of the Bulawayo-Victoria Falls Highway and the absence of traditional festivals such as the carnival as having stifled some potential travellers.",
            "time": "20:35",
            "date": "08 Jan 2025"
        },
        {
            "title": "Govt slashes capital gains withholding tax on ZSE share sales",
            "href": "https://www.zbcnews.co.zw/govt-slashes-capital-gains-withholding-tax-on-zse-share-sales/",
            "content": "Story by Stanley James, Business Editor\nInvestor participation on the Zimbabwe Stock Exchange (ZSE) is expected to increase this year after government reduced the capital gains withholding tax on the selling of shares to one percent.\nThe capital gains withholding tax on selling shares has been slashed from 2 percent to 1 percent with immediate effect, amid optimism the development will result in investors realising more returns from the sale of their shares.\nThe arrangement has been described by market watchers as government’s commitment towards the growth of local capital markets.\n“It is entirely premised towards reducing the cost of doing business while enabling investors to realise more, so the net effect is to attract more investors participation, while enabling the local market to play a vital role in economic growth,” said an economist, Mr Ignatious Matungamire.",
            "time": "20:35",
            "date": "08 Jan 2025"
        },
        {
            "title": "Govt sets sight on infrastructure development, poverty reduction and healthcare",
            "href": "https://www.zbcnews.co.zw/govt-sets-sights-on-infrastructure-development-poverty-reduction-and-healthcare/",
            "content": "Story by Yolanda Moyo\nGovernment has outlined its key priorities for 2025, focusing on infrastructure development, poverty reduction as well as improving the healthcare and education sectors.\nOutlining key achievements of the past year in economic growth and social development, the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube emphasised government’s success in stabilising the economy through prudent fiscal and monetary policies.\nProfessor Ncube further noted that focus is now on economic growth and improving livelihoods.\n“2024 has not been an easy year in terms of the performance of the domestic year, but we have triumphs as well. In specific challenges is the issue of currency volatility up to April then we introduced a new currency, the ZIG which then brought in stability. The other challenge has been the drought which has really resulted in growth slowing down to 2 percent, but going forward we see that things will improve.\n“In terms of triumphs in the region, for example, President being the chairperson of SADC, which has given us additional roles as the finance ministry. We are driving the economic and investment development fund. We are pleased that we successfully introduced the ZIG it was never easy moving from one currency to the other. As government we have continued to support the economy through various programs. The private sector continues to work with the private sector in various sectors such as the energy sector. Looking at the industrial sector there are various investments,” said Professor Ncube.\nShifting to infrastructure development, Professor Ncube says government has adopted a two tier model which is expected to modernise the country.\n“As government, we adopted a two tier model where we are investing in roads as government including the National Railways of Zimbabwe, but also allowing the private sector to come in on the PPP basis. We continue to support the devolution agenda with development coming from the bottom up leaving no one behind,” he said.",
            "time": "20:35",
            "date": "08 Jan 2025"
        }
    ]
}