{
    "news": [
        {
            "title": "SADC urged to step up investment in energy and water infrastructure",
            "href": "https://www.zbcnews.co.zw/sadc-urged-to-step-up-investment-in-energy-and-water-infrastructure/",
            "content": "Story by Stanley James, Business Editor\nHARARE – THE Southern African Development Community (SADC) this week convened its 43rd Joint Meeting of Ministers Responsible for Energy and Water in Harare, with investments in renewable energy and infrastructure projects topping the agenda.\nThe high-level engagement marks a renewed regional thrust towards achieving energy self-sufficiency and bolstering water infrastructure across member states.\nThe five-day event, which commenced this Monday with a meeting of senior officials, provides a strategic platform for SADC to evaluate progress and accelerate the implementation of priority infrastructure projects.\nPermanent Secretary in the Ministry of Energy and Power Development, Dr Gloria Magombo, underscored the region’s strides in power system investments.\n“SADC has outlined strides by the regional member states in terms of massive investment in energy systems to further boost power supplies for industry and commerce,” she said.\nThe conference aims to identify tangible pathways for mobilising resources towards increased energy generation, in line with rising demand from industry and commerce.\nMs Angele Makombo N’tumba, SADC Deputy Executive Secretary for Regional Integration, highlighted the significance of the gathering.\n“This meeting serves as a strategic preparatory platform, setting the tone for the forthcoming Joint Meeting of Ministers. The annotated agenda before us reflects the extensive scope of issues under discussion ranging from regional protocols and infrastructure development to energy markets.",
            "time": "20:45",
            "date": "30 Jun 2025"
        },
        {
            "title": "Muzarabani Oil and Gas Discovery Project to get National Project Status",
            "href": "https://www.zbcnews.co.zw/muzarabani-oil-and-gas-discovery-project-to-get-national-project-status/",
            "content": "Story by Stanley James, Business Editor\nTHE oil and gas project, which is being implemented by Australia Stock Exchange entity,  Invictus Energy in Muzarabani, is set to be granted a National Project Status paving way for more investors in raising required capital.\nAn update released by Invictus Energy reveals that the Ministry of Finance, Economic Development and Investment Promotion has decided to grant the national project status on the Muzarabani Oil and Gas Project after realisation of the economic benefits that will arise from the project.\nThe move will see more investors coming on board, riding on the government’s fiscal and non-financial incentives for interested parties in raising capital for the oil and gas discovery process.\nThe company also thanked the government for granting the project a National Project Status as a show of confidence and commitment to facilitate progress and set the tone for continuous exploration activities.",
            "time": "20:45",
            "date": "30 Jun 2025"
        },
        {
            "title": "Zimbabwe sets sights on increased exports investments in NDS2",
            "href": "https://www.zbcnews.co.zw/zimbabwe-sets-sights-on-increased-exports-investments-in-nds2/",
            "content": "Story by Stanley James, BusinessEditor\nZIMBABWE has set sights on increased exports and investment inflows in the National Development Strategy Two (NDS2) with a view to consolidating gains from the past years.\nAs Zimbabwe gears towards launching the NDS2, quasi-government economic institutions have prepared roadmaps to increase socio-economic development.\nWith NDS1 having set the pace for annual export earnings at over US$7 billion, expectations are high that the next blueprint will further maximise receipts.\n“You can see that our statistics are showing an upward trajectory in exports. This is a result of the NDS1 aspirations whereby for the past five years focus has been on regaining all the external markets. For instance,  the horticulture sector has performed extremely well and this has further laid the roadmap for increased export receipts.\n“Going forward, value addition of the exports will unlock more earnings and enable the country to achieve the set goals. The mission is on how Zimbabwe can consolidate the current gains and forge ahead with strategies that promote overall economic growth in the next five years,” ZimTrade client manager, Mr Kupakwashe Midzi said.\nWith the rate of licenced investors also improving, authorities are also predicting growth, riding on measures to boost inflows in the NDS2 roadmap.",
            "time": "20:45",
            "date": "30 Jun 2025"
        },
        {
            "title": "Speaker Mudenda calls for consolidation of business laws at ZNCC Congress",
            "href": "https://www.zbcnews.co.zw/speaker-mudenda-calls-for-consolidation-of-business-laws-at-zncc-congress/",
            "content": "Story by Margaret Matibiri\nTHE Speaker of Parliament, Advocate Jacob Mudenda, has challenged the Zimbabwe National Chamber of Commerce (ZNCC) to spearhead efforts towards the consolidation of business laws to enhance the ease of doing business and boost the country’s competitiveness.\nAdvocate Mudenda made the remarks while addressing delegates at the ZNCC annual congress in Victoria Falls, which is running under the theme,“Interrogating the regulatory landscapein Zimbabwe and the region: learning from best practices to deepen policy quality, partnerships and enhance productivity.”\nThe Speaker noted that fragmented regulatory frameworks were contributing to high business costs and negatively impacting Zimbabwe’s competitiveness compared to regional peers.\n“Zimbabwe has nine procedures to start a business compared with 7.4 for Sub-Saharan Africa and 4.9 for OECD high-income countries. The costs required to complete these procedures amount to 76.6percentof income per capita, more than doublethe Sub-SaharanAfrica’s 36.3percentand 25 times the cost in OECD countries at threepercent,” he said.\nAdvocate Mudenda urged ZNCC to move beyond compliance with existing laws and actively advocate for reforms through formal channels.\n“ZNCC must transition from mere compliance with current regulatory frameworks to becoming powerful advocates for business law consolidation. ZNCC should learn to petition Parliament in terms of section 149 of our Constitution,” said Advocate Mudenda.",
            "time": "20:46",
            "date": "30 Jun 2025"
        },
        {
            "title": "Zim gears up for National Day and Business Forum at Expo 2025 Osaka",
            "href": "https://www.zbcnews.co.zw/zim-gears-up-for-national-day-and-business-forum-at-expo-2025-osaka/",
            "content": "Story by Oleen Ndori, Foreign Editor\nTHE Zimbabwe Pavilion at the ongoing Expo 2025 Osaka is drawing significant attention, with preparations at an advanced stage for the country’s National Day and Business Forum scheduled for 15 and 16 July.\nThe pavilion has become a major attraction at the global event, having welcomed over half a million visitors keen to experience Zimbabwe’s famed star attractions through an immersive virtual reality tour.\nSpeaking on preparations, Zimbabwe’s Ambassador to Japan, Stewart Nyakotyo, confirmed that plans for both the National Day and Business Forum are progressing smoothly.\n“The Business Forum is being organised by ZimTrade in partnership with ZIDA and on the Japanese side, we are working with the Japan External Trade Organisation (JETRO), which is their equivalent of ZimTrade. Preparations are now quite advanced, and invitations have already been sent to Japanese companies and institutions.\n“At the Forum, we will showcase investment and trade opportunities, with a special focus on mining, tourism, and agriculture. As for the National Day, it is a date set aside specifically for Zimbabwe, a day of honour for our country here in Japan and at the Expo. It is a moment to highlight Zimbabwe’s potential across sectors like investment, tourism, manufacturing and mining. More than that, it is a day to celebrate and share our vibrant culture with the Japanese people,” he said.\nTourism and Hospitality Industry Permanent Secretary, Dr Takaruza Munyanyiwa, said the number of visitors to the Zimbabwe Pavilion is encouraging. The ministry hopes to capitalise on this momentum to boost tourist arrivals into the country.",
            "time": "20:46",
            "date": "30 Jun 2025"
        }
    ]
}