{
    "news": [
        {
            "title": "Zim firms prioritise ESG compliance to boost global competitiveness",
            "href": "https://www.zbcnews.co.zw/zim-firms-prioritise-esg-compliance-to-boost-global-competitiveness/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe’s economic sectors are embracing a culture of disclosing their Environmental, Social and Governance (ESG) systems in their 2025 business plans to attract global capital.\nThe ZBC News has gathered that firms in key sectors of the economy have submitted modalities to their shareholders on how they will respond to community needs and manage the environment they operate in.\nGreen Building Council of Zimbabwe president, Mr Mike Juru confirmed that the ESG roadmap is in motion.\nHe said, “The mining, agriculture, manufacturing, retail and food processing are making inroads or strides in as much as compliance to the principles of ESG are concerned to the extent that continuous review of the principles will further accelerate economic development policies.”\nEconomic sectors also stand to benefit by complying with ESG principles.",
            "time": "08:35",
            "date": "01 Jan 2025"
        },
        {
            "title": "Consumers optimistic about price stability in 2025",
            "href": "https://www.zbcnews.co.zw/consumers-optimistic-about-price-stability-in-2025/",
            "content": "Stanley James, Business Editor\nZimbabweans are expecting price stability to continue next year riding on a boom in spending during the festive season.\nStability in the prices of goods during the past few months has excited consumers, thanks to government and Central Bank interventions.\nA tight monetary and fiscal policy has also stabilised prices much to the relief of consumers.",
            "time": "08:35",
            "date": "01 Jan 2025"
        },
        {
            "title": "Zim’s manufacturing sector eyes machinery investments",
            "href": "https://www.zbcnews.co.zw/zims-manufacturing-sector-eyes-machinery-investments/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’S manufacturing sector is targeting more investments in machinery to continue boosting industrial productivity.\nThe sector was this year not spared from the effects of the El Nino-induced drought and production challenges.\nConfederation of Zimbabwe Industries Microeconomic Committee Chairperson, Mr Jimmy Psillos says the challenges faced by industry this year have, however, presented opportunities for growth in 2025.\nHe said, “Challenges were there of course but we also learned as an industry that it is through cost containment strategies that will enable us to stay afloat so as industry. The first element that we had to devise included the need to invest in machinery so as to unlock value to put shareholders. This actually paid off. In fact, the industry is ready for next year riding on lessons that we learned this year.”\nEmployers Confederation of Zimbabwe president, Mr Demos Mbauya says the country’s manufacturing sector also defied market expectations by maintaining production levels as the availability of locally produced goods improved.\n“Given the challenges faced by the economy this year, the country could have been a net importer of goods but you can see for yourselves the vast availability of locally goods is an indication that industry is on the right path to growth trajectory, which is commendable. The year 2025 presents opportunities for us to grow our business portfolios, relook at cost benefits analysis and boost production to the extent that the good rains will further aid to the success of the industry,” he said.",
            "time": "08:36",
            "date": "01 Jan 2025"
        },
        {
            "title": "November exports surge by over 29 percent",
            "href": "https://www.zbcnews.co.zw/november-exports-surge-by-over-29-percent/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe’s exports increased by over 29 percent in November to US$900 million, driven by tobacco and gold.\nThe country is on course to achieve an over US$7 billion export earnings target on the back of continued growth in receipts since January.\nA latest official trade data report seen by the ZBC News on Sunday indicates that despite fluctuating global commodity prices and climate change shocks, gold and tobacco continue to earn the nation more foreign currency.\nThe trend resulted in a drop in trade deficit, reflecting a favourable balance of payment position in November.\nAmong the top 10 products exported in November were gold, horticultural products, tobacco, platinum, nickel, chrome and many others.\nRiding on the expansion of industry and commerce operations, fuel continues to dominate imports, followed by machinery, equipment, raw materials and vehicles.",
            "time": "08:36",
            "date": "01 Jan 2025"
        },
        {
            "title": "Denge village business units to benefit youths",
            "href": "https://www.zbcnews.co.zw/denge-village-business-units-to-benefit-youths/",
            "content": "Story by Mercy Bofu-Matinha\nRural youths continue to benefit from empowerment programmes implemented by the ZANU PF led government with those from Denge area in Chivi being the latest to benefit from launched agriculture initiatives.\nThe establishment of Denge village business unit in Chivi North’s Ward 9 has brought relief for youths in the area, who are looking forward to focus on horticulture, fisheries and poultry projects.The business unit, which is almost complete, is expected to start running next month.\n“We are excited that the government continue to prioritise young people including those in rural communities. This project is going to assist us a lot as we are going to produce crops for our families and for commercial purpose,” one of the villager told the ZBC News.\nAnother said, “This project will create employment for a number of youths. Already some have benefited through the establishment of this project, however we are looking forward to grow cash crops such as potatoes, paprika and horticultural crops.”Speaking after touring the project and handing over a stock-feed thresher to Ward 9 Farmers Field School, Chivi District Development Coordinator, Mr Innocent Matingwina concurred with the area legislator, Honourable Godfrey Mukungunugwa that communities including youths must take advantage of empowerment programmes by government for improved livelihoods.\n“As you are aware, we are in a drought season and the government has been assisting us a lot in ensuring food security. Given that our area is dry, a borehole has been established here and it will not only benefit youths because the community around will be able to get clean and safe water. Again this thresher given to the community will enable you to produce fodder for your livestock hence they will not be affected much by drought,” said Mr Matingwina.",
            "time": "08:36",
            "date": "01 Jan 2025"
        }
    ]
}