{
    "news": [
        {
            "title": "VP Mohadi tours Prospect Lithium Zimbabwe",
            "href": "https://www.zbcnews.co.zw/vp-mohadi-tours-prospect-lithium-zimbabwe/",
            "content": "Story by Jerald Sasa\nVice President Kembo Mohadi toured Prospect Lithium Zimbabwe (PLZ) in Goromonzi this Thursday to appreciate mining activities at the project, which is one of the largest hard rock lithium processing plants in Africa.\nVice President Mohadi, who was accompanied by Mashonaland East Minster of State for Provincial Affairs and Devolution Advocate Itayi Ndudzo, gained insights into PLZ operations which are making a significant contribution to the national economy.\nCde Mohadi noted that the mining sector is key to Zimbabwe’s economic prosperity.",
            "time": "08:39",
            "date": "14 Feb 2025"
        },
        {
            "title": "RBZ maintains stance on de-dollarisation",
            "href": "https://www.zbcnews.co.zw/rbz-maintains-stance-on-de-dollarisation/",
            "content": "\nStory by Owen Mandovha\nThe Reserve Bank of Zimbabwe says the de-dollarisation roadmap is no course, with industry stakeholders calling for refinement of the policy stance to maintain stability in the economy.\nThe continuity of the multi-currency regime dominated discussions at a Post-Monetary Policy Statement Breakfast Meeting in Harare this Thursday, with stakeholders citing that the policy is noble, but needs fine tuning given the widespread use of foreign currency for transacting.\n“The RBZ underlined that there is no going back on that policy measure, but certainly looking at the current situation the ZiG is only about 10% of the money in circulation,” said property developer, Mr Ken Sharpe.\n“Certainly the policy measures by the Governor require huge introspection.  The industry is not opposed to the mono-currency regime but many considerations need to be made given that there is a need to eliminate the exchange rate distortions currently bedeviling the economy. However more considerations need to be made on the timelines that do not distort the current economic trajectory,” said CEO of Africa Roundtable, chairperson Mr Oswell Binha.\nRBZ deputy governor Dr Innocent Matshe reiterated that the Central Bank’s stance to de-dollarise by 2030 is the best route available to achieve economic stardom.\n“This economy is affected by low liquidity, especially of the United States dollar which we cannot control at all hence we will continue on that path so that we give full control over our monetary policy to dictate the growth of the economy, ” he said.",
            "time": "08:39",
            "date": "14 Feb 2025"
        },
        {
            "title": "Afreximbank project construction works to be finalised by September",
            "href": "https://www.zbcnews.co.zw/afreximbank-project-construction-works-to-be-finalised-by-september/",
            "content": "\nStory by Stanley James, Business Editor\nConstruction of the US$100 million Afreximbank Southern Africa Regional Office and Trade Centre in Harare is expected to be completed by September this year.\nWhen the government granted land to Afreximbank to build a landmark facility for trade promotion in 2021, restored business confidence in Zimbabwe was high on the agenda.\nWith an assessment of the project by its property management firm, Integrated Properties, on Wednesday showing construction works are at an advanced stage, the development has also set the tone for the transformation of Zimbabwe’s business landscape.\n“The purpose of this assessment is to monitor and evaluate the project scope, taking into account the fact that most of the construction works are reaching finalisation.\n“We are on track to meet all of our targets riding on the current developments, basically we are targeting the completion of all the works by September this year,” Integrated Properties chief executive officer, Mike Juru said.\nThere are also expectations the project will position Zimbabwe as a safe and viable business portfolio.\n“We hope that this facility will further scale up the business portfolio of the capital city already we started our work to identify those that will also occupy the facility, but, the key thrust is on the green building structures that are also being embraced.",
            "time": "08:39",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zimbabwe urged to capitalise on Osaka Expo 2025",
            "href": "https://www.zbcnews.co.zw/zimbabwe-urged-to-capitalise-on-osaka-expo-2025/",
            "content": "Story by Owen Mandovha, Business Reporter\nJapanese Ambassador to Zimbabwe His Excellency Shimichi Yamanaka says the Osaka 2025 Expo provides a perfect opportunity for government to attract more investments and highlight strides made in creating a low-risk investment destination.\nHe said this when he paid a courtesy call on President of the Senate, Senator Marbel Chinomona, at the New Parliament in Mt Hampden this Tuesday, where discussions centered on measures to harness trade ties between the two countries, including participation at the upcoming Osaka Expo 2025.\n“We held fruitful discussions with the President of the Senate and looked at ways of creating strong trade ties between Zimbabwe and Japan. The two countries share a long history and this is an opportune time to elevate such a partnership,” said Ambassador Yamanaka.",
            "time": "08:39",
            "date": "14 Feb 2025"
        },
        {
            "title": "Gold production soars",
            "href": "https://www.zbcnews.co.zw/gold-production-soars/",
            "content": "Stanley James, Business Editor\nZimbabwe’s gold mining sector target of 40 tonnes by the end of the year is on track after deliveries to the sole buyer and exporter, Fidelity Gold Refinery (FGR) rose by over 30% in January.\nThe country’s gold mining industry has defied the effects of the rainfall season as data released by FGR reveals a surge in deliveries from over 1,8 tonnes in January  2024 to over three tonnes during the same month this year.\nArtisanal and small scale miners contributed over 70% of the deliveries, with the large scale corporates accounting for 30%.\nMines and Mining Development Minister Honourable Winston Chitando says the gold mining sector has started the year on a good note.\n“This is quite impressive considering the fact that during the rainy season, the sector always experience challenges in overall production volumes, but the current trend has raised hopes that the Gold mining sector is on course to achieve the intended goals, as the Government we remain committed to ensure that all the Miners operate under favourable environments for the benefit of the nation,” he said.",
            "time": "08:39",
            "date": "14 Feb 2025"
        }
    ]
}