{
    "news": [
        {
            "title": "The private sector applauded for supporting business reforms",
            "href": "https://www.zbcnews.co.zw/the-private-sector-applauded-for-supporting-business-reforms/",
            "content": "Story by Stanley James, Business Editor\nHARARE-THE private sector has been commended for supporting the government’s development agenda by giving input in efforts to ease the business environment in the country.\nA regulatory impact assessment stakeholder dialogue was held in Harare this Thursday, with stakeholders from the National Economic Consultative Forum (NECF), business people under the Confederation of Zimbabwe Industries (CZI), and the National Competition Commission (NCC) giving their input.\nIt emerged during a meeting that the private sector also contributed on proposals to make Zimbabwe an investor-friendly nation.\n“It is not only the private sector but all the stakeholders so as NECF we remain committed to do our best in as far as our mission to focus on economic development is concerned this meeting held today therefore presents that opportunity to further scale up our relations with industry and commerce, identify the needs of the economy and provide the necessary recommendations,” Steering Committee Co-Chairperson National Economic Consultative Forum, Dr Mike Bimha said.\nThe business community contends that continuous review of regulations is key for industrial growth.\n“There is that aspect of identifying the needs of industry and commerce including the need to take into account possible measures to sustain the growth trajectory of the economy and this can only be sustained if there are workable policies to boost inflows and make Zimbabwe a favourable business destination for all,” CEO Shipping and Freight Forwarders Association of Zimbabwe, Mr Washington Dube said.\nRegulatory authorities have reaffirmed their commitment to favourable measures for industrial growth.\n“This meeting is being held at the right time when expectations are all on what needs to be done to make Zimbabwe an attractive investment destination, so all the input will be ideal in terms of helping economic decision makers on what can be done to take the nation forward,” Executive Director National Competitiveness Commission, Mr Phillip Phiri said.",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "Stanbic Bank donates an autoclave machine to Ingutsheni Hospital",
            "href": "https://www.zbcnews.co.zw/stanbic-bank-donates-an-autoclave-machine-to-ingutsheni-hospital/",
            "content": "Story by Zanele Ndlovu\nBULAWAYO – STANBIC Bank Zimbabwe has stepped in to support the country’s mental health sector by donating a high-capacity autoclave machine to Ingutsheni Central Hospital in Bulawayo, a move set to strengthen infection control and medical safety at the institution.\nThe modern sterilisation unit, the autoclave, unveiled during a commissioning ceremony attended by senior health officials and Stanbic Bank executives, is expected to improve hygiene and operational efficiency in the hospital’s daily procedures.\nBeing a referral point for mental health patients across the country, Ingutsheni Hospital is Zimbabwe’s oldest psychiatric institution and continues to play a critical role in mental healthcare.\nHowever, it faces significant challenges, including ageing infrastructure and deteriorating facilities, which affect service delivery and patient care.\nSpeaking at the handover ceremony, the hospital’s Chief Medical Officer, Dr Nemache Mawere said the autoclave will go a long way in reducing the risk of infection among patients and healthcare workers.\n“Ingutsheni Hospital has always resembled a large rural hospital, with minimal infrastructure development to reflect that it is a modern facility. The arrival of this autoclave machine, along with the soon-to-be-opened CSSD department, marks a major milestone in shifting us away from that perception. We intend to open a gentle care unit, and for that, we need sterilised instruments. This facility was desperately needed,” Dr Mawere said.\nStanbic Bank Chairperson, Ms Mucha Mukangwani said the donation forms part of the bank’s commitment to national development and public health.\n“We are here to officially hand over this autoclave machine to Ingutsheni Hospital, an institution that has served Zimbabwe with dedication since 1908. The autoclave will significantly enhance infection and germ control through effective sterilisation. We are proud to support the largest psychiatric hospital in Zimbabwe, with over 700 beds, located in the City of Kings and Queens, Bulawayo.\n“This donation aligns with our commitment to supporting national development priorities and complements the Government’s efforts to improve access to quality healthcare. Similar initiatives have benefited Parirenyatwa, Sally Mugabe, and Victoria Chitepo hospitals, at a combined cost of US$80,000,” said Ms Mukangwani.",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "ZAS 2025 preparations gain momentum as exhibitor numbers surge",
            "href": "https://www.zbcnews.co.zw/zas-2025-preparations-gain-momentum-as-exhibitor-numbers-surge/",
            "content": "Story by Tendai Munengwa\nHARARE – MORE than 500 exhibitors are expected to participate and showcase their wares at this year’s Zimbabwe Agricultural Show set for Harare next month.\nPreparations for the 2025 Edition of ZAS are in full swing, with organisers confirming that over 300 exhibitors have already registered to take part in the country’s largest agricultural and commercial exhibition.\nThe show will run from August 25 to 30, in Harare, under the theme: “Building Bridges: Connecting Agriculture, Industry and Community.”\n“At this stage, 304 exhibitors have confirmed their participation in this year’s agricultural show, with expectations to reach 580 exhibitors,” Zimbabwe Agricultural Society CEO, Mr Robert Gunundu said.",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "13 000 youths set to benefit from Youth Employment and Entrepreneurship Project",
            "href": "https://www.zbcnews.co.zw/13-000-youths-set-to-benefit-from-youth-employment-and-entrepreneurship-project/",
            "content": "Story by Fungai Jachi\nHARARE-AT least 13 000 youths from across the country are set to benefit from the second phase of the Youth Employment and Entrepreneurship Project, which was launched in Harare this Wednesday.\nYouth Empowerment in Zimbabwe has ceased to be a fantasy; it is now a lived reality, and young people like 17-year-old Tapiwanashe Shumba and 26-year-old Chido Makanha are already benefiting from the empowerment initiatives spearheaded by the government and its development partners.\n“I am grateful that opportunities have been created for us. I am into rabbit breeding, and there is a huge market because people view it as a delicacy. The business is doing quite well,” he said.\n“I am one black person who is providing a rare breed of flowers to the market, and as a young person, I am excited about that. I am looking forward to starting exporting soon because my hectarage has increased,” Chido Makanha said.\nSander Jamba, who works with nine others in peas production, is already making a mark on the export market.\n“We are a group of ten young people who ventured into pea farming. We started off providing the local market, but failed to survive because of competition. That is when we were helped to start export-oriented production. Now we have a market in Europe and we are exporting our peas and making more money,” Jamba said.\nPeter Kanodeweta, who got funding from the Youth Bank to start his apiary project, is grateful for the opportunities being provided to young people.\n“For starters, my apiary project, I got money from the youth bank and was able to buy what I needed to start the project. I started with 30 hives and now I have 60, hoping to be at 100 by the end of the year. The Second Republic has really created a conducive environment for young people to venture into business,” he said.\nThe launch of the second phase of the Youth Employment and Entrepreneurship Project stands to bring sustainability to already existing enterprises, while also giving a new lifeline to new businesses with development partners and the government vowing to continue collaborating for the benefit of youths.",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "State of sugar industry value chain under the spotlight",
            "href": "https://www.zbcnews.co.zw/state-of-sugar-industry-value-chain-under-the-spotlight/",
            "content": "Story by Fungai Jachi\nTHE state of the sugar industry value chain has attracted the attention of Parliament, with legislators questioning what government is doing to improve the sector after identifying sugarcane as a strategic crop with huge impact on the economy.\nThe committee summoned the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development after visiting sugarcane plantations and meeting with farmers who pointed out challenges affecting the sugar industry.\nIn response to the questions raised, Permanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Professor Obert Jiri, said among other initiatives, the Sugar Act is currently under review to align it with modern agricultural economics and environmental standards.",
            "time": "20:46",
            "date": "17 Jul 2025"
        }
    ]
}