{
    "news": [
        {
            "title": "TIMB introduces new regulations for tobacco sales",
            "href": "https://www.zbcnews.co.zw/timb-introduces-new-regulations-for-tobacco-sales/",
            "content": "Story by Tendai Munengwa\nTHE Tobacco Industry and Marketing Board (TIMB) has announced that all tobacco not produced under a contract arrangement must be sold exclusively at auction floors during the 2024/25 marketing season.\nWith just two weeks remaining before the start of the 2024/25 tobacco marketing season, the TIMB is urging merchants and contractors to comply with the regulations, particularly the new requirement that all freely produced tobacco must be sold strictly at auction floors.",
            "time": "20:36",
            "date": "22 Feb 2025"
        },
        {
            "title": "Zimbabwe, UN Tourism to establish Culinary Academy in Victoria Falls",
            "href": "https://www.zbcnews.co.zw/zimbabwe-un-tourism-to-establish-culinary-academy-in-victoria-falls/",
            "content": "Story by Tichaona Kurewa\nZimbabwe and the UN Tourism have concluded an agreement to set up a Culinary Academy in Victoria, with construction works expected to begin mid-year, with the facility targeted to open its doors in 2028.\nIn July last year, UN Tourism and Zimbabwe signed a Memorandum of Understanding (MOU) to mark the establishment of the Zimbabwe International Tourism Academy for the Culinary Arts in Victoria Falls.\nIt is against this background that the Minister of Tourism and Hospitality Industry, Honourable Barbra Rwodzi was recently in Spain to tie the loose ends.\nMinister Rwodzi told ZBC News that construction of the school to be named after the First Lady Dr Auxillia Mnangagwa for her sterling efforts in promoting gastronomy tourism will begin this winter.\n“We are expecting to start the construction mid-year. From July going forward we should start the construction. It must last us two years. The school must open in 2028,” she said.\nThe school will be established within the Masuwe Special Economic Zone which will also put Zimbabwe on the global map and provide employment.\n“If the United Nations is coming to be a part of us, anyone else can come to be a part of us. So it drives more investment in the country but more so for us in tourism, it’s about endorsing the destination. We already have the ground because this whole land, 271 hectares, belongs to the Ministry of Tourism and Hospitality Industry through Mosi-oa-Tunya Development Company. So the land for the school is already there, it’s a nine-hectare land for the school which is ready and which is already on the subdivision,” she added.",
            "time": "20:36",
            "date": "22 Feb 2025"
        },
        {
            "title": "Local authorities challenged to enhance investment climate",
            "href": "https://www.zbcnews.co.zw/local-authorities-challenged-to-enhance-investment-climate/",
            "content": "Story by Tapiwa Machemedze\nA call has been made for local authorities to enhance marketing ease of doing business measures to boost investment in Mashonaland Central province.\nThis emerged at the Bindura Investment Conference held on Tuesday.\nBindura Municipality went on the charm offensive to lure investment to the mining town after convening its inaugural business conference, which attracted diverse stakeholders.\n“We are in the mining supplies business and are based in Kadoma so we have begun to establish a presence here in Bindura that’s why we came here and it has been worthwhile,” an attendee said.\nAnother said, “Our company is currently undertaking construction of a shopping mall in Mazowe so we came here to see opportunities available in Bindura.”\n“I am a local businessman the founder of Simwami investments so I came here to see what our council has in store for us. I plan to establish a quarry plant in the next 3 months so business networking remains critical,” another added.\nBindura Municipality announced plans to achieve city status by 2028, highlighting investment opportunities in agro-processing, manufacturing, minerals, religious tourism and real estate sectors.\n“Bindura is open for business. We are ready to work with you in unlocking our potential, but it’s a collective responsibility. Let’s seize the moment to make our town great and improve lives in line with Vision 2030,” Bindura Mayor Councillor Jacob Gwature said.\nMashonaland Central Minister of State for Provincial Affairs and Devolution, Honourable Christopher Magomo challenged the town and local authorities to take deliberate efforts to attract investors.",
            "time": "20:36",
            "date": "22 Feb 2025"
        },
        {
            "title": "Bulawayo hosts NCC’s inaugural competitiveness summit",
            "href": "https://www.zbcnews.co.zw/bulawayo-hosts-nccs-inaugural-competitiveness-summit/",
            "content": "Story by Yolanda Moyo\nTHE National Competitiveness Commission (NCC) inaugural Competitiveness Summit began this Wednesday in Bulawayo, drawing key stakeholders from across Zimbabwe.\nThe summit aims to address critical issues impacting the nation’s economic competitiveness and chart a course for sustainable growth.",
            "time": "20:36",
            "date": "22 Feb 2025"
        },
        {
            "title": "ZANU PF’s economic cluster engages Bulawayo industry",
            "href": "https://www.zbcnews.co.zw/zanu-pfs-economic-cluster-engages-bulawayo-industry/",
            "content": "Story by Yolanda Moyo\nIn a bid to gain a deeper understanding of the challenges faced by local industries, the ZANU PF’s economic development and empowerment cluster embarked on a tour of various industries in Bulawayo as it fosters better collaboration with industry leaders.\nThe visit was driven by President Emmerson Mnangagwa’s thrust of building a robust and thriving industrial sector in Zimbabwe.\nThe ZANU PF economic and empowerment development cluster visiting the National Railways of Zimbabwe, General Belting and Ref Air.\nIndustry representatives expressed their appreciation for the tour, saying it provides an invaluable opportunity for the party to witness the strides made by local industries.\n“As General Belting, we have invested in improving our efficiency thereby cutting costs and enhancing our competitiveness.\n“However, we are facing a challenging influx of cheap imports in the market that are coming in to compete with our products in a case where we are facing high cost of production looking at energy.\n“We are currently operating at 30 percent and with such a visit we are confident that this engagement will pave the way for a more robust and sustainable industrial sector,” General Belting managing director, Mr Joseph Gunda said.\n“Over the past four years, we’ve been bringing in and upgrading and mechanizing the line the bending the splitting machines,” REF AIR general manager, Ms Karen Mirtle stated.\n“Once that side of it has increased we can do 18 times 20 times faster than what we used to. We supply right across Africa and we’ve done work in Zambia… We’ve done work in Uganda, Mozambique Malawi.\n“With the African free trade opening South Africa is our only competitor.  We can’t compete because we can’t produce at their rate. There is a need to improve on foreign currency availability in the market so that as an industry we need that to procure machinery.”\nThe leader of the economic cluster, Cde Elifasi Mashava emphasised the significance of the tour in the context of the government’s broader economic development agenda.\n“The ruling party, ZANU PF, which I represent at this forum, has deemed it necessary to embark on this crucial tour to assess the prevailing conditions of our industries. This tour will provide us with an objective view of the performance of industries here in Bulawayo,” Cde Mashava said.",
            "time": "20:36",
            "date": "22 Feb 2025"
        }
    ]
}