{
    "news": [
        {
            "title": "Banks expand loan access to strengthen key economic sectors",
            "href": "https://www.zbcnews.co.zw/banks-expand-loan-access-to-strengthen-key-economic-sectors/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’s banking sector is ramping up efforts to support productive industries, with the mining sector emerging as the primary beneficiary of increased loan allocations.\nDuring an analysts’ briefing on Monday, CBZ Holdings Limited, the country’s largest financial institution by deposits and assets, confirmed the sector’s strategic focus on funding key economic drivers.\nBankers Association of Zimbabwe President, Mr Lawrence Nyazema, stated that the expansion of loan facilities reflects the financial sector’s commitment to economic growth.\n“The productive sectors are a key component in the growth of the economy, a move that has seen financial institutions focusing on what can be done to further enhance the value of returns to firms by mobilising additional funding to sustain loan requirements, of course in the future we intend to further double our efforts, but at the present moment, it is imperative to note that the mining sector is accounting for a huge proportion of the overall loans riding on its ability to attract investments and facilitate increased uptake of projects,” Mr Nyazema said.\nRegional and multilateral financiers continue to provide local banks with credit lines for on-lending to the productive sectors at affordable terms.",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zim’s listed companies reinvest 2024 financial year profits",
            "href": "https://www.zbcnews.co.zw/zims-listed-companies-reinvest-2024-financial-year-profits/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’s listed companies are reinvesting profits for the 2024 financial year on strategic business units in line with growth and recovery aspirations.\nMost listed companies whose year-end financials are on December 31 2024 have started releasing their audited results.\nResults gleaned by the ZBC News show resilience and improvements in financial indicators during a year that was characterised by climate change-induced drought.\nHowever, for strategic reasons, companies are reinvesting earnings into business units.\n“While we have presented our financials, it is imperative to look into the future growth by identifying the needs of the shareholders. By reinvesting part of our profits, we have also taken into consideration how we balance our books between current financial trends and future operations. Going forward, we remain committed to expanding our Business portfolio base in Zimbabwe,” Old Mutual Zimbabwe Group’s Chief Executive Officer (CEO), Mr Samuel Matsekete said.",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Reserve Bank of Zimbabwe holds policy rate at 35%",
            "href": "https://www.zbcnews.co.zw/reserve-bank-of-zimbabwe-holds-policy-rate-at-35/",
            "content": "Story by Stanley James, Business Editor\nTHE Reserve Bank of Zimbabwe (RBZ) has maintained the bank policy rate at 35 percent and kept the statutory reserve requirements unchanged to consolidate exchange and inflation rate gains.\nIn a statement issued after the Monetary Policy Committee (MPC) meeting over the weekend, central bank Governor Dr John Mushayavanhu noted that the tight monetary policy being pursued is yielding positive results.\nThe RBZ Chief cited the continuous gains in exchange rate stability and the drop in ZiG inflation since January as milestones by the authorities in maintaining stability.\nIn line with the current stable economic conditions, the MPC resolved to keep the bank policy rate and statutory reserve requirements unchanged.\nMonetary authorities are also expecting inflation to moderate in the last quarter of this year at less than 30 percent.",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Business leaders dismiss protest calls, vow to maintain productivity",
            "href": "https://www.zbcnews.co.zw/business-leaders-dismiss-protest-calls-vow-to-maintain-productivity/",
            "content": "Story by Story by Stanley James, Business Editor\nZIMBABWE’s business community has reiterated that it will be business as usual on Monday, March 31, despite calls for protests, which have been widely dismissed as counterproductive.\nIndustry leaders stress that Zimbabwe cannot afford disruptions to economic activity and have urged citizens to remain peaceful.\nFollowing government assurances of stability, Confederation of Zimbabwe Retailers (CZR) President, Mr Denford Mutashu, told ZBC News this Friday that retail operations will continue uninterrupted.\n“The shops will be fully opened and we encourage the consumers to be fully aware that our operations have the full support of the security services, what we have learnt is that demonstrations have never ever worked instead they have crippled the operations of the economy so it is within our interest that business will be as usual,” Mr Mutashu said.\nOther business associations have also stressed the need for a peaceful environment with the Zimbabwe Miners Federation, saying Monday will be a normal working day.\nIn a statement, the federation urged its members to remain focused on the gains of Zimbabwe’s independence and defending the national sovereignty.",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Resilient industries drove Zim’s GDP growth",
            "href": "https://www.zbcnews.co.zw/resilient-industries-drove-zims-gdp-growth/",
            "content": "Story by Stanley James, Business Editor\nTHE Zimbabwe National Statistics Agency (ZISTAT) has revealed that the country’s economy grew by 2.09 percent during the fourth quarter of 2024, as the Second Republic continues to implement development-oriented policies.\nAccording to the latest Zimbabwe National Statistics Agency (ZIMSTAT) data gleaned by the ZBC News on Friday, Gross Domestic Product (GDP), which is the national output of goods and services was at over ZiG$106 billion in the last quarter of 2024 from ZWG108 billion in the third quarter.\nWhile the data shows that GDP for the fourth quarter slowed down to 2.09 percent from three percent the previous quarter, it is the resilience of industries that consolidated growth.\nThe top four industries that dominated GDP growth in the fourth quarter of 2024 are wholesale and retail, mining, manufacturing and agriculture.\nEconomists contend that the GDP rates reflect a resilient economy in the wake of climate change-induced drought, unfavourable global commodity prices, and local and external risks.",
            "time": "09:46",
            "date": "01 Apr 2025"
        }
    ]
}