{
    "news": [
        {
            "title": "Enforcement of mandatory petrol blending tightened",
            "href": "https://www.zbcnews.co.zw/enforcement-of-mandatory-petrol-blending-tightened/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe has tightened monitoring of the petroleum sector’s compliance to the mandatory blending of petrol as errant operators risk losing licences and closure of service stations.\nA notice to petroleum sector operators issued by the Zimbabwe Energy Regulatory Authority (ZERA) this this Friday states that requirements outlined in the Statutory Instrument 150 of 2024 for operators to blend unleaded petrol with ethanol are still in motion.\nResponding to inquiries from ZBC News over the issue, ZERA chief executive officer, Mr Eddington Mazambani said the regulatory authorities have embarked on a country fact-finding mission to monitor and evaluate compliance.\n“The entire mission is for us to look and assess into the needs of the nation regarding what needs to be done as far as ensuring that compliance becomes a national issue. As the regulatory authority, the focus is on what we can do to ensure that the entire issue becomes a success. Currently, a lot of groundwork has been covered and we shall roll out more inspections to assess and ensure that our aspirations are taken into effect by the relevant stakeholders for the benefit of the nation,” he said.",
            "time": "08:33",
            "date": "22 Dec 2024"
        },
        {
            "title": "Tourism booms in 2024, government expects even stronger 2025",
            "href": "https://www.zbcnews.co.zw/tourism-booms-in-2024-government-expects-even-stronger-2025/",
            "content": "Story by Tichaona Kurewa\nGovernment has expressed satisfaction with the performance of the tourism sector this year, amid optimism that 2025 will be bigger and better.\nThe United Nations Tourism Gastronomy and several MICE tourism gatherings held in Zimbabwe saw the tourism industry emerging as the major contributor to the GDP.\nSpeaking on the sidelines of a meet and greet domestic tourism campaign in Victoria Falls this Wednesday, Tourism and Hospitality Industry Minister Honourable Barbra Rwodzi highlighted the signing of the Memorandum of Understanding for Zimbabwe to host the first UN Tourism School in Africa as another success story.\n“I an gladly say we have surpassed our expectations for 2024. We are very happy that the cabinet has accepted our policy and it means 2025 going forward there will be implementation and that implementation must have an impact on the numbers of arrivals as well as on investments and as well as the way the regulatory front, the legal front, the way we should run the business of tourism in the industry.",
            "time": "08:33",
            "date": "22 Dec 2024"
        },
        {
            "title": "Zimbabwe and Zambia seal SMEs partnership",
            "href": "https://www.zbcnews.co.zw/zimbabwe-and-zambia-seal-smes-partnership/",
            "content": "Story by Fairstars Mukungurutse\nThe Ministry of Women Affairs, Community, Small and Medium Enterprises Development has signed a Memorandum of Understanding with its Zambian counterparts for SMEs development.\nThe agreement between the two parties seeks to establish a framework for co-operation to capacitate Micro, Small and Medium Enterprises (MSMEs) and cooperatives in Zimbabwe and Zambia.",
            "time": "08:33",
            "date": "22 Dec 2024"
        },
        {
            "title": "Zim’s domestic resource mobilisation receives boost",
            "href": "https://www.zbcnews.co.zw/zims-domestic-resource-mobilisation-receives-boost/",
            "content": "Story by Stanley James\nZimbabwe’s domestic resource mobilisation drive has received a major boost after 50 000 new taxpayers were registered this year, with authorities setting a US$7 billion revenue target for 2025.\nTaxpayers who paid their taxes and custom duties in full were honoured in Harare Wednesday night.\nZimbabwe Revenue Authority (ZIMRA) Commissioner General Ms Regina Chinamasa revealed an increased taxpayer base this year.\n“The year is just about to come to an end and we take this opportunity to honour the outstanding taxpayers. This is in line with our thrust to sustain the government projects basically over 50 000 new taxpayers have come on board from about 33 000 new taxpayers last year. We remain resolute that we will achieve the year-end target of over US$6,1 billion and a set target of over US$7 billion has been put in motion. This is absolutely coming at  a time when systems are being put in place to modernise our operations and stamp out an tax evasion,” she said.\nTaxpayers who were presented with compliance awards pledged commitment to working with government.\n“Paying tax has its own advantages especially when it comes to doing businesses in a proper and sustainable manner and this places businesses in the right shape imagine if you want a loan from the bank and your tax documents are in shambles it really becomes a challenge,” said a winner.\n“The first element is that I would like to give credit to myself for being compliant to tax regulations this will enable my operations to get the right recognition related to sustainable operations in the long term the focus will be on tapping opportunities for growth,” said another winner.",
            "time": "08:33",
            "date": "22 Dec 2024"
        },
        {
            "title": "Zambia eyes partnership with Zimbabwe on product standards and certification policy",
            "href": "https://www.zbcnews.co.zw/zambia-eyes-partnership-with-zimbabwe-on-product-standards-and-certification-policy/",
            "content": "Story by Stanley James, Business Editor\nThe Southern African Development Community (SADC) industrialisation roadmap is in motion as Zambia seeks partnerships with Zimbabwe on the standardisation of goods by emerging companies for regional exports.\nA Zambian delegation comprising government officials, the private sector and SMEs representatives on a fact-finding mission of Zimbabwe’s emerging firms this Wednesday assessed modalities being implemented on local product certification standards for access to regional and global markets.\nWith the SADC industrialisation roadmap considering the SMEs sector as the engine for growth, representatives from the two economies discussed ways of cooperation to boost quality of products and promote trade.\nStandards Association of Zimbabwe (SAZ) Director General Mr Cosmus Mukoyo said the institution is willing to cooperate with the northern neighbouring economy on product standards policy aimed at broadening the regional export market base.\n“This is a great opportunity arising at a time when we have realised that the SMEs sector in Zimbabwe continues to grow, therefore the visit by the Zambians is an eye opener for us in identifying strategies being put in place by Zimbabwe to scale up business growth. This is really vital for us as we seek to foster business growth and focus on exports in the long term. The overall purpose is to unlock the value of goods in terms of standards and product specifications,” he said.\nEmpowering SMEs, business development and quality standards of goods and services are factors being cited as key to broadening the SADC market base for emerging businesses in Zambia and Zimbabwe.",
            "time": "08:33",
            "date": "22 Dec 2024"
        }
    ]
}