{
    "news": [
        {
            "title": "Roofing almost complete at Mbare Musika temporary market project",
            "href": "https://www.zbcnews.co.zw/roofing-almost-complete-at-mbare-musika-temporary-market-project/",
            "content": "Story by Memory Chamisa\nThe project to construct a temporary market to accommodate traders affected by a fire that razed Mbare Musika in October is on course, with the structure now at roofing level.\nThe construction works which began early this month have brought hope, with the residents near the construction site expressing satisfaction with the ongoing work.",
            "time": "06:32",
            "date": "29 Dec 2024"
        },
        {
            "title": "Denge village business units to benefit youths",
            "href": "https://www.zbcnews.co.zw/denge-village-business-units-to-benefit-youths/",
            "content": "Story by Mercy Bofu-Matinha\nRural youths continue to benefit from empowerment programmes implemented by the ZANU PF led government with those from Denge area in Chivi being the latest to benefit from launched agriculture initiatives.\nThe establishment of Denge village business unit in Chivi North’s Ward 9 has brought relief for youths in the area, who are looking forward to focus on horticulture, fisheries and poultry projects.The business unit, which is almost complete, is expected to start running next month.\n“We are excited that the government continue to prioritise young people including those in rural communities. This project is going to assist us a lot as we are going to produce crops for our families and for commercial purpose,” one of the villager told the ZBC News.\nAnother said, “This project will create employment for a number of youths. Already some have benefited through the establishment of this project, however we are looking forward to grow cash crops such as potatoes, paprika and horticultural crops.”Speaking after touring the project and handing over a stock-feed thresher to Ward 9 Farmers Field School, Chivi District Development Coordinator, Mr Innocent Matingwina concurred with the area legislator, Honourable Godfrey Mukungunugwa that communities including youths must take advantage of empowerment programmes by government for improved livelihoods.\n“As you are aware, we are in a drought season and the government has been assisting us a lot in ensuring food security. Given that our area is dry, a borehole has been established here and it will not only benefit youths because the community around will be able to get clean and safe water. Again this thresher given to the community will enable you to produce fodder for your livestock hence they will not be affected much by drought,” said Mr Matingwina.",
            "time": "06:32",
            "date": "29 Dec 2024"
        },
        {
            "title": "New taxes take effect on the 1st of January 2025",
            "href": "https://www.zbcnews.co.zw/new-taxes-take-effect-on-the-1st-of-january-2025/",
            "content": "Story by Owen Mandovha, Business Reporter\nAn array of new taxes introduced by Treasury will take effect on the 1st of January 2025 as contained in the 2025 Nation Budget Statement presented last month by Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube.\nThe new Fast Foods Tax of 1% on the sales value of fast food items like pizzas, burgers, and French fries will take effect from the 1st January 2025 to encourage healthy eating, while a betting tax rate of 10% withholding tax on gross winnings of sports betting punters will also be effective from the 1st of next month.\nA 20% plastic carrier bag tax on the sale value of plastic carrier bags aimed at promoting biodegradable alternatives to protect the environment.\nProperties converted from residential to business use will also attract a 25% tax on their rental income effective the 1st of January 2025.\nTreasury also increased some selected taxes including the capital gains tax on marketable securities to be revised from a temporary 2% withholding tax to a final 1% tax from the 1st of January 2025.\nExcise duty on alcoholic beverages will be increased from 25 cents per litre to 30 cents per litre, effective from the 1st of January, 2025.",
            "time": "06:32",
            "date": "29 Dec 2024"
        },
        {
            "title": "Bulawayo Industrial Park on the cards",
            "href": "https://www.zbcnews.co.zw/bulawayo-industrial-park-on-the-cards/",
            "content": "Story by Grace Sibanda\nThe revitalisation of Bulawayo’s industrial hub status is progressing well, with an industrial park set to be constructed in the city after getting the green light from the local authority and government.\nBulawayo was once a centre of manufacturing and commerce, but in recent years the city has faced major economic setbacks that have deterred industrial growth.\nHowever, plans to construct an industrial park in the Umvumila area present a new era of industrial development for the country`s second largest city.Bulawayo Industrial Park representative, Mr Darlington Nyika outlines the project plan, saying the strategic location of the park makes it ideal for regional trade and commerce as it links with neighbouring countries such as South Africa, Botswana and Mozambique.\n“The Bulawayo Industrial Park is a state-of-the-art industrial complex located on the outskirts of the city. Spanning over 100 hectares of land, the park is designed to accommodate a diverse range of industries, from manufacturing and logistics to technology and innovation. One of the primary benefits of the Bulawayo Industrial Park is its potential to create thousands of jobs for the local community. From skilled laborers to management professionals, the park will provide a wide range of employment opportunities, helping to stimulate economic growth and reduce unemployment,” he said.",
            "time": "06:32",
            "date": "29 Dec 2024"
        },
        {
            "title": "Zim’s aviation sector records significant investments and growth in 2024",
            "href": "https://www.zbcnews.co.zw/zims-aviation-sector-records-significant-investments-and-growth-in-2024/",
            "content": "Story by Owen Mandovha, Business Reporter\nFirms involved in the country’s aviation ecosystem recorded stellar performances during the year 2024, riding on government massive investments in the rehabilitation of the country’s airports infrastructure.\nMajor firms’ comprising of the country’s aviation ecosystem are flourishing in the booming aviation industry after the expansion of the Robert Gabriel Mugabe International Airport which was completed last year.\nIn 2024, the National Handling Services registered robust business growth on its headline earnings, looking forward to even better fortunes in 2025.\nNHS’ chairperson, Advocate Godwin Nyengedza said, “As the NHS, the future looks bright, especially as cargo and passenger traffic is high during the season, but obviously, we can’t rule out the positive impact of the expansion of the airport in breathing life into our operations as more air flights are now to Zimbabwe.”",
            "time": "06:32",
            "date": "29 Dec 2024"
        }
    ]
}