{
    "news": [
        {
            "title": "RBZ clamps down on cash deposit boxes",
            "href": "https://www.zbcnews.co.zw/rbz-clamps-down-on-cash-deposit-boxes/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE Reserve Bank of Zimbabwe (RBZ) has revealed that millions of dollars are lying idle in the country due to a growing trend by business of keeping money in cash deposit boxes, saying the practice deprives the economy of the much-needed liquidity.\nAnnouncing his 2025 Monetary Policy Statement, RBZ Governor Dr John Mushayavanhu indicated this financial disintermediation which is stifling economic growth by depriving economic agents of the much-needed liquidity.\nHe said the Financial Intelligence Unit of the Reserve Bank of Zimbabwe will not simply watch but will deal with this malpractice.\n“There are manufacturers who are supplying goods to the informal market but are not banking their proceeds. They are keeping these monies in their cash boxes which is not in line with the Anti Money Laundering Act. The FIU will not just watch and will dismantle this practice,” he said.",
            "time": "18:30",
            "date": "10 Feb 2025"
        },
        {
            "title": "Fruit Logistica participation a success – Zimtrade",
            "href": "https://www.zbcnews.co.zw/fruit-logistica-participation-a-success-zimtrade/",
            "content": "Story by Bruce Chahwanda\nLOCAL trade promotion body, ZimTrade, says the participation of local firms at the just-ended 2025 Fruit Logistica in Germany has been a success, with new orders having been clinched, generating business worth over US$20 million.\nThey were three days of hard work with various meetings scheduled for the 30 local firms that were participating at this year’s Fruit Logistica, while others had impromptu engagements with a view to secure new markets and expand horticultural orders across the globe.\nAs the premier horticultural exhibition concludes, local companies are satisfied with their order books, pledging to double their effort to ensure they meet market demands.\nZimTrade Director Operations Mr Similo Nkala said the exhibition was a success.\n“It has been a very successful mission at Fruit Logistica 2025. We have received a lot of inquiries from countries like Germany, the United Kingdom, the Netherlands, and the rest of Europe. The key thing for us is that this will go a long way in increasing our exports which generated US$142 million in 2023,” he said.\nBusiness generated at this year’s exhibition is in line with targets in the Horticultural Recovery and Growth Plan which seeks to increase horticulture exports to US$300 million by 2030.",
            "time": "18:30",
            "date": "10 Feb 2025"
        },
        {
            "title": "SADC border efficiency strategy unveiled",
            "href": "https://www.zbcnews.co.zw/sadc-border-efficiency-strategy-unveiled/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe and other Southern African Development Community (SADC) member states are converging in implementing border efficiency management systems aimed at facilitating the smooth flow of cargo within the region.\nThe SADC customs experts held a meeting in Harare this Friday where a Time Release Study (TRS) was launched to help identify challenges hindering trade, focusing on possible solutions.\nTRS chairperson commissioner Batsirai Chadzingwa revealed that Zimbabwe stands to benefit by implementing efficient systems at border posts.\n“This study is very important because it is being unveiled when there is a lot that is taking place in as much as the development of regional integration is concerned. Remember this region has a lot to do in terms of trade. By convening today they key thrust is on modalities to enhance efficiency and reduce the timeliness of procedures. This is very critical as it will further accelerate growth opportunities while enabling the member states to remove barriers to trade,” he said.",
            "time": "18:30",
            "date": "10 Feb 2025"
        },
        {
            "title": "RBZ to roll out new world class ZiG notes",
            "href": "https://www.zbcnews.co.zw/rbz-to-roll-out-new-world-class-zig-notes/",
            "content": "Story by Stanley James, Business Editor\nThe Reserve Bank of Zimbabwe (RBZ) has embarked on a project to introduce new world class standard ZiG notes by the 3rd quarter of this year.\nRBZ governor, Dr John Mushayavanhu told bank executives during the 2025 monetary policy presentation that the move is in response to concerns from the public about the durability of the ZiG.\n“The need to come up with a durable currency is of greater importance. Therefore, we have devised a strategy to ensure that the current ZiG notes are replaced by world class notes and such an initiative will also go a long way in addressing the needs of the nation at a time when the public has been sending an outcry that the current notes get easily torn and cannot be durable,” he said.",
            "time": "18:31",
            "date": "10 Feb 2025"
        },
        {
            "title": "RBZ Governor Dr Mushayavanhu presents the 2025 Monetary Policy Statement",
            "href": "https://www.zbcnews.co.zw/rbz-governor-dr-mushayavanhu-presents-the-2025-monetary-policy-statement/",
            "content": "Story Stanley James, by Business Editor\nTHE Reserve Bank of Zimbabwe (RBZ) has set sights on growth and stability by reducing exporters’ foreign currency retention thresholds, maintaining the bank policy rate, and increasing the use of the ZiG and banking sector confidence.\nPresenting the 2025 Monetary Policy Statement in Harare this Thursday, Reserve Bank of Zimbabwe Governor Dr John Mushayavanhu announced a reduction in the exporters’ foreign currency retention thresholds, in a move aimed at further bolstering the use of the Zimbabwe Gold.\n“To guarantee continued stability in the interbank foreign exchange market through augmenting the supply of foreign currency reserves needed to anchor the ZiG, the foreign currency retention level for exporters has been reduced with immediate effect, this implies that the effective surrender portion of export proceeds has been increased from 25 percent to 30 percent.\n“This review is consistent with the increased use of ZiG in the economy, the additional 5 percent will ensure that exporters mobilise sufficient ZiG to meet local currency obligations and other expenses including tax payments going forward,” Dr Mushayavanhu said.\nThe central bank also refined the foreign exchange management system.\n“To engender greater flexibility and deepen the foreign exchange market while enhancing its efficiency and the price discovery mechanism, the Reserve Bank is further refining and clarifying the Interbank Foreign Exchange Trading guide to authorised dealers as follows, the five percent trading margin as communicated in the previous Interbank Foreign Exchange Trading Guidelines issued at the inception of the willing buyer, willing seller foreign exchange trading arrangements on 3 May 2024 only applicable for the determination of the starting exchange rate following the introduction of the new currency,  ZiG, ” he added.\nWith monetary authorities revealing milestones since the launch of the ZiG, improving confidence in the local markets tops the RBZ priorities.\n“Consistent with its monetary policy objectives of ensuring currency and exchange rate stability, the Reserve Bank is committed to the continued accumulation of reserves to cover ZiG reserve money in the economy, the Reserve Bank will leverage its foreign reserves build up strategy on the anticipated increase in gold production through in-kind royalties, purchase of foreign exchange export surrender proceeds and from willing sellers of foreign exchange in the WBWS market,” the Governor said.",
            "time": "18:31",
            "date": "10 Feb 2025"
        }
    ]
}