{
    "news": [
        {
            "title": "Zimbabwe strengthens diplomatic relations with the Vatican",
            "href": "https://www.zbcnews.co.zw/zimbabwe-strengthens-diplomatic-relations-with-the-vatican/",
            "content": "Story by Abigirl Tembo\nZIMBABWE is looking to deepen ties with the Vatican, with focus on promoting education, social justice and women empowerment.\nSpeaking after Pope Francis’s funeral, which was attended by Vice President General (Retired) Dr Constantino Chiwenga on Saturday, Zimbabwe’s top envoy to France and Vatican Ambassador Sekai Nzenza outlined the country’s plans to strengthen its ties with the Vatican.\nShe emphasised the crucial role the Catholic Church has played in Zimbabwe’s education system, citing its numerous schools and institutions that have provided quality education to millions of Zimbabweans over the years.",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "From exclusion to empowerment, ZITF 2025 highlights indigenous innovation",
            "href": "https://www.zbcnews.co.zw/from-exclusion-to-empowerment-zitf-2025-highlights-indigenous-innovation/",
            "content": "Story by Peter Chivhima\nZIMBABWE’S independence continues to open doors of opportunities for indigenous business players as witnessed at the just-ended 65th edition of the Zimbabwe International Trade Fair in Bulawayo.\nBefore 1980, platforms such as the Zimbabwe International Trade Fair (ZITF) which was then known as the Central African Trade Fair, were largely dominated by the white minority.\nOpportunities for black Zimbabweans to innovate, produce and market their goods were limited, often stifled by a system that excluded them from mainstream economic activities.\nToday, things have changed and local entrepreneurs are now key players in shaping the national economy.\n“We are happy that independence has brought a lot to us and today we are here exhibiting our products freely, in the past it was difficult to get such opportunities because the white minority were the ones owning companies,” an exhibitor said.\n“We are grateful for the independence, we are now able to showcase our products, now able to discuss with other people who are into business on how to grow our business and how we can improve on our products as well,” a business owner said.\nThe Trade Fair is no longer a preserve for a few, but a celebration of Zimbabwe’s diverse and dynamic entrepreneurial spirit nurtured by the freedom and opportunities that independence made possible.",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Zim strengthens trade ties at the 7th Iran-Expo 2025",
            "href": "https://www.zbcnews.co.zw/zim-strengthens-trade-ties-at-the-7th-iran-expo-2025/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE this Monday joins over 100 nations at the seventh Iran-Expo 2025, which officially opened this Monday, marking a key step in strengthening economic and trade relations between the two countries.\nVice President General (Retired) Dr Constantino Chiwenga, who is leading the Zimbabwean delegation is attending the Expo and will also tour exhibition halls.\nHe will also be attending specialised and export development oriented meetings at the Iran-Expo 2025 including discussions to increase economic and trade relations between Zimbabwe and Iran.",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "VP Chiwenga in Tehran for the Third Iran-Africa Economic Conference",
            "href": "https://www.zbcnews.co.zw/vp-chiwenga-in-tehran-for-the-third-iran-africa-economic-conference/",
            "content": "Story by Stanley James, Business Editor\nVICE President General (Retired) Dr Constantino Chiwenga has arrived in Tehran, Iran, for the Third Iran-Africa Economic Conference, which officially begins this Sunday.\nThe conference presents opportunities for African economies including Zimbabwe to assess levels of cooperation, review progress on agreements and focus on the outlook of ties with Iran.\nIt also serves as a platform to reflect on Iran’s commitment to continue doing business with African countries beyond political and diplomatic relations.\nVice President Chiwenga touched down at Mehrabad Airport in Tehran early Sunday morning and was received by Iran’s Minister of Cooperatives, Labour and Social Welfare, Dr Ahmad Meydari, as well as Zimbabwe’s Ambassador to Iran, His Excellency Bright Kupemba.\nHe is expected to meet Iran’s top government leadership including representatives of business organisations as well as attending the 7th Iran Expo 2025.\nVice President Chiwenga is leading the Zimbabwean delegation on cooperation talks with Iran in the medical industry, tourism, mining, manufacturing, small and medium enterprises, agriculture and education.",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Zim to take part at the 3rd Iran-Africa International Economic Conference",
            "href": "https://www.zbcnews.co.zw/zim-to-take-part-at-the-3rd-iran-africa-international-economic-conference/",
            "content": "Story by Stanley James\nZIMBABWE will participate in this year’s third Iran-Africa International Economic Conference, which begins this Sunday. The conference will focus on consolidating economic ties with the Western Asian nation.\nZimbabwe’s participation at the conference in Tehran is a show of confidence by the government in further expanding business ties with Iran.\nZimbabwe’s top envoy to the Islamic Republic of Iran Ambassador Bright Kupemba speaks on the importance of the conference which will also be attended by Vice President General Retired Dr Constantino Chiwenga.\n“The focus is mainly on investment, trade, development and exchange of knowledge, it will allow  Iran and African business people to exchange notes on business, markets and general global economic trends, and it will give an opportunity for our businesses, to interact with the Iran business community across all the key sectors,” Ambassador Kupemba said.\n“The major areas of focus this year are the agriculture, mining and health sectors. It is a platform where African economies are going to learn from Iran, an economy that has been under sanctions for the past 45 years but managed to prevail. This is the experience that Zimbabwe would further like to learn during the conference, it will also give Zimbabwe an opportunity to interact with other African business people and get to understand what is also happening in other African economies.\n“This conference and expo will showcase Iran’s achievements in health, agriculture and other key sectors. We have benefitted from the previous Iran- Africa conference, our main areas of interest are in the health delivery systems, particularly cancer treatment, Iran is quite advanced and some companies are willing to do joint ventures with Zimbabwe,” he added.\nThe Ambassador explained the impact of Memorandums of Understanding signed by President Emmerson Mnangagwa and the late Iranian President Ebrahim Raisi.\n“We have 17 signed Memorandums of Understanding. What has happened is that we cannot expedite all of them at the same time, we have made some successes in the health sectors, we are working with the pharmaceuticals in that sector, and there are joint projects between Natpharm and Iranian companies in the distribution and manufacturing of selected drugs, in the health sector, I think we are making quite significant progress,  then we also have MOU’s in Science and Technology, progress is being made in space technology. We have some quite commendable projects in the agriculture sector, in terms of the manufacturing of agricultural equipment between an Iranian company and the Government of Zimbabwe.",
            "time": "18:38",
            "date": "28 Apr 2025"
        }
    ]
}