{
    "news": [
        {
            "title": "Zim’s aviation sector records significant investments and growth in 2024",
            "href": "https://www.zbcnews.co.zw/zims-aviation-sector-records-significant-investments-and-growth-in-2024/",
            "content": "Story by Owen Mandovha, Business Reporter\nFirms involved in the country’s aviation ecosystem recorded stellar performances during the year 2024, riding on government massive investments in the rehabilitation of the country’s airports infrastructure.\nMajor firms’ comprising of the country’s aviation ecosystem are flourishing in the booming aviation industry after the expansion of the Robert Gabriel Mugabe International Airport which was completed last year.\nIn 2024, the National Handling Services registered robust business growth on its headline earnings, looking forward to even better fortunes in 2025.\nNHS’ chairperson, Advocate Godwin Nyengedza said, “As the NHS, the future looks bright, especially as cargo and passenger traffic is high during the season, but obviously, we can’t rule out the positive impact of the expansion of the airport in breathing life into our operations as more air flights are now to Zimbabwe.”",
            "time": "06:32",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zim to double gold output in 2025",
            "href": "https://www.zbcnews.co.zw/32579-2/",
            "content": "Story by Owen Mandovha, Business Reporter\nGovernment is targeting to double its gold mobilisation initiatives to enhance production of the yellow metal to reach over 40 tonnes next year.\nThe Ministry of Mines and Mining Development is sending teams in major gold mining regions throughout the country working with small and medium scale miners to promote and incentivise more gold production.\nSpeaking at a gold mobilisation workshop recently, Mines and Mining Development Minister, Honourable Winston Chitando said this year’s targeted output of 35 tonnes of gold will be achieved.\n“Production of the yellow metal has increased from around 20 tonnes a few years back and currently we are sitting at over 32 tonnes. In October during our last mobilisation output rose by 4.1 tonnes and in November it rose by over 3 tonnes signalling the successes of gold mobilisation initiatives,” he said.\nMinister Chitando said his ministry has set sights on doubling their efforts in 2025.",
            "time": "06:32",
            "date": "26 Dec 2024"
        },
        {
            "title": "Mukuru gets deposit-taking licence in Zim",
            "href": "https://www.zbcnews.co.zw/mukuru-gets-deposit-taking-licence-in-zim/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE growth and stability of the financial sector is reducing the financial exclusion gap as more players transform to become deposit-taking institutions to serve previously marginalised groups.\nThe granting of a licence for financial firm, Mukuru, to take deposits signifies a huge leap in the growth of the local financial services as confidence in the banking system rises.\nThe firm’s Group Managing Director Andy Jury says the milestone provides a perfect opportunity to further consolidate the Reserve Bank of Zimbabwe’s financial inclusion policy by leveraging on its vast national network outreach.\n“This is big in terms of accelerating the national financial inclusion policy. The move means that the firm, which handles huge amounts of remittances in the industry, will be able to keep money in the formal economy where by nature withdrawals done prior to this development predominantly find themselves into the black market,” he said.\nWith many remittances naturally transitory in nature, the new deposit taking microfinance institution plugs a huge gap, serving the financially marginalised.",
            "time": "06:32",
            "date": "26 Dec 2024"
        },
        {
            "title": "Enforcement of mandatory petrol blending tightened",
            "href": "https://www.zbcnews.co.zw/enforcement-of-mandatory-petrol-blending-tightened/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe has tightened monitoring of the petroleum sector’s compliance to the mandatory blending of petrol as errant operators risk losing licences and closure of service stations.\nA notice to petroleum sector operators issued by the Zimbabwe Energy Regulatory Authority (ZERA) this this Friday states that requirements outlined in the Statutory Instrument 150 of 2024 for operators to blend unleaded petrol with ethanol are still in motion.\nResponding to inquiries from ZBC News over the issue, ZERA chief executive officer, Mr Eddington Mazambani said the regulatory authorities have embarked on a country fact-finding mission to monitor and evaluate compliance.\n“The entire mission is for us to look and assess into the needs of the nation regarding what needs to be done as far as ensuring that compliance becomes a national issue. As the regulatory authority, the focus is on what we can do to ensure that the entire issue becomes a success. Currently, a lot of groundwork has been covered and we shall roll out more inspections to assess and ensure that our aspirations are taken into effect by the relevant stakeholders for the benefit of the nation,” he said.",
            "time": "06:32",
            "date": "26 Dec 2024"
        },
        {
            "title": "Tourism booms in 2024, government expects even stronger 2025",
            "href": "https://www.zbcnews.co.zw/tourism-booms-in-2024-government-expects-even-stronger-2025/",
            "content": "Story by Tichaona Kurewa\nGovernment has expressed satisfaction with the performance of the tourism sector this year, amid optimism that 2025 will be bigger and better.\nThe United Nations Tourism Gastronomy and several MICE tourism gatherings held in Zimbabwe saw the tourism industry emerging as the major contributor to the GDP.\nSpeaking on the sidelines of a meet and greet domestic tourism campaign in Victoria Falls this Wednesday, Tourism and Hospitality Industry Minister Honourable Barbra Rwodzi highlighted the signing of the Memorandum of Understanding for Zimbabwe to host the first UN Tourism School in Africa as another success story.\n“I an gladly say we have surpassed our expectations for 2024. We are very happy that the cabinet has accepted our policy and it means 2025 going forward there will be implementation and that implementation must have an impact on the numbers of arrivals as well as on investments and as well as the way the regulatory front, the legal front, the way we should run the business of tourism in the industry.",
            "time": "06:32",
            "date": "26 Dec 2024"
        }
    ]
}