{
    "news": [
        {
            "title": "State of sugar industry value chain under the spotlight",
            "href": "https://www.zbcnews.co.zw/state-of-sugar-industry-value-chain-under-the-spotlight/",
            "content": "Story by Fungai Jachi\nTHE state of the sugar industry value chain has attracted the attention of Parliament, with legislators questioning what government is doing to improve the sector after identifying sugarcane as a strategic crop with huge impact on the economy.\nThe committee summoned the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development after visiting sugarcane plantations and meeting with farmers who pointed out challenges affecting the sugar industry.\nIn response to the questions raised, Permanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Professor Obert Jiri, said among other initiatives, the Sugar Act is currently under review to align it with modern agricultural economics and environmental standards.",
            "time": "06:52",
            "date": "16 Jul 2025"
        },
        {
            "title": "China-Zimbabwe trade grows by 18 percent as investment relations strengthen",
            "href": "https://www.zbcnews.co.zw/china-zimbabwe-trade-grows-by-18-percent-as-investment-relations-strengthen/",
            "content": "Story by Stanley James\nTRADE between Zimbabwe and China has reached a massive US$1.9 billion during the first five months of this year, representing an annual growth rate of over 18 percent.\nFigures released during the China-Zimbabwe Business Forum held in Harare this Tuesday revealed continued growth in trade ties between the two economies, as Zimbabwe’s exports to the Asian economic giant have risen by over 14 percent to more than US$1.9 billion.\nZimbabwe’s imports from China were pegged at over US$600 million during the period under review, reflecting a 29 percent increase.\nHowever, it is Zimbabwe that recorded a surplus of over US$7 million, reflecting strides by the Second Republic’s efforts to boost external markets by incentivising local industries.\nChina is pledging increased business ties with Zimbabwe.\n“For the period under review, it is imperative to observe that tobacco has been the key export commodity by Zimbabwe to China. However, horticultural produce, including citrus commodities, is in the second spot mainly as a result of increased demand. In the long term, both countries stand to benefit, riding on improved relations that have created scope for further growth in business, investments, and trade in the fields of energy, mining, agriculture, manufacturing, and tourism, among many other strategic sectors,” China Zimbabwe Exchange Centre CEO, Mr Steve Ke Zhao said.",
            "time": "06:52",
            "date": "16 Jul 2025"
        },
        {
            "title": "Cross-border traders in Matabeleland North benefit from Presidential revolving fund",
            "href": "https://www.zbcnews.co.zw/cross-border-traders-in-matabeleland-north-benefit-from-presidential-revolving-fund/",
            "content": "Story by Tichaona Kurewa\nCROSS-border traders in Matabeleland North Province have started to receive funding under the US$200 000 Cross Border for ED Revolving Fund.\nThis Sunday marked the commencement of the disbursement process in Matabeleland North, much to the delight of beneficiaries, who welcomed the transformative nature of the zero-interest-rate initiative.\n“Indeed, true to his word of leaving no place or person behind, here in Matabeleland North, we have been remembered,” said one of the beneficiaries.\nAnother beneficiary says the scheme should boost their business, and it is very flexible and affordable to all who qualify.\n“We thank the President for remembering us. My business will certainly grow from here,” another beneficiary added.\nThe Cross Borders Association for ED, together with ZANU-PF leadership, urged beneficiaries to repay the loans and refrain from engaging in illegal activities.\n“This is a demonstration that the President loves his people. It will also help steer youths away from drugs, by providing profitable business opportunities to keep them engaged,” Cross Borders for ED chairperson, Cde Wellington Chamande said.",
            "time": "06:52",
            "date": "16 Jul 2025"
        },
        {
            "title": "Mat North Investment Indaba pushes for private sector-led growth",
            "href": "https://www.zbcnews.co.zw/mat-north-investment-indaba-pushes-for-private-sector-led-growth/",
            "content": "Story by Mhlomuli Ncube\nUMGUZA-THE Government has re-emphasised the critical role of the private sector in national development through enhanced participation in key projects.\nNow in its second day, the Matabeleland North Investment Indaba 2025 has brought together stakeholders from across various sectors to explore investment opportunities in infrastructure, transport, mining, energy, and value addition.\nDelivering the keynote address, Minister of Finance and Economic Development, Professor Mthuli Ncube, underscored the importance of public-private partnerships in attaining the country’s developmental aspirations.\n“We are currently developing the NDS2, so we hope that the interactions from this Conference will also be an input into sharpening our second plan for the Republic,” he said.\nHe added that real economic transformation can only be achieved when the private sector becomes an active driver of national and provincial initiatives.\nOther delegates echoed the minister’s sentiments, underscoring the economic promise of Matabeleland North and the strategic importance of aligning capital markets with local projects.\n“This is an event which brings together various parties, project owners, and the capital markets and looking at the potential embedded in the region of Matebeleland North, it is a platform which will contribute to the unlocking of value in Matebeleland North,” Engineer William Gambiza said.\nWith a rich endowment of natural resources and a strategic geographic location, the province has been earmarked for major infrastructure development and industrialisation.\nBeitbridge Bulawayo Railway General Manager, Mr Khumbulani Mabvura, stressed the urgent need for investments in the rail sector to reduce pressure on road infrastructure.\n“The Victoria Falls Road, which the government is currently rehabilitating, may face deterioration again in the next two years due to the growing number of heavy trucks. We are seeking investment for our railway line along that corridor to protect our road infrastructure and increase value by transporting bulk goods via rail,” he said.\nMatabeleland North Minister of State for Provincial Affairs and Devolution, Honourable Richard Moyo, said the time for rhetoric is over, and the province is now pursuing actionable investment outcomes.",
            "time": "06:52",
            "date": "16 Jul 2025"
        },
        {
            "title": "Small-scale miners gear up for digital transformation through landmark deal",
            "href": "https://www.zbcnews.co.zw/small-scale-miners-gear-up-for-digital-transformation-through-landmark-deal/",
            "content": "Story by Theophilus Chuma\nTHE Artisanal and Small-scale mining sector is embracing the digital mining cadastre system, a requirement outlined in the recently gazetted Mines and Minerals Amendment Bill, targeting greater transparency and efficiency for thesector.\nThis follows a Memorandum of Understanding signed between the Zimbabwe Miners Federation (ZMF) and the Association of Mine Surveyors of Zimbabwe (AMSZ) in Harare this Thursday.\nIt is a deal of mutual agreement, which is expected to catapult artisanal and small-scale mining into a fully computerised sector for managing mining rights and operations under thesector, guided by the principles of the Mining Cadastre Information Management System (MCIMS).\nThe working arrangement agreed between ZMF and AMSZ targets to unlock benefits for the sector.\n“Our partnership with the Zimbabwe Miners Federation is a landmark agreement and supports access to credible mine surveying services, which they critically need for meeting formalisation requirements. Secondly, it supports the growth of this sector, our Minershave great potential to grow from small to medium and ultimately to large-scale miners. This is why we are ready to support this sector,” AMSZ president, Mr ShepherdGumbisaid.",
            "time": "06:52",
            "date": "16 Jul 2025"
        }
    ]
}