{
    "news": [
        {
            "title": "Tobacco marketing season reaches US$5.45 per kilogram on second auction day",
            "href": "https://www.zbcnews.co.zw/tobacco-marketing-season-reaches-us5-45-per-kilogram-on-second-auction-day/",
            "content": "Story by Tendai Munengwa",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Global economies embrace Zim’s engagement agenda, highlighting its viability for business",
            "href": "https://www.zbcnews.co.zw/global-economies-embrace-zims-engagement-agenda-highlighting-its-viability-for-business/",
            "content": "\nStory by Stanley James Business Editor\nMORE global economies are warming up to the government’s engagement and re-engagement agenda, with the European Union(EU), Serbia and Egypt describing Zimbabwe as a safe and viable destination for business.\nThis emerged after Ambassadors of the EU, Serbia and Egypt to Zimbabwe paid a courtesy call on the Minister of Industry and Commerce, Honourable Mangaliso Ndlovu in Harare this Wednesday that the three countries have an interest in setting up projects and increasing economic ties with Zimbabwe.\n“The EU continues to explore more opportunities with Zimbabwe in the fields of trade, Investment and economic cooperation, so what makes this meeting more interesting is that it was held when the EU economies also continue to explore more opportunities in Zimbabwe,” His Excellency Jobst Van Kirchmann, EU’s Ambassador to Zimbabwe said.\n“For the third time in a row, I can even confirm that the EU will be taking part at the Zimbabwe International Trade Fair, with more new companies from the regional bloc expected to take part. I believe we can do more riding on the current strides.”\nSerbia’s Ambassador to Zimbabwe, His Excellency Radisa Grujic, highlighted the growing strategic partnership between the two countries, focusing on boosting trade, cooperation, and economic opportunities.\n“Serbia is also seriously taking Zimbabwe as a strategic partner that can also unlock value on returns to our investors, the meeting with the Minister was cordial and an eye opener in that it opened a platform on how the two countries can work with each other, boost trade and offer cooperation, there is also a business expo in Serbia where we have also invited the local companies to take part,” he said.\n“This will offer an opportunity to understand business operations, project opportunities for the two countries, and accelerate cooperation in the future. We also discussed economic opportunities that exist with a view of deepening ties with a number of proposals being discussed on exchange programmes.”\nMeanwhile, Her Excellency Salwa Mowafi, Ambassador of the Arab Republic of Egypt to Zimbabwe, highlighted the positive outcomes of discussions with the Minister, focusing on areas of cooperation, including investments in agriculture, resilience building, and manufacturing, while exploring opportunities to scale up trade in line with Zimbabwe’s diplomatic initiatives.\n“The interactions with the Minister resulted in us looking at a number of areas of cooperation between the two countries, by so doing it is a reflection of the commitment to fulfill the engagement strategy,” she said.\n“So we have seen the commitment by the government which is a positive element, we also discussed a wide range of issues that are anchored on investments in a number of sectors in agriculture, resilience building and manufacturing sectors we are also looking at interrogating more avenues to scale up trade within the context of diplomatic advancements initiated by the Zimbabwean government.”\nThe government has reaffirmed its commitment to work with global economies.",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Two Victoria Falls hotels receive major facelift",
            "href": "https://www.zbcnews.co.zw/two-victoria-falls-hotels-receive-major-facelift/",
            "content": "Story by Tichaona Kurewa\nMEMBERS of the Hospitality Association of Zimbabwe (HAZ) are actively upgrading their properties to meet contemporary standards and enhance destination Zimbabwe’s appeal.\nCurrently, over US$60 million worth of accommodation facilities in Victoria Falls are undergoing development or extensive refurbishment.\nTwo prominent hotels in the resort city, the four-star A’ Zambezi River Lodge, and the three-star Victoria Falls Rainbow Hotel, are the latest to undergo significant renovations.\nThese upgrades are a crucial step in driving the growth of Zimbabwe’s tourism industry.\nThe refurbishments encompass major redesigns and room upgrades, aimed at meeting the evolving tastes of the global market.\n“These upgrades align with global best practices, ensuring our tourism infrastructure remains highly competitive. The refurbishment of these two hotels will significantly contribute to achieving our national goal of a US$5 billion tourism industry,” Rainbow Tourism Group Chief Executive Officer officer, Mr Tendai Madziwanzira.\n\nVictoria Falls-based tourism practitioner, Simon Munengwa, has praised the developments for enhancing the city’s competitive edge.\n“This is fantastic for enhancing the overall image of the tourist city. These two hotels are critical assets, and their modernisation ensures we keep pace with global standards,” he said.",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "Monetary Policy anchors Zim’s de-dollarisation efforts, says RBZ",
            "href": "https://www.zbcnews.co.zw/monetary-policy-anchors-zims-de-dollarisation-efforts-says-rbz/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE Reserve Bank of Zimbabwe says the Monetary Policy Statement presented last month acts as a balancing tool to stabilise the exchange rate while establishing a strong foundation for the country’s de-dollarisation roadmap.\nThe Parliamentary Portfolio Committee on Budget and Finance summoned the Governor of the Reserve Bank of Zimbabwe, Dr John Mushayavanhu this Monday to interrogate him on whether the policy blueprint is adequate to address some challenges affecting business.\nDr Mushayavanhu mentioned in his remarks that the Monetary Policy Statement enhances the stability of the ZiG currency and the economy.\nHe said, “We are doing everything in accordance to stabilise the ZIG currency. Looking at the de-dollarisation roadmap, the main important thing is that the 2030 deadline to dissolve multi-currency is what we are working with, whereby we will have zero transactions in foreign currency.\n“We are supporting the productive sector through the targeted finance facility however, there has been calls to also support the retail sector upon learning of challenges affecting them. Coming to the bank policy rate, we are calculating the month-on-month inflation but waiting to calculate the year-on-year inflation until May,”",
            "time": "06:33",
            "date": "07 Mar 2025"
        },
        {
            "title": "James Mharadze elected Chairperson of COMESA’s Yellow Card Scheme",
            "href": "https://www.zbcnews.co.zw/james-mharadze-elected-chairperson-of-comesas-yellow-card-scheme/",
            "content": "Story by Tichaona Kurewa\nZIMBABWEANS are increasingly occupying key roles in the region, with Mr James Mharadze recently elected as Chairperson of the Council of Bureaux for the Common Market for Eastern and Southern Africa (COMESA) Yellow Card Scheme.\nMharadze, an insurance practitioner, was elected at the ongoing 38th COMESA meeting of the Council of Bureaux of the Regional Third Party Motor Vehicle Insurance in Victoria Falls.\nActing COMESA Yellow Card Scheme Chairperson Mr Patrick Kusikwenyu indicated that the vote on Zimbabwe is a show of confidence in the Southern African country and its ability to lead the Yellow Card Scheme.\n“For starters, we have been in it from the beginning. We have a lot of understanding of the processes and how they work, but also, I think the guidance that we will also be able to give will be at the highest level. We want to see efficiency as we move into this new era, the year that we will be running.\n“We want to ensure that the governance structures of the Yellow Card continue to be strengthened. We also want to see the ability for the communication between countries to be much better. So Zimbabwe has just recently been elected and I think it is a very important position to hold,” he said.\nMr Charles Ndagijima, Past president from Burundi will deputise Mr Mharadze.\nMr Mharadze is a complete insurance professional with experience in both short-term insurance and life assurance industries comprising 21 years in general insurance and two years in the life assurance industry.\nHe has 23 years of professional experience, 14 of which are at senior management level, and will lead the regional board for a year.\nHe worked for AIG Zimbabwe, Zimnat Lion, Optimal Insurance, CBZ Life, and CBZ Insurance.\nCurrently, Mharadze is the General Manager and Principal Officer at CBZ Insurance.",
            "time": "06:33",
            "date": "07 Mar 2025"
        }
    ]
}