{
    "news": [
        {
            "title": "Rehabilitation of Bulawayo–Vic Falls highway underway",
            "href": "https://www.zbcnews.co.zw/rehabilitation-of-bulawayo-vic-falls-highway-underway/",
            "content": "Story by Mhlomuli Ncube\nBULAWAYO -THE rehabilitation of the Bulawayo–Victoria Falls Highway has officially commenced, with five contractors engaged by the government now on the ground carrying out preliminary works along the key national route.\nThe contractors, have begun land clearance to create detours, are working on multiple segments of the highway, which connects Bulawayo to the world-renowned tourist destination, Victoria Falls.\nThe long-awaited development has been met with enthusiasm by motorists using the route, many of whom commended government efforts to improve road infrastructure in the region.\n“I just want to thank our President and the government for ensuring this road is repaired,” a motorist said.\n“This is an important road to Victoria Falls, a very vital part of our country. Government has made a timely and crucial intervention,” a driver said.\nUnder the first phase of the project covering the stretch from Bulawayo to Gwayi, each of the five contractors has been allocated 51 kilometres to rehabilitate.\nMatabeleland North Minister of State for Provincial Affairs and Devolution, Honourable Richard Moyo, confirmed that early-stage works, including the construction of detours, are progressing across all assigned segments.\n“The work will start in Bulawayo and extend to Gwayi. We can confirm that all five contractors are currently undertaking detour construction as part of critical preliminary works,” he said.",
            "time": "20:45",
            "date": "12 Jun 2025"
        },
        {
            "title": "Zimbabwe wins bid to host UN Women in Tourism Congress",
            "href": "https://www.zbcnews.co.zw/zimbabwe-wins-bid-to-host-un-women-in-tourism-congress/",
            "content": "Story by Memory Chamisa\nNIGERIA – ZIMBABWE has won the bid to host the Third United Nations (UN) Women in Tourism Regional Congress set for 2026.\nThis emerged at the 68th UN Tourism Regional Commission for Africa meeting in Nigeria.\nIt was a double triumph for Destination Zimbabwe as it was again elected vice president of the 26th UN Tourism General Assembly set for Riyadh, Saudi Arabia, in November.\nThe vote of confidence comes in recognition of the resounding work of the tourism patron, the First Lady Dr Auxillia Mnangagwa, through initiatives such as Gastronomy Tourism, Women’s Market Galore, Farm to Market, Agri4She and AgroTourism4She.\nSpeaking on the sidelines of the meeting, the Minister of Tourism and Hospitality Industry, Honourable Barbara Rwodzi, highlighted how Zimbabwe has become one of Africa’s best destinations after its successful hosting of the UN Gastronomy Conference last year.\n“Tourism is more than traveling to visit historical sites, waterfalls, mountains, and parks. It is an engine of local economies transformed by technology and creativity. African nations need to redefine their global identity through the vibrance of their people, rich cultural heritage, and natural endowments. Zimbabwe is indeed the new frontier in world tourism, given its huge potential and limitless opportunities for innovation and creativity,” she said.\nRunning under the theme: “Boosting Social Impact and Education in Tourism via Innovation, AI, and Creative Industries in Africa,” the meeting highlights the future of Africa’s prosperity as it uses technology to empower people.\nThe high-profile summit, attended by ministers, delegates from 51 African nations, and global tourism leaders, emphasised innovation, sustainability, and African cultural identity as key to unlocking the continent’s economic potential.\nZimbabwe received the highest votes, followed by Kenya, Seychelles, Zambia, Angola, Morocco, South Africa, Mozambique, and Tunisia.",
            "time": "20:45",
            "date": "12 Jun 2025"
        },
        {
            "title": "Over 200 Bulawayo SMEs count losses after industrial site inferno",
            "href": "https://www.zbcnews.co.zw/over-200-bulawayo-smes-count-losses-after-industrial-site-inferno/",
            "content": "Story by Aifheli Mudau\nBULAWAYO – OVER 200 small and medium entrepreneurs are struggling to come to terms with a fire incident that gutted their goods and machinery at Save The Nation Industrial Site in Bulawayo Monday night.\nThe inferno, which occurred under unclear circumstances, has left entrepreneurs without income and livelihoods, raising urgent calls for intervention and support from both the government and stakeholders.\nEntrepreneurs who spoke to the ZBC News described the devastation as a major setback that wiped out years of investment.\n“It took us more than 10 years to build up our workspaces and purchase machinery. Now we have lost everything,” one visibly distressed entrepreneur said.\n“We are pleading for assistance from the government and all willing partners. This is our only source of income,” another affected operator said.",
            "time": "20:45",
            "date": "12 Jun 2025"
        },
        {
            "title": "Infrastructure Development Bank of Zimbabwe expands housing projects in Masvingo",
            "href": "https://www.zbcnews.co.zw/infrastructure-development-bank-of-zimbabwe-expands-housing-projects-in-masvingo/",
            "content": "Story by Mercy Bofu-Matinha\nMASVINGO – WITH the Second Republic prioritising housing delivery, the Infrastructure and Development Bank of Zimbabwe (IDBZ) is working on developing 1 300 housing stands under various partnerships in Masvingo.\nThis follows the successful completion of the Clipsham Views Housing Project in Masvingo by the IDBZ and its partners, which saw the development of nearly 1 000 stands.\nThe development bank has started working on phase two of the housing project, sitting on a 100-hectare piece of land.\nSpeaking during a tour of the Clipsham Phase One site by the IDBZ board and executive management this Tuesday, the bank’s Director for Infrastructure Projects, Dr Reggie Dangarembga said they are expecting Phase Two of the project to be completed within a year.\n“We are now moving into Clipsham Phase Two, which sits on approximately 100 hectares. Our expectation is that within a year or so, the project will be completed. This is part of our broader effort to reduce the housing backlog nationwide.”\nDr Dangarembga also noted that IDBZ has housing developments underway in various urban centres across the country, including Harare, Bulawayo, Kadoma, Plumtree, and Kwekwe.\nAdditionally, the bank has partnered with tertiary institutions to build student accommodation.\nThe government-owned development bank’s target is to ensure the Second Republic’s housing delivery priorities are met, hence they continue to invest in infrastructure development.\nIDBZ Board Chairperson, Dr Kuphukile Mlambo, underscored the bank’s dual mandate of infrastructure and development finance, positioning it as a key enabler in achieving national goals under Vision 2030 and the National Development Strategy 1.",
            "time": "20:45",
            "date": "12 Jun 2025"
        },
        {
            "title": "ZITF expands events calendar with new expos to drive innovation",
            "href": "https://www.zbcnews.co.zw/zitf-expands-events-calendar-with-new-expos-to-drive-innovation/",
            "content": "Story by Yolanda Moyo\nTHE Zimbabwe International Trade Fair (ZITF) Company is significantly expanding its events calendar this year, introducing a series of specialised expos designed to foster innovation, drive sustainable economic growth and address critical national priorities.\nAs part of its strategic realignment, the ZITF Company will this year host the Scholastica Expo as a stand-alone event in July, separate from the main trade fair.\nIn addition, two new thematic expos, a Green Business Expo and a Technology Expo, will be launched in August.\nSpeaking on the development, ZITF Chief Executive Officer, Dr Nicholas Ndebele, said the decision to restructure the event calendar was informed by insights gathered from stakeholders during previous editions of the trade fair.\n“The decision to host Scholastica in July as an independent event stems directly from crucial conversations held during past ZITF editions, where the consistent theme was the urgent need to strengthen collaboration between industry and academia.”\nHe explained that separating Scholastica from the main ZITF would give it greater prominence and allow deeper engagement with issues such as heritage-based education, indigenous knowledge systems, and career development.\n“Scholastica will serve as a crucial nexus, fostering dialogue and collaboration that will lead to more responsive academic programmes, targeted research, and, ultimately, a more competitive and innovative industrial sector.",
            "time": "20:45",
            "date": "12 Jun 2025"
        }
    ]
}