{
    "news": [
        {
            "title": "Professor Mthuli Ncube presents local investment opportunities at the World Economic Forum",
            "href": "https://www.zbcnews.co.zw/professor-mthuli-ncube-presents-local-investment-opportunities-at-the-world-economic-forum/",
            "content": "Story by Owen Mandovha\nThe 2025 edition of the World Economic Forum Annual Meetings started in Davos, Switzerland this Monday with Zimbabwe participating at the global event to attract foreign capital into the country.\nThe event running under the theme: ‘Collaboration for the Intelligent Age,’ started this Monday in Switzerland.\nZimbabwe’s Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube is heading Zimbabwe’s delegation at these annual meetings; seeking to leverage on one of the thematic priorities dubbed: ‘Industries under the intelligent age.’",
            "time": "18:35",
            "date": "21 Jan 2025"
        },
        {
            "title": "Revenue collection surpasses targets",
            "href": "https://www.zbcnews.co.zw/revenue-collection-surpasses-targets/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe’s developmental agenda has received a major boost in the wake of revelations that authorities will collect over US$7 billion in revenue this year after surpassing 2024 targets.\nGiving an update on revenue collections for the just ended year, Zimbabwe Revenue Authority (ZIMRA) Commissioner General Ms Regina Chinamasa disclosed that the institution surpassed its targets after collecting over US$6 billion.\nShe revealed that in line with facilitating increased funding for government projects, the public entity has this year set a target of over US$7 billion.\nValue Added Tax, corporate tax, custom duties, Pay As You Earn and mining royalties are some of the tax heads that are expected to generate revenue to sustain capital projects and employment costs for the state.\n“Zimbabwe has what it takes in terms of resource mobilisation and revenue generation as the authority that is mandated with the duty to raise money on behalf the state. We have also seen it necessary to forge ahead with using all the relevant instruments to collect more revenues. Going ahead, the focus is also working with the tax payers to generate more money,” Ms Chinamasa.\nThe anticipated revenue collection systems are also expected to help in Zimbabwe’s domestic resource mobilisation drive as statistics indicate that development partner support remains subdued despite accounting for at least 20% of the national budget.",
            "time": "18:35",
            "date": "21 Jan 2025"
        },
        {
            "title": "2nd Republic’s fisheries programme transforms Hwange district",
            "href": "https://www.zbcnews.co.zw/2nd-republics-fisheries-programme-transforms-hwange-district/",
            "content": "Story by Mhlomuli Ncube\nZANU PF councillors in Hwange have managed to see a resolution passed in the opposition dominated local authority which will result in a US$150 000 fisheries programme being implemented for the benefit of the local community.\nThe people of Hwange say this will have a positive impact on their livelihoods.\nA beneficiary told the ZBC News, “We want to see programmes that impact on our lives. We are grateful to the Vision of our President who has planted such ideas around the country.”\nAnother stated, “This will not only give council revenues, it creates employment locally and the community benefits.”\n“We are happy whenever programmes that are of benefit are adopted in our area. This means more empowerment for local people,” added another beneficiary.\nThe councillors say the fisheries programme will serve as an important revenue generation stream.",
            "time": "18:35",
            "date": "21 Jan 2025"
        },
        {
            "title": "Fast food tax vital for domestic resource mobilisation",
            "href": "https://www.zbcnews.co.zw/fast-food-tax-vital-for-domestic-resource-mobilisation/",
            "content": "Story by Yolanda Moyo\nEconomists are expecting the introduction of the fast food tax to widen Treasury’s revenue inflows and facilitate funding for development projects.\nThe tax, which was effected this month, is levied per-unit basis for various fast-food items and aims to generate revenue for government while discouraging the consumption of unhealthy foods.\nWhile the tax has generated intense debate, economists believe it presents an opportunity to bolster domestic resource mobilisation and address critical national needs.\n“This tax provides a valuable new revenue stream for the government. These funds can be strategically utilized to address critical national priorities such as infrastructure development, healthcare, and education. This aligns with global trends that have been successful implemented in reducing consumption of fast foods,” said economist, Mr Stevenson Dlamini.\n“The proceeds from this tax can be used to strengthen primary healthcare, combat non-communicable diseases linked to unhealthy diets, and improve nutrition education programmes. This will not only improve public health outcomes, but also contribute to a more productive and healthier workforce. This will be crucial in research and development in the NDC field helping the nation in fight this scourge,” said economist Mr Malorn Gwadu.",
            "time": "18:35",
            "date": "21 Jan 2025"
        },
        {
            "title": "Local currency maintains four-month stable trend",
            "href": "https://www.zbcnews.co.zw/local-currency-maintains-four-month-stable-trend/",
            "content": "Story by Owen Mandovha\nMeasures implemented by the Reserve Bank of Zimbabwe (RBZ) have cooled off exchange rate volatility, providing stability to the ZiG currency over the past five months.\nAlmost four months after its introduction in April 2024, the ZiG was fast losing value as the yawning gap between the official rate of 13.56 to the greenback and the parallel market rate which was hovering between 40 and 50 to the United States dollar prompted monetary authorities to devalue the ZiG to 23.56.\nThis was followed by the upward review of the statutory reserve requirements among a host of other interventions to quell emerging inflationary pressures and exchange rate volatility.\nThe local currency has remained largely stable in the last quarter of the year 2024 as explained by financial economist Mr Batanai Matsika.\n“The liquidity management measures introduced by the central through a tight monetary policy stance speaks to the ongoing macroeconomic stability and it is essential to mention the interventions made by the RBZ to contain money supply growth which was a threat to the exchange rate stability. The ensuing liquidity crunch is also explained by this stance due to increased statutory reserve requirements though we can see a local currency that has largely remained stable for some time,” he said.",
            "time": "18:35",
            "date": "21 Jan 2025"
        }
    ]
}