{
    "news": [
        {
            "title": "Zimbabwe on track to halt cement imports as new plants take shape",
            "href": "https://www.zbcnews.co.zw/zimbabwe-on-track-to-halt-cement-imports-as-new-plants-take-shape/",
            "content": "Story byTamuka Charakupa\nZIMBABWE is edging closer to stopping cement imports after the setting up of various production plants across the country.\nChinese firm,Shungai Investment, is setting up a US$70 million cement plant in Chegutu, a developmentwhichis earmarked to catapult the country towards cement self-sufficiency status.\nThe plant is expected tostartfull production next year, with a projected output of800 000tonnes of cementannually.\nShuntai Investments (Pvt) Ltd Administration Manager, Mr YanBoconfirmed that his firm is seekingaSpecial Economic Zone status to operate competitively.\n“We are installing technologically-advanced machines and making use of locally available resources, so this means we are going to have minimum production cost, which translates to reduced retail price of a bag of cement. So far, we have already employed 300 local youths from Chegutu, and across all our operations, we are looking atabout4 000people in total. For the Chegutu plant, we have set up January of next year as our completion target.”\nChegutu District Development Coordinator, Mr Mark Kadaira, is impressed with the localised industrialisation drive, especially indrivingyouth empowerment.\n“This investment dovetails with the President’s mantra of leaving no one and no place behind. As a district, we are going to benefit a lot, especially in youth employment and the cheap availability of cement, whichobviouslyplays a part in infrastructure development.”\nThe Minister of Industry and Commerce, Honourable Mangaliso Ndlovu, said the government’s target is to improve the contribution of the manufacturing sector to the country’s Gross Domestic Product (GDP) from the current 14.5percentto 22percent.",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "RBZ Quarterly Report Shows Signs of Economic Stability",
            "href": "https://www.zbcnews.co.zw/rbz-quarterly-report-shows-signs-of-economic-stability/",
            "content": "Story by Stanley James, Business Editor\nHARARE – THE Reserve Bank of Zimbabwe (RBZ) is satisfied with the price and exchange rate stability after the implementation of various interventions that have also seen the country recording over US$5 billion in foreign currency inflows since January.\nThe RBZ on Wednesday released its quarterly economic report on monetary, price, and financial stability, highlighting key achievements including growth in reserves backing the Zimbabwe Gold (ZiG) currency, stable prices, a steady bank policy rate, growing demand for the local currency, and a stable interbank foreign exchange market.\nThe central bank attributed the over US$5 billion in foreign currency inflows between January and May this year to strong export performance, diaspora remittances, and support from development partners.\nEconomists have lauded the RBZ’s efforts in restoring macroeconomic fundamentals and enhancing market confidence.\n“There is that element of a huge return to macro-economic fundamentals as evidenced by the statistics from the central bank and the situation on the ground points to stable economic conditions that are vital towards increased market confidence,” Economist, Dr Zack Murerwa said.\nThe private sector is also welcoming stability, with the Confederation of Zimbabwe Industries (CZI) noting that businesses are now able to plan more effectively.\n“Industry and commerce need to plan accordingly and in an economy with stable conditions it becomes easier to plan as well as project on the future of businesses, an element that is vital towards further strengthening business ability to continue operating and attracting domestic and external investors,” CZI Chief Executive Officer Mrs Sekai Kuvarika said.\nThe Central Bank further highlighted the growing public and institutional acceptance of the ZiG currency, which is backed by gold and other reserves.",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Zimbabwe set to resume wheat exports",
            "href": "https://www.zbcnews.co.zw/zimbabwe-set-to-resume-wheat-exports/",
            "content": "Story by Tendai Munengwa\nTHE record wheat hectarage planted this season has set a strong foundation for the country to resume wheat exports and earn the much-needed foreign currency.\nOfficials from the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development led by Professor Obert Jiri toured wheat farms and dams in Mazowe, Mashonaland Central Province, this Tuesday to assess the progress being made by farmers to feed the nation.\nAt Cde Aaron Nhepera’s farm, the officials witnessed a thriving crop on a 60-hectare piece of land, with the farmer praising continued support from government.\n“We started small after getting land but with the support that we have been getting from government agricultural programmes, we are weaning ourselves to do it our own. I have 160 hectares of centre pivots and with inputs programmes like the ARDA inputs support scheme I am expecting to produce over seven tonnes of wheat per hectare,” said Cde Nhepera.\nThe tour also revealed a positive picture of the prospects of the country achieving adequate wheat output and surplus to resume exports of the strategic crop.",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Local firms scale up exports to Zambia",
            "href": "https://www.zbcnews.co.zw/local-firms-scale-up-exports-to-zambia/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’S regional trade development agenda continues to gain traction as local companies increase their export market share in Zambia, riding on the SADC industrialisation agenda.\nPresenting an update on the participation of Zimbabwean firms at the upcoming Zambia Agricultural and Commercial Show at the end of this month, ZimTrade Export Promotion Manager, Mrs Vuyiswa Mafu revealed increased interest by local firms.\n“Over 25 local firms will take part at the Expo a true reflection of their commitment to bolster ties with Zimbabwe and we expect the entire event to yield the intended aspects of broadening the scope of business and unlock more value in trade,” she said.\nShe also revealed that there is huge demand for locally produced goods in the Zambian market.",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "The beverage sector seeks government support amid soaring sugar demand",
            "href": "https://www.zbcnews.co.zw/the-beverage-sector-seeks-government-support-amid-soaring-sugar-demand/",
            "content": "Story by Peter Chivhima\nZIMBABWE’S beverage manufacturing sector is appealing for enhanced government support to stabilise sugar supplies and reduce production costs.\nThe call was made this Tuesday during a briefing with the Parliamentary Portfolio Committee on Industry and Commerce, where Delta Corporation Finance Director, Mr Alex Makamure, detailed the operational bottlenecks affecting the sector.\n“The main suppliers of refined sugar are StarAfrica (Goldstar Sugars) and Tongaat Hullets (Hippo Valley and Triangle). Over the years they have failed to meet the quantity and quality requirements. Given these challenges, the Ministry of Industry and Commerce has agreed with the bottlers that they be allowed to supplement their requirements from imports,” he said.\nHowever, sugar remains on the controlled list of imported products, attracting a protective import duty of US$100 per tonne a cost the sector says adds significant pressure on pricing.\nIn addition, the beverage sector continues to grapple with the implications of the sugar tax, introduced in February 2024, which Mr Makamure says led to price hikes of between 15% and 45%, especially for sugar-laden products such as Mazoe Orange Crush.\n“Prices of Sugar added on soft drinks increased by 15 % to 45 % following the introduction of the tax in February 2024. The highest increase were on cordial such as Mazoe Orange Crush. The process of cordials have been moderated since January 2025 after the surtax was halved to 0.0005/g,” Mr Makamure said.\nIn response, Chairperson of the Portfolio Committee on Industry and Commerce, Honourable Clemence Chiduwa, urged Delta Corporation and other industry players to strengthen engagements with domestic sugar producers to build sustainable supply chains.\n“We encourage you to find each other local companies so that you increase your production. This will create a balance between your production and the market. However as the Committee will further discuss the issues you have raised,” he said.",
            "time": "20:46",
            "date": "10 Jul 2025"
        }
    ]
}