{
    "news": [
        {
            "title": "New book chronicles ZSE’s resilience amid economic challenges",
            "href": "https://www.zbcnews.co.zw/new-book-chronicles-zses-resilience-amid-economic-challenges/",
            "content": "\nStory by Patience Nyagato\nTHE importance of investment knowledge came under the spotlight at the launch of a book titled ‘A cookie that did not crumble,’ in Harare this Saturday.\nAlfonce Maketo authored the book which celebrates the Zimbabwe Stock Exchange (ZSE) Market, bringing to light its resilience even at a time when the economy was ailing due to the economic sanctions imposed on the country by the West, among other factors.\n“The cookie that did Not Crumble is a book that was written out of the realisation that we have some positive aspects that are coming out of our country,” Maketo said.\n“We are always hearing about the negative things but there are also some positive aspects that are coming and one of those positives is the resilience that is mainly shown by Zimbabweans in all walks of life. In this case, in this book, we are talking of the resilience of the Zimbabwe Stock Exchange, at a time when everyone expected the stock market to crumble, when everyone was crushing it, saying it was a scam, that it does not pay, does not give returns to investors, the ZSE, through measures that have been put by the government, that have been put by the ZSE management, and also some stakeholders who are involved in that space has remained resilient.\n“Up to today, for the past decade or so, it has been under a lot of pressure, but it has managed to stack its head above the waters, hence its resilience. It is just a great story of resilience, how that institution managed to stay afloat when companies were delisting when companies were closing, when companies were migrating from the ZSE to the VFX, there were measures that were put in place by various stakeholders to ensure that our stock market still stands proudly in the world, against its peers,” Maketo said.\nThe Zimbabwe Stock Exchange is one of the viable investment markets open for Zimbabweans.\n“Understanding the ZSE is a matter of education, other African countries including Tunisia and Morocco are doing well in such markets people because people understand. People want fast money where they lose all money but the chances of losing an investment in the stock exchange is low,” ZSE Chief Executive Officer, Mr Justin Bgoni said.\nSecretary for Presidential Affairs and Devolution in the Office of the President and Cabinet, Engineer Tafadzwa Muguti who was guest of honour at the event highlighted the need for a culture shift from toxic politics to economic progress.",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Govt launches the Midlands Investment Compendium to unlock provincial potential",
            "href": "https://www.zbcnews.co.zw/govt-launches-the-midlands-investment-compendium-to-unlock-provincial-potential/",
            "content": "Story by Tafara Chikumira\nTHE government has launched the Midlands Province Investment Compendium, a document which spells out the investment opportunities in the province.\nThe document outlines the low-hanging fruits that lie in all the local authorities within the Midlands Province, thereby marketing the province to realise its full potential.\nThe government says investors should take advantage of the business operating environment obtained in the country and make meaningful investments.\n“The launch of the Midlands Investment Compendium will be a new vehicle to provide a clear guideline to create new potential and investment in the region,” the Minister of Finance and Economic Development, Professor Mthuli Ncube said.\nDeputy Chief Secretary to the President and Cabinet, Mr Willard Manungo, said the investment conference comes at a good time when Zimbabwe is preparing to launch the National Development Strategy Two at the end of this year.\n“This investment conference provides a good opportunity for you as a province to prepare for NDS 2 as we conclude NDS1 in December. You need to prepare strongly for foreign investors. We need foreign direct investment for us to move forward as a country,” he said.\nThe Minister of Energy and Power Development, Honourable July Moyo called for more investment in energy projects.\n“There are vast opportunities in the energy sector. We are now going green and we would like investors to invest in solar energy and other power-generating projects.”\nThe Midlands Minister of State for Provincial Affairs and Devolution, Honourable Owen Ncube and ZANU PF Politburo member, Cde Andy Mhlanga urged investors to take advantage of the friendly investment policies that have been created by the Second Republic.",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Zim’s telecomms sector maintains growth",
            "href": "https://www.zbcnews.co.zw/zims-telecomms-sector-maintains-growth/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’S telecommunications sector has maintained growth in the first three months of this year driven by exchange rate stability, more subscribers and increased use of data by industry and commerce.\nData released at the 2025 Annual Telecommunications Conference indicate a resilient sector that sustained operations and viability due to stable costs.\nIt shows that internet or data usage continue to be the main driver of revenues for the sector.\nThe government and telecommunications sector players are happy with the development and continued expansion efforts.",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Tobacco trade surpasses US$130 Million as volumes begin to surge",
            "href": "https://www.zbcnews.co.zw/tobacco-trade-surpasses-us130-million-as-volumes-begin-to-surge/",
            "content": "Story by Owen Mandovha, Business Reporter\nTOBACCO valued at over US$130 million has so far been traded on both auction and contract floors since the beginning of the 2025 tobacco marketing season last month.\nVolumes are starting to pick up after a slow start to the season, with one of the auction floors operating in Harare recording the highest volumes this Friday since the beginning of the year.\n“Volumes are starting to go up and this Friday about 1 200 bales passed through our auction floors, which is the biggest figure that we have registered so far since the start of the season. We look forward to rising figures from now going forward,” Premier Tobacco Auction Floors’ sales manager, Mr Sam Garagba said.",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Midlands Province signals readiness for business growth and investment opportunities",
            "href": "https://www.zbcnews.co.zw/midlands-province-signals-readiness-for-business-growth-and-investment-opportunities/",
            "content": "Story by Courage Bushe\nTHE Midlands Province has sent out a clear message to prospective local and international investors that it is ready to do business and grow its provincial Gross Domestic Product.\nIn line with the country’s devolution agenda and ensuring that provinces grow their Gross Domestic Product, the Midlands Province is hosting a two-day investment conference in Gweru starting this Thursday.\nThe conference is being attended by potential investors, who were excited by business opportunities in the province.\n“We are happy the conference will provide a platform for business leaders and stakeholders to explore investment opportunities and contribute to the province’s development. This is a good initiative and commendable towards economic growth,” an attendee said.\n“As people who are into business, we are happy to learn about investment incentives, infrastructure development, and the province’s unique selling points. We can safely say that the government is walking the talk in decentralising things,” another added.",
            "time": "20:38",
            "date": "05 Apr 2025"
        }
    ]
}