{
    "news": [
        {
            "title": "COMESA’s yellow card scheme sees 33% surge in issuance",
            "href": "https://www.zbcnews.co.zw/comesas-yellow-card-scheme-sees-33-surge-in-issuance/",
            "content": "Story by Tichaona Kurewa\nTHE 38th Common Market for Eastern and Southern Africa (COMESA) meeting of the Council of Bureaux of the Regional Third Party Motor Vehicle Insurance kicked off in Victoria Falls this Wednesday, amid revelations a phenomenal increase of 33 percent in yellow cards issuance was recorded last year compared to 2023.\nCOMESA Yellow Card Council of Bureau Chairperson, Mr Kusikwenyu told journalists on the sidelines of the COMESA meeting of the Council of Bureaux of the Regional Third Party Motor Vehicle Insurance that his organisation issued more than 600 000 yellow cards in 2024, as opposed to about 450 000 the previous year.\nOf these cards, over 70 000 were issued to vehicles exiting Zimbabwe.\nHe attributed the growth to ongoing efforts to raise awareness in member states on the benefits of the yellow card.\n“That growth has been because of the efforts of the council to grow the yellow card through conscientising the motorists on the benefits of the yellow card. Remember, the yellow card is a trade facilitation instrument, and it allows drivers that cross borders to be able to get compensation quickly if they’re involved in accidents outside the country,” he said.\nZimbabwe’s Insurance and Pensions Commission’s Ms Sibongile Siwela director noted the significance of the yellow card.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "African Association of Automotive Manufacturers laud Zim motor industry",
            "href": "https://www.zbcnews.co.zw/african-association-of-automotive-manufacturers-laud-zim-motor-industry/",
            "content": "Story by Stanley James, Business Editor\nTHE African Association of Automotive Manufacturers has expressed interest in reviving Zimbabwe’s motor industry through raising funds and joint ventures with local firms.\nDuring a meeting with government officials and the private sector this Wednesday, the delegation noted that despite challenges which led to low capacity, Zimbabwe’s motor industry has the potential to recover.\n“Remember our goal is to harmonise resources for the growth of the car value chains across the nation and it is our firm belief that the current developments will further enable us to focus on long term gains while creating a platform to unlock value while facilitating growth and recovery so our recommendations after this visit will help authorities to further come up with tangible plans to facilitate growth,” African Association of Automotive Manufacturers chief executive officer, Mr Dave Coffey.\nThe local car manufacturing industry is also expecting to learn from the delegation.\n“The delegation will have an opportunity to visit different companies in the car manufacturing chains, a development we believe shall open opportunities for the sharing of ideas while unlocking value for the investors off course there have been challenges but hope has not been lost in as much as facilitating the growth of the sector is concerned, ” said Motor Industry Association of Zimbabwe president, Mr Lawrence Nyamushanya.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "38th COMESA meeting kicks off in Vic Falls",
            "href": "https://www.zbcnews.co.zw/38th-comesa-meeting-kicks-off-in-vic-falls/",
            "content": "Story by Tichaona Kurewa\nTHE 38th Common Market for Eastern and Southern Africa (COMESA) meeting of the Council of Bureaux of the Regional Third Party Motor Vehicle Insurance has kicked off in Victoria Falls.\nThis significant gathering brings together 14 COMESA member states, including Zimbabwe, to review the progress of the COMESA Yellow Card Scheme.\nThe scheme, also known as the Regional Third Party Motor Vehicle Insurance, is vital in facilitating the smooth movement of freight and people across the region.\nDuring the meeting, attendees will discuss ways to further position the scheme to benefit member states.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Expo 2025 Osaka: A gateway to enhanced trade, investment for Zim and Japan",
            "href": "https://www.zbcnews.co.zw/expo-2025-osaka-a-gateway-to-enhanced-trade-investment-for-zim-and-japan/",
            "content": "Story by Oleen Ndori, Foreign Desk Editor\nZIMBABWE and Japan are hoping to use the Expo2025 Osaka to increase trade and investment opportunities for both countries.\nFebruary 23 was the 65th birthday of Japanese Emperor Naruhito, and to belatedly mark the day, the Japanese Embassy in Harare held its celebrations this Wednesday.\nJapanese Ambassador to Zimbabwe, His Excellency Shinichi Yamanaka says that 45 years since the establishment of diplomatic ties, the two countries’ cooperation has seen growth in areas such as agriculture, road rehabilitation, health and the economy.\nHe said the upcoming Expo 2025 Osaka, along with the 9th Tokyo International Conference on African Development (TICAD9) will further grow these ties.\n“The Osaka-Kansai Expo is scheduled to take place for six months from April 13 to October 13 in Osaka, Japan. Zimbabwe will have a dedicated pavilion at the EXPO with a special focus on July 16, which has been designated as Zimbabwe’s National Day. Various events and activities are scheduled to be held. In addition, Japan will also host the Tokyo International Conference on African Development (TICAD) 9 in August in Yokohama, Japan. I am also confident that the assistance in the areas of education, health, gender and mine clearance through international organisations and NGOs has brought great relief to the people at the grass-roots level.\n“We are also witnessing the strengthening of economic ties between our two nations. Last November, the Government of Japan decided to support sesame seed production in Zimbabwe. Sesame is important for Japanese food and the export of sesame from Zimbabwe to Japan started recently. Another positive development was the resumption of petalite export after two years. Petalite is essential to produce traditional earthenware pot in Japan. Coffee exports to Japan also resumed after 20 years. Given these developments, it is evident that business activities between Japan and Zimbabwe are expanding gradually and steadily,” he said.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Former executives bounce back as OK Zimbabwe Limited eye revival",
            "href": "https://www.zbcnews.co.zw/former-executives-bounce-back-as-ok-zimbabwe-limited-eye-revival/",
            "content": "Story by Stanley James, Business Editor\nLISTED retail giant OK Zimbabwe Limited has reappointed former directors to revive the operations of the entity after closing some branches.\nIn a notice, the retail entity revealed that the current executives of Mr Maxen Karombo who was the chief executive officer, chief financial officer Phillimon Mushosho and Supply Chain director Mr Knox Mupaya have stepped down from their duties.\nThe long serving executive, Mr Willard Zireva has bounced back as the chief executive officer, Mr Alex Siyavora is taking over as chief finance officer and Mr Muzvidzwa Richard Chingaira as Supply Chain director.\nThe three have been tasked with steering the group’s turnaround for the next six months as the board looks for permanent replacements.\nThe retail firm revealed that the former executives will be implementing a restructuring plan to steer the listed firm back to its glory days.",
            "time": "08:41",
            "date": "27 Feb 2025"
        }
    ]
}