{
    "news": [
        {
            "title": "Foreign Tech giants express interest in Zim’s ICT sector",
            "href": "https://www.zbcnews.co.zw/foreign-tech-giants-express-interest-in-zims-ict-sector/",
            "content": "Story by Owen Mandovha, Business Reporter\nTWO international technology firms have expressed interest in investing in Zimbabwe’s Information and Communication Technology (ICT) sector, a move set to accelerate the country’s transition towards a digital economy by 2030.\nA delegation from Finish tech giant Nokia led by the vice president, of Mobile Networks, Mikko Levante was the first to meet ICT, Postal and Courier Services Minister Honourable Tatenda Mavetera in Harare this Friday and was later followed by a team from Pakistan’s major telecoms firm headed by its Chief Executive Officer, Mr Muhamad Faisal Khan.\nBoth teams expressed huge interest in investing in Zimbabwe’s ICT sector which dovetails with the government’s quest to create a highly digitised society and economy.\n“We are interested in investing in Zimbabwe’s sector of ICT as it represents huge opportunities for us by matching our expansion profile,” Mikko Levante said\nThe Pakistani delegation revealed that Zimbabwe presents vast opportunities for their company.\n“Teresol is looking to partner with local companies in the ICT sector and our research has shown that there are a lot of opportunities that exist on the local market and we are glad to have met the Minister who welcomed us to scout for opportunities,” Mr Khan said.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zimbabwe’s mining industry draws interest as Sweden sees strong growth potential",
            "href": "https://www.zbcnews.co.zw/zimbabwes-mining-industry-draws-interest-as-sweden-sees-strong-growth-potential/",
            "content": "Story by Stanley James, Business Editor\nSWEDEN-based firms have expressed interest in setting up mining projects in Zimbabwe driven by vast opportunities and favourable incentives offered by the Second Republic.\nThe Swedish – Zimbabwean Sustainability in Mining Expo held in Harare this Friday saw companies from the European Union trading bloc expressing keen interest in Zimbabwe’s industry.\n“The Swedish delegation is in Zimbabwe and its mission is to look at the prospects of mining in Zimbabwe,” Sweden’s Ministry of Foreign Affairs, Director General, Ms Camilla Mellander said.\n“This Thursday I visited Zimplats and observed that over 60 % of machinery in use there is from Sweden. Our country has all that it takes in terms of mining equipment implying the existing cooperation will also positively affect Zimbabwe. The key issue is how sustainable mining practices are vital to the growth of Zimbabwe’s mining sector in the short to long term.\n“The main issue is how Sweden can take a cue from the mining boom in Zimbabwe, remember our country is entirely dominated by mining projects an element that becomes crucial in terms of creating synergies with Zimbabwe in the mining value chains,”\nZimbabwe is committed to further collaborating with Sweden in mining projects.\n“We are really excited to have the presence of this delegation in Zimbabwe, it’s a true reflection of what we are doing as government in facilitating increased inflows of external projects, it is also a reflection of how the ties between Zimbabwe and Sweden are being reinforced so there are here to further scout more opportunities in the resource extraction sector which is riding on massive growth credit to several interventions by the Government,” Zimbabwe’s Ambassador to Sweden, the Nordics and Baltics, Priscilla Misihairabwi said.\n“Zimbabwe possess a wealth of mineral resources and the mining industry is expected to play a vital role towards the attainment of vision 2030. However we recognise the importance of balancing economic growth with environmental mining best practices so their presence is very vital in further enhancing the existing ties and focus on long term deliverables,” the Minister of Mines and Mining Development, Honourable Winston Chitando said.\nThe Swedish- Zimbabwean Sustainability in Mining Expo is aimed at showcasing Swedish technologies and innovations that can be used to promote sustainable mining practices in Zimbabwe.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Industry players hail govt’s industrialisation policies",
            "href": "https://www.zbcnews.co.zw/industry-players-hail-govts-industrialisation-policies/",
            "content": "Story by Yolanda Moyo\nINDUSTRY has hailed government policies aimed at improving the ease of doing business, saying they are yielding positive results for Zimbabwe’s manufacturing sector.\nThe Parliamentary Portfolio Committee on Industry and Commerce, which is touring several industry players across the country, was in Bulawayo this Thursday where it engaged a cooking oil-producing firm, United Refineries Limited (URL).\nAmong the government policies welcomed by industry are currency stabilisation strategies and the Targeted Finance Facility (TFF), designed to provide affordable capital to manufacturers.\n“We are seeing a certain level of stability and the disparity between the formal and informal rates converging together which is allowing better conversion through the willing buyer willing seller.\n“We are looking forward to the stability continuing and we look forward to everything that comes to play with a stable environment,” URL’s general manager Mr Benjamin Blatche said.\nThe Parliamentary Portfolio Committee’s visit underscores the government’s commitment to supporting the manufacturing sector, which is seen as crucial for economic growth and job creation.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zim unveils strategic roadmap for Expo 2025 Osaka",
            "href": "https://www.zbcnews.co.zw/zim-unveils-strategic-roadmap-for-expo-2025-osaka/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE government has outlined its strategic roadmap to maximise opportunities at Expo 2025 Osaka, which commences in less than a month in Japan.\nOn Thursday, the Japanese Embassy in Harare hosted government officials and private sector representatives to highlight the significance of Zimbabwe’s participation in the global event.\n“Expo 2025 Osaka is an ideal platform to harness trade relations and cooperation between Japan and Zimbabwe and we are looking forward to host Zimbabwe’s government and the private sector to ensure that it leverages on this opportunity to advance its economic and diplomatic objectives,” Japanese Ambassador to Zimbabwe, His Excellency Shinichi Yamanaka said.\nThe government officials who participated in the session said there are several opportunities at the Expo where Zimbabwe will showcase its rich cultural heritage and renowned tourist attractions.\n“The Expo is set to have a huge impact on the local tourism industry which has registered tremendous growth and the pavilion provides an opportunity to showcase Zimbabwe as a destination in terms of tourism offerings and heritage. Victoria Falls and Great Zimbabwe are two sites that excite tourists from Japan,” the Minister of Tourism and Hospitality Industry, Honourable Barbra Rwodzi said.\n“We have set our sights on ensuring that as the Osaka 2025 Expo comes to an end, Zimbabwe will have managed to harvest a lot of trade and investment deals as our economic diplomacy policy thrust continues to bear fruit,” Deputy Minister of Foreign Affairs and International Trade Honourable Sheila Chikomo added.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Ethiopia and Zimbabwe enhance economic cooperation with strategic partnership",
            "href": "https://www.zbcnews.co.zw/ethiopia-and-zimbabwe-enhance-economic-cooperation-with-strategic-partnership/",
            "content": "ETHIOPIA and Zimbabwe have reinforced their commitment to economic collaboration, with a high-level meeting between Ethiopia’s Minister of Finance, Ahmed Shide, and Zimbabwe’s Minister of Finance, Economic Development, Professor M. Ncube.\nThe discussions, held in Addis Ababa, focused on knowledge-sharing and strategic partnerships to bolster economic resilience and sustainable development in both nations.\nTo formalise this collaboration, Ethiopia and Zimbabwe agreed to establish technical working groups that will oversee ongoing knowledge-sharing in these key sectors.\n\nZimbabwe expressed interest in Ethiopia’s economic policies, particularly in tax reform, social protection initiatives, and value chain development within the leather and agro-processing industries.",
            "time": "06:35",
            "date": "24 Mar 2025"
        }
    ]
}