{
    "news": [
        {
            "title": "From exclusion to empowerment, how Zim’s banking sector has evolved",
            "href": "https://www.zbcnews.co.zw/from-exclusion-to-empowerment-how-zims-banking-sector-has-evolved/",
            "content": "Story by Stanley James, Business Editor\nAS Zimbabwe celebrates 45 years of independence on April 18, the country’s banking sector has recorded huge milestones driven by a robust financial system dominated by domestic-owned banks.\nBefore independence, the banking system was mainly tailor-made for the white minority in terms of the provision of loans and access to services.\nIt was dominated mainly by two multinational banks whose terms and conditions only suited the white minority.\nHowever, government interventions since 1980 are yielding results as evidenced by the rise in bank account holders across the country, digital financial services, and dominance of domestic-owned banks, financial inclusion and a roadmap to reduce bank charges while offering better returns to savings.\n“The banking sector has also played a pivotal role in the overall growth of the economy, such a trend is evidenced by the rise in overall statistics in terms of the number of people accessing financial services across the country to the extent that going forward, the need to spruce up the image of the sector becomes of greater importance. As a result of the key milestones, Zimbabwe’s banking sector is now focusing on facilitating affordable bank charges, offering loans at concessionary rates including more loans to the productive sectors,” Economist, Dr Zack Murerwa said.\nAnother key highlight of the huge strides in Zimbabwe’s banking sector is that there has not been any bank failure or collapsed bank in the past 10 years.\n“The course to growth is on track and this is manifested by the continuous growth in the number of banking services and also more investments so in the outlook it is all about tapping into viable strategies to consolidate growth and enhance the sector’s ability to extend more loans,” Bankers Association of Zimbabwe president, Mr Lawrence Nyazema said.\nIn line with the Government’s aspirations of leaving no one and no place behind, authorities are focusing on measures to widen access to banking services by the youths, women and marginalised communities.\nThrough these initiatives, AFC Financial Holdings was unbundled and rebranded in 2019 into four separate business units to strategically support the country’s agriculture sector which has been identified as a backbone of the country’s economic development.\nThe Leasing unit has provided the majority of small-scale farmers with the much-needed implements such as tractors and combine harvesters at affordable rates while the main commercial bank has availed agricultural funding which had been lacking under the previous structure, with the aim of making Zimbabwe self-sufficient in food security since the country attained independence.",
            "time": "20:37",
            "date": "08 Apr 2025"
        },
        {
            "title": "Zimbabwe’s airports register 19% growth in passenger traffic",
            "href": "https://www.zbcnews.co.zw/zimbabwes-airports-register-19-growth-in-passenger-traffic/",
            "content": "\nStory by Stanley James, Business Editor\nZIMBABWE’S airports recorded a 19 % surge in passenger traffic flows last year driven by the government’s upgrading and refurbishment of the ports of entry.\nData from the Civil Aviation Authority of Zimbabwe (CAAZ) released to the ZBC News this Tuesday shows that air passenger volumes rose to over two million last year from around 1.9 million in 2023.\nThe data, which is showing a promising outlook for Zimbabwe’s aviation sector shows an over five percent growth in air traffic movements compared to 2023.\nAs a result of increased trade, the country’s airports also experienced growth in terms of cargo volumes to over 17 tonnes compared to around 15 tonnes in 2023, with more volumes being recorded in the last quarter.\nThe international and domestic airports in Zimbabwe also witnessed huge milestones driven by the influx of new airlines, new routes and increased flights.\nEconomists contend that Zimbabwe’s airport upgrades and development strategies are yielding the intended goals of attracting increased business and traffic flows.\n“There is that appetite for the airlines to come and operate in the country, this is mainly arising from the fact that the government did actually set its priorities right by focusing on the expansion of the industry, such a development has therefore positively propelled the traffic flows. It is also prudent to note that going forward, the surge in air traffic passenger flows will have multiplier effects in terms of increasing investments and also creating more opportunities for growth in the short to long term,” Development Economist, Dr Prosper Chitambara said.\n“What is needed is that element towards the continuous upgrading of the airports in line with the global standards, to further accelerate growth and ensure the current gains continue for the benefit of the nation. Remember Zimbabwe is now a global village meaning that the local airports should meet the needs of the global market thereby sustaining growth and consolidating the current gains,” a University of Zimbabwe Business Studies Lecturer, Dr Nyasha Kaseke said.",
            "time": "20:38",
            "date": "08 Apr 2025"
        },
        {
            "title": "President Daniel Chapo of Mozambique to officially open 2025 ZITF",
            "href": "https://www.zbcnews.co.zw/president-daniel-chapo-of-mozambique-to-officially-open-2025-zitf/",
            "content": "Story by Owen Mandovha\nMOZAMBICAN President, His Excellency Daniel Chapo, is expected to open this year’s edition of the Zimbabwe International Trade Fair, which will also be extended to six days.\nPresident Chapo, who was sworn in in January this year, is expected to make his first official state visit to Zimbabwe as President at the trade fair, which is attracting a lot of interest from both local and international business players.\nThe Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere confirmed the development during this Tuesday’s post-cabinet media briefing in Harare.\n“The President of the Republic of Mozambique, His Excellency Daniel Chapo will officially open the 65th Edition of ZITF on April 25, 2025. In terms of the current space booking situation, 95% has been booked to date, compared to 87% booked during the same period in 2024. International exhibitor space uptake has increased, with 29 countries having registered,” he said.\nIn a major breakthrough in connecting rural communities countrywide, the Presidential Internet Scheme will come into effect in June, targeting various public institutions across the country.\n“This initiative will employ advanced Low Earth Orbit satellite technology and fibre optic infrastructure to ensure comprehensive coverage and accessibility. These will cover schools, Community Information Centres, Zimbabwe Republic Police Stations, Health Institutions, Traditional Leaders’ homesteads, Agriculture Extension Offices, Courts, District Development Coordinators’ offices, Vocational Training Centres and Growth Points in the wards,” Dr Muswere noted.",
            "time": "20:38",
            "date": "08 Apr 2025"
        },
        {
            "title": "Hyatt Regency owner set to deepen Zim hospitality portfolio",
            "href": "https://www.zbcnews.co.zw/hyatt-regency-owner-set-to-deepen-zim-hospitality-portfolio/",
            "content": "Story by Stanley James, Business Editor\nUNITED Arab Emirates (UAE)-based Albwardy Investments, the owner of Hyatt Regency Meikles Hotel, is looking to increase its investment in Zimbabwe’s hospitality industry.\nAlmost a year after acquiring the iconic Meikles Hotel under the Hyatt Regency brand, the multinational firm has identified viable opportunities for further growth in Zimbabwe.\nA recent tour of the refurbished facilities at the hotel highlighted Albwardy Investments’ commitment to supporting the government’s goal of expanding national hotel room availability from over 6 000 to 20 000 in the next five years.\n“As we take stock of what has happened since last year, the investor is actually willing to further scale up investment portfolios in Zimbabwe’s tourism industry riding on the growth trajectory and milestones in terms of the refurbishments that have been done. Given the capital outlay of the project, there is a greater scope of expanding projects in the overall tourism sector,” Hyatt Regency General Manager, Mr Tinashe Munjoma said.\nIncreased global investor interest is expected to facilitate Zimbabwe’s tourism industry growth.\n“A lot is being made in terms of commitment by local and external investors in taking the current challenges into opportunities by injecting more funds thereby unlocking value for the shareholders. The massive investments that you are seeing are a testimony of long-term commitments to continue operating in Zimbabwe while ensuring that the nation benefits,” Tourism Consultant, Mr Stan Higgins said.",
            "time": "20:38",
            "date": "08 Apr 2025"
        },
        {
            "title": "Zim’s tariff suspension signals commitment to economic diplomacy",
            "href": "https://www.zbcnews.co.zw/zims-tariff-suspension-signals-commitment-to-economic-diplomacy/",
            "content": "\nStory by Stanley James, Business Editor\nZIMBABWE’s reengagement and engagement drive is being solidified as the government forges ahead with its economic diplomacy thrust towards restoring normal ties with all global economies.\nThis is further reflected by the latest move by President Emmerson Mnangagwa in announcing that the government will soon suspend all tariffs on goods from the World’s biggest economy, the United States of America (USA).\nWhile a global economic journal defines a tariff as a duty or tax levied by the government on goods entering or leaving the country’s borders, it is the spirit of the Second Republic of enhancing bilateral economic cooperation that has led to the latest decision.\nDespite the latest move by authorities being made after the US administration imposed an 18 percent tariff hike on Zimbabwean exports to the US, the government of Zimbabwe is taking a different approach as President Mnangagwa commits to bolstering relations with President Donald Trump’s administration.\nTo Zimbabwe the decision of suspending tariffs on goods from the USA has influenced by the need to facilitate the expansion of American imports within the economy while at the same time promoting exports of local goods to the USA.\nWith official data from the Zimbabwe National Statistics Agency, showing that the USA trade deficit with Zimbabwe was over US$24 million in 2024 with imports pegged at more than US$67 million, outstripping exports at over US$43 million, the need for the two economies to scale up trade is of great importance.\nTherefore, the proposed suspension of tariffs on goods from the USA is actually setting the tone of serious commitment by Zimbabwe to build positive economic ties with President Donald Trump’s administration.\nIt also reflects the government of Zimbabwe’s interest in doing more business with the world’s biggest economy.\nIn the past few months, several business delegations have visited Zimbabwe with a view of setting up projects in the mining, agriculture, manufacturing, retail, financial services, and construction among others.\nWith the government of Zimbabwe committing to forego potential revenue by suspending the tariffs, the move resonates with the intention of welcoming prospective investors from the US to invest in Zimbabwe.\nZimbabwe’s sincerity to engage with the US is also shaping future relations riding on the diplomacy which has seen the country mending ties with several European Union economies in the past few years.\nWith Zimbabwe’s main exports to the US comprising tobacco, minerals and textiles, it is the spirit of enhanced cooperation that has seen the government further committing to allowing goods from the US market duty free.\nThis comes on the backdrop of yearly volumes of export receipts surging to more than seven billion in 2024 from a baseline averaging US$3 billion a few years ago.\nZimbabwe is therefore riding on the fruits of economic diplomacy, with the need to embrace the US in the global trading arena being of paramount importance.\nAlthough Zimbabwe does not benefit from the African Growth Opportunities Act (AGOA), a USA trade pact that provides preferential access to the US markets for eligible Sub- Saharan Africa economies, attempts to mend economic ties with the US are for the good of Zimbabwean industry and commerce.\nAs Zimbabwe’s imports are now skewed in favour of raw materials and machinery, the suspension of tariffs on goods from the US markets will positively affect local firms in terms of cheaper costs of strategic components for production.",
            "time": "20:38",
            "date": "08 Apr 2025"
        }
    ]
}