{
    "news": [
        {
            "title": "Zimbabwe urged to capitalise on Osaka Expo 2025",
            "href": "https://www.zbcnews.co.zw/zimbabwe-urged-to-capitalise-on-osaka-expo-2025/",
            "content": "Story by Owen Mandovha, Business Reporter\nJapanese Ambassador to Zimbabwe His Excellency Shimichi Yamanaka says the Osaka 2025 Expo provides a perfect opportunity for government to attract more investments and highlight strides made in creating a low-risk investment destination.\nHe said this when he paid a courtesy call on President of the Senate, Senator Marbel Chinomona, at the New Parliament in Mt Hampden this Tuesday, where discussions centered on measures to harness trade ties between the two countries, including participation at the upcoming Osaka Expo 2025.\n“We held fruitful discussions with the President of the Senate and looked at ways of creating strong trade ties between Zimbabwe and Japan. The two countries share a long history and this is an opportune time to elevate such a partnership,” said Ambassador Yamanaka.",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Gold production soars",
            "href": "https://www.zbcnews.co.zw/gold-production-soars/",
            "content": "Stanley James, Business Editor\nZimbabwe’s gold mining sector target of 40 tonnes by the end of the year is on track after deliveries to the sole buyer and exporter, Fidelity Gold Refinery (FGR) rose by over 30% in January.\nThe country’s gold mining industry has defied the effects of the rainfall season as data released by FGR reveals a surge in deliveries from over 1,8 tonnes in January  2024 to over three tonnes during the same month this year.\nArtisanal and small scale miners contributed over 70% of the deliveries, with the large scale corporates accounting for 30%.\nMines and Mining Development Minister Honourable Winston Chitando says the gold mining sector has started the year on a good note.\n“This is quite impressive considering the fact that during the rainy season, the sector always experience challenges in overall production volumes, but the current trend has raised hopes that the Gold mining sector is on course to achieve the intended goals, as the Government we remain committed to ensure that all the Miners operate under favourable environments for the benefit of the nation,” he said.",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "ARDA eyes increasing exports of agricultural produce in 2025",
            "href": "https://www.zbcnews.co.zw/arda-eyes-increasing-exports-of-agricultural-produce-in-2025/",
            "content": "Story by Josephine Mugiyo\nTHE Agricultural and Rural Development Authority (ARDA) has set sights on increasing its exports to 30% this year in addition to its mandate of producing 45% of the country’s strategic grain reserves.\nARDA currently runs over 400 irrigation schemes across the country and has 19 000 hectares under irrigation.\nMandated by government to produce at least 45% of the country’s grain reserve requirements, the entity has put in place a road map to ensure this is attainable.\nAs they work with the various irrigation schemes ensuring they are run as viable business units, ARDA Chief Executive Officer Mr Tinotenda Mhiko says this year’s focus is also on increasing production of export crops to 30% from the current 12% at its several irrigation schemes dotted countrywide.\n“We are working with parastatals like ZIMTRADE, for marketing and production of our crops, at least 30 % of our production we intend to do it from export crops to generate the much needed foreign currency,” said Mr Mhiko.\nMr Mhiko also noted that the institution is working to ensure value addition and this has been exhibited at plants like the ARDA run BEST Food Processing Plant in Norton which processes various fruits into paste.\n“Then value addition and beneficiation. Late last year we operationalised and retooled best food processors. It produces 100 tonnes of tomatoes per day. We have gone further to guarantee a market for the villagers thus impacting GDP at village level, to produce for this processing factor,” he added.\nA visit to the BEST Fruit Processing Plant revealed that the entity is ramping up production of tomato paste this season. The produce is collected from communal farmers.",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "RBZ clamps down on cash deposit boxes",
            "href": "https://www.zbcnews.co.zw/rbz-clamps-down-on-cash-deposit-boxes/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE Reserve Bank of Zimbabwe (RBZ) has revealed that millions of dollars are lying idle in the country due to a growing trend by business of keeping money in cash deposit boxes, saying the practice deprives the economy of the much-needed liquidity.\nAnnouncing his 2025 Monetary Policy Statement, RBZ Governor Dr John Mushayavanhu indicated this financial disintermediation which is stifling economic growth by depriving economic agents of the much-needed liquidity.\nHe said the Financial Intelligence Unit of the Reserve Bank of Zimbabwe will not simply watch but will deal with this malpractice.\n“There are manufacturers who are supplying goods to the informal market but are not banking their proceeds. They are keeping these monies in their cash boxes which is not in line with the Anti Money Laundering Act. The FIU will not just watch and will dismantle this practice,” he said.",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Fruit Logistica participation a success – Zimtrade",
            "href": "https://www.zbcnews.co.zw/fruit-logistica-participation-a-success-zimtrade/",
            "content": "Story by Bruce Chahwanda\nLOCAL trade promotion body, ZimTrade, says the participation of local firms at the just-ended 2025 Fruit Logistica in Germany has been a success, with new orders having been clinched, generating business worth over US$20 million.\nThey were three days of hard work with various meetings scheduled for the 30 local firms that were participating at this year’s Fruit Logistica, while others had impromptu engagements with a view to secure new markets and expand horticultural orders across the globe.\nAs the premier horticultural exhibition concludes, local companies are satisfied with their order books, pledging to double their effort to ensure they meet market demands.\nZimTrade Director Operations Mr Similo Nkala said the exhibition was a success.\n“It has been a very successful mission at Fruit Logistica 2025. We have received a lot of inquiries from countries like Germany, the United Kingdom, the Netherlands, and the rest of Europe. The key thing for us is that this will go a long way in increasing our exports which generated US$142 million in 2023,” he said.\nBusiness generated at this year’s exhibition is in line with targets in the Horticultural Recovery and Growth Plan which seeks to increase horticulture exports to US$300 million by 2030.",
            "time": "06:28",
            "date": "12 Feb 2025"
        }
    ]
}