{
    "news": [
        {
            "title": "Tax relief packages for manufacturing sector operationalised",
            "href": "https://www.zbcnews.co.zw/tax-relief-packages-for-manufacturing-sector-operationalised/",
            "content": "Story by Stanley James, Business Editor\nAs Zimbabwe seeks to facilitate the growth of companies in line with Vision 2030 aspirations, Treasury this Wednesday toured a local manufacturing firm in Harare to assess production trends, identify challenges and focus on viability.\nIt emerged during the tour that companies in the manufacturing sector have started benefitting from tax relief packages announced in the 2025 national budget.\n“As statistics show that capacity for the manufacturing industry is averaging 52% from a baseline of around 37% in 2018, investments in new equipment and machinery is cited as the key drivers for growth, therefore the tax relief packages will offer reduced costs and enable the industry to grow,” said ProPlastics chief executive officer, Mr Kuda Chigiya.\n\n\nTreasury explained the importance of the tax relief packages.",
            "time": "06:37",
            "date": "01 Feb 2025"
        },
        {
            "title": "ZimTrade takes 30 firms to 2025 Fruit Logistica",
            "href": "https://www.zbcnews.co.zw/zimtrade-takes-30-firms-to-2025-fruit-logistica/",
            "content": "Story by Bruce Chahwanda, Political Editor\nZIMBABWE is targeting to generate at least US$20 million worth of business during the global horticultural fair, Fruit Logistica, which gets underway next week in Berlin, Germany.\nThe national trade and promotion agency, Zimtrade, is strengthening its export offensive for local horticultural products on the global market, as it leads 30 firms to this year’s premier horticultural exhibition.\n“As Zimbabwe, we are facilitating the participation of 10 Zimbabwean companies at Fruit Logistica 2025 Usi zimtwe duwa facilitating the participation of 10 Zimbabwean companies at Fruit Logistica 2025 which is running from 5 to 7 February,” ZimTrade’s director for operations, Mr Similo Nkala.\n“In addition to that, we have about 20 more companies that are also participating in this trade fair as visitors where they would be engaged in back-to-back meetings in terms of engaging their existing and potential buyers of their products. We will be exhibiting quite a wide range of products, which include manchur peas, sugar snaps, citrus, blueberries, strawberries, and other products that we are producing in Zimbabwe,” he said.\nMr Nkala disclosed that Zimbabwe is benefiting immensely from participating at the Fruit Logistica.\n“I think the key thing for our participation at this trade fair in terms of business generated in 2024 was about US$17 million. For 2025, we are looking forward to generating business, which is plus US$20 million. I think the key focus for our participation at this trade fair, besides issues to do with fresh produce, we are also looking to learn in terms of the current innovations that are related to this industry.\n“There will also be a number of side business forums that have to do with logistics and also other latest key issues in terms of the industry, like in terms of extending the shelf life of our products,” he said.\nThe Fruit Logistica is a platform for business executives to create viable synergies that can be translated into tangible business ventures.\nNew technologies for harvesting and preserving fresh produce will also be on exhibition.\nZimbabwe is targeting to leverage the platform to push blue-berries, one of the popular Horticultural products in Europe.",
            "time": "06:37",
            "date": "01 Feb 2025"
        },
        {
            "title": "India investments in Zimbabwe exceed US$600 Million",
            "href": "https://www.zbcnews.co.zw/india-investments-in-zimbabwe-exceed-us600-million/",
            "content": "Story by Oleen Ndori\nZimbabwe is expanding ties with India amid revelations that investments in the private sector exceed US$600 million, reflecting the success of the Zimbabwe is Open For Business mantra.\nWith over 25 Indian firms operating in Zimbabwe, ties between Harare and New Dehli that began before independence have grown over the years.\nMarking this year’s India Day, the country’s Ambassador to Zimbabwe, His Excellency Bramha Kumar celebrated the ties, saying Zimbabwe is a valued partner.\n“Indian investment from the private sector is reaching new heights, and it is estimated to be worth US$600 million. They directly provide employment to some 5 000 people and indirect employment to roughly 10 000 people. Numbers of Indian companies and professionals are also on the rise. There are already some expansion projects of this private sector investment, one of which was recently officiated by his Excellency President Mnangagwa last month.  I am confident that the Indian business sector will be an important contributor in restructuring of Zimbabwe’s economy. Zimbabwe has been India’s valued partner in issues of mutual concern at various international fora, including the United Nations. Our two countries have been strong supporters of the South-South cooperation framework. Zimbabwe has joined the International Solar Alliance,” he said.The Deputy Minister for Foreign Affairs and International Trade, Honourable Sheilla Chikomo said the growth of economic ties between the two countries is encouraging.",
            "time": "06:37",
            "date": "01 Feb 2025"
        },
        {
            "title": "VFEX posts significant growth in 2024",
            "href": "https://www.zbcnews.co.zw/vfex-posts-significant-growth-in-2024/",
            "content": "Story by Tichaona Kurewa\nTHE Victoria Falls Stock Exchange (VFEX) recorded significant growth last year after surpassing its performance targets in 2023.\nKey indicators released by the VFEX demonstrate a surge in trading activity and market capitalisation, signaling a positive trajectory for the young exchange.\nTotal market turnover skyrocketed by a remarkable 117%, climbing from US$26.3 million in 2023 to US$57 million in 2024.\nThe market capitalisation also experienced a substantial increase of six percent, reaching US$1.3 billion last year compared to 1.2 billion United States dollars in 2023.\nIncreased trading activity was also noted during the year under review with the number of trades executed on the VFEX surging by 31% in 2024, up from 796 in 2023, indicating a significant rise in investor participation.\nBusiness consultant, Dr Farai Musamba, indicates that the VFEX has performed beyond expectation.",
            "time": "06:37",
            "date": "01 Feb 2025"
        },
        {
            "title": "Zim targets more foreign investment",
            "href": "https://www.zbcnews.co.zw/zim-targets-more-foreign-investment-capital/",
            "content": "Story by Owen Mandovha, Business Reporter\nZimbabwe stands ready to cushion its economy against emerging global geopolitical risks and seeks to continue attracting foreign investment capital to develop its economy.\nThis was said by the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, who attended the just-concluded World Economic Forum Annual Meetings in Davos, Switzerland this week.\nA future associated with rising geopolitical tensions, raging wars and worsening climate change crisis is what the government of Zimbabwe has to contend with going forward, which calls for appropriate interventions to maintain stability.\nHowever, Professor Ncube says there are numerous pockets of investment opportunities available for Zimbabwe to take advantage of regardless of the mounting global headwinds.\nHe said, “The World Economic Forum was indeed an eye opener for us. Risks that we need to be on the lookout are climate change, wars and tensions that have the impact on global economy. As a country, we have to prepare ourselves for this new normal so as to achieve our economic aspiration.”",
            "time": "06:37",
            "date": "01 Feb 2025"
        }
    ]
}