{
    "news": [
        {
            "title": "Zim targets more foreign investment",
            "href": "https://www.zbcnews.co.zw/zim-targets-more-foreign-investment-capital/",
            "content": "Story by Owen Mandovha, Business Reporter\nZimbabwe stands ready to cushion its economy against emerging global geopolitical risks and seeks to continue attracting foreign investment capital to develop its economy.\nThis was said by the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, who attended the just-concluded World Economic Forum Annual Meetings in Davos, Switzerland this week.\nA future associated with rising geopolitical tensions, raging wars and worsening climate change crisis is what the government of Zimbabwe has to contend with going forward, which calls for appropriate interventions to maintain stability.\nHowever, Professor Ncube says there are numerous pockets of investment opportunities available for Zimbabwe to take advantage of regardless of the mounting global headwinds.\nHe said, “The World Economic Forum was indeed an eye opener for us. Risks that we need to be on the lookout are climate change, wars and tensions that have the impact on global economy. As a country, we have to prepare ourselves for this new normal so as to achieve our economic aspiration.”",
            "time": "08:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Multimillion-dollar mining industrial park to spur economic growth",
            "href": "https://www.zbcnews.co.zw/multimillion-dollar-mining-industrial-park-to-spur-economic-growth/",
            "content": "Story by Owen Mandovha\nTHE Government continues to unlock the mining sector’s potential to spearhead the attainment of Vision 2030, with the commissioning of a giant multi-million-dollar Mining Industrial Park set for next month.\nThe country is now earning record foreign currency inflows, riding on a remarkable transformation and growth of the mining industry over the past five years.\nThe reopening of closed mines and the establishment of new ones has sustained this trajectory towards meeting an upper middle-income economy by 2030.\nIn his guest lecture at the Zimbabwe National Defence University (ZNDU), Mines and Mining Development Minister Honourable Winston Chitando revealed that another multimillion-dollar mining venture to be commissioned within the next few weeks will spur economic growth through job creation and industrialisation.\n“The mining industrial park in Beitbridge which will be commissioned by President Emmerson Mnangagwa will produce electricity from coal mined at River Ranch. This project will not only grow the gross domestic product of Matebeleland South province,” Minister Chitando said.",
            "time": "08:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Export-led industrialisation drive gets private sector backing",
            "href": "https://www.zbcnews.co.zw/export-led-industrialisation-drive-gets-private-sector-backing/",
            "content": "Story by Stanley James, Business Editor\nTHE private sector has pledged to support an export-led industrialisation drive to enable local companies to increase regional and global exports.\nThe sector held discussions on Wednesday to unpack and assess the current trade agreements for Zimbabwe’s bilateral and multilateral partners.\nWith Zimbabwe chairing the SADC region, the focus is on increasing exports and expanding the local industrial capacity.\n“Zimbabwe is chairing the SADC region and this presents an opportunity for the nation to further tap into profitable markets and raise awareness on possible opportunities within the region, including how the entire economy can tap into increased productivity based,” industrialist Mr Lesley Marange said.\nThe unpacking of the trade agreements is also aimed at helping the industry access viable and strategic markets.\n“CZI is therefore engaging its stakeholders and unpacking the current trade agreements, participants are of the view that the sustainability of such arrangements will depend on the commitment by firms to broaden markets and expand their production based,” British Embassyhead of trade and investment Mr Stuart Oxenford stated.",
            "time": "08:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Professor Mthuli Ncube presents local investment opportunities at the World Economic Forum",
            "href": "https://www.zbcnews.co.zw/professor-mthuli-ncube-presents-local-investment-opportunities-at-the-world-economic-forum/",
            "content": "Story by Owen Mandovha\nThe 2025 edition of the World Economic Forum Annual Meetings started in Davos, Switzerland this Monday with Zimbabwe participating at the global event to attract foreign capital into the country.\nThe event running under the theme: ‘Collaboration for the Intelligent Age,’ started this Monday in Switzerland.\nZimbabwe’s Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube is heading Zimbabwe’s delegation at these annual meetings; seeking to leverage on one of the thematic priorities dubbed: ‘Industries under the intelligent age.’",
            "time": "08:37",
            "date": "26 Jan 2025"
        },
        {
            "title": "Revenue collection surpasses targets",
            "href": "https://www.zbcnews.co.zw/revenue-collection-surpasses-targets/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe’s developmental agenda has received a major boost in the wake of revelations that authorities will collect over US$7 billion in revenue this year after surpassing 2024 targets.\nGiving an update on revenue collections for the just ended year, Zimbabwe Revenue Authority (ZIMRA) Commissioner General Ms Regina Chinamasa disclosed that the institution surpassed its targets after collecting over US$6 billion.\nShe revealed that in line with facilitating increased funding for government projects, the public entity has this year set a target of over US$7 billion.\nValue Added Tax, corporate tax, custom duties, Pay As You Earn and mining royalties are some of the tax heads that are expected to generate revenue to sustain capital projects and employment costs for the state.\n“Zimbabwe has what it takes in terms of resource mobilisation and revenue generation as the authority that is mandated with the duty to raise money on behalf the state. We have also seen it necessary to forge ahead with using all the relevant instruments to collect more revenues. Going ahead, the focus is also working with the tax payers to generate more money,” Ms Chinamasa.\nThe anticipated revenue collection systems are also expected to help in Zimbabwe’s domestic resource mobilisation drive as statistics indicate that development partner support remains subdued despite accounting for at least 20% of the national budget.",
            "time": "08:37",
            "date": "26 Jan 2025"
        }
    ]
}