{
    "news": [
        {
            "title": "Business backs new industrial development policy",
            "href": "https://www.zbcnews.co.zw/business-backs-new-industrial-development-policy/",
            "content": "Story by Stanley James, Business Editor\nTHE business community has pledged support to the Zimbabwe National Industrial Development Policy whose consultative process is set to begin next week.\nConsultations for the new policy which runs from 2026 to 2030 are expected to begin in the next few weeks.\nIndustrialist Mr Mike Kamungeremu says the business community is committed to providing sound input for the policy.\n“Our company has already submitted the relevant paperwork and what is crucial is for firms to focus on relevant systems that facilitate the growth of industries,” he said.\nConfederation of Zimbabwe Industries Macro-economic Committee chairperson, Mr Jimmy Psillos believes long-lasting solutions to challenges facing industry should dominate the industrial development policy agenda.\n“The local industry is key in driving the industrial growth agenda at a time when we expect the growth development agenda to take centre stage in dealing with challenges affecting industries so it is all about workable measures to boost growth.”",
            "time": "09:27",
            "date": "16 Jan 2025"
        },
        {
            "title": "Zim eyes cooking oil self-sufficiency",
            "href": "https://www.zbcnews.co.zw/zim-eyes-cooking-oil-self-sufficiency/",
            "content": "\nStory by Stanley James, Business Editor\nZIMBABWE is targeting cooking oil self-sufficiency, driven by government interventions in increasing soya beans, sunflower and cotton seed production.\nA tour by government officials at two of Zimbabwe’s largest cooking oil manufacturing firms this Tuesday provided an opportunity for them to assess the state of the sector.\nIt emerged that Zimbabwe is moving towards cooking oil self-sufficiency riding on increased investments aided by the increase in soya bean, sunflower and cotton seed production.\nData released during the tour reveals the availability of locally produced cooking oil has increased from 20 percent in 2018 to over 80 percent last year.\n“The retail sector shelves ideally have what it takes in terms of telling the ideal picture of the situation. If there are so many cooking oil commodity products on the shelves that are being produced locally, then this reflects that the situation is just normal and there is more that is being done by the local producers to facilitate such growth.\n“Like any other business, there are challenges but we continue to wither the storm with the key focus being on what is needed to boost overall growth off course production is on a high trajectory but we have our constraints and such a platform gives us the ideal opportunity to see what we can do and chart the way forward basically I am convinced this will yield the intended goals,” the acting chief executive officer for Surface Wilmar and Olivine Industries, Mr Sylvester Dendere.",
            "time": "09:27",
            "date": "16 Jan 2025"
        },
        {
            "title": "Mat North poised for further transformation",
            "href": "https://www.zbcnews.co.zw/mat-north-poised-for-further-transformation/",
            "content": "Story by Tichaona Kurewa\nMatabeleland North province is set for significant growth this year, with several key projects nearing completion.\nThe Gwayi-Shangani Dam project is on track to achieve its target water catchment by the 2025-2026 rainfall season, pending the release of funding from Treasury.\nThe province also anticipates the opening of Lupane General Hospital, its largest referral hospital, with phased commissioning scheduled for the end of the year.\nAdditionally, the rehabilitation and construction of the Bulawayo-Victoria Falls Road is underway, with contractor Bitumen World currently repairing potholes. Full-scale reconstruction will commence after the end of the rainfall season.\n“We have solar plant projects that are nearing completion. We are pleased that His Excellency the President will commission these projects during the year. Many devolution projects, including schools and clinics are progressing well. We look forward to their completion with the support of devolution funds allocated to the province this year,” said Minister of State for Provincial Affairs & Devolution, Matabeleland North Province, Hon Richard Moyo.",
            "time": "09:27",
            "date": "16 Jan 2025"
        },
        {
            "title": "LPG prices fall 10% after VAT scrapping",
            "href": "https://www.zbcnews.co.zw/lpg-prices-fall-10-after-vat-scrapping/",
            "content": "Story by Stanley James, Business Editor\nZimbabwe’s Sustainable Energy Plan has received a boost after the government scrapped Value Added Tax (VAT) on Liquefied Petroleum Gas (LPG), translating to a 10 percent reduction in the price of the commodity.\nThe removal of VAT for gas that was effected on the 1st of January this year has resulted in the Zimbabwe Energy Regulatory Authority (ZERA) slashing prices of the commodity by about 10 percent.\nZERA’s Chief Executive Officer, Mr Eddington Mazambani revealed that the move will reduce energy costs for Industry and Commerce.\nHe said, “It is true that the gas prices have been slashed, this is in response to the removal of the Value Added Tax, so we have gazetted the relevant prices and we anticipate the trend to continue subject to market conditions. While this is for January, we anticipate the trend to continue intact all the value chains have been informed or notified of the developments and we expect them to comply.”",
            "time": "09:27",
            "date": "16 Jan 2025"
        },
        {
            "title": "Calls for policy intervention grow as smuggled goods flood market",
            "href": "https://www.zbcnews.co.zw/calls-for-policy-intervention-grow-as-smuggled-goods-flood-market/",
            "content": "Story by Owen Mandovha, Business Reporter\nPlayers in the wholesale and retail sector have called for policy interventions to address viability challenges at a time when the market has been flooded by smuggled goods and informal traders on their doorsteps.\nThe Second Republic has created an environment for business to thrive with various players including the informal sector running successful business ventures.\nThe gains are, however, being set back by a glut of smuggled goods which have found their way into the informal market at cheaper prices.\nKey proponents of the Buy Zimbabwe initiative are convinced there is need for policy and regulatory interventions.\n“The situation obtaining here is clear, you have got big manufacturers who are doing very well in the same environment that these retailers and wholesalers are operating. The problem here is that laws favour the informal sector because big businesses have to comply with a lot of policies that are difficult and distort their pricing framework. So it’s not an economic issue but an issue of how government should reform policies that allow these companies to thrive,” Buy Zimbabwe’s Executive Director Mr Munyaradzi Hwengwere said.\nConfederation of Zimbabwe Retailers’ president, Dr Denford Mutashu concurred adding that there is need to cushion the formal sector.\n“Retailers have to sell in both currencies which does not apply to the informal sector hence manufacturers end up preferring to sell directly to the informal sector who sell in foreign currency so this provides an untenable situation for the formal retailers.”",
            "time": "09:27",
            "date": "16 Jan 2025"
        }
    ]
}