{
    "news": [
        {
            "title": "2nd Republic’s fisheries programme transforms Hwange district",
            "href": "https://www.zbcnews.co.zw/2nd-republics-fisheries-programme-transforms-hwange-district/",
            "content": "Story by Mhlomuli Ncube\nZANU PF councillors in Hwange have managed to see a resolution passed in the opposition dominated local authority which will result in a US$150 000 fisheries programme being implemented for the benefit of the local community.\nThe people of Hwange say this will have a positive impact on their livelihoods.\nA beneficiary told the ZBC News, “We want to see programmes that impact on our lives. We are grateful to the Vision of our President who has planted such ideas around the country.”\nAnother stated, “This will not only give council revenues, it creates employment locally and the community benefits.”\n“We are happy whenever programmes that are of benefit are adopted in our area. This means more empowerment for local people,” added another beneficiary.\nThe councillors say the fisheries programme will serve as an important revenue generation stream.",
            "time": "08:34",
            "date": "20 Jan 2025"
        },
        {
            "title": "Fast food tax vital for domestic resource mobilisation",
            "href": "https://www.zbcnews.co.zw/fast-food-tax-vital-for-domestic-resource-mobilisation/",
            "content": "Story by Yolanda Moyo\nEconomists are expecting the introduction of the fast food tax to widen Treasury’s revenue inflows and facilitate funding for development projects.\nThe tax, which was effected this month, is levied per-unit basis for various fast-food items and aims to generate revenue for government while discouraging the consumption of unhealthy foods.\nWhile the tax has generated intense debate, economists believe it presents an opportunity to bolster domestic resource mobilisation and address critical national needs.\n“This tax provides a valuable new revenue stream for the government. These funds can be strategically utilized to address critical national priorities such as infrastructure development, healthcare, and education. This aligns with global trends that have been successful implemented in reducing consumption of fast foods,” said economist, Mr Stevenson Dlamini.\n“The proceeds from this tax can be used to strengthen primary healthcare, combat non-communicable diseases linked to unhealthy diets, and improve nutrition education programmes. This will not only improve public health outcomes, but also contribute to a more productive and healthier workforce. This will be crucial in research and development in the NDC field helping the nation in fight this scourge,” said economist Mr Malorn Gwadu.",
            "time": "08:34",
            "date": "20 Jan 2025"
        },
        {
            "title": "Local currency maintains four-month stable trend",
            "href": "https://www.zbcnews.co.zw/local-currency-maintains-four-month-stable-trend/",
            "content": "Story by Owen Mandovha\nMeasures implemented by the Reserve Bank of Zimbabwe (RBZ) have cooled off exchange rate volatility, providing stability to the ZiG currency over the past five months.\nAlmost four months after its introduction in April 2024, the ZiG was fast losing value as the yawning gap between the official rate of 13.56 to the greenback and the parallel market rate which was hovering between 40 and 50 to the United States dollar prompted monetary authorities to devalue the ZiG to 23.56.\nThis was followed by the upward review of the statutory reserve requirements among a host of other interventions to quell emerging inflationary pressures and exchange rate volatility.\nThe local currency has remained largely stable in the last quarter of the year 2024 as explained by financial economist Mr Batanai Matsika.\n“The liquidity management measures introduced by the central through a tight monetary policy stance speaks to the ongoing macroeconomic stability and it is essential to mention the interventions made by the RBZ to contain money supply growth which was a threat to the exchange rate stability. The ensuing liquidity crunch is also explained by this stance due to increased statutory reserve requirements though we can see a local currency that has largely remained stable for some time,” he said.",
            "time": "08:34",
            "date": "20 Jan 2025"
        },
        {
            "title": "New hotel for Shurugwi",
            "href": "https://www.zbcnews.co.zw/new-hotel-for-shurugwi/",
            "content": "Story by Tafara Chikumira\nThe mining town of Shurugwi has received a facelift after the commissioning of a new hotel which also functions as a tourism training school.\nThe latest development, which has transformed the Sebanga area just outside the town of Shurugwi, is in line with the national tourism growth plan spearheaded by the Zimbabwe Tourism Authority (ZTA).\nZTA Regional Manager, Mrs Linda Ntuli told the ZBC News, “We had a target of 1 025 rooms for 2025 and the inclusion of a new player takes our room stock to 1 089, meaning we are way above our target for 2025 and this is the beginning of the year. It is an exciting development for us in terms of new infrastructure, in terms of job creation and in terms of perception when it comes to Shurugwi as a destination.”\nThe Second Republic’s mantra: Zimbabwe is open for business was the driving force behind the proprietor’s desire to make a difference in society.Scenic Hotel Managing Director, Mr Moses Zuva said, “The President is very clear with his ‘Nyika Inovakwa Nevene Vayo’ mantra, which also prompted us to spring into action. If we look at this area it used to be a residential area, but we have decided to commercialise it. The community will start to enjoy some spin-off benefits from the traffic of people for the facility. We also have abundant of clean water where we are assisting the community in the process.”\nLeader of the Zion Christian Church, Bishop Nehemiah Mutendi, who also graced the official opening ceremony, urged investors to take advantage of the peace and tranquility obtaining in the country and come up with meaningful development for posterity.",
            "time": "08:34",
            "date": "20 Jan 2025"
        },
        {
            "title": "Public entities compliance to accountability surges",
            "href": "https://www.zbcnews.co.zw/public-entities-compliance-to-accountability-surges/",
            "content": "Story by Stanley James\nZimbabwe has recorded an over 70% increase in public entities compliance with accountability regulations for the benefit of economic planners.\nA Public Entities Corporate Governance Compliance Assessment Survey Report released to state-owned enterprises executives at a gender mainstreaming in Public Entities workshop in Harare this Thursday reflects that most of the utilities are holding Annual General Meetings, producing financial and strategic plans on time.\nExecutives of the public entities revealed commitment to accountability systems.“The focus is on accountability that is to say how are we coping up with the Governance structures as a public entity mandated to collect revenue in behalf of the Government it is imperative for us to therefore Institute prudent financial systems,” said ZIMRA commissioner-general, Ms Regina Chinamasa.\n“Gender inclusivity is also at the core focus of our business units as we seek to strike a balance between the operations and serving the interest of our shareholders so going forward we shall continue to embrace such an agenda,” said Airports Company of Zimbabwe chief executive officer, Mr Tawanda Gusha.",
            "time": "08:34",
            "date": "20 Jan 2025"
        }
    ]
}