{
    "news": [
        {
            "title": "Retail and residential projects dominate real estate sector investments",
            "href": "https://www.zbcnews.co.zw/retail-and-residential-projects-dominate-real-estate-sector-investments/",
            "content": "Story by Stanley James, Business Editor\nMore than US$500 million has been invested in Zimbabwe’s real estate projects since January, dominated by retail and residential properties.\nStakeholders in the real estate sector are meeting in Harare for their annual three-day indaba to review operations and focus on the outlook, with presentations showing increased capital expenditure by investors.\n“This is a sector that is used to hedge against macro-economic issues so interest continue on a positive trajectory and indeed, while there are challenges, this is however not hindering overall strides in the value chains,” said real estate consultant, Mr Kura Chihota.\nZimbabweans abroad are also investing in the real estate sector.\n“The diaspora market is forming the basis of unlocking more returns to the investors. It is the appetite by the Zimbabweans to invest back home that has seen a lot being done by the diaspora market in as far as making decisions to inject capital in fixed assets that guarantee long term benefits is concerned,” noted Homelux Properties Managing Director, Mr Justin Machibaya.",
            "time": "09:31",
            "date": "17 Dec 2024"
        },
        {
            "title": "President Mnangagwa opens iron and steel indaba",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-opens-iron-and-steel-indaba/",
            "content": "Story by Tafara Chikumira\nPresident Emmerson Mnangagwa has officially opened the inuagural Iron and Steel Indaba in Kwekwe this Thursday, with the need to resuscitate the industry and consolidate current gains taking centre stage.\nThe indaba comes at a time government has made significant progress in growing the iron and steel industry that had been hit by the illegal sanctions that saw the closure of ZISCO steel company in 2008.\nThe inception of the Second Republic has, however, witnessed some massive growth in the iron and steel sector, with the establishment of Dinson Iron and Steel Company putting the country on the world map in the steel production matrix.\nOfficially opening the Indaba, President Mnangagwa highlighted the strides made in revitalising the iron and steel industry.\nHe noted that the iron and steel sector is critical for the growth of the national economy.",
            "time": "09:31",
            "date": "17 Dec 2024"
        },
        {
            "title": "Entrepreneurship and innovation key to achieving Vision 2030 goals",
            "href": "https://www.zbcnews.co.zw/entrepreneurship-and-innovation-key-to-achieving-vision-2030-goals/",
            "content": "Story by Mercy Bofu-Matinha\nGOVERNMENT has challenged the business community to take advantage of the conducive environment availed by the Second Republic to be innovative and expand their businesses.\nWith Masvingo province targeting an US$8 billion economy by the year 2030, government has challenged stakeholders to adopt a culture of innovation and maximise on production.\nMasvingo Minister of State for Provincial Affairs and Devolution Honourable Ezra Chadzamira made the remarks at the 3rd edition of the Masvingo Achievement Awards (MAA) where individuals, companies and institutions which performed well during the course of the year were honoured.\n“As a province, the economic performance for the year 2023, ZIMSTAT current statistics reflects that the real gross domestic product for Masvingo is more than 18 billion Zimbabwe Gold, contributing about 7 percent to the National GDP. It is our wish that we continue to put up measures that ensure growth of our GDP and that we meet our US$8 billion economy by 2030.”\nThose who were honoured paid tribute to government for the support through ensuring a conducive operating environment for businesses.",
            "time": "09:31",
            "date": "17 Dec 2024"
        },
        {
            "title": "Private sector backs Zim’s Industrial Reconstruction and Growth Plan",
            "href": "https://www.zbcnews.co.zw/private-sector-backs-zims-industrial-reconstruction-and-growth-plan/",
            "content": "Story by Stanley James, Business Editor\nTHE private sector has pledged to support the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP) 2024 -2025, aimed at solving challenges affecting companies.\nGovernment and the private sector this Tuesday held discussions on the industrial blue print, whose focus is on growth opportunities, reducing costs and strengthening value chains.\nWith Zimbabwe focusing on a private sector-led economy, captains of industry and commerce contend the implementation is important towards achieving set objectives.\n“The desire to grow industry is there and it is within such blue prints that a foundation towards growth is laid out and what is crucial is for the entire people to entrench the aspirations of the plan. This therefore entails cooperation among stakeholders to come up with a common vision, that is taking a closer look at current challenges and offer solutions that takes the economy forward riding on the current gains within the sector and taking a closer look to the outlook projections of enhancing intermediate manufacturing, utilisation of idle infrastructure assets, value chain optimisation, rural industrialisation and local content strategy implementation,” Zimbabwe National Chamber of Commerce- Harare Branch chairperson Mr Ephraim Chawoneka said.\nNavidale Textiles Managing Director Mrs Mary Madzima noted, “As the plan seeks to address influx of smuggled and counterfeit products, improve the ease of doing business, enhance growth of large corporates, address regulation and compliance issues, it becomes imperative that as the private sector we need to embrace it for the growth of the economy.”\n“We are more than willing to partner the government to implement the plan because through implementation, we are destined to achieve the intended targets so that it will harness competitiveness and position Zimbabwe as a regional hub for industrial growth by addressing issues of access to long-term financing and infrastructure as well as utilities such as electricity and water cost and availability,” Employers’ Confederation of Zimbabwe vice president Dr Farai Dube added.",
            "time": "09:31",
            "date": "17 Dec 2024"
        },
        {
            "title": "Govt’s support pays off as manufacturing sector growth continues",
            "href": "https://www.zbcnews.co.zw/govts-support-pays-off-as-manufacturing-sector-growth-continues/",
            "content": "Story by Stanley James Business Editor\nZimbabwe continues to register significant growth in the manufacturing sector as a result of government’s support and investments in machinery and equipment.\nOfficial statistics seen by the ZBC News show that confidence in the manufacturing sector is on an upward trajectory as capacity utilisation is expected to recover from 52,1 percent this year to over 55 percent in 2025.\nThe growth is expected to be driven by government support, improved power supplies and increased agriculture output which will stimulate food processors including the beverages and drinks subsectors of the economy.\n“Once again, it is through your support that we have seen it necessary to continue investing in Zimbabwe and we shall further focus on the needs of the markets in as far as consolidating the current gains is concerned,” Varun Beverages chairman Mr Ravi Jaipuria said.\nAs more manufacturing firms roll out new machinery and equipment projects, upgrade technology systems, leading to an over 80 percent local product availability, hopes are high that more investors will be coming to start businesses in Zimbabwe.\n“We have continued to invest in Zimbabwe and we have launched new products reflecting our positive response to the Government of Zimbabwe so we are also investing in solar panels to consolidate current growth and focus on diversifying the market base with the sixth project testifying that indeed we are here to continue operating in Zimbabwe,” said the Confederation of Zimbabwe Retailers president, Mr Denford Mutashu.",
            "time": "09:31",
            "date": "17 Dec 2024"
        }
    ]
}