{
    "news": [
        {
            "title": "Zimbabwe set to resume wheat exports",
            "href": "https://www.zbcnews.co.zw/zimbabwe-set-to-resume-wheat-exports/",
            "content": "Story by Tendai Munengwa\nTHE record wheat hectarage planted this season has set a strong foundation for the country to resume wheat exports and earn the much-needed foreign currency.\nOfficials from the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development led by Professor Obert Jiri toured wheat farms and dams in Mazowe, Mashonaland Central Province, this Tuesday to assess the progress being made by farmers to feed the nation.\nAt Cde Aaron Nhepera’s farm, the officials witnessed a thriving crop on a 60-hectare piece of land, with the farmer praising continued support from government.\n“We started small after getting land but with the support that we have been getting from government agricultural programmes, we are weaning ourselves to do it our own. I have 160 hectares of centre pivots and with inputs programmes like the ARDA inputs support scheme I am expecting to produce over seven tonnes of wheat per hectare,” said Cde Nhepera.\nThe tour also revealed a positive picture of the prospects of the country achieving adequate wheat output and surplus to resume exports of the strategic crop.",
            "time": "20:47",
            "date": "08 Jul 2025"
        },
        {
            "title": "Local firms scale up exports to Zambia",
            "href": "https://www.zbcnews.co.zw/local-firms-scale-up-exports-to-zambia/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’S regional trade development agenda continues to gain traction as local companies increase their export market share in Zambia, riding on the SADC industrialisation agenda.\nPresenting an update on the participation of Zimbabwean firms at the upcoming Zambia Agricultural and Commercial Show at the end of this month, ZimTrade Export Promotion Manager, Mrs Vuyiswa Mafu revealed increased interest by local firms.\n“Over 25 local firms will take part at the Expo a true reflection of their commitment to bolster ties with Zimbabwe and we expect the entire event to yield the intended aspects of broadening the scope of business and unlock more value in trade,” she said.\nShe also revealed that there is huge demand for locally produced goods in the Zambian market.",
            "time": "20:47",
            "date": "08 Jul 2025"
        },
        {
            "title": "The beverage sector seeks government support amid soaring sugar demand",
            "href": "https://www.zbcnews.co.zw/the-beverage-sector-seeks-government-support-amid-soaring-sugar-demand/",
            "content": "Story by Peter Chivhima\nZIMBABWE’S beverage manufacturing sector is appealing for enhanced government support to stabilise sugar supplies and reduce production costs.\nThe call was made this Tuesday during a briefing with the Parliamentary Portfolio Committee on Industry and Commerce, where Delta Corporation Finance Director, Mr Alex Makamure, detailed the operational bottlenecks affecting the sector.\n“The main suppliers of refined sugar are StarAfrica (Goldstar Sugars) and Tongaat Hullets (Hippo Valley and Triangle). Over the years they have failed to meet the quantity and quality requirements. Given these challenges, the Ministry of Industry and Commerce has agreed with the bottlers that they be allowed to supplement their requirements from imports,” he said.\nHowever, sugar remains on the controlled list of imported products, attracting a protective import duty of US$100 per tonne a cost the sector says adds significant pressure on pricing.\nIn addition, the beverage sector continues to grapple with the implications of the sugar tax, introduced in February 2024, which Mr Makamure says led to price hikes of between 15% and 45%, especially for sugar-laden products such as Mazoe Orange Crush.\n“Prices of Sugar added on soft drinks increased by 15 % to 45 % following the introduction of the tax in February 2024. The highest increase were on cordial such as Mazoe Orange Crush. The process of cordials have been moderated since January 2025 after the surtax was halved to 0.0005/g,” Mr Makamure said.\nIn response, Chairperson of the Portfolio Committee on Industry and Commerce, Honourable Clemence Chiduwa, urged Delta Corporation and other industry players to strengthen engagements with domestic sugar producers to build sustainable supply chains.\n“We encourage you to find each other local companies so that you increase your production. This will create a balance between your production and the market. However as the Committee will further discuss the issues you have raised,” he said.",
            "time": "20:47",
            "date": "08 Jul 2025"
        },
        {
            "title": "Zim tourism sector savours growth as traditional food hub opens",
            "href": "https://www.zbcnews.co.zw/zim-tourism-sector-savours-growth-as-traditional-food-hub-opens/",
            "content": "Story by Tafara Chikumira\nTHE first restaurant to offer exclusively traditional dishes, the Highway Gastro Hub, has been commissioned in Kwekwe, in a major milestone set to boost gastronomy tourism in the country.\nThe seed of gastronomy tourism which was popularised by the country’s tourism ambassador the First Lady Dr Auxillia Mnangagwa continues to grow with the latest being the opening of the restaurant which serves traditional meals.\nThe restaurant, located some 30 kilometers from Kwekwe, is a breath of fresh air as it offers unique dishes that are an alternative to fast food.\n“We are coming on board to complement the efforts by our First Lady, Dr Mnangagwa, who has been pushing for the uptake of gastronomy tourism. Here, we are saying people can come and relax and remember their culture by getting some traditional food. We also offer culinary skills to those who wish to pursue hotel and tourism classes,” Director of Operations for Gastro Highway Hub, Mrs Margaret Mhaka said\nThe government says the introduction of gastronomy tourism is set to propel the tourism sector which is now angling to attain a US$12 billion economy by 2030.\n“This is a huge milestone in this country. This is a unique restaurant, which is right on the roadside. People can come here and relax with their families. We are saying every dollar spent in the tourism sector counts. The future of this sector is indeed bright. We have made strides since 2018, and we are breaking records,” Minister of Tourism and Hospitality industry, Honourable Barbra Rwodzi noted.",
            "time": "20:47",
            "date": "08 Jul 2025"
        },
        {
            "title": "South African experts call for stronger trade and youth focus at BRICS 2025 Summit",
            "href": "https://www.zbcnews.co.zw/south-african-experts-call-for-stronger-trade-and-youth-focus-at-brics-2025-summit/",
            "content": "IN exclusive comments to Soweto TV, a media partner of the TV BRICS International Media Network, South African analysts highlighted the need for deeper economic collaboration among the BRICS member states and greater domestic impact from multilateral engagements.\nKhanyi Magubane, a political analyst, emphasised the summit’s likely focus on strengthening trade ties among the BRICS countries.\n“Every summit has a focus, and this particular one is going to focus on strengthening trade and the way countries do business with each other,” she said.\nMagubane noted that in an evolving global landscape, countries are seeking cost-effective partnerships, and the summit provides a platform for recalibrating such economic groups.\nShe also pointed to the anticipated intensity of bilateral and multilateral engagements on the sidelines.\n“We are going to see foreign ministers meeting, delegations from policy and political offices trying to cut deals that make sense for their respective countries.”\nMagubane further underscored that growing interest from countries seeking BRICS membership will likely reinforce the group’s global influence.\nYouth activist and politician Jacob Walaza shared the perspective of South Africa’s younger generation, highlighting priorities for the domestic agenda.\n“One of our key expectations is reindustrialisation. We need to ensure that South Africa is technologically competitive and that infrastructure is developed to support job creation,” he said.\nWalaza stressed that BRICS summits must go beyond diplomatic declarations and result in local impact.",
            "time": "20:47",
            "date": "08 Jul 2025"
        }
    ]
}