{
    "news": [
        {
            "title": "Govt reaffirms commitment to boosting tourism as key economic contributor",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-boosting-tourism-as-key-economic-contributor/",
            "content": "Story by Fairstars Mukungurutse\nGOVERNMENT has reaffirmed its commitment to continue fostering the growth of the tourism and hospitality industry as the country targets to attain an upper middle-income society by 2030.\nSurpassing agriculture and mining, the tourism and hospitality industry registered tremendous growth in 2024, accounting for 12 % of the country’s GDP.\nIn an interview with ZBC News after addressing students at the Zimbabwe Staff College this Monday, Tourism and Hospitality Industry Minister, Honourable Barbara Rwodzi said the government has put in place a raft of measures to consolidate the tourism industry as one of the top contributors to the Gross Domestic Product, alongside mining, agriculture and manufacturing.\n“We had an engagement with the Staff of the Defense Forces today, where we were discussing the contribution of the tourism industry to the country’s economy, and we were giving them a layout of what the tourism industry is all about, how we are guided by the constitution, the President’s Vision 2030, as well as the policies and how we have formulated our strategies to be where we are,” she said.\n“We were telling them the figures for 2023, in comparison with 2024 figures, whereby tourism was the highest sector that contributed to the GDP by 12 %, and how we achieved that. Agriculture was affected by climate change due to the drought that we experienced in 2024, and mining was affected by the fluctuation of global prices, and, that resulted in tourism being the number one contributor to the GDP.",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Coal producers applaud govt’s efforts to stabilise ZiG currency and revitalise sector",
            "href": "https://www.zbcnews.co.zw/coal-producers-applaud-govts-efforts-to-stabilise-zig-currency-and-revitalise-sector/",
            "content": "Story by Tichaona Kurewa\nCOAL producers have praised government efforts to stabilise the Zimbabwe Gold (ZiG) currency and its ongoing engagement and re-engagement drive, measures which they say are key in significantly revitalising the sector.\nThe government has implemented various measures to enhance the ease of doing business, including the introduction of the ZiG currency and a concerted effort to engage and re-engage with the global community.\nA visit to Zambezi Gas Mine by the ZBC News crew revealed increased activity attributed directly to timely government interventions.\n“The Second Republic has helped us by opening doors, allowing us to enter into markets for equipment. We can now get cheaper and efficient equipment from China and that has enabled us to start finding our feet again. With the Second Republic’s re-engagement drive, we can now talk to our traditional suppliers like BaloWorld and get assistance,” Zambezi Gas’ executive Mr Mathew Rararadza said.\n“Our friends from the East are always receptive when we want facilities with regards to machines, imports and everything, all thanks to the re-engagement drive. It has also opened for Western countries as their companies are starting to come back now and want to do business with us, especially after the lifting of the sanctions on some companies the lifting of the sanctions on some companies,” Coal Producers Association’s Chairperson, Mr Lainos Masimura said.\nThe stability of the ZiG currency has also been highlighted as a critical factor in the sector’s resurgence.\n“Our hope and wish is that the currency continues to grow strength so that we can be able to transact locally in our currency and then work with foreign currency when we are exporting. For us to run on a foreign currency when we are doing local transactions, it always comes with the costs that are also denominated in foreign currency and it becomes difficult to operate,” Mr Masimura stated.\nZimbabwe’s coal production has shown consistent growth. As of December 2023, the country recorded more than 4.9 million tonnes, up from just over 3.9 million tonnes in December 2022.",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "Oil prices decline as tariff uncertainty keeps investors on edge",
            "href": "https://www.zbcnews.co.zw/oil-prices-decline-as-tariff-uncertainty-keeps-investors-on-edge/",
            "content": "OIL prices fell on Monday as concern about the impact of U.S. import tariffs on global economic growth and fuel demand, as well as rising output from OPEC+ producers, cooled investor appetite for riskier assets.\nBrent crude fell 31 cents, or 0.4%, to $70.05 a barrel by 0445 GMT after settling up 90 cents on Friday. U.S. West Texas Intermediate crude was at $66.69 a barrel, down 35 cents, or 0.5%, after closing 68 cents higher in the previous trading session.\nWTI declined for a seventh successive week, the longest losing streak since November 2023, while Brent was down for a third consecutive week after U.S. President Donald Trump imposed then delayed tariffs on its key oil suppliers Canada and Mexico while raising taxes on Chinese goods. China retaliated against the U.S. and Canada with tariffs on agricultural products.\n“Tariff uncertainty is a key driver behind the weakness,” ING analysts said in a note, adding that oil price cuts from Saudi Arabia and deflationary signals from China also hurt sentiment.\nIG analyst Tony Sycamore said other factors weighing on oil prices include concerns about U.S. growth, the potential lifting of U.S. sanctions on Russia, and OPEC+ opting to increase output.\n“Nonetheless, with much of the bad news likely factored in, we expect weekly support around $65/$62 to hold firm before a recovery back to $72.00,” he said in a client note in reference to the WTI price.\nOil prices clawed back some loss on Friday after Trump said the U.S. would increase sanctions on Russia if the latter fails to reach a ceasefire with Ukraine.\nThe U.S. is also studying ways to ease sanctions on Russia’s energy sector if Russia agrees to end its war with Ukraine, two people familiar with the matter told Reuters.\nMeanwhile, the Organization of the Petroleum Exporting Countries and allies including Russia, collectively known as OPEC+, said it will proceed with oil output hikes from April.\nRussia’s Deputy Prime Minister Alexander Novak on Friday said OPEC+ could reverse the decision in the event of market imbalance.\nAdding to supply concerns, Saudi Arabia cut prices for crude grades it sells to Asia for the first time in three months in April.\nLast week, Trump said he wanted to negotiate a deal with OPEC member Iran to prevent the latter seeking nuclear weapons – though Iran has said it is not seeking such weapons.",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "GeoPomona waste-to-energy project enters final construction phase",
            "href": "https://www.zbcnews.co.zw/geopomona-waste-to-energy-project-enters-final-construction-phase/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE GeoPomona Waste to Energy Project is entering its final construction phase and continues to garner widespread support from key partners, including the country’s largest commercial bank, CBZ Holdings.\nA delegation from CBZ, led by Group Chief Executive Officer Mr Lawrence Nyazema, visited the project in Harare this Thursday.\nSince taking over waste collection responsibilities from the City of Harare last year, GeoPomona has made a significant impact, collecting an average of 1 500 tonnes of solid waste per day from illegal dumpsites.\nWith the sorting plant at the waste management project site in Harare now complete, the firm awaits construction of the main waste-to-energy plant which will generate at least 22 megawatts of electricity once operational.\n“This project is the first of its kind in Africa and we are excited to continue supporting GeoPomona until the project gets to finality. The modern equipment at this site attests to the effectiveness of the project as a solution to the waste management challenges faced by Harare,” Nyazema said.\nGeoPomona Chief Executive Officer Dr Dilesh Nguwaya owes the success of the project to their partners who are providing key support.",
            "time": "21:07",
            "date": "10 Mar 2025"
        },
        {
            "title": "France keen to improve business ties with Zimbabwe",
            "href": "https://www.zbcnews.co.zw/france-keen-to-improve-business-ties-with-zimbabwe/",
            "content": "Story by Stanley James, Business Editor\nFRANCE is keen to improve business and trade ties with Zimbabwe, driven by a 20 percent growth in trade to over US$70 million last year.\nThe official opening of the Francophone Week Thursday night, created a platform to review Zimbabwe’s relations with France in terms of business, trade, and socio-economic development.\n“The past few weeks have been key in as much as our drive to value Zimbabwe on Bilateral ties is concerned, official statistics show that trade between the two countries reached over US$70 million, while this shows a 20 percent rise,” the French Ambassador to Zimbabwe, His Excellency Paul Bertrand Barets said.\n“We still have a lot of work to do and this Francophone Week serves to show how France continues to engage global partners with Zimbabwe being a main priority riding on the gains that have been achieved, going forward we expect the existing cordial relations to continue.”\nSeveral French investors are lining up to explore available opportunities in Zimbabwe this year.\n“As you know, there will be a European Union, Zimbabwe Business Forum this year, several French companies and investors have also confirmed their participation in the event in what will mark further commitment to the growth of business ties between the two countries.\n“This will further testify to the growing relations, and provide an opportunity for increased investments including joint ventures that will likely have a potential to boost business relations, so indeed, France is more than willing to work with Zimbabwe,” the Ambassador said.\nThe Francophone Week official opening ceremony which was also attended by diplomats, government officials, and the private sector, among others, provides an opportunity for France to showcase several aspects in terms of social, culture, arts, industry, and commerce.\nIn Zimbabwe, several programmes are lined up for Francophone Week which runs from March 8 to March 23.\nIt also seeks to promote the French language systems, offering a platform for cultural exchanges while creating an opportunity for French-speaking countries to exhibit their cultural values and activities.",
            "time": "21:07",
            "date": "10 Mar 2025"
        }
    ]
}