{
    "news": [
        {
            "title": "ZiG one year on: RBZ assesses progress and stability",
            "href": "https://www.zbcnews.co.zw/zig-one-year-on-rbz-assesses-progress-and-stability/",
            "content": "Story by Stanley James, Business Editor\nTHE Reserve Bank of Zimbabwe (RBZ) has expressed satisfaction with the performance of the Zimbabwe Gold (ZiG) currency, which marks one year since its introduction.\nLaunched on April 5, 2024, ZiG was introduced as a structured currency to address challenges affecting domestic currency stability. As the currency reaches its first anniversary, RBZ Governor Dr John Mushayavanhu reflects on its impact.The Road to ZiG: A Monetary Solution“The Zimbabwe Gold (ZiG) was introduced at a time when the economy was facing significant inflationary and exchange rate pressures from December 2023 to March 2024. The pressures resulted in the domestic currency losing its value, its desired properties of predictability, convertibility, transactional convenience, and reliability as a store of value.\n“The significant growth in inflationary pressures in the economy led to the depreciation of the local currency both on the interbank and parallel markets, such that banknotes became too small and inconvenient for the transacting public given the price levels in the economy. Such challenges, among others, necessitated the recalibration of the bank’s monetary policy framework, together with the reintroduction of a structured currency, the Zimbabwean Gold to restore price and exchange rate stability and expectations necessary to boost confidence in the local currency.\n“The economy also experienced challenges with small change for foreign currency transactions, compelling retailers to either use shop coupons or force customers to buy small items. The situation also saw some retailers, wholesalers, and banks refusing soiled or torn US dollar notes, further inconveniencing the transacting public.\n“The transition from the Zimbabwe Dollar to ZiG was smooth, as all the Zimbabwe Dollar balances in bank accounts were successfully converted to ZiG using a factor of 2,498.7242. To ensure a seamless process, the Reserve Bank also mandated banks to continue accepting deposits of Zimbabwe Dollar banknotes for a period of 21 days after 5 April 2024,” said Dr Mushayavanhu.ZiG Acceptance and PerformanceThe RBZ Governor highlighted how businesses and the public have embraced the new currency.\n“The ZiG currency has been fully embraced by businesses and accepted by the transacting public for both transactional and saving purposes. The countrywide outreach programmes to create awareness of the new currency also demonstrated that the general populace embraced the ZiG.\n“Basically, the acceptance of the local currency by the public has improved since 5 April. Before the introduction of ZiG, the economy was moving towards full dollarisation, with the US dollar increasingly dominating the weaker Zimbabwe Dollar. However, the ZiG’s domestic share in total transactions has increased to above 35% from less than 15% in 2023 and continues to grow as confidence improves.\n“Therefore, the economy has experienced relative stability since April 2024 on both the exchange rate and inflation fronts, notwithstanding the shock on the exchange rate experienced around August and September 2024. The parallel exchange rate premium, which was above 100% before the introduction of ZiG, has since narrowed to below 20% by March 2025,” he said.Building Reserves and Future PlansIn light of these developments, promoting the wider use of ZiG remains a key objective for the RBZ.\n“The Reserve Bank continues to accumulate reserves to provide adequate backing for ZiG stability. Currently, total reserve coverage for the ZiG amounts to over US$500 million, of which more than US$230 million are gold reserves. The current level of reserve coverage for the ZiG is equivalent to more than three times the total amount of the ZiG currency in circulation, which is quite a healthy situation to durably support the stability of the local currency.",
            "time": "21:26",
            "date": "03 Apr 2025"
        },
        {
            "title": "Govt pledges viable tariffs for renewable energy projects",
            "href": "https://www.zbcnews.co.zw/govt-pledges-viable-tariffs-for-renewable-energy-projects/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE government has assured independent power producers that it will guarantee the viability of their projects by way of economic tariffs to improve the national power supply situation.\nThe Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube made his maiden visit to the 22 megawatt GeoPomona Waste to Energy Project and was delighted by how the project is unfolding.\nProfessor Ncube has pledged that Treasury is guaranteeing an economic tariff to ensure the viability of independent power producers such as GeoPomona to promote large scale investments in renewable energy generation.\n“We have come up with a framework that ensures that all independent power producers have support from the government by way of giving them an economic tariff of US$0.16 per kilowatt,” the Minister said.\n“I am here at GeoPomona to understand and learn about this project which we see as a game changer not only in waste management but to enhance our environmental management systems as a country. Our wish is that the project is replicated in other provinces in the country.”",
            "time": "21:26",
            "date": "03 Apr 2025"
        },
        {
            "title": "US imposes 18% tariff on Zim exports, analysts predict minimal impact",
            "href": "https://www.zbcnews.co.zw/us-imposes-18-tariff-on-zim-exports-analysts-predict-minimal-impact/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE US government has imposed an 18 percent tariff on imports from Zimbabwe, with many other African countries also affected by President Donald Trump’s sweeping economic decision.\nThe sweeping tariffs which kicked off this Wednesday, have sent shockwaves across the globe with major stock markets tumbling on their first day as US President Donald Trump pursues his inward-looking American first policy.\nThe penalties announced on US allies and rivals alike have drawn condemnation from other leaders facing the end of an era of trade liberalisation that has shaped the global order for decades.\nZimbabwe has also been slapped with an 18 percent tariff on all exports to the US, but analysts believe the impact on the local economy will be minimal considering the US is not Zimbabwe’s major trading partner.\n“Zimbabwe will not be greatly affected by the 18% tariff as its trade with the US stands at around 1.3% constituting about 0.3% of GDP. We are only yet to see how Zimbabwe is likely to be affected given that South Africa, which is Zimbabwe’s largest trading partner is likely to be the biggest casualty of tariffs based on their significant trade with the US,” Economist, Dr Prosper Chitambara said.\nSouth African-based entrepreneur and PhD student, Omalli Jalai says any impact should be seen from the standpoint of how Zimbabwe is likely to be affected, given that its largest trading partner, South Africa will be hard hit after being slapped with a 30 percent tariff.",
            "time": "21:27",
            "date": "03 Apr 2025"
        },
        {
            "title": "Portugal to participate at ZITF, strengthening international trade relations",
            "href": "https://www.zbcnews.co.zw/portugal-to-participate-at-zitf-strengthening-international-trade-relations/",
            "content": "Story by Oleen Ndori, Foreign Desk Editor\nPORTUGAL is excited by the prospects of attending the 2025 Zimbabwe International Trade Fair set to begin later this month in Bulawayo.\nSpeaking with journalists after meeting with the Minister of Foreign Affairs and International Trade, Professor Amon Murwira in Harare this Thursday, Portugal’s representative in Zimbabwe, Ambassador Rui Concalves Monteiro said the international trade expo will be able to kick-start economic engagements between the two countries.\n“I am trying to have more contacts, including at the Chambers of Commerce level and it is also, as I told you, my intention is to go to Bulawayo by the end of this month to see how the ZITF works and to maintain some contact with businessmen and businesswomen along with maintaining contact with the Portuguese authorities and to make the bridge, taking into account that some Portuguese companies, namely in the field of construction, renewable energies and tourism, perhaps some are in Portugal, but also some are nearby in other countries in this region so they could come here. That is what we are talking about, opportunities, conditions, legislation, and the most important fields of cooperation,” Ambassador Monteiro said.",
            "time": "21:27",
            "date": "03 Apr 2025"
        },
        {
            "title": "RBZ denies plans to seize safe deposit boxes, reaffirms respect for property rights",
            "href": "https://www.zbcnews.co.zw/rbz-denies-plans-to-seize-safe-deposit-boxes-reaffirms-respect-for-property-rights/",
            "content": "Story by Oleen Ndori",
            "time": "21:27",
            "date": "03 Apr 2025"
        }
    ]
}