{
    "news": [
        {
            "title": "Youth-led telemedicine firm secures US$50k seed capital from NVCCZ",
            "href": "https://www.zbcnews.co.zw/youth-led-telemedicine-firm-secures-us50k-seed-capital-from-nvccz/",
            "content": "Story by Owen Mandovha\nHARARE-YOUNG Zimbabwean innovators have been urged to harness the opportunities presented by the National Venture Capital Company of Zimbabwe (NVCCZ) to transform their ideas into successful enterprises, as the Government intensifies support for youth-led innovation under its economic development strategy.\nThis comes as the NVCCZ, in collaboration with Old Mutual, disbursed US$50 000 in seed capital to KumbaCare, a youth-led telemedicine startup founded by Ms Agatha Mandovha, during an event held in Harare this Tuesday.\nKumbaCare offers a mobile-based healthcare platform tailored to serve rural and marginalised communities, enabling users to access health consultations for as little as US$1 per month, with benefits valued at US$30.\n“We came up with a solution that targets rural communities and underprivileged people by offering an affordable telemedicine solution using mobile platforms to seek health assistance from experts by just paying a dollar monthly but getting a US$30 package,” she said.\nThe NVCCZ was established as part of Government’s efforts to drive innovation and create employment by offering funding support to viable youth-led projects across sectors.\nNVCCZ Chief Executive Officer, Mr Tino Kambasha, emphasised that the initiative is a strategic intervention aimed at unlocking the potential of young entrepreneurs to contribute meaningfully towards national development.\n“We are here to solve support these young innovators who are determined to solve the country’s problems in our quest to attain an upper middle income society by 2030. We are working with young entrepreneurs through Old Mutual and this indeed is a new era to support entrepreneurship by Government,” he said.\nOld Mutual Zimbabwe, a key partner in the initiative, plays a pivotal role in identifying and nurturing promising ideas through its Innovation Hub, located in Harare.\n“We offer a platform where young people can develop their ideas and pitch them through structured innovation challenges. The most promising projects, such as KumbaCare, are then funded by NVCCZ,” group’s Marketing, Public Affairs and Sustainability Executive, Mrs Lilian Mbaiwa said.",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "China to eliminate tariffs on imports from all African countries",
            "href": "https://www.zbcnews.co.zw/china-to-eliminate-tariffs-on-imports-from-all-african-countries/",
            "content": "CHINA has announced the full removal of tariffs on imports from all African countries.\nThis is reported by ENA, a partner of TV BRICS.\nThe tariff elimination falls under the new China–Africa Economic Partnership for shared development, a framework designed to accelerate Africa’s integration into global trade by increasing market access, improving customs procedures, and strengthening institutional trade capacity.\nThe initiative is part of a broader effort by Beijing to support industrialisation, diversify imports and reinforce economic links with African states beyond raw materials.\nPresident Xi Jinping reaffirmed China’s readiness to welcome all African exports under zero-tariff treatment.\nHe emphasised that the new arrangement would be accompanied by enhanced cooperation in customs, quarantine, logistics, and capacity building.\nChina also pledged to support training programmes and expand the visibility of high-quality African goods in the Chinese market.\nIn 2024, China–Africa trade reached nearly US$300 billion, consolidating China’s position as Africa’s largest trading partner.",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Foreign reserves hit more than US$700m as ZiG strengthens",
            "href": "https://www.zbcnews.co.zw/foreign-reserves-hit-more-than-us700m-as-zig-strengthens/",
            "content": "Story by Owen Mandovha, Business Reporter\nThe ZiG currency continues to experience widespread usage in the economy, with the latest statistics showing that local currency transactions on the National Payments System have risen by 17 percent since the introduction of the currency in April 2024.",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Kariba women entrepreneurs making strides in tourism and manufacturing",
            "href": "https://www.zbcnews.co.zw/kariba-women-entrepreneurs-making-strides-in-tourism-and-manufacturing/",
            "content": "Story by Tamuka Charakupa\nKARIBA – THE government- led women empowerment initiatives are bearing fruit with women venturing into key sectors, including manufacturing, construction and tourism industries.\nIn Kariba, a town famed for its picturesque lakefront and vibrant tourism appeal, women are breaking through traditional barriers and emerging as notable figures in the small and medium enterprise (SME) space.\nOne such trailblazer is Mrs Chikomborero Jaiwa, a local entrepreneur who has established herself within the competitive tourism industry.\n“When I started a few years ago, many people looked at me and thought I would not survive. Tourism here has long been dominated by large corporations, mostly white-owned. As a black woman and a former teacher, I am redefining the odds, I have now secured my stake in this sector despite widespread scepticism.”\nHer story resonates with that of Mrs Mationesa Kazangarare, who runs a medium-scale water bottling plant, capitalising on Kariba’s climate and natural resources.\n“Kariba experiences high temperatures throughout the year. I realised we were consuming bottled water transported all the way from Manicaland,” she said.\n“So I identified the gap and established this plant. I wanted to prove that you don’t have to be based in a major city to operate a professional business. Kariba’s water is clean and abundant, why should we not bottle it here, create employment here, and uplift our community?”\nThe government has commended such entrepreneurial efforts, viewing them as critical to local development and national economic empowerment goals.\nThe Minister of Women Affairs, Community, Small and Medium Enterprises Development, Senator Monica Mutsvangwa recently visited Kariba and praised the thriving women-led businesses.\n“I have been touring SMEs in Kariba and I am proud to witness women-led enterprises flourishing. My Ministry remains committed to facilitating a conducive business environment, affordable loan access through Smedco, and technical training. We are now in the digital era, let us leverage ICT and social media platforms for marketing to expand beyond Kariba.”",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Bulawayo seminar champions women’s economic empowerment",
            "href": "https://www.zbcnews.co.zw/bulawayo-seminar-champions-womens-economic-empowerment/",
            "content": "Story by Thubelihle Mhodi\nBULAWAYO – WOMEN entrepreneurs have been encouraged to sharpen their business acumen and leverage networking platforms to enhance their participation in key economic sectors.\nThis call was made during the Ladies in Business Seminar, an annual event which was held in Bulawayo this Saturday, which brought together a diverse group of women from various industries to explore opportunities for collaboration, innovation, and growth.\nThe seminar, which continues to draw increased participation from emerging and established female entrepreneurs, has become a vital platform for measuring the progression of women in business and their contribution to Zimbabwe’s socio-economic development.\nParticipants shared insights on how women can successfully run businesses without necessarily owning significant assets or capital, highlighting the importance of creativity, resilience, and leveraging available opportunities.\n“You do not need to own property to run a successful business, you can manage on behalf of someone else. Women do not always need significant capital to start businesses. Homemakers can use their natural hospitality to build thriving ventures,” a participant said.\nOthers emphasised the empowerment potential of addressing market gaps, particularly in sectors such as agriculture and accommodation.\n“There are many opportunities, but a persistent shortage of suitable accommodation. Empowering women in these sectors is essential for self-reliance, economic growth, and financial inclusion,” a lady said.\n“This seminar allows me to network within the farming industry. Agriculture is broad it involves inputs, outputs, logistics, and marketing. Events like these help us connect and scale up,” ”another woman participant said.\nMs Thubelihle Ndlovu, Managing Director of Purse on Point, the organisation behind the initiative, underscored the value of collective learning and strategic partnerships in promoting financial literacy among women.",
            "time": "20:46",
            "date": "17 Jun 2025"
        }
    ]
}