{
    "news": [
        {
            "title": "Govt reaffirms commitment to resolving Bulawayo water crisis with the Glassblock Dam project",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-resolving-bulawayo-water-crisis-with-the-glassblock-dam-project/",
            "content": "Story by Yolanda Moyo\nTHE government has reiterated its unwavering commitment to resolving Bulawayo’s long-standing water challenges, with the Glassblock Dam project identified as a vital mid-term solution.\nSet to be developed through a public-private partnership, the Dam is expected to increase Bulawayo’s water supply by 70%, offering much-needed relief to both residents and industries.\nFinance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, recently outlined the government’s three-pronged approach to addressing Bulawayo’s water challenges in an interview with ZBC News.\n“The President has put the development of infrastructure at the top of the government’s priorities. This development of infrastructure is multi-faceted, with the provision of water infrastructure being one of them,” Professor Ncube said.\n“That is why President Emmerson Mnangagwa launched the Presidential Borehole Drilling Scheme, amongst other programmes. We have noted that Bulawayo has been facing water challenges, and as government, we have moved in with a three-pronged approach to ensure the challenge is addressed.\n“We all know that the government is constructing the Gwayi Shangani Dam as a long-term measure to this challenge. We are currently going through the contractual details of the Glass Block Dam which is expected to be the mid-term solution to the challenge we are facing, and soon, once we finish on the details construction is set to begin.”",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "SADC Ministers convene in Zim to strengthen regional trade and labour cooperation",
            "href": "https://www.zbcnews.co.zw/sadc-ministers-convene-in-zim-to-strengthen-regional-trade-and-labour-cooperation/",
            "content": "By Tichaona Kurewa\nZIMBABWE is hosting two key Southern African Development Community (SADC) meetings this week, focusing on trade and labour issues within the region.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zhong Jin International Hotel opens in Redcliff as Zim’s investment drive gains traction",
            "href": "https://www.zbcnews.co.zw/zhong-jin-international-hotel-opens-in-redcliff-as-zims-investment-drive-gains-traction/",
            "content": "Story by Tafara Chikumira\nTHE Second Republic’s open-for-business mantra continues to attract more investments after the commissioning of the Zhong Jin International Hotel in Redcliff this Sunday.\nMotivated by the friendly investment climate in the country, the Chinese investors have ploughed more than US$5 million towards the mega project which is set to change the face of the industrial town.\n“Allow me to thank President Emmerson Mnangagwa for opening up the investment climate we enjoy in the country. We want to thank your support which has seen us establish this investment. Without your support we would not have managed to establish such an infrastructure,” Zhong Jin International Hotel General Manager, Mr Yolo Chen said.\nThe government is impressed by opportunities brought about by the investment, which further cements the bilateral relations between Harare and Beijing.\n“This investment is a game changer as it has created jobs and stimulated growth in the tourism value chain. The investment has exceeded US$5 million and we thank you for that.\n“Our target is to grow the sector to accrue US$2 billion up from US$1.1 billion realised last year. We have come up with clusters as a way of promoting the tourism sector,” the Minister of Tourism and Hospitality Industry, Honourable Barbra Rwodzi said.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zim records over 3% rise in milk output for January",
            "href": "https://www.zbcnews.co.zw/zim-records-over-3-rise-in-milk-output-for-january/",
            "content": "Story by Stanley James, Business Editor\nZIMBABWE’s dairy sector has started the year on a strong note after recording a 3% rise in milk output to over 9,7 million litres in January.\nAccording to the latest official data released by the Zimbabwe Association of Dairy Farmers this Monday, milk output for the month under review was pegged at 9,7 million litres, compared to 9,5 million litres the same month last year.\nWith the focus on achieving a target of above 120 million litres in 2025 from 114 million litres the previous year against a national requirement of 130 million litres, the dairy sector is confident of a continuous growth trajectory.\n“The target for this year is over 120 million litres, this is definitely achievable taking into account the persistent growth in output that has seen us being on an towards trajectory. Going forward the sector is looking at what can be done to sustain current gains including the need to capacitate the farmers leading to continuous growth which is an element that will further set the tone towards self-sufficiency for Zimbabwe,” Zimbabwe Dairy Industry Trust chairperson, Mr Themba Mutsvairo said.\nWith dairy related imports falling due to growth in the availability of locally manufactured products on domestic shelves, Zimbabwe is also expected to benefit from a favourable balance of payments position.\n“Since 2018 there has been largely an improved availability of locally produced dairy commodities, this is something that is reflecting the resilience of the dairy sector, the trend has also resulted in reduced dairy imports, a further testimony that the nation is on track to eventually reach a point where the commodity will not be imported, so going forward it is up to the relevant authorities to focus on tangible systems to consolidate current gains,” Buy Zimbabwe General Manager, Mr Alois Burutsa.",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Foreign Tech giants express interest in Zim’s ICT sector",
            "href": "https://www.zbcnews.co.zw/foreign-tech-giants-express-interest-in-zims-ict-sector/",
            "content": "Story by Owen Mandovha, Business Reporter\nTWO international technology firms have expressed interest in investing in Zimbabwe’s Information and Communication Technology (ICT) sector, a move set to accelerate the country’s transition towards a digital economy by 2030.\nA delegation from Finish tech giant Nokia led by the vice president, of Mobile Networks, Mikko Levante was the first to meet ICT, Postal and Courier Services Minister Honourable Tatenda Mavetera in Harare this Friday and was later followed by a team from Pakistan’s major telecoms firm headed by its Chief Executive Officer, Mr Muhamad Faisal Khan.\nBoth teams expressed huge interest in investing in Zimbabwe’s ICT sector which dovetails with the government’s quest to create a highly digitised society and economy.\n“We are interested in investing in Zimbabwe’s sector of ICT as it represents huge opportunities for us by matching our expansion profile,” Mikko Levante said\nThe Pakistani delegation revealed that Zimbabwe presents vast opportunities for their company.\n“Teresol is looking to partner with local companies in the ICT sector and our research has shown that there are a lot of opportunities that exist on the local market and we are glad to have met the Minister who welcomed us to scout for opportunities,” Mr Khan said.",
            "time": "20:37",
            "date": "24 Mar 2025"
        }
    ]
}