{
    "news": [
        {
            "title": "Mlambaphele community lauds government digitalisation drive",
            "href": "https://www.zbcnews.co.zw/mlambaphele-community-lauds-government-digitalisation-drive/",
            "content": "Story by Providence Maraneli\nGovernment thrust to bridge the digital divide between the once marginalised communities and urban areas continues to gain traction, with the Mlamphelele community of Gwanda South set to benefit from the POTRAZ tower relocation programme.\nOn our way to Mankonkoni Irrigation Scheme along the Shashe River in Gwanda South, we passed through a business centre in Mashaba area and we asked for a spot to make a call because of network challenges.\nTo our surprise, we were told that we only needed to have a neighbouring Botswana network line to make calls because all three Zimbabwean networks were not available in the border-lying area.\nThis scenario poses difficulties to the villagers who cannot cross the flooded Shashe River during rainy season which makes it difficult to communicate.\n“We only buy MASCOM and sell it around here because our local network is not there and now with the rains we can’t cross to Botswana to order so it’s a challenge,” said a community member.\n“There is no network even if you have a problem you can’t call an ambulance,” said another community member.\n“There is an information gap around this area because of network,” added a community member.\nAll hope is, however, not lost after the Posts and Telecommunications Regulatory Authority Zimbabwe (POTRAZ) through its tower relocation programme has started the erection of a tower at Mlambaphele border post which the local leadership say will bridge the information gap that existed between the border lying areas and the urban areas.\n“I am happy that we have been remembered, it has been difficult for people here, they could not communicate, we have cattle rustlers but even when we try to coordinate raids on cattle rustlers there was no way. If someone is sick you cannot call the ambulance, but with what is going on we are hopeful now,” said Headman Rantasi.\n“This will solve most of our challenges in this area, we have elephants that destroy fields and one has to travel to Gwanda to deliver the message. This is a welcome move,” said area councillor, Cde Andrew Ndlovu.",
            "time": "20:25",
            "date": "17 Feb 2025"
        },
        {
            "title": "Preparations on course as Byo hosts youths",
            "href": "https://www.zbcnews.co.zw/preparations-on-course-as-byo-hosts-youths/",
            "content": "Story by Aifheli Mudau\nPreparations for the National Youth Day set to be held in Bulawayo this Friday are progressing well with stakeholders working round the clock to make the day a success.\nAll roads from the breadth and length of Zimbabwe will this Friday lead to Bulawayo where the National Youth Day celebrations will be held.\nThis year’s celebrations will start a day before the main event to cater for the inaugural youth festival that will see all organisations dealing with youth affairs taking part.\n“We are moving very well with the preparations and will start the celebrations on Thursday,” said ZANU PF Bulawayo Provincial Youth chairperson, Thompson Shereni.\n“We urge all youths to be there since this day is theirs,” said ZANU PF Bulawayo Provincial spokesman, Cde Archbold Chiponda.\n“I am already here in Bulawayo to make sure we work together with all to prepare for the big day,” said deputy the Minister of Youth Empowerment, Development and Vocational Training, Honourable Kudakwashe Mupamhanga.",
            "time": "20:25",
            "date": "17 Feb 2025"
        },
        {
            "title": "Govt’s devolution funds lauded as game changer in local development",
            "href": "https://www.zbcnews.co.zw/govts-devolution-funds-lauded-as-game-changer-in-local-development/",
            "content": "Story by Tichaona Kurewa\nLocal authorities have commended government for availing devolution funds which have become a game changer in local development and advancing the attainment of Sustainable Development Goals (SDGs).\nA regional SDGs Localisation and Voluntary Reviews Capacity Building Workshop recently held in Victoria Falls saw parties being implored to localise and integrate development goals into local communities.\nIt is in this context that local authorities are an essential vehicle in the implementation of various projects to attain the SDGs.\nLocal authorities are cognisant of this role and testify that the devolution fund is a game changer as it is funding projects such as solarised boreholes, clinics and schools, among others.\nMutasa RDC’s chief executive officer (CEO), Mr. George Bandura said, “The availing of devolution funds, as it does, is the prime financial enablement vehicle that government uses in the attainment of the Sustainable Development Goals.”\n“Devolution funds are a funding source which will enable local authorities to implement some of the projects which will support Vision 2030 through the implementation of SDGs. So we must have that oiling in the form of devolution funds to enable local authorities to deliver on their projects,” added Murewa RDC’s CEO Dr Alois Gurajena.",
            "time": "20:25",
            "date": "17 Feb 2025"
        },
        {
            "title": "Beatrice road accident claims three lives",
            "href": "https://www.zbcnews.co.zw/beatrice-road-accident-claims-three-lives/",
            "content": "Story by Jerold Sasa\nThree people are feared dead after two buses collided near Beatrice along the Harare Beitbridge Highway this Saturday.\nAccording to officials, the accident occurred mid-afternoon this Saturday when a Mandaza bus which was coming from Chipinge towards Harare collided with a Glen View 2 High School bus which was heading towards Masvingo to ferry church members who had hired it and had three people on board.\nTwo of the people who are feared dead were in the Mandaza bus while the other deceased was in the Glen View High 2 Bus.\nOver 30 passengers and the drivers of buses were injured and ferried to Beatrice Hospital where they were later transferred to Chitungwiza and Harare Hospitals.",
            "time": "20:25",
            "date": "17 Feb 2025"
        },
        {
            "title": "Drug abuse survivors acquire entrepreneurial skills",
            "href": "https://www.zbcnews.co.zw/drug-abuse-survivors-acquire-entrepreneurial-skills/",
            "content": "\nStory by Tamuka Charakupa\nMore than 200 youths and women from across Norton town have been capacitated with various life-changing skills as the government’s youth empowerment drive gathers pace.\nThe 248 drawn from across Norton town are reportedly former drug addicts who have acquired knowledge and skills in various entrepreneurial activities including detergent making, leather shoe production and baking, among other skills.\nAmong those who graduated under Manake Empowerment Trust (MET), are two young men Paul Mangena and Tinashe Dube who are leading a group of 14 other youths engaged in leather shoe production.\nManaka Empowerment Trust Director Dr Sibongile Sokane said the initiative targets to eradicate the drug and substance abuse menace.\n“Our aim is to drive the youth from the scourge of drug and substance abuse by impacting them with life skills that drive self-empowerment. We also aim to fight gender-based violence through training women as well.”\nPermanent Secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, Dr Mavis Sibanda said the initiative dovetails with Vision 2030 which also prioritises youth empowerment.\n“The skills training programme that are being offered help tackle the challenge of livelihood skills gaps that women and communities struggle with and help them realize significant economic empowerment and self-sustenance.",
            "time": "20:25",
            "date": "17 Feb 2025"
        }
    ]
}