{
    "news": [
        {
            "title": "Heavy rains render Bindura’s Kamonde Bridge impassable",
            "href": "https://www.zbcnews.co.zw/heavy-rains-render-binduras-kamonde-bridge-impassable/",
            "content": "Story by Tapiwa Machemedze\nA cross-section of farmers in Bindura’s Matepatepa area are unable to deliver critical supplies to their farms following extensive damage to Kamonde Bridge by heavy rains on Thursday night.\nWhile residents are passing through on foot, the bridge is impassable by vehicles, setting back farming efforts as some farmers need to ferry fertilisers and other critical supplies to the Matepatepa farming area.\n“There were heavy rains on Thursday going into Friday. The water was powerful from Kamonde River and surrounding higher ground. It converged and failed to dislodge the soil and started eroding the bridge which eventually gave in. Now all the produce from these farms cannot pass through,” a farmer said.\nAnother added, “The biggest problem is the movement of produce, school children. As farmers, we go to town and buy produce daily. Today, we are likely to receive more rains, so we hope the local authority will urgently intervene before the whole bridge is washed away.”",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "ZBC & ZINARA showcase capacity for integrated vehicle licensing system to Parliamentary Portfolio Committees",
            "href": "https://www.zbcnews.co.zw/zbc-zinara-showcase-capacity-for-integrated-vehicle-licensing-system-to-parliamentary-portfolio-committees/",
            "content": "Story Peter Chivhima\nTHE Zimbabwe Broadcasting Corporation (ZBC) and the Zimbabwe National Roads Administration (ZINARA) have demonstrated their capacity to implement an integrated disc for vehicle licencing, in line with the provisions of the Constitution.\nA high-level presentation to the Joint Parliamentary Portfolio Committees on Media, Information and Broadcasting Services, and Transport and Infrastructural Development at the New Parliament Building in Mt Hampden this Monday saw ZBC and ZINARA proving their technical capacity to deliver solutions that enhance efficiency.\nTen Ten Technologies’ CEO Mr Charles Wekete said, “Indeed, as we demonstrated in our presentation, we confirmed that it’s technically feasible. The question we were asked to address was whether it’s possible to have a single licensed disc that covers vehicle licensing, insurance, and radio licensing. Our answer was unequivocally yes; it’s entirely possible from a technical standpoint.\n“We also discussed the importance of security features. Regarding the concern about individuals printing licensed discs at home, we clarified that the display of licensed discs on vehicle windshields is regulated by existing laws. As technical partners, it’s not our role to advocate for changes to these regulations. Instead, it’s up to the relevant authorities, including government agencies, to determine whether they wish to revise or repeal these laws and permit individuals to print their licensed discs at home.”\n“When we come together and integrate our systems, it will also be less costly in terms of the administration of things, because we will be having a lot of automation taking place in the background, saving us from printing a lot of discs and all the other expenses associated with the operations in silos.  So we are breaking the silo mentality and cooperating, which is something that we have shown through the meeting that it’s possible to work together,” ZBC’s Acting CEO Engineer Tapiwa Mudzamba said.\nZBC Head of Licensing Mr Wisdom Samanyai and Chairpersons of both Parliamentary Portfolio Committees threw their full support behind the vision, emphasising the importance of enhancing efficiency for motorists.\n“We are pleased that all three parties, including our vendor, are on the same page. We have even outlined the timelines involved. The question was if this proposal is approved tomorrow, when can we expect implementation to begin? We were able to provide a detailed explanation of the technical arrangements and other behind-the-scenes efforts already underway to ensure a smooth rollout,” Mr Samanyai said.",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "Zim celebrates International Children’s Day of Broadcasting with young talent at ZBC Studios",
            "href": "https://www.zbcnews.co.zw/zim-celebrates-international-childrens-day-of-broadcasting-with-young-talent-at-zbc-studios/",
            "content": "\nStory by Fungai Jachi\nZIMBABWE joined the global community in commemorating the International Children’s Day of Broadcasting, with children getting an opportunity to showcase their talents at the Zimbabwe Broadcasting Corporations Pockets Hill and Montrose studios.\nThese are the voices of the future, and this Sunday, the young participants eagerly assumed various roles, showcasing their talents and sharing their perspectives on the importance of the International Children’s Day of Broadcasting-ICDB.\n“It was exciting to be here as we got to appreciate what its like being in the media, we got a chance to share our views and that is important. It was fun and we need more of these opportunities,” child participants said.\nZBC TV Children’s Programming Producer, Adiola Chiyangwa, highlighted the national broadcaster’s commitment to empowering children through its programming.",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "Senator Dr James Makamba donates resources health institutions in Mount Darwin",
            "href": "https://www.zbcnews.co.zw/senator-dr-james-makamba-donates-resources-health-institutions-in-mount-darwin/",
            "content": "Story by Tapiwa Machemedze\nA total of 17 health institutions in Mount Darwin have received resources from Senator Dr James Makamba’s health facilities initiative, aimed at complementing government efforts.\nOn Saturday, seven clinics in the area became the latest beneficiaries of donations from Senator Makamba, which included consumables and cash worth nearly US$20 000.\nThe initiative, launched on the first of January this year, aims to support 28 health institutions in the senatorial constituency. Stakeholders, including traditional leaders, government officials, war veterans, and ruling party members, commended the efforts, emphasising the importance of community contributions to development.\n“I encourage us to unite and join hands with our President in this program being done by our Senator. He is doing a good programme and this job is going on well. What is being done encourages unity of purpose, self-reliance is what is required. For example, if a roofing sheet is damaged on our roof, let us repair it while we wait for government interventions,” Mount Darwin War Veterans Chairman, Cde Andrew Chikukwa said.\n“I am very happy we have been visited by our Senator, we feel very happy we have development in the area. We have our ruling party which raised us so I am happy that we are developing,” Chief Madziwa added.\n“This programme being carried out by our senator is very good for the district. He is helping our clinics and the community so that areas get what they need. He is leaving money and consumables which is supporting the government’s mandate. He is reminding people that a country is built by its people,” Mt Darwin District Development Coordinator Mr White Nkoma weighed in.",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "Govt pledges media sector growth, stresses importance of operating within the law",
            "href": "https://www.zbcnews.co.zw/govt-pledges-media-sector-growth-stresses-importance-of-operating-within-the-law/",
            "content": "Story by Memory Chamisa\nTHE government has reaffirmed its commitment to the media sector transformation but warned players to always operate within the confines of the law.\nSpeaking on the sidelines of the third anniversary of a local broadcasting media house in Harare this Friday, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere said, that while media freedom is fully guaranteed in Zimbabwe, advocating for the overthrowing of a legitimate government is unconstitutional.\n“The government says the media has no room to fuel the overthrowing of a legitimate government. As the nation journeys towards Vision 2030, it is important to appreciate and understand the constitutional obligations particularly Section 61 and Section 62 of the Constitution of Zimbabwe,” Dr Muswere said.\n“Section 61 of the Constitution is clear in terms of the freedom of expression and the freedom of media and Section 62, also speaks to access to information. We should also be very clear in terms of the supreme law of the country, the right to broadcast the overthrowing of a legitimate and democratic government does not exist in our Constitution. The media freedom, the freedom of expression that we have should always be guarded jealously and we should always protect our journalists.”\nMinister Muswere also said the Zimbabwe Media Commission and the Ministry will continue to work together with members of the fourth estate to give direction for the nation’s development as witnessed by the opening up of airwaves.",
            "time": "06:33",
            "date": "04 Mar 2025"
        }
    ]
}