{
    "news": [
        {
            "title": "ZBC shines at Zim Community Awards",
            "href": "https://www.zbcnews.co.zw/zbc-shines-at-zim-community-awards/",
            "content": "Story by Fungai Jachi\nTHE Zimbabwe Broadcasting Corporation (ZBC) stole the lime light at the 5th edition of the Zim Community Trailblazers Awards held in Harare Friday night after scooping three awards in recognition of the national broadcaster’s contribution to community development.\nIt was a night to remember for the national broadcaster after it was honoured for its programming that is having a positive impact in communities.\nRadio Zimbabwe, commonly known as Nhepfenyuro Yevanhu/Umsakazo Wabantu, scooped a Hall of Fame Award, while one of the station’s top producer/presenters Rutendo Makuti received recognition for her sterling work through the programme “Ruoko Runopa”.\n“It is overwhelming to be recognised for the work that we are doing. We will continue to do our best to provide relevant content to our listeners,” Radio Zimbabwe station manager Siphelani Chikwape said.\n“I feel blessed to have been honoured in this way. It shows that the programme is receiving an overwhelming response and it is always good to help others,” Makuti said.\nZBC News Reporter Collete Musanyera was named the best Arts Reporter of the Year.\nOther winners from various sectors were equally excited about the recognition.\nOrganisers of the event said they aim to inspire others to reach their full potential in transforming communities.\nZim Community Trailblazers Awards’ Board Chairperson Dr Nigel Chanakira said, “We recognise that the greatest progress often occurs during times of adversity when challenges are transformed into opportunities. The awards celebrate the unique ability of Zimbabweans to rise above challenges and strive for excellence.”",
            "time": "20:35",
            "date": "01 Feb 2025"
        },
        {
            "title": "Mathendele Primary School commissioned",
            "href": "https://www.zbcnews.co.zw/mathendele-primary-school-commissioned/",
            "content": "Story by Providence Maraneli\nThe Second Republic’s commitment to the provision of quality education for its citizenry is on display after a new modern school, Mathendele Primary in Plumtree, was commissioned this Friday.\nAccording to the 2022 census, Plumtree town has experienced a rapid growth in development coupled with a relatively high population of children of the school-going age.\nIt further points out that of the estimated 20 000 people that live in the border town, each homestead has an average of four people, with two being children of school-going age.\nThe number of schools, however, did not meet the needs of this population, with Dingumuzi Primary School accommodating almost 2000 pupils.\nAs such, in line with the government’s commitment to provide quality education for all, Plumtree Town Council channeled devolution funds to the construction of a new school.\nPlumtree Town Secretary Mr Thembalami Nyoni said, “We noted the increase in population and the growth of the town and thought we should construct this school so that we provide quality education for our children. We used money from revenue collection and devolution funds.”\n“We as Plumtree Council are in full support of Vision 2030, where we are saying education for all by 2030. Our wish is to have a lot of schools here in Plumtree by 2030 so that we don’t have children who may fail to get a place in schools. We want all children to access education. We are open to investors in education so that we transform our area,” Plumtree Town Councillor Maxwell Washaya said.\nThe project, which gobbled US$198 000, joins a long list of new schools constructed in Matabeleland South, including Poli-Magama in Matobo, Jonsley Primary in Gwanda and Pezulu Primary School teachers quarters in Insiza, as the government commits to the provision of quality education to its citizenry.\n“The coming in of Mathendele decongest schools in this town, the ministry remains committed to fulfilling the potential of learners in the education sector, provision of better access and quality education to every pupil and this remains very key. By investing in schools, the government is investing in future leaders who will drive Zimbabwe to a prosperous economy,” Matabeleland Provincial Education Director Mrs Beatrice Manjere said.",
            "time": "20:35",
            "date": "01 Feb 2025"
        },
        {
            "title": "Zim sets 30 years minimum age for public service vehicle drivers",
            "href": "https://www.zbcnews.co.zw/zim-sets-30-years-minimum-age-for-public-service-vehicle-drivers/",
            "content": "Story by Fungai Jachi\nPublic transport operators have welcomed the gazetting of a Statutory Instrument which requires drivers of public service vehicles to be aged 30 and above, saying the move will curb road carnage and recklessness on the roads.\nIn a Government Gazette published this Friday, Transport and Infrastructural Development Minister, Honourable Felix Mhona confirmed the new regulations which state that public service vehicle drivers must be 30 years of age and have a minimum of five years driving experience.\nHowever, drivers aged between 25 and 30 who were already authorised to drive before the new regulation will be allowed to continue driving public service vehicles.\nThe new regulation has been welcomed by transporters, describing the move as a positive development in reducing road carnage.\n“When someone is 30 years old, they will be mature enough to understand the importance of protecting human life. This move has come at the right time as we look forward to do all we can to avoid accidents because most of them are because of human error,” Zimbabwe Passenger Transport Organisation’s secretary, Mr Wilfred Chibage said.",
            "time": "20:35",
            "date": "01 Feb 2025"
        },
        {
            "title": "Govt forges ahead with the implementation of people-centred development programmes",
            "href": "https://www.zbcnews.co.zw/govt-forges-ahead-with-the-implementation-of-people-centred-development-programmes/",
            "content": "Story by Memory Chamisa\nTHE Government is forging ahead with the implementation of people-centered development programmes to accelerate the country’s transformation to an empowered, modern, prosperous, and highly industrialised society by 2030.\nFrom the borehole sinking programme, construction of the temporary market to accommodate traders, and now the Presidential Vendors Fund launched this Friday, Musha Mukuru as Mbare is popularly known, has come out the biggest winner of the developmental trajectory being spearheaded by the Second Republic.\nThe Launch of the US$50 000 Presidential Vendors Fund is expected to uplift the livelihoods of vendors at zero percent interest.\nFor the beneficiaries, the initiative is set to ensure the competitiveness of their enterprises.\n“His Excellency has shown that he loves us people from Mbare. The various programmes he has implemented have eased the challenges we have faced before from water, workspace, and now the vendors’ fund at zero interest for that matter we really appreciate him,” said one beneficiary of the programme.\n“As youths, the President is on record saying go and make money and him providing us with the Vendors Fund has shown the confidence he has in us and this is going to make a huge impact and take youths away from drug and substance abuse,” added another.\n“Mbare has been one of those places that have been frowned upon and associated with all society’s ills but since the coming of the Second Republic the narrative has changed from residential to the business side and we are grateful to the President for giving us that dignity,” noted a resident.\nHanding over the fund to the ZANU PF leadership, Presidential Business Advisor Dr Paul Tungwarara reaffirmed the governments’ commitment to spurring development in communities for the attainment of Vision 2030.\n“The President is one leader who is committed to ensuring his people are prosperous from health, business-wise, and all the programmes he has implemented have ensured that livelihoods are sustained. Mbare has proved itself that it is a powerhouse and business evolves from here hence this fund will go a long way in ensuring vendors are capacitated and their businesses are sustained.\n“We know the fire that gutted the market last year affected many but we now have to look forward to the completion of the temporary structure that will ensure wares are safe and vendors have a conducive place to sell their wares too. The President has said if this money is put to good use he is going to add another US$50 000 to make it US$100 000 in the Fund.\nThe ZANU PF leadership noted the significance of the fund in propelling the growth of the SME sector in Mbare.",
            "time": "20:35",
            "date": "01 Feb 2025"
        },
        {
            "title": "Tragedy strikes in Harare’s Adelaide Park as young boy (11) drowns in abandoned pit",
            "href": "https://www.zbcnews.co.zw/tragedy-strikes-in-harares-adelaide-park-as-young-boy-11-drowns-in-abandoned-pit/",
            "content": "\n\nStory by Fairstars Mukungurutse\nPLAY-time ended tragically for an 11-year-old boy from Adelaide Park in Harare this Sunday after he drowned in a water-filled open pit that had been left unattended.\nThe deceased, Tanaka Makosa, was in the company of his friend when he slipped inside the water-filled pit.\n“I asked Tanaka to accompany me to Area 600. Upon our return, we passed through the water-filled pit and Tanaka said I want to test how deep the water is, that’s when he slipped inside. He called my name once before his whole body was submerged in water. That’s when I rushed to look for help,” a young boy who was with Tanaka narrated the ordeal.\nHelp came, but it was already too late to save the young boy.\n“When I heard a child had drowned, I quickly dashed to the spot, removed my clothes and went inside the water. My whole body was submerged in water because the pit was deep. I then managed to locate the child and carried him out of the water, but I noticed that we had already lost him,” a neighbour, Mr Japhet Chinganga said.\nHis mother, Mrs Mercy Taimo narrated her sad story.\n“I spent the greater part of the day with Tanaka and his friend here at home. I didn’t even notice the time they left home. I only became aware they were not home after my other son came running saying Tanaka had drowned. We then rushed to the spot and by the time we arrived, my child had been taken out of the water. We then drove to a nearby clinic, but unfortunately, it was too late.”\nAdelaid Park residents have raised concern over the open pits dotted across the area.\n“This is not the only pit in this area, there are a lot of holes dug by the quarry mine and we don’t even know why they are putting the lives of our children at risk,” a resident said.\n“We have little children and how are we supposed to ensure our kids are safe? Kids being kids, they love to explore,” voiced another.\n“Apart from these dangerous pits, our children are at risk of being run over by speeding trucks from the mine,” another stated.",
            "time": "20:35",
            "date": "01 Feb 2025"
        }
    ]
}