{
    "news": [
        {
            "title": "Junior Parliament set to open with govt reaffirming commitment to child participation",
            "href": "https://www.zbcnews.co.zw/junior-parliament-set-to-open-with-govt-reaffirming-commitment-to-child-participation/",
            "content": "Story by Memory Chamisa\nHARARE – THE government says it remains committed to including children in the decision-making processes that affect their lives.\nAs preparations for the official opening of the 33rd Junior Parliament in Mt Hampden gather momentum, an alumni dinner is set for this Wednesday evening to proffer guidance to the incoming members of the Junior Parliament.\nGiving an update of the official opening set for Friday, the Minister of Youth Empowerment, Development and Vocational Training, Honourable Tino Machakaire said since the establishment of the Junior Parliament in 1991, the gathering has become a strategic institution among the youth of Zimbabwe.\n“The government is committed to developing our young people into productive citizens and responsible leaders of tomorrow. The Ministry of Youth Empowerment, Development and Vocational Training as well as other stakeholders have continuously enhanced programmes that enable them to reach their full potential . It is worth noting that this year’s 33rd Session of the Junior Parliament will see the ascending of the former parliamentarians to a Junior Senate which enables continuity. This has enriched the quality and scope of debates within the August House,” he said.\nMinister Machakaire also said the Junior Parliament has not only served as a leadership development and advocacy platform, but also a vehicle through which representatives of young people from all provinces participate in the governance of Zimbabwe.\n“These young men and women are the duty leaders of tomorrow and it is imperative that their grooming starts now to prepare them. We are excited to be working with the Junior President who was recently elected and is also expected to announce his cabinet. The Second Republic continues to roll out programmes based on digital and other ICT-related platforms. As a result, more children now have access to a wide range of educational material and information.”\nPresident Emmerson Mnangagwa is expected to preside over the official opening this Friday, with junior parliamentarians aged between 12 and 18 representing their peers in each of Zimbabwe’s ten provinces.",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Electrification drive gains momentum as Soti Source mini-grid solar project nears completion",
            "href": "https://www.zbcnews.co.zw/electrification-drive-gains-momentum-as-soti-source-mini-grid-solar-project-nears-completion/",
            "content": "Story by Mercy Bofu-Matinha\nGUTU – THE Soti Source community in Gutu is set to benefit from a 160-kilowatt mini-grid solar project being implemented by government through the Rural Electrification Fund (REF).\nThe solar project is expected to provide electricity to key institutions including Tongogara Primary School, Soti Source Primary and Secondary Schools, Soti Source Clinic, the local business centre, churches, and various government offices.\nMembers of the community expressed gratitude for the development, citing long-awaited access to power as a major step toward socio-economic transformation.\n“We have lived here since 1981, and we are thankful to the Second Republic for prioritising development in this resettlement area. Through this project, our schools, clinic, and business centre will finally be electrified. Key services will now be more accessible and efficient,” one community member said.\nAnother resident noted that the availability of electricity would enhance rural industrialisation.\n“With electricity, we can now undertake projects like welding, carpentry, and small-scale irrigation. Our lifestyle will significantly improve, and science subjects and ICT learning will become possible at our schools.”\nAccording to the Provincial Manager for REF, Engineer Emmanuel Masendu, the project is almost complete.\n“The project is now 95 percent complete, and we expect to finalise all remaining work by the end of this month. The community should begin to benefit from the solar power starting next month,” he confirmed.\nSpecial Advisor to the President responsible for Monitoring Implementation of Government Projects, Cde Joram Gumbo visited the project site this Wednesday and applauded the initiative as part of government’s broader rural electrification thrust.",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Ex-inmate turns life around through ZPCS rehabilitation programme",
            "href": "https://www.zbcnews.co.zw/ex-inmate-turns-life-around-through-zpcs-rehabilitation-programme/",
            "content": "Story by Providence Maraneli\nGWANDA – THE Zimbabwe Prisons and Correctional Service (ZPCS)’s new rehabilitation thrust is bearing fruit, with a former inmate in Gwanda setting up a thriving business after release.\nArmed with iron rods, a driller, and protective goggles, Norman Ngwenya now spends his days productively at the Ntepe business centre in Gwanda, a far cry from his past as a prison inmate.\nHis story is one of redemption, resilience, and the power of second chances.\nThree years ago, Ngwenya was serving a custodial sentence for a sexual offence.\nWhile incarcerated at Gwanda Prison, he seized the opportunity to acquire welding skills through a training initiative spearheaded by the ZPCS.\nToday, Ngwenya operates a thriving welding business that is contributing meaningfully to his community.\n“I am extremely grateful to the ZPCS for equipping me with a skill I can now use to support myself and my family. I am able to weld various items, and business is going well,” Ngwenya said.\nMembers of the Ntepe community have commended the transformation they have witnessed in Ngwenya since his release.\n“In the past, we believed that once someone was convicted, they could not be reintegrated. But with Norman, we are witnessing a true transformation,” a community member said.\nWithin the walls of Gwanda Prison, more inmates are following a similar path.\nMatshitshi Khumalo and Kholwani Mazwi, both serving sentences, have taken up sculpting and artificial flower-making respectively, and hope to pursue their crafts upon release.\n“I am now engaged in sculpting using inexpensive materials, and you can see the beauty of what we are creating. I appreciate the knowledge being imparted to us,” Khumalo said.\n“I have learnt how to make artificial flowers, and I intend to turn this into a business once I am released,” Mazwi added.\nThe ZPCS has placed strong emphasis on rehabilitation and reintegration, with a deliberate focus on skills development to reduce recidivism.\nThe Officer in Charge at Gwanda Prison, Superintendent Ishmael Madzimbamuto said the department is proud of the positive outcomes.",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Hwange conservation model applauded by international wildlife fund",
            "href": "https://www.zbcnews.co.zw/hwange-conservation-model-applauded-by-international-wildlife-fund/",
            "content": "Story by Margaret Matibiri\nZIMBABWE’s wildlife conservation efforts have earned international praise, with the country being hailed as a regional model for sustainable environmental stewardship.\nChief Executive Officer of the International Fund for Animal Welfare (IFAW), Mr Azzedine Downes, who is currently visiting Zimbabwe, made the remarks during a media briefing held at Hwange National Park after touring the renowned wildlife sanctuary.\n“What has happened here in Hwange, andinZimbabwe as a whole, is a role model for many others. Next week, we will be meeting with traditional chiefs from Southern Africa and we brought them here to Zimbabwe so that they can see the progress that has been achieved,” said Mr Downes.\nHe noted that lessons drawn from Zimbabwe’s conservation model would be shared with other countries where IFAW operates, including Malawi and Zambia.\nMr Downes also expressed admiration for the country’s rich biodiversity, singling out Hwange as a destination of choice for wildlife tourism.",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Man survives lion attack near Victoria Falls",
            "href": "https://www.zbcnews.co.zw/man-survives-lion-attack-near-victoria-falls/",
            "content": "Story by Tichaona Kurewa\nVICTORIA FALLS – A 29-year-old man from the Woodlands Resettlement Area near Victoria Falls is lucky to be alive after surviving a brutal lion attack over the weekend.\nWhat began as an ordinary day for Metrod Tshuma quickly turned into a life-threatening ordeal.\nAt approximately 10 a.m. on Saturday, Tshuma heard shouting, barking dogs, and the unmistakable roar of a lion near the community’s cattle grazing area.\n“I heard people shouting and dogs barking. I ran out and heard a lion roaring where our cattle graze, so I ran to meet my colleagues to try and scare it away,” said Tshuma.\nAlongside several others, he attempted to approach the danger, but the lion ambushed him from behind.\n“It went into a thicket close to where I was, with my colleagues behind me. The lion came from my back and attacked me,” he recounted.\nThe lion bit off his thumb and clawed his head and hand.\nInjured and bleeding, Tshuma stumbled toward a tree and cried for help.\n“I managed to escape by pushing it away. I cried out, injured and in pain, later my colleagues came to rescue me.”\nTshuma was rushed to Victoria Falls Hospital, where he remains under medical care, nursing deep wounds.\n“I thank the almighty God for protecting me because I was going to be killed by that lion,” he said.",
            "time": "06:46",
            "date": "19 Jun 2025"
        }
    ]
}