{
    "news": [
        {
            "title": "Wetlands protection policies boost rural livelihoods",
            "href": "https://www.zbcnews.co.zw/wetlands-protection-policies-boost-rural-livelihoods/",
            "content": "Story by Theophilus Chuma\nRural communities are leveraging on wetlands to power their productivity and sustain livelihoods.\nThis comes as a result of the effective implementation of the Zimbabwe National Wetlands Policy and Wetlands Management Guidelines.\nThe rehabilitation of wetlands is assisting to build resilience against climate change in rural communities, providing an essential source of livelihood for thousands of families.\nSmall holder farming ventures such as the Kasibo garden in Hwange, is one among many examples where communities are benefitting from the sustainable use of natural ecosystems.\nNewton Murimbika from the Makonde area, looks at the protection of wetlands as an essential component to the survival of humanity.\n“Wetlands are good for us, they provide essential support to the survival of our crops and livestock,” Murimbika said.\nThis is a sentiment shared by many within the community.\nMakonde Ward 4 Councillor Anyway Murisa said, “Wetlands are very important for us because they will even protect our biodiversity. That way they play a very crucial role even in the rainfall cycle.”\nEnvironmental protection and resilience is one of the priority areas under the Second Republic, with government implementing the Zimbabwe National Wetlands Policy and Wetlands Management Guidelines of 2022.\nEnvironmental Management Agency (EMA)’s Education and Publicity Manager Ms Amkela Sidange said, ” We are looking at wetlands as a vital component of the ecosystem. We are saying wetlands become part of the solution to the current challenges of pollution, biodiversity loss and climate change.”\n“The World Wetlands Day is a very important day. This gives us an opportunity to raise awareness on the protection of wetlands. We need to look at protecting our wetlands so that we can have access to water. Otherwise we will be helping climate change by destroying them,” Monavale Vlei’s Manager Ms Dorothy Wakeling said.",
            "time": "06:37",
            "date": "04 Feb 2025"
        },
        {
            "title": "Collaborative effort brings much-needed healthcare assistance to Mt Darwin",
            "href": "https://www.zbcnews.co.zw/collaborative-effort-brings-much-needed-healthcare-assistance-to-mt-darwin/",
            "content": "Story by Tapiwa Machemedze\nThe Mt Darwin community is on cloud nine after the ZANU PF leadership adopted a multi-stakeholder approach to boost healthcare facilities, with five health centres receiving an assortment of goods to improve service delivery.\nThe Mount Darwin political leadership visited health facilities in the district, availing much-needed assistance in various forms to five clinics, mainly in previously marginalised areas.\n“I am happy our political leadership has visited Mutasa Clinic deep down here. We don’t often get visitors and this visit is a first of its kind,” a community member said.\nA nurse said, “We also got money to buy mattresses, blankets, and sheets to put at our waiting mothers shelter. We also got money to buy desks, chairs medicines, and 20 bags of cement to build toilets because our catchment covers 11 820 people but we only had 4 toilets for all the people.”\nHanding over donations, Mt Darwin Senator Dr James Makamba, who was accompanied by Mt. Darwin North Legislator Honourable Laban Munemo and Proportional representation legislator Honourable Elizabeth Shongedza, among other leaders, said supporting health institutions is key in fostering healthy lifestyles.",
            "time": "06:37",
            "date": "04 Feb 2025"
        },
        {
            "title": "ZBC shines at Zim Community Awards",
            "href": "https://www.zbcnews.co.zw/zbc-shines-at-zim-community-awards/",
            "content": "Story by Fungai Jachi\nTHE Zimbabwe Broadcasting Corporation (ZBC) stole the lime light at the 5th edition of the Zim Community Trailblazers Awards held in Harare Friday night after scooping three awards in recognition of the national broadcaster’s contribution to community development.\nIt was a night to remember for the national broadcaster after it was honoured for its programming that is having a positive impact in communities.\nRadio Zimbabwe, commonly known as Nhepfenyuro Yevanhu/Umsakazo Wabantu, scooped a Hall of Fame Award, while one of the station’s top producer/presenters Rutendo Makuti received recognition for her sterling work through the programme “Ruoko Runopa”.\n“It is overwhelming to be recognised for the work that we are doing. We will continue to do our best to provide relevant content to our listeners,” Radio Zimbabwe station manager Siphelani Chikwape said.\n“I feel blessed to have been honoured in this way. It shows that the programme is receiving an overwhelming response and it is always good to help others,” Makuti said.\nZBC News Reporter Collete Musanyera was named the best Arts Reporter of the Year.\nOther winners from various sectors were equally excited about the recognition.\nOrganisers of the event said they aim to inspire others to reach their full potential in transforming communities.\nZim Community Trailblazers Awards’ Board Chairperson Dr Nigel Chanakira said, “We recognise that the greatest progress often occurs during times of adversity when challenges are transformed into opportunities. The awards celebrate the unique ability of Zimbabweans to rise above challenges and strive for excellence.”",
            "time": "06:37",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mathendele Primary School commissioned",
            "href": "https://www.zbcnews.co.zw/mathendele-primary-school-commissioned/",
            "content": "Story by Providence Maraneli\nThe Second Republic’s commitment to the provision of quality education for its citizenry is on display after a new modern school, Mathendele Primary in Plumtree, was commissioned this Friday.\nAccording to the 2022 census, Plumtree town has experienced a rapid growth in development coupled with a relatively high population of children of the school-going age.\nIt further points out that of the estimated 20 000 people that live in the border town, each homestead has an average of four people, with two being children of school-going age.\nThe number of schools, however, did not meet the needs of this population, with Dingumuzi Primary School accommodating almost 2000 pupils.\nAs such, in line with the government’s commitment to provide quality education for all, Plumtree Town Council channeled devolution funds to the construction of a new school.\nPlumtree Town Secretary Mr Thembalami Nyoni said, “We noted the increase in population and the growth of the town and thought we should construct this school so that we provide quality education for our children. We used money from revenue collection and devolution funds.”\n“We as Plumtree Council are in full support of Vision 2030, where we are saying education for all by 2030. Our wish is to have a lot of schools here in Plumtree by 2030 so that we don’t have children who may fail to get a place in schools. We want all children to access education. We are open to investors in education so that we transform our area,” Plumtree Town Councillor Maxwell Washaya said.\nThe project, which gobbled US$198 000, joins a long list of new schools constructed in Matabeleland South, including Poli-Magama in Matobo, Jonsley Primary in Gwanda and Pezulu Primary School teachers quarters in Insiza, as the government commits to the provision of quality education to its citizenry.\n“The coming in of Mathendele decongest schools in this town, the ministry remains committed to fulfilling the potential of learners in the education sector, provision of better access and quality education to every pupil and this remains very key. By investing in schools, the government is investing in future leaders who will drive Zimbabwe to a prosperous economy,” Matabeleland Provincial Education Director Mrs Beatrice Manjere said.",
            "time": "06:37",
            "date": "04 Feb 2025"
        },
        {
            "title": "Zim sets 30 years minimum age for public service vehicle drivers",
            "href": "https://www.zbcnews.co.zw/zim-sets-30-years-minimum-age-for-public-service-vehicle-drivers/",
            "content": "Story by Fungai Jachi\nPublic transport operators have welcomed the gazetting of a Statutory Instrument which requires drivers of public service vehicles to be aged 30 and above, saying the move will curb road carnage and recklessness on the roads.\nIn a Government Gazette published this Friday, Transport and Infrastructural Development Minister, Honourable Felix Mhona confirmed the new regulations which state that public service vehicle drivers must be 30 years of age and have a minimum of five years driving experience.\nHowever, drivers aged between 25 and 30 who were already authorised to drive before the new regulation will be allowed to continue driving public service vehicles.\nThe new regulation has been welcomed by transporters, describing the move as a positive development in reducing road carnage.\n“When someone is 30 years old, they will be mature enough to understand the importance of protecting human life. This move has come at the right time as we look forward to do all we can to avoid accidents because most of them are because of human error,” Zimbabwe Passenger Transport Organisation’s secretary, Mr Wilfred Chibage said.",
            "time": "06:37",
            "date": "04 Feb 2025"
        }
    ]
}