{
    "news": [
        {
            "title": "47 murder cases reported between 20 and 26 December 2024",
            "href": "https://www.zbcnews.co.zw/47-murder-cases-reported-between-20-and-26-december-2024/",
            "content": "Story by Peter Chivhima\nThe country continue to witness an alarming surge in violence, with 47 murder cases reported across the country between December 20 and 26 this year.\nThe disturbing statistics were confirmed by Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, in a statement released on Friday evening.\nAccording to Commissioner Nyathi, most murder cases resulted from disputes at social gatherings during Christmas celebrations, often triggered by excessive beer drinking.\nAdditionally, attacks by unknown suspects, particularly on individuals walking alone at night, contributed to the high number of murders.\nThe ZRP also attributed the rise in murder cases to conflicts over love relationships.\nAmong the disturbing cases is one of Mastard Chauke, aged 22, who is now facing a murder charge for allegedly killing Ostern Mangaru (29) on Christmas Day, with a stone during a beer-fuelled dispute in Mwenezi.\nLearnmore Mudzengi (36) of Shurugwi is also in trouble over allegations of stabbing his brother, Sydney Mudzengi (21) to death following a misunderstanding at Musavezi Business Centre in Shurugwi.\nIt is alleged the conflict arose over a missing pool token.",
            "time": "21:04",
            "date": "28 Dec 2024"
        },
        {
            "title": "77 people killed in more than 1 000 accidents",
            "href": "https://www.zbcnews.co.zw/77-people-killed-in-more-than-1-000-accidents/",
            "content": "Story by John Nhandara\nThe Zimbabwe Republic Police (ZRP) has reported a surge in fatalities on the country’s roads, with 77 people losing their lives in over 1 000 traffic accidents recorded during the 12-day period from the 15th to the 26th of December.\nPolice spokesperson, Commissioner Paul Nyathi said while fatalities increased, the total number of accidents recorded declined, compared to the same period last year.\n“We recorded 1211 road traffic accidents 65 fatal accidents, with 77 people being killed. 401people were injured,” he said.",
            "time": "21:04",
            "date": "28 Dec 2024"
        },
        {
            "title": "Zimbabwe students excel in Cambridge examinations",
            "href": "https://www.zbcnews.co.zw/zimbabwe-students-excel-in-cambridge-examinations/",
            "content": "Story by Wellington Makonese\nThe wave of academic excellence continues to sweep across the country as demonstrated by outstanding results in the recently-released Cambridge Primary Checkpoint Results.The results, released earlier this month, reveal sweeping pass rates across various subjects with most schools that include Samuel Centenary Junior School, Havard Junior School and St Martins Allure Elementary clocking 100% pass rates.\nAmong them is wizkid Rugare Mutendi, whose exceptional performance has ignited dreams of a future in medicine.\n“I’m super excited about my achievement and now looking forward to do sciences at a better level and be a doctor the exams where quite decent,” Rugare says.\nThe consistent performance over the years highlights the dedication and strength of Zimbabwe’s education system.",
            "time": "21:04",
            "date": "28 Dec 2024"
        },
        {
            "title": "15 Regional and Residential Courts established in 2024",
            "href": "https://www.zbcnews.co.zw/32727-2/",
            "content": "Story by Peter Chivhima\nThe Judicial Service Commission (JSC) managed to set up 15 Regional and Residential Magistrate Courts this year as part of the drive to bring justice delivery closer to people’s door steps.\nJSC Secretary Mr Walter Chikwana speaks on the strides realised in justice delivery this year.\n“In 2024 the success has been unprecedented because we have never done it since the inception of the Judicial Service Commission in 2010. We have opened and established new regional magistrates in Guruve, Mutoko, Kwekwe, Zvishavane. The other four are already functional except for Guruve where we are now finalising and working on the logistical areas so that we have proper infrastructure that will house the regional court. So our numbers of regional magistrates have increased in that respect. We have also established close to 10 resident magistrates courts within the country. We have established a resident magistrate court in Mabvuku where again we are going to open a regional magistrate there. We have since commenced construction of the courthouse in Mabvuku and we are quite certain that during the course of the year the courthouse will be ready to be opened,” he said.",
            "time": "21:04",
            "date": "28 Dec 2024"
        },
        {
            "title": "Roofing almost complete at Mbare Musika temporary market project",
            "href": "https://www.zbcnews.co.zw/roofing-almost-complete-at-mbare-musika-temporary-market-project/",
            "content": "Story by Memory Chamisa\nThe project to construct a temporary market to accommodate traders affected by a fire that razed Mbare Musika in October is on course, with the structure now at roofing level.\nThe construction works which began early this month have brought hope, with the residents near the construction site expressing satisfaction with the ongoing work.",
            "time": "21:04",
            "date": "28 Dec 2024"
        }
    ]
}