{
    "news": [
        {
            "title": "Harare’s persistent drainage crisis: A call for accountability amidst the rains",
            "href": "https://www.zbcnews.co.zw/harares-persistent-drainage-crisis-a-call-for-accountability-amidst-the-rains/",
            "content": "Story by Memory Chamisa\nAS the rains pour down over Harare, the city’s residents have long welcomed the much-needed relief from the dry spell, however, alongside the refreshing showers comes the familiar sight of flooding, caused not by the intensity of the rains but by the persistent failure of the city’s drainage systems.\nMotorists and pedestrians find themselves navigating impassable streets, as clogged drains become a significant source of frustration and danger.\nFor years, Harare has faced the same story every rainy season: the city’s stormwater drains, once intended to carry away rainfall, are instead choked with debris, waste, and neglect.\nThis recurring problem is a stark reminder of the Harare City Council’s ongoing shortcomings, particularly in its preparation for the rains, despite the evident need for timely action, the local authority’s inability to address the drainage issue has now become a permanent feature of the rainy season.“This has become a perennial issue, Harare was once clean and organized, now, it feels like a disaster zone. The council must do better,” one frustrated citizen said.\n“This is not just an inconvenience, it is a serious hazard. The city council must act urgently to restore Harare’s glory and fix the drainage system,” another echoed the same frustrations.\n“Drainage in the CBD is a critical issue requiring immediate attention. Workers must ensure that debris removed from blocked drains is properly disposed of at the Pomona Dumpsite or other appropriate locations. Poor workmanship is often a problem, and many broken drainage systems need reconstruction using bricks and cement.\nHarare Mayor His Worship Jacob Mafume acknowledged the challenge.",
            "time": "09:29",
            "date": "24 Feb 2025"
        },
        {
            "title": "Commuters suffer when ‘kombis’ play cat and mouse with local authorities",
            "href": "https://www.zbcnews.co.zw/commuters-suffer-when-kombis-play-cat-and-mouse-with-local-authorities/",
            "content": "Story by Memory Chamisa\nCOMMUTER omnibus passengers and pedestrians are raising concerns about reckless driving by omnibus drivers, who are jeopardising their safety while evading arrest on the roads.\nThe ongoing cat-and-mouse games between local authorities and commuter omnibus operators have left passengers as the primary victims of this situation.\nSome drivers are going to extreme lengths to avoid capture, including jumping out of moving vehicles and leaving passengers stranded and frightened on board.\nPassengers are now urging both the operators and local authorities to collaborate on a solution that prioritises their safety.\n“This issue has gone out of hand and both the police and commuter omnibus drivers need to solve it. We are at risk as the driver sometimes drives off with a passenger disembarking or worse still trying to get on board,” a citizen said.\n“These cat and mouse games have resulted in many injuries and no one is held accountable when it happens, they all leave and the injured one foots the bill on their own,” another added.\nTransport operators have weighed in saying the local authorities must not chase after commuter omnibus drivers but should take the offence through the associations they are registered with.",
            "time": "09:29",
            "date": "24 Feb 2025"
        },
        {
            "title": "Bindura residents fear mine spillage contamination",
            "href": "https://www.zbcnews.co.zw/bindura-residents-fear-mine-spillage-contamination/",
            "content": "Story by Tapiwa Machemedze\nA sudden surge of water from Ran Mine in Bindura caused alarm among residents of Chipadze Friday morning, raising concerns about contamination and potential health risks.\nHeavy rains that fell on Bindura Thursday night led to unexpected chaos as floodwaters overflowed into homes and churches in Chipadze.\nWhen ZBC News arrived at the scene, the water had receded, but residents were still reeling from the shock of the flooding. Many expressed concerns about contamination since the water originated from the nearby Ran Mine.\n“This happened at around 3 am when the water came from the mine, flowing down their dam, it filled the church and then got into some of the houses. Now we do not understand what this is,” a concerned resident said.\n“We were surprised when we saw water flowing from Ran Mine. We woke up and went and told them water was flowing from their dam, kindly asking them for a solution.\n“We have stayed here for so many years and never encountered such a problem, it is their water, they should correct this situation, where will we get drinking water? How will we bath?”\nRan Mine’s Corporate Affairs Manager, Mr Jack Murehwa, alleviated concerns about potential chemical contamination, stating that the mine is situated on a hill and that the water mainly comes from run-off.\nHe added that tests have been conducted, confirming no contamination has been found.\nThe Environmental Management Agency (EMA) Provincial Environment and Publicity Officer, Mr Maxwell Mupotsa, mentioned that the agency is collaborating with relevant stakeholders to address safety concerns effectively.",
            "time": "09:29",
            "date": "24 Feb 2025"
        },
        {
            "title": "Zimbabwe recognised for education excellence in Morocco",
            "href": "https://www.zbcnews.co.zw/zimbabwe-recognised-for-education-excellence-in-morocco/",
            "content": "Story by Farai Gwaze\nZIMBABWE, through the University of Zimbabwe (UZ), has been honored for its transformative contributions to education on the African continent at this year’s African Leadership Magazine Awards, held in Casablanca, Morocco.\nUZ was recognised for its significant role in enhancing research capacity, fostering industry incubation, and promoting research that links academic initiatives to industry needs across Africa.\n“Most of the nominations were done by our readers. It is a three-step process, we look at the nominations and schedule them for a pole, we were surprised that the University of Zimbabwe was tops in this, amidst other universities in Africa,” African Leadership Magazine Chairperson and publisher, Dr Ken Giami said.\n“I want to say kudos to their research capacity, industry incubation and research to industry linkages. These are some of the reasons why this award was given.”",
            "time": "09:29",
            "date": "24 Feb 2025"
        },
        {
            "title": "Calls made for a multi-sectoral approach to mitigate effects of climate change",
            "href": "https://www.zbcnews.co.zw/calls-made-for-a-multi-sectoral-approach-to-mitigate-effects-of-climate-change/",
            "content": "\nStory by Tamuka Charakupa\nTHERE is a growing call for a multi-sectoral approach to address the negative effects of climate change, with the Church pledging its full support for this initiative.\nThe Roman Catholic Church in Chinhoyi recently joined the fight against climate change, emphasising the need for a comprehensive societal effort to protect the environment.\nAs part of this commitment, the church launched a tree-planting initiative aimed at promoting environmental sustainability.\n“We have organised this event to share among church followers, particularly students, the importance of environmental conservation,” Priest, Father Peter Paul said.\n“Pope Francis in his encyclical letter clearly states that climate change is a serious moral issue, driven by human activity, and demands urgent action to protect the Earth and its most vulnerable inhabitants. He has consistently called for global leaders to take concrete steps to address climate change, criticising irresponsible lifestyles while prioritising the needs of the poor in the fight against environmental degradation.\n“As young people, we have the mandate to protect our environment through engaging in actions that do not contribute towards climate change. We should plant more trees and avoid littering the environment.\n“Nature provides solutions to our daily needs be it food, medicine, ecosystem, etc and without proper and safe practices we are on the verge of destroying everything including humanity.”\nMakonde District Forestry Officer Mr Wisdom Nduku revealed the district has surpassed its 5 000 indigenous tree planting target.",
            "time": "09:29",
            "date": "24 Feb 2025"
        }
    ]
}