{
    "news": [
        {
            "title": "Zim celebrates International Children’s Day of Broadcasting with young talent at ZBC Studios",
            "href": "https://www.zbcnews.co.zw/zim-celebrates-international-childrens-day-of-broadcasting-with-young-talent-at-zbc-studios/",
            "content": "\nStory by Fungai Jachi\nZIMBABWE joined the global community in commemorating the International Children’s Day of Broadcasting, with children getting an opportunity to showcase their talents at the Zimbabwe Broadcasting Corporations Pockets Hill and Montrose studios.\nThese are the voices of the future, and this Sunday, the young participants eagerly assumed various roles, showcasing their talents and sharing their perspectives on the importance of the International Children’s Day of Broadcasting-ICDB.\n“It was exciting to be here as we got to appreciate what its like being in the media, we got a chance to share our views and that is important. It was fun and we need more of these opportunities,” child participants said.\nZBC TV Children’s Programming Producer, Adiola Chiyangwa, highlighted the national broadcaster’s commitment to empowering children through its programming.",
            "time": "08:42",
            "date": "03 Mar 2025"
        },
        {
            "title": "Senator Dr James Makamba donates resources health institutions in Mount Darwin",
            "href": "https://www.zbcnews.co.zw/senator-dr-james-makamba-donates-resources-health-institutions-in-mount-darwin/",
            "content": "Story by Tapiwa Machemedze\nA total of 17 health institutions in Mount Darwin have received resources from Senator Dr James Makamba’s health facilities initiative, aimed at complementing government efforts.\nOn Saturday, seven clinics in the area became the latest beneficiaries of donations from Senator Makamba, which included consumables and cash worth nearly US$20 000.\nThe initiative, launched on the first of January this year, aims to support 28 health institutions in the senatorial constituency. Stakeholders, including traditional leaders, government officials, war veterans, and ruling party members, commended the efforts, emphasising the importance of community contributions to development.\n“I encourage us to unite and join hands with our President in this program being done by our Senator. He is doing a good programme and this job is going on well. What is being done encourages unity of purpose, self-reliance is what is required. For example, if a roofing sheet is damaged on our roof, let us repair it while we wait for government interventions,” Mount Darwin War Veterans Chairman, Cde Andrew Chikukwa said.\n“I am very happy we have been visited by our Senator, we feel very happy we have development in the area. We have our ruling party which raised us so I am happy that we are developing,” Chief Madziwa added.\n“This programme being carried out by our senator is very good for the district. He is helping our clinics and the community so that areas get what they need. He is leaving money and consumables which is supporting the government’s mandate. He is reminding people that a country is built by its people,” Mt Darwin District Development Coordinator Mr White Nkoma weighed in.",
            "time": "08:42",
            "date": "03 Mar 2025"
        },
        {
            "title": "Govt pledges media sector growth, stresses importance of operating within the law",
            "href": "https://www.zbcnews.co.zw/govt-pledges-media-sector-growth-stresses-importance-of-operating-within-the-law/",
            "content": "Story by Memory Chamisa\nTHE government has reaffirmed its commitment to the media sector transformation but warned players to always operate within the confines of the law.\nSpeaking on the sidelines of the third anniversary of a local broadcasting media house in Harare this Friday, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere said, that while media freedom is fully guaranteed in Zimbabwe, advocating for the overthrowing of a legitimate government is unconstitutional.\n“The government says the media has no room to fuel the overthrowing of a legitimate government. As the nation journeys towards Vision 2030, it is important to appreciate and understand the constitutional obligations particularly Section 61 and Section 62 of the Constitution of Zimbabwe,” Dr Muswere said.\n“Section 61 of the Constitution is clear in terms of the freedom of expression and the freedom of media and Section 62, also speaks to access to information. We should also be very clear in terms of the supreme law of the country, the right to broadcast the overthrowing of a legitimate and democratic government does not exist in our Constitution. The media freedom, the freedom of expression that we have should always be guarded jealously and we should always protect our journalists.”\nMinister Muswere also said the Zimbabwe Media Commission and the Ministry will continue to work together with members of the fourth estate to give direction for the nation’s development as witnessed by the opening up of airwaves.",
            "time": "08:42",
            "date": "03 Mar 2025"
        },
        {
            "title": "Illegal mining causes major crack in Zvishavane’s Novale Road, raising safety concerns",
            "href": "https://www.zbcnews.co.zw/illegal-mining-causes-major-crack-in-zvishavanes-novale-road-raising-safety-concerns/",
            "content": "Story by Courage Bushe\nA portion of Zvishavane’s Novale road has developed a huge crack due to illegal mining activities, a worrying development that has raised safety concerns among the travelling public and residents.\nIn the National Development Strategy One (NDS1) blueprint, mining has been identified as a key accelerator to Vision 2030, however, illegal mining activities are hindering progress.\nZvishavane District Development Coordinator, Mr Darlington Chokera condemned illegal mining activities, occurring around residential areas and public infrastructures, saying concerted efforts are needed to curb the scourge.",
            "time": "08:42",
            "date": "03 Mar 2025"
        },
        {
            "title": "Woman kills hubby over infidelity",
            "href": "https://www.zbcnews.co.zw/woman-kills-hubby-over-infidelity/",
            "content": "Story by Thembinkosi Mangena\nTragedy rocked Mabvuku community in Harare after a woman allegedly stabbed her 43-year-old husband following accusations of infidelity.\nWhen the ZBC News crew arrived at the scene of the crime, the body of the deceased, Duncan Chiwaya had just been taken by the police and relatives were left cleaning blood stains in the house.\nA visibly distraught mother, Janet Dumbu, was at a loss for words after the death of her son Chiwaya.\n“I knew nothing about their marital problems and I was only shocked to be called to see my son lying in a pool of blood, with my daughter-in-law beside the body,” she said.\nA neighbour, Ellen Luundi, who was playing the role of an aunt in the couple’s marriage, confirmed the two had been having problems.\n“They have been having problems. The wife accused Chiwaya of infidelity. Last week she had packed her bags with the intention of quitting the marriage and I helped them reconcile. Then I woke up to see missed calls from the husband, and when I tried to call back it was too late, a child was at my door knocking to tell me about this tragic event,” she said.\nThe incident has left the neighbourhood shell-shocked.\n“This is painful, why do people kill each other when they have problems in marriage?” a community member asked.\n“It is better to walk out of a toxic marriage than killing each other, I am pained by the loss,” another community member said.",
            "time": "08:42",
            "date": "03 Mar 2025"
        }
    ]
}