{
    "news": [
        {
            "title": "Selukwe Chrome High School classroom block commissioned",
            "href": "https://www.zbcnews.co.zw/selukwe-chrome-high-school-classroom-block-commissioned/",
            "content": "Story Tafara Chikumira, Midlands Bureau Chief\nTHE Government continues to improve learning conditions for students by constructing classroom blocks and availing Information Communication Technology (ICT) gadgets across the country.\nSelukwe High School in the Midlands province was the place to be this Thursday as the government commissioned a classroom block and distributed ICT gadgets, some of which were made available by development partners.\n“We are very excited as parents at Selukwe High. The Block has been on the cards for quite some time now and its completion is a huge relief to us. Children were overcrowded in a situation that was making the learning process a toll order. Now we can safely say our children can learn in a friendly environment,” SDA chair for Selukwe Chrome High School, Mrs Eunice Kokai.\nThe Second Republic’s engagement and reengagement efforts are also bearing fruit with World Vision donating one thousand 100 tablets, while Unki Mine donated 22 digital learning instruments for schools in the province to enhance interactive learning and access to digital educational content.\n“My school is one of the schools in remote areas. Heritage-based learning requires ICT gadgets. The gadgets we have here will help even in the pass rate of the school as our children can now compete with their peers in urban areas. We have indeed managed to achieve some positive development with the help of our government,” Totonga Primary School Head Mr Tauya Gova.\n“As students, we were failing to realize our full potential. Some of us might be good at ICTs but fail to get the necessary exposure. The ICT gadgets will go a long way in identifying future ICT gurus.”\nThe government is excited by the progress which is in line with the Second Republic’s vision 2030.\n“By investing in education and infrastructure, we are not only addressing current needs but also laying the groundwork for future generations.\n“This vision underscores the commitment to inclusivity, ensuring that marginalized and disadvantaged communities are given the support they need to participate fully in society. Through initiatives like the STEP-UP programme, we are actively working to bridge gaps in access and quality, empowering every child to reach their full potential,” the Minister of Primary and Secondary Education Honourable Torerai Moyo.",
            "time": "08:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Riverbed miners destroy Inyankuni bridge",
            "href": "https://www.zbcnews.co.zw/riverbed-miners-destroy-inyankuni-bridge/",
            "content": "Story by Providence Maraneli\nZIMBABWEANS have been urged to take a proactive approach in the fight against riverbed mining following the destruction of Inyankuni Bridge that links Insiza and Umzingwane districts by illegal miners.Motorists are the most affected as they now have to wait for the mighty Umzingwane River to recede as the bridge was destroyed, but the Umzingwane – Nyankuni confluence is not the only illegal mining site that has troubled authorities, with West Nicholson in Gwanda and Nugget in Matobo being some of the hotspots.“We are really concerned by the rampant alluvial mining in our rivers, especially in Umzingwane and Nugget in Matobo, they use chemicals that are dangerous to the environment and what worries us the most is the impact that it has had on the flow of rivers, and our dams are not filling up even with these rains,” Environmental Management Agency(EMA) Provincial Manager, Mr Decent Ndlovu said.\n“Umzingwane, Gwanda, and Matobo arę districts that have really been affected, and what we have said is that when the gold rush is done, it is the districts that will rehabilitate the areas, so I think we should take a pro-active approach, and have officers monitoring these areas even outside what the EMAs say because we bear the burden,” Acting Director Local Government Mr Jusa Zachariah added.\nThe rampant destruction of critical infrastructure and hampering of the flow of water to major dams that supply water to Bulawayo; Inyankuni, Mayfair, Upper and Lower Ncema, and Mtshabezi has drawn the attention of the government.",
            "time": "08:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Harare City Council admits to financial mismanagement",
            "href": "https://www.zbcnews.co.zw/harare-city-council-admits-to-financial-mismanagement/",
            "content": "Story by John Nhandara\nTHE Harare City Council has admitted financial mismanagement within the local authority, leading to poor service delivery.\nHarare City Council Mayor Councillor Jacob Mafume appeared before the Commission of Inquiry into the state of affairs at the local authority, where he revealed a lack of financial accountability due to the absence of an enterprise resource planning system.\n“There is an absence of an electronic resource planning (ERP). The chasing away of enterprise resource package in 2019 at the recommendation of management has resulted in the City Council not managing to produce audited accounts.\n“ERP is the only tool the auditor general and management can verify accounts hence management conspired to get rid of ERP,” Mayor Mafume said.“The books of accounts are done manually, which means documentation can be changed and very difficult to chase.”\nCouncillor Mafume admitted financial mismanagement within the city council’s operations is contributing to a marked decline in service delivery across the capital.",
            "time": "08:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Stakeholders call for HCC councillors to resign",
            "href": "https://www.zbcnews.co.zw/stakeholders-call-for-hcc-councillors-to-resign/",
            "content": "Story by Bruce Chahwanda, Politica Editor\nHARARE City Council executives have been exposed for being incompetent, corrupt, and obsessed with hefty perks at the expense of ratepayers, who are contending with uncollected garbage while some residents have gone for more than a decade without running water.\nThe setting up of the Justice Maphios Cheda-led commission to look into the operations of the City of Harare has unearthed maladministration, massive corruption, nepotism, and plunder of resources by council officials.\nThis comes at a time when service delivery is deteriorating, with garbage not being collected, while roads are becoming impassable each day despite the Harare City Council getting devolution funds from the central government.\nTown planner, Engineer Jacob Mutisi said a dissolution of the council is the only way forward to ensure residents have value for their money.\n“This expose warrants heads of the council to resign to pave the way for new leaders if the city is to attain world-class status. Massive corruption has exposed city fathers and the reasonable thing is to throw in the towel as they have failed to deliver on their mandate.”",
            "time": "08:37",
            "date": "26 Jan 2025"
        },
        {
            "title": "Government policies and framework lauded for high pass rate",
            "href": "https://www.zbcnews.co.zw/government-policies-and-framework-lauded-for-high-pass-rate/",
            "content": "Story by Wellington Makonese\nVision 2030 is in motion with government policies in the education sector delivering quality education after the construction of several facilities across the country which have also come with a marked improvement in examination results.\nZimbabwe has embarked on a remarkable journey in education from mud-walled schools to the rise of institutions of excellence, transformation that has empowered generations and fueled national aspirations.\nAccess to education expanded significantly, with schools being built across the country, providing learning opportunities to formerly marginalized areas.\nThese gains have also translated to positive academic results at all levels.\n“The government has done a lot since independence from policy which allows for expansion, competent teachers who are accepted abroad and everywhere,” said educationist, Mrs Yeukai Matsikarima.\nAnother educationist Mr Evermore Chakwizira, said “The advantages, this age is provision of adequate learning material at every corner of the country, adoption of new technologies and it’s provision are all part of government efforts to bolster our education.”\n“Now we have new policies that drive economic growth and innovation which is a major,” educationist, Dr Tapera Chikandiwa stated.\nGovernment noted that the gains being witnessed are a result of calculated interventions by both private and public entities.\n“We are very grateful to his excellence president Mnangagwa and his leadership for his vision of a brighter education system that transforms lives and the economy, ensuring that no one and no place is left behind, hence the programs to construct schools in all corners,” said the Deputy Minister of Primary and Secondary Education, Honorable Angeline Gata.",
            "time": "08:37",
            "date": "26 Jan 2025"
        }
    ]
}