{
    "news": [
        {
            "title": "National Multi-Faith Economic Dialogue ends with calls for Church inclusion in development",
            "href": "https://www.zbcnews.co.zw/national-multi-faith-economic-dialogue-ends-with-calls-for-church-inclusion-in-development/",
            "content": "Story by Oleen Ndori\nHARARE – THE two-day National Multi-Faith Economic Dialogue has ended with agreements to push the church’s participation in the country’s economic activities.\nAs part of its broader inclusive development thrust, the ruling ZANU PF party has been engaging religious stakeholders to ensure their participation in national economic activities.\nThe latest dialogue session, which brought together representatives from various faith-based organisations, ended with delegates pledging to support the government’s economic vision.\nBishop Nehemiah Mutendi affirmed the church’s active role in national growth.\n“As the church we are not listening in and observing, but we are taking part in this growth of the economy.”\n“The meeting was important in shaping and exchanging ideas in how the church can support Government vision,” Sheikh Ishmael Duwa said.\n“With empowerment we can strengthen community – government cooperation,” Luxod Mutova said.\n“As the church we applaud the inclusion of our voices in shaping the country’s economic outlook,” Apostle Biggy Mutazu said.\nThe Special Presidential Advisor, Dr Paul Tungwarara, says the inclusion of everyone feeds directly into the “leaving no one and no place behind” vision by President Emmerson Mnangagwa.\n“People from different churches are spread across all provinces. If they are empowered, we will see development across the entire country—including in remote areas. That is what the President wants: inclusive development involving everyone. He remains the President for all churches and he wants everyone to be involved in development,” he said.\nZANU PF National Political Commissar, Cde Munyaradzi Machacha, enunciated the goal of the interface in bridging the gap between government, the party, and interfaith groupings.\n“We had a productive two-day engagement between the party and various church and faith-based organisations. Our aim was to build bridges, so churches can better understand national development frameworks such as NDS1 and NDS2, and identify roles they can play to help achieve Vision 2030’s goal of becoming an upper-middle-income economy. We are encouraged that the message has been well received.”",
            "time": "21:46",
            "date": "09 Jul 2025"
        },
        {
            "title": "Seke villagers celebrate Bwoni Clinic completion",
            "href": "https://www.zbcnews.co.zw/seke-villagers-celebrate-bwoni-clinic-completion/",
            "content": "\nStory by Jerold Sasa\nSEKE – VILLAGERS in Seke communal area have applauded government for availing resources for the construction of Bwoni Clinic, thereby transforming health delivery in the area.\nPreviously forced to travel long distances to Kunaka Hospital in Dema or Charakupa Clinic, villagers are now enjoying convenient access to medical services, thanks to the newly completed clinic.\n“We are excited as people from Seke as we have been travelling long distances to seek medical services which has made life easier for them,” said one villager.\n“For us as women the provision of maternity services has come as a great relief since these services were available very far from our communities,” added another.\n“We thank government for availing resources under the devolution program which assisted us to complete the project,” Manyame RDC Chairperson, Councillor Ian Manyere said.\n“I commend the villagers who initiated this project resulting in the government coming on board,” Seke legislator,  Honourable Munyaradzi Kashambe.\nGovernment says it is committed to providing quality health delivery services to communities.\n“It is the position of government to ensure that people do not travel distances to seek medical services as no-one should travel more than 5km to a nearest health facility,” Minister of Local Government and Public Works, Honourable Daniel Garwe said.",
            "time": "21:46",
            "date": "09 Jul 2025"
        },
        {
            "title": "Govt liberalises maize trade as ZMX and GMAZ sign deal",
            "href": "https://www.zbcnews.co.zw/govt-liberalises-maize-trade-as-zmx-and-gmaz-sign-deal/",
            "content": "\nStory by Tendai Munengwa\nHarare – THE government policy to liberalise the trading of staple maize is on course, with the Zimbabwe Mercantile Exchange (ZMX) and Grain Millers Association (GMAZ) signing an agreement to buy grain from farmers under a competitive pricing system and paying them instantly.\nA new chapter in the grain marketing landscape was ushered in this Wednesday, as ZMX and GMAZ formalised an arrangement to operationalise the procurement of maize on a willing buyer, willing seller basis.\n“Today we make history by signing an enabling agreement that will fully operationalise our commodities exchange, ZMX, by committing to procure all maize that will be brought to it.\n“We anticipate massive trades starting in the next two weeks as the bulk of farmers are expected to start deliveries of maize. This MoU is a great departure from the practice of yesteryear where the fiscus had to intervene and shoulder the full burden of bringing maize to millers,” GMAZ Chairperson, Dr Tafadzwa Musarara.",
            "time": "21:46",
            "date": "09 Jul 2025"
        },
        {
            "title": "Industry and commerce endorse Zimbabwe’s skills retention agenda",
            "href": "https://www.zbcnews.co.zw/industry-and-commerce-endorse-zimbabwes-skills-retention-agenda/",
            "content": "Story by Stanley James, Business Editor\nHarare – ZIMBABWE’s Skills Retention Policy has received endorsement from the country’s industry and commerce sectors, with stakeholders committing to work hand-in-glove with institutions of higher learning to promote career development and economic growth.\nThe Zimbabwe Annual Career Development Conference provided a platform for government, tertiary institutions, and the private sector to engage on strategies aimed at addressing the skills gap and enhancing employment creation.\nWith Zimbabwe having experienced significant brain drain over the years, stakeholders agreed that identifying labour market trends is key to sustaining jobs in strategic sectors.\n“This meeting is very pivotal in shaping the skills development agenda. So the partners are of the view that the future of the economy will largely depend on creating self-employment opportunities and focusing on how the skills retention can be sustained,” CEO of the National Blood Service Zimbabwe, Ms Lucy Marowa said.\n“Career development is the hallmark of economic growth, taking into account the macroeconomic trajectory that has seen productive sectors working with institutions of higher learning in capacity building and partnerships with industry and commerce. This is the gateway to finding each other on the key aspects of sustaining the needs of the labour markets around the country,” Executive Director of the Institute of Career Development Zimbabwe, Mr Lovemore Tsvangira.",
            "time": "21:46",
            "date": "09 Jul 2025"
        },
        {
            "title": "ZDF reaffirms commitment to women empowerment and inclusion",
            "href": "https://www.zbcnews.co.zw/zdf-reaffirms-commitment-to-women-empowerment-and-inclusion/",
            "content": "Story by Peter Chivhima\nHARARE – THE Zimbabwe Defence Forces (ZDF) has reiterated its commitment to promoting women’s empowerment and embracing diversity within its ranks.\nDirector General Administration in the Air Force of Zimbabwe, Air Commodore Morris Mujikwa, presided over a graduation ceremony of 40 non-commissioned officers at Manyame Air Force Base in Harare this Wednesday.\nAir Commodore Mujikwa implored the graduating officers to be exemplary leaders and use the knowledge acquired to develop their respective institutions and serve the nation with honour.\n“The course drew participants from the Zimbabwe Defence Forces, the Zimbabwe Republic Police, and the Zimbabwe Prisons and Correctional Service, reflecting inter-agency collaboration in national security and leadership development,” Air Commodore Mujikwa said.\n“This was an eye-opener and we learnt a lot,” Master Sergeant Rumbidzai Tayali said.\n“We learnt a lot, and we are going to use the knowledge gained for the development of our nation as well as the security and defence of our country,” Master Sergeant Shamiso Mahaso said.",
            "time": "21:46",
            "date": "09 Jul 2025"
        }
    ]
}