{
    "news": [
        {
            "title": "Old Gwanda Road project kicks off",
            "href": "https://www.zbcnews.co.zw/old-gwanda-road-project-kicks-off/",
            "content": "\nStory by Providence Maraneli\nThe construction of 42 homesteads for villagers who will be affected by the Old Gwanda Road project has started.\nA hindrance to the US$150 million road project, which will change the landscape of Matabeleland South, was the displacement of villagers along the road. However, the issue has been addressed.\nThe contractor of the project, Zwane Enterprises, signed concession agreements with the government through the Ministry of Transport and Infrastructural Development.\n“We are grateful to the villagers who agreed to have their homesteads moved and today marks the day we start the construction of the homesteads and we are going to make sure that it is done to the satisfaction of everyone,” Zwane chief executive officer, Engineer Bhekithemba Mbambo said.\nThe local leadership has welcomed the project.\n“We are so happy that this project has started. We know it will change Matabeleland South. It is a project that demonstrates that Ilizwe lakhiwa ngabanikazi balo,” Chief Masuku said.\n“This is a model that we are committed to supporting as the Ministry of Transport. Very soon, the Bulawayo- Beitbridge highway is going to be started using the same model,” Matabeleland South Provincial Roads Engineer, Mangisi Nkomo said.\n“The project will set the three districts on a development trajectory. All the production that is happening in this area will be transported smoothly, noted Matobo legislator, Honourable Edgar Moyo.\nSpeaking at the groundbreaking ceremony for the model homestead at Ntunjambili village this Saturday, the Minister of State for Matabeleland South Provincial Affairs and Devolution, Honourable Evelyn Ndlovu emphasised the importance of public-private partnerships in development.",
            "time": "20:35",
            "date": "09 Feb 2025"
        },
        {
            "title": "Cde Chigudu described as a unifier",
            "href": "https://www.zbcnews.co.zw/cde-chigudu-described-as-a-unifier/",
            "content": "\nStory by Peter Chivhima\nNational hero Cde Tinaye Chigudu has been described as a loving father and a unifier as his death leaves a void in his family and the nation at large.\nKnown as a loving and supportive man, Cde Chigudu’s legacy extends beyond his family to the significant contributions he made to Zimbabwes liberation struggle and post-independence development.\nHis wife, Mrs Esther Dumba described him as a devoted husband and family man.\n“He was a loving husband. Despite us having children, he never changed, and he continued with the same love and respect. He always defended me. Even to the wider community, he was a caring and loving man. If you ask many people, they’ll tell you how he assisted them.”\nCde Chigudu’s love for his family was echoed by his daughter, Rudo, who shared fond memories of her late father.\n“My dad was a loving man. He didn’t believe that the father should eat first. He always made sure we were served first. Even when he came home from work, he would check to see if we had eaten. He was a family unifier. He was strict about time. If he was taking us to school and you were late, he would drive off without you.”\nCde Chigudu was one of the first liberation combatants trained in North Korea under ZIPRA, the military wing of the Zimbabwe African Peoples Union (ZAPU). He played a pivotal role in the liberation struggle and was dedicated to the cause of Zimbabwe’s independence.\nAs an intelligence operative in the then-Salisbury, Cde Chigudu worked tirelessly in pursuit of freedom. His mission led to his capture by the Rhodesian regime, and he endured 12 years of imprisonment.\nUpon his release, the former Manicaland Province Governor rejoined comrades in Zimbabwe and resumed his duties in the armed struggle.",
            "time": "20:35",
            "date": "09 Feb 2025"
        },
        {
            "title": "Govt walks the talk on empowering war veterans",
            "href": "https://www.zbcnews.co.zw/govt-walks-the-talk-on-empowering-war-veterans/",
            "content": "\nStory by Memory Chamisa\nThe governments ongoing efforts to support and uplift the lives of war veterans who played a critical role in the countrys liberation struggle continues to gather momentum, with three provinces receiving US$150 000 each this Saturday for the implementation of economic projects.\nWar veterans, ex-political prisoners, detainees and restrictees from Bulawayo, Matebeleland North and South provinces gathered at Stanley Square in Makokoba for the launch of the Presidential War Veterans Fund.\nThe three provinces have become the latest after Masvingo, Mashonaland Central and East have already received their allocation of funds from the national US$1.5 million fund.\nThe liberation stalwarts could not hide their joy as they look forward to life changing projects that will not only sustain them, but generations to come.\n“We are grateful to the President for remembering us and we assure him of our unwavering support and that this fund will revolve to ensure everyone is able to benefit and leave a legacy for generations to come,” said a beneficiary of the programme.\n“We saw this launch being done to other provinces and we were just wondering when our turn would come and the day is here. We are more than happy for this recognition by His Excellency. Thank you Mr President,” added another.\nThe ZANU PF leadership in the three provinces lauded his Excellency President Emmerson Mnangagwa for his vision of empowering the liberation stalwarts.\nWar Veterans League Secretary, Cde Douglas Mahiya said the initiative is part of a broader strategy to promote social justice and rectify historical imbalances faced by veterans.",
            "time": "20:35",
            "date": "09 Feb 2025"
        },
        {
            "title": "Ministry engages ZBC to publicise the Heritage-Based Curriculum",
            "href": "https://www.zbcnews.co.zw/ministry-engages-zbc-to-publicise-the-heritage-based-curriculum/",
            "content": "\nStory by ZBC Reporter",
            "time": "20:35",
            "date": "09 Feb 2025"
        },
        {
            "title": "Women’s League endorses President Mnangagwa’s leadership",
            "href": "https://www.zbcnews.co.zw/womens-league-endorses-president-mnangagwas-leadership/",
            "content": "Story by Tendai Munengwa\nTHE ZANU PF Women’s League and the female Ministers unanimously endorsed the 2030 resolution to allow President Emmerson Mnangagwa to remain in office and see through his Vision of achieving an upper-middle-income society.",
            "time": "20:36",
            "date": "09 Feb 2025"
        }
    ]
}