{
    "news": [
        {
            "title": "Govt supports Gwanda’s Sibona community with vital food aid as they await harvesting",
            "href": "https://www.zbcnews.co.zw/govt-supports-gwandas-sibona-community-with-vital-food-aid-as-they-await-harvesting/",
            "content": "Story by Providence Maraneli\nGOVERNMENT’S commitment to cushioning the citizenry against the effects of the El-Nino-induced drought continues, with the Sibona community in Gwanda receiving a mealie meal consignment.\nMatabeleland South received meaningful rains late in the season, the majority of the cereal crops are at the late maturity stage, making the communities food insecure until harvest time. As such, the government has sourced mealie meal to cushion the Sibona community of Gwanda to sustain themselves before the harvest period.\n“We are grateful for this donation, you see we are yet to harvest anything from the fields and we were in need of food,” a food beneficiary said.\n“The rains came late so most of our crops are still not yet ready, so getting this donation will go a long way,” a local farmer said.\nZANU PF 2023 election candidate for Gwanda North constituency Cde Lungisani Ncube who is spearheading development in the community thanked the government and development partners for the timely intervention.\n“This is what the Second Republic is all about, being people-centred, no one is being left out and we are so grateful to the government and its development partners,” Cde Ncube said.\nThe consignment, a culmination of an engagement between Matabeleland South Minister of State for Provincial Affairs and Devolution and a development partner -Tzu Chi Foundation Zimbabwe, is set to sustain vulnerable members of the community until the next harvest.",
            "time": "08:36",
            "date": "11 Mar 2025"
        },
        {
            "title": "Shamva’s education boosted with new classroom block at Bradley Primary",
            "href": "https://www.zbcnews.co.zw/shamvas-education-boosted-with-new-classroom-block-at-bradley-primary/",
            "content": "\nStory by Tapiwa Machemedze\nSHAMVA district’s education sector continues to grow in leaps and bounds following the commissioning of a classroom block at Bradley Primary School in the district this Monday.\nBradley community welcomed the opening of the new modern classroom block, after the recent opening of Chiraramo Secondary School and a block at Mandimu Primary School.\n“Our children used to learn in sheds then moved to the first block and now this is the second block so we are happy with this development,” a parent said.\n“We welcome this new development. It is a boost for our community. Our children will have quality education,” another parent added.\nThe school commissioned by the Acting Permanent Secretary for Mashonaland Central Provincial Affairs and Devolution, Mr Levi Katambarare, representing Minister Christopher Magomo, was funded by the Church of Jesus Christ of Latter Day Saints.\n“We are our brother’s keeper which is why we were moved to assist the community and build this church, Mr Katambarare said.\n“Investment in education is creating a future where our children are equipped to contribute to our nation’s development,” he said.",
            "time": "08:36",
            "date": "11 Mar 2025"
        },
        {
            "title": "Pfumvudza/Intwasa programme and village business units transforming lives in Chivi North",
            "href": "https://www.zbcnews.co.zw/pfumvudza-intwasa-programme-and-village-business-units-transforming-lives-in-chivi-north/",
            "content": "Story by Mercy Bofu-Matinha\nTHE Pfumvudza/Intwasa Programme and Village Business Units are transforming lives in Chivi North which has seen many communities becoming food secure.\nMrs Thembinkosi Huruva Mukungunugwa and her family from Maramba village in Chivi North adopted the Pfumvudza Intwasa programme in 2018.\nThey started with one plot and since then, they have been cultivating five plots, producing enough for the family and surplus for sale, enabling them to send their children to school.\n“When we started this programme in 2018 we were very skeptical and we started with just one plot. However, after the harvest, we realised that the concept is a noble, life-changing programme. Since then we have not looked back,” farmer, Mrs Mukungunugwa said.\nOther farmers paid tribute to the government for helping to transform the dry area of Chivi into a food-secure community.\n“As a community, we remain indebted to our government for the support they are giving us. We received inputs and technical support hence the crop you are seeing around our villages,” a community member said.\n“Apart from the Pfumvudza Intwasa programme we now have many village business units including fish ponds and it has helped us to take farming as a business,” a communal farmer addded.\nAgriculture experts are assisting farmers in Chivi to focus on traditional grains.\n“We continue to urge farmers in this area to focus on traditional grains given their resilience to climate change. Yes maize might do well in a season like this, but we recommend traditional grains. As Valley Seeds, we are working with more than 300 farmers supporting them in producing those traditional grains,” agronomist for Valley Seeds, Mr Tinashe Bvukumbwe said.\nGovernment representatives are confident of a good harvest this summer cropping season from assessments carried out.",
            "time": "08:36",
            "date": "11 Mar 2025"
        },
        {
            "title": "Govt reaffirms commitment to boosting tourism as key economic contributor",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-boosting-tourism-as-key-economic-contributor/",
            "content": "Story by Fairstars Mukungurutse\nGOVERNMENT has reaffirmed its commitment to continue fostering the growth of the tourism and hospitality industry as the country targets to attain an upper middle-income society by 2030.\nSurpassing agriculture and mining, the tourism and hospitality industry registered tremendous growth in 2024, accounting for 12 % of the country’s GDP.\nIn an interview with ZBC News after addressing students at the Zimbabwe Staff College this Monday, Tourism and Hospitality Industry Minister, Honourable Barbara Rwodzi said the government has put in place a raft of measures to consolidate the tourism industry as one of the top contributors to the Gross Domestic Product, alongside mining, agriculture and manufacturing.\n“We had an engagement with the Staff of the Defense Forces today, where we were discussing the contribution of the tourism industry to the country’s economy, and we were giving them a layout of what the tourism industry is all about, how we are guided by the constitution, the President’s Vision 2030, as well as the policies and how we have formulated our strategies to be where we are,” she said.\n“We were telling them the figures for 2023, in comparison with 2024 figures, whereby tourism was the highest sector that contributed to the GDP by 12 %, and how we achieved that. Agriculture was affected by climate change due to the drought that we experienced in 2024, and mining was affected by the fluctuation of global prices, and, that resulted in tourism being the number one contributor to the GDP.",
            "time": "08:36",
            "date": "11 Mar 2025"
        },
        {
            "title": "Rising childhood obesity in Zim sparks health concerns",
            "href": "https://www.zbcnews.co.zw/rising-childhood-obesity-in-zim-sparks-health-concerns/",
            "content": "Story by Abigirl Tembo, Health Editor\nA growing trend of childhood obesity in Zimbabwe is sounding alarm bells among health experts who warn of severe long-term health consequences if left unchecked.\nLatest statistics from the 2024 ZimLAC Survey reveal that more than 5% of children in Zimbabwe are overweight, with a higher prevalence in urban areas at 7.4% compared to rural areas at 4.5%\nThe Multiple Indicator Cluster Survey (MICS) 2023 also reported that over 6% of children under the age of five are overweight, while more than 3 % are obese.\nAccording to nutritionist Dr Nyasha Grace Mushonga, the prevalence of childhood obesity in Zimbabwe is a cause for concern.\n“Overweight among children is not a very good sign of a healthy future population because these are the people who are going to be the adults of tomorrow,” Dr Mushonga said.\n“What it means when one is overweight, you have more cells than you should have, and when we lose weight, the cells only shrink but they do not decrease in number. This only means that the potential to regain that weight is there. That is why you find adults who try to do weight-losing programmes, after a few months or a few weeks, they regain because the cells are still there, and the potential to gain weight is there.\n“The same thing applies to children, when they have so many cells, they are not going to go away because you are losing weight, but they will be enlarged as one gains weight.\n“So we say let us teach these children at an early age the correct ways of eating food. We know as parents the way we manifest love to our children is very different, some parents think if the child says I want this, and you give them, you are loving them. But that is not the issue. You need to teach these children how to eat properly.”",
            "time": "08:36",
            "date": "11 Mar 2025"
        }
    ]
}