{
    "news": [
        {
            "title": "Construction of Vic Falls multi-purpose cricket stadium on course",
            "href": "https://www.zbcnews.co.zw/construction-of-vic-falls-multi-purpose-cricket-stadium-on-course/",
            "content": "Story by Tichaona Kurewa\nConstruction of the multi-purpose Mosi-oa-Tunya International Cricket Stadium in Victoria Falls is progressing well, with significant ground having been covered in terms of earthworks and pitch development.\nThe facility is a cornerstone of Zimbabwe Cricket (ZC)’s ambitious infrastructure development plan.\nThis comes at a time when Zimbabwe is preparing to co-host the 2026 under-19 Cricket World Cup alongside Namibia and the 2027 men’s Cricket World Cup with South Africa and Namibia.\nThe project is on track, with 50% of the main pitch having been constructed.\n“We have made significant progress in the earthworks. We’ve levelled Pitch A, the main pitch, and the practice pitch. Planting has commenced on the main square, including the wicket and the 30-yard area. The good news is this planting coincides with the rains. I’m told there’s been good rainfall in Victoria Falls, which is very encouraging. While the rains have temporarily slowed work on the practice pitch due to water logging, overall progress is substantial,” said managing director of Zimbabwe Cricket, Givemore Makoni.\nConstruction of other facilities is expected to begin soon.\n“Construction work on the media centres, players’ changing rooms, and grandstands is scheduled to begin in March this year. We are on course in terms of the field work and adhering to our phased plan. We are confident in meeting all our deadlines,” said Mr Makoni.",
            "time": "18:32",
            "date": "15 Jan 2025"
        },
        {
            "title": "Zim delegation in Russia for a technical exchange programme",
            "href": "https://www.zbcnews.co.zw/zim-delegation-in-russia-for-a-technical-exchange-programme/",
            "content": "Story by ZBC Reporter\nA high-powered Zimbabwean delegation is currently in Kazan, Russia, for a technical exchange programme that will inform the re-designing of the Mbare Musika Traders market into a modern facility.",
            "time": "18:32",
            "date": "15 Jan 2025"
        },
        {
            "title": "Zim sees surge in international tourists",
            "href": "https://www.zbcnews.co.zw/zim-sees-surge-in-international-tourists/",
            "content": "\nStory by Tichaona Kurewa\nZIMBABWE’s tourism sector experienced a surge in tourist arrivals at Victoria Falls, Zambezi National Park, and Hwange National Park during the 2024 festive season.\nStatistics from the Zimbabwe Parks and Wildlife Management Authority reveal a significant increase in tourist numbers during the recent festive season, with over 30 000 visitors exploring Hwange and Victoria Falls/Zambezi National Parks.\nA notable highlight is the surge in international visitors to the Victoria Falls rainforest, reaching 5 000 compared to 4 000 in 2023.\nDomestic tourism to the rainforest however saw a slight decrease from 7 000 to 6 000.\n“But I think we are happy about the number of people that visited our tourist destinations, especially the campaign that has been led by various stakeholders, including the Ministry of Tourism, to ensure that we visit the tourist destinations that we have.",
            "time": "18:32",
            "date": "15 Jan 2025"
        },
        {
            "title": "Schools officially open for the new term",
            "href": "https://www.zbcnews.co.zw/schools-officially-open-for-the-new-term/",
            "content": "\nStory by ZBC Reporter\nSCHOOLS opened for the first term of the year this Tuesday with learners and teachers excited about the prospects that lie ahead.",
            "time": "18:32",
            "date": "15 Jan 2025"
        },
        {
            "title": "Mat North poised for further transformation",
            "href": "https://www.zbcnews.co.zw/mat-north-poised-for-further-transformation/",
            "content": "Story by Tichaona Kurewa\nMatabeleland North province is set for significant growth this year, with several key projects nearing completion.\nThe Gwayi-Shangani Dam project is on track to achieve its target water catchment by the 2025-2026 rainfall season, pending the release of funding from Treasury.\nThe province also anticipates the opening of Lupane General Hospital, its largest referral hospital, with phased commissioning scheduled for the end of the year.\nAdditionally, the rehabilitation and construction of the Bulawayo-Victoria Falls Road is underway, with contractor Bitumen World currently repairing potholes. Full-scale reconstruction will commence after the end of the rainfall season.\n“We have solar plant projects that are nearing completion. We are pleased that His Excellency the President will commission these projects during the year. Many devolution projects, including schools and clinics are progressing well. We look forward to their completion with the support of devolution funds allocated to the province this year,” said Minister of State for Provincial Affairs & Devolution, Matabeleland North Province, Hon Richard Moyo.",
            "time": "18:32",
            "date": "15 Jan 2025"
        }
    ]
}