{
    "news": [
        {
            "title": "President Mnangagwa appoints Lieutenant General Matatu as ZNA Commander",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-appoints-lieutenant-general-matatu-as-zna-commander/",
            "content": "Story ZBC Reporter",
            "time": "21:06",
            "date": "27 Mar 2025"
        },
        {
            "title": "Road safety audits training launched",
            "href": "https://www.zbcnews.co.zw/road-safety-audits-training-launched/",
            "content": "Story by Peter Chivhima\nZIMBABWE is taking a significant step towards safer roads with the launch of a month-long Road Safety Audits Training Programme in Harare this Thursday.\nIn a bid to address the rising number of road traffic accidents in the country, the Road Safe Zimbabwe Trust has partnered with key stakeholders in road administration to introduce this comprehensive training initiative.\nThe launch event, held in Harare, saw participants from various towns joining virtually.\n“The symposium is critical to us as engineers and it allows us to share ideas on how to reduce road carnage by coming up with sustainable road infrastructure,” Ministry of Transport and Infrastructural Development’s Engineer Zimunya said.\n“This meeting is crucial especially to me as a student because looking at our road infrastructure, there is a lot which needs to be done especially in terms of managing the traffic,” a University of Zimbabwe student, Mitchell Musemwa added.\nThe Traffic Safety Council of Zimbabwe’s Managing Director, Mr Munesu Munodawafa and the Road Safe Zimbabwe Executive Director, Mr Sam Nyaude are convinced the launch will go a long way in reducing road carnage.\n“The road safety audits and the training we are having here is brought to get a number of engineers from various institutions, from ZINARA to the local authorities and even the department of roads, where we are reflecting and saying, let us review our infrastructure. Let us see what things could be done to improve road safety. Let us look at the infrastructure around it and say, is it forgiving. In the event of an accident, is somebody likely to survive,” Mr Munodawafa said.",
            "time": "21:07",
            "date": "27 Mar 2025"
        },
        {
            "title": "Chegutu delegation embarks on Chimoio tour to learn liberation history",
            "href": "https://www.zbcnews.co.zw/chegutu-delegation-embarks-on-chimoio-tour-to-learn-liberation-history/",
            "content": "\nStory by Tamuka Charakupa\nA delegation of over 100 people from Chegutu District, including ZANU PF returnees, teachers, and members of the security sector, has embarked on a tour of Chimoio, Mozambique, to gain deeper insights into the country’s liberation struggle history.\nAs part of the visit, the delegation will undergo an induction on the ruling party’s ideology, aligning with efforts to strengthen political awareness and unity.\nMeanwhile, the Second Republic’s inclusive development policies continue to make an impact, with over 500 opposition supporters from Chegutu returning to ZANU PF, citing renewed confidence in the party’s leadership and governance approach.\n“We were fighting the ruling party for meaningful development but now we have embraced the drive by the Second Republic where emphasis is on self-actualisation under the mantra ‘Nyika Inovakwa Ne Vene Vayo,” returnee Mr Ephraim Chinja said.\n“We are happy with the leadership of President Mnangagwa and his vision of leaving no one and no place behind,” former opposition legislator, Mr Gift Konjana added.\nThe ZANU PF leadership in Mashonaland West Province is impressed by the overwhelming number of returnees charmed by the ruling party’s inclusive development agenda.",
            "time": "21:07",
            "date": "27 Mar 2025"
        },
        {
            "title": "Zim-Russia media cooperation set to strengthen through strategic partnership",
            "href": "https://www.zbcnews.co.zw/zim-russia-media-cooperation-set-to-strengthen-through-strategic-partnership/",
            "content": "\nStory by Fairstars Mukungurutse\nTHE Russian Federation has expressed its commitment to enhancing cooperation with Zimbabwe in the media sector.\nA delegation from Russian news agency, Ruptly, met with Information, Publicity and Broadcasting Services Permanent Secretary, Mr Nick Mangwana in Harare this Thursday.\nWhile reaffirming commitment to the long-standing relations between Zimbabwe and Russia, the discussions focused on enhancing cooperation in the field of media services through joint projects.\n“There is no current penetration of Ruptly in Zimbabwe, but this explorative visit will make sure that that situation changes. As a ministry, we support that very much. We want our media, both private and state media, to have alliances and partnerships across the globe, and also with those countries with whom ideologically we are aligned. We have an MOU with the Russian government where our media services are expected to cooperate, and this is part of the actualisation of the MoU,” Mr Mangwana said.\n“During this visit, they will also meet the private media so that the Zimbabwean story will be told in foreign lands through a friendly voice, and the Russian story will be told in our jurisdiction through us as a friendly voice as well.”\nSpeaking on the partnership, Ruptly’s Chief Executive Officer, Ms Anna Semidotskaya, highlighted the longstanding friendship between the two nations and the agency’s role in fostering closer ties through media collaboration.",
            "time": "21:07",
            "date": "27 Mar 2025"
        },
        {
            "title": "Government launches second phase of Early Warning System",
            "href": "https://www.zbcnews.co.zw/government-launches-second-phase-of-early-warning-system/",
            "content": "Story by Tafara Chikumira\nGOVERNMENT has launched the second phase of the Early Warning System (EWS) in a major milestone meant to deal with the problem of school dropouts through various intervention measures.\nThis phase follows the success of the pilot project and will expand to include 30 more districts.\nThe first phase of the programme, which targeted only five districts with 103 schools, witnessed 78 percent of these schools registering an increase in enrollment.\nGovernment is now contemplating having the programme spread in all schools across the country in line with the inclusive development agenda.\n“The ministry is also committed to ensuring that the Early Warning System’s practices are universal in all schools and not only limited to those few selected districts from where various projects are operating. It is for this reason that a ministry-driven EWS framework intends to bring inclusivity as it will provide general guidelines on how to curb dropouts within our schools,” the  Minister of Primary and Secondary Education, Honourable Torerai Moyo said.\n“I would therefore like to call upon all of you to engage with this process cognisant of the duties we all have in fulfilling the educational dreams and ambitions of the Zimbabwean child and consequently, contributing to the country’s educational and developmental priorities,” he added.",
            "time": "21:07",
            "date": "27 Mar 2025"
        }
    ]
}