{
    "news": [
        {
            "title": "Hwange’s Big Charlie dies",
            "href": "https://www.zbcnews.co.zw/hwanges-big-charlie-dies/",
            "content": "Story by Batsirai Donavan Shoko\nA Hwange man popularly known as Big Charlie on account of his unique physical attributes has passed away.\nThe giant from the mining town famed for his 2,1 metres height and 300kgs weight reportedly passed away this Tuesday morning at St Patrick’s Hospital in Empumalanga Suburb.\nAccording to family Spokesperson Ms Susan Ndlovu, Big Charlie had been suffering from high blood pressure and diabetes.",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Bikita community benefits from wetlands conservation",
            "href": "https://www.zbcnews.co.zw/bikita-community-benefits-from-wetlands-conservation/",
            "content": "Story by Mercy Bofu-Matinha\nVillagers in Bikita are benefitting from their wetlands conservation efforts through sustainable agriculture projects, with more communities being called upon to embrace sustainable management of natural resources.\nThe restoration of Mukweture and Chapedo wetlands in Bikita has come as a major relief for the surrounding community as it has enabled them to expand their agricultural initiatives.\nThe two projects spearheaded by the community through assistance from the Environmental Management Agency (EMA) and Christian Care Zimbabwe, are benefitting nearly 1 000 families through gardening, apiculture, livestock and fish farming projects.\n“We are excited about this project of wetlands conservation, when we started we never thought the project would benefit us. We managed to put up a weir as our water reservoir and our partners helped with water pump and pipes. Now we have got four community gardens supplied water from the reservoir,” said a community member.\n“From this wetland, we also put up bee hives and we are now into apiculture supplying the community and beyond with honey,” said another community member.\nEMA emphasised the importance of wetlands conservation in ensuring food security at the same time addressing the impact of climate change.\n“As EMA we encourage communities to take advantage of natural resources in their areas and use them sustainably for development. Today we are witnessing the importance of wetlands conservation as the people of Bikita are now able to do a number of agriculture initiatives. Now they have got weirs that conserve water throughout the year and even their livestock is now benefitting.  This shows that if we work together we can address the impact of climate change even at community level,” said EMA Masvingo provincial manager, Mr Milton Muusha.\nChristian Care Zimbabwe continues to compliment government efforts in empowering rural communities through food security.",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Gweru dairy farmer invests in value addition",
            "href": "https://www.zbcnews.co.zw/gweru-dairy-farmer-invests-in-value-addition/",
            "content": "Story by Tafara Chikumira\nA Gweru-based farmer is making waves in dairy production and contributing to national milk targets after setting up a milk processing plant, in line with the Second Republic’s value addition and beneficiation thrust.\nThe Gweru-based farmer has taken advantage of the Second Republic’s industrialisation and reindustrialisation efforts setting up a modern milking parlor that enables him to do business at ease.\nThe farmer who boasts of milking 400 cows per day has also set up some compressors for the preservation of milk products while anticipating growth in the near future.\n“We are producing an average of 25 litres a day per cow so we are producing around 10 000 liters a day. We process a fortune of our milk and make sure there is milk and salad so that there are milk products here in Gweru and the balance of goes to Dendairy. We would like to increase the size of our dairy cows and our aim is to reach 500 milking cows a day. We started some five years ago and now we are at a point where we can milk 100 cows an hour. We have invested in milk cooling compressors so those are currently being installed. Two are already running and we hope the other three are up and running in the next two or three months,” said dairy farmer, Mr Robert Anderson.",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Disability-friendly buildings a must, say persons with disabilities",
            "href": "https://www.zbcnews.co.zw/disability-friendly-buildings-a-must-say-persons-with-disabilities/",
            "content": "Story by Rachel Shonhiwa\nPersons with disabilities in Zimbabwe have called for greater inclusivity in the construction of public spaces, citing significant challenges in accessing buildings due to lack of accessibility features.\nFor individuals with disabilities, navigating the city of Harare can be a daunting task, as numerous buildings pose significant barriers to entry, hindering their accessibility and independence.\nSeveral individuals shared their experiences with the ZBC News, highlighting the need for greater inclusivity in the construction of public spaces.\n“Some of the buildings are not accessible. There still is a need to do more. We need facilities to put up ramps for us. We need brailles and these side handles to assist us. Moving about the CBD is quite challenging at the moment. You just end up having to get used to these places, otherwise they are not accessible,” a person with disabilities said.\n“Sometimes we want to buy our stuff from the shops in the CBD, the equipment that we use in our daily lives, but the shops are not accessible. We are facing challenges even in the entertainment and sports industries. We cannot access the facilities there. We need the government to assist us.”",
            "time": "09:29",
            "date": "19 Feb 2025"
        },
        {
            "title": "Zimbabwe reviews landmine-free target",
            "href": "https://www.zbcnews.co.zw/zimbabwe-reviews-landmine-free-target/",
            "content": "Story by Peter Chivhima\nZimbabwe is reviewing its landmine-free nation target, with the government expressing confidence in the country’s ability to achieve set objectives.\nHarare is hosting a three-day National Stakeholder Dialogue focusing on humanitarian demining and providing support to landmine victims.\n“We would like to express our heartfelt gratitude to the government for the invaluable support they are providing to us. Their efforts have made it significantly easier for us to access assistive devices, which has greatly improved our quality of life and enabled us to participate more fully in our communities. We appreciate their commitment to promoting inclusivity and equality for all,” a landmine victim said.\nAnother said, “We want to thank the government for the support and all the efforts to assist us because now we are getting food assistance from the government.”\nThe Symposium brings together key stakeholders, including representatives from Japan, the United Kingdom, and the European Union, all of whom have pledged their support to Zimbabwe’s journey towards becoming a landmine-free nation.\n“Currently, we are the leading funder, having generously supported the demining operations since 2016 with a total contribution of US$29 million,” European Union Ambassador to Zimbabwe His Excellency Jobst Von Kirchmann said.\nAmbassador Extraordinary and Plenipotentiary Mr Shinichi Yamanaka noted, “We will continue to support Zimbabwe in achieving its target of becoming a landmine-free nation.”",
            "time": "09:29",
            "date": "19 Feb 2025"
        }
    ]
}