{
    "news": [
        {
            "title": "Mutirikwi men thrive in basketry",
            "href": "https://www.zbcnews.co.zw/mutirikwi-men-thrive-in-basketry/",
            "content": "Story by Gay Matambo\nGRASS-woven baskets are still a popular interior, which is one of the reasons why a number of men in Mutirikwi area of Chiredzi have also ventured into the trade.\nWith basketry predominantly a domain for women, Mr Brighton Chada has a thriving art and craft business, whose products include basket chairs made from woven grass, tree bucks and bamboo reeds.\nEach chair takes at least seven days to make while bigger chairs with more complicated designs take as long as a month.\nBasketry has become a lucrative source of income for Mr Chada, who has been able to fend for his family through the art.\n“I have been doing this for 20 years now. I married my wife and took my children to school through funds from weaving. When I started, I used to weave baskets only until I started making chairs. During the sugarcane crop season, that’s when we have many customers and sometimes it depends on whether people like the design or not,” he said.\n“This area is actually called Pamasofa, even people in Harare know this place. I get resources locally, and I make these artifacts at zero cost. I use trees, grass, and reeds. The big one costs US$80, the small ones cost US$50 and garden chairs cost US$30. We make all-weather furniture. This is because these can stay outside even during rainy days and even in the house,” he added.\nThe ZBC News also caught up with Mr Farai Magaya in Muzembi village, Triangle, who specialises in traditional basket weaving using dry grass and reeds.",
            "time": "09:09",
            "date": "26 Feb 2025"
        },
        {
            "title": "Plumtree consultations call for pension hike and non-monetary benefits",
            "href": "https://www.zbcnews.co.zw/plumtree-consultations-call-for-pension-hike-and-non-monetary-benefits/",
            "content": "Story by Aifheli Mudau\nTHE need for an upward review of pension benefits and the provision of non-monetary benefits dominated discussions during the State Pensions Bill public consultations held in Plumtree on Tuesday.\nIn a move aimed at strengthening social safety nets for those who were in active service, the Parliamentary Portfolio Committee on Public Service, Labour, and Social Welfare visited Plumtree in Matabeleland South Province to gather public input on the Bill.\nParticipants emphasised the need to increase pension benefits and called for the inclusion of non-monetary benefits.\n“I think the pensions payout should be increased to at least US$150 or way above that so that we can have a decent life,” a participant said.\nAnother stated, “The Bill should consider that pensioners at their age need a lot of support and as such, the payouts should be better.”\n“All workers should be given a lump sum of money mid-journey of their working life so that they can start some life-changing projects if they so wish,” added a participant.",
            "time": "09:09",
            "date": "26 Feb 2025"
        },
        {
            "title": "Holy Cross conference centre project on track",
            "href": "https://www.zbcnews.co.zw/holy-cross-conference-centre-project-on-track/",
            "content": "Story by Tafara Chikumira\nTHE Holy Cross Conference Centre and Tourism Resort project in Chirumanzu is progressing well, amid indications that the first phase of the project will be completed by the end of April this year.\nThe centre boasts of a conference centre, a bar, and 10 modern chalets earmarked for the initial phase among other critical features.\n“We are excited by the progress of this critical project.  We are happy that the team is enthusiastic. All the materials are now on site and we hope to open to the public by May this year,” said Holy Cross project supervisor, Mr Shepherd Hloma.\nThe community has begun to enjoy benefits from the project, with tertiary students also gaining skills and experience.\n“The project has brought life to our community. I have since managed to construct a beautiful house to my name. I have also managed to buy some cattle through this project. My children can now attend school after the payment of full school fees. We are enjoying as Chirumanzu community,” a community member noted.\nAnother added, “I used to be an assistant for builders in my community.  Things have changed for the better ever since I started working here. I can now do a lot of work from plumbing to building. I have learnt several skills and I can safely say my future is bright.”\n“As a single mother, life was very tough as I had to fend for my family. I want to thank the government for this noble project where we are also engaged in demanding duties just like our male counterparts.”",
            "time": "09:09",
            "date": "26 Feb 2025"
        },
        {
            "title": "Govt prioritises electricity access for Gutu villagers",
            "href": "https://www.zbcnews.co.zw/govt-prioritises-electricity-access-for-gutu-villagers/",
            "content": "Story by Mercy Bofu-Matinha\nTHE Government continues to prioritise rural development by ensuring access to electricity, with villagers of Gutu being the latest to benefit following the commissioning of electricity transformers in the area to supply critical institutions including clinics, schools, and rural business centres.\nMr Cuthbert Marimi is one of the small business owners at Jaravaza shopping Centre in Gutu, and he is looking forward to improved business following the installation of a new electricity transformer in their area.\nApart from Jaravaza Shopping Centre, five other transformers were installed at various centres and are expected to feed into critical institutions including rural healthcare centres and schools, with the project being spearheaded by area legislator, Honourable Winston Chitando.\n“Today is a big day for this community, we had gone for more than three years without electricity because we did not have a transformer. Now that it has been installed, our small businesses are going to thrive again because we were no longer able to run butcheries, and liquor shops or store perishable goods. We thank our government for always being supportive of the rural populace,” Mr Marimi said.\nGutu central villagers gathered at various centres across their constituency at the weekend to celebrate the development implemented by the Second Republic.\n“Today after the installation of electricity transformers, our clinics will now run viably, our children will now be doing computer studies at any time. Even our rural homes are now reconnected meaning we now have smooth access to information,” a villager said.\n“The government sank more than 20 boreholes and many are now into gardening projects. Again, we are beneficiaries of the Presidential Goat and Poultry Scheme among many others,” another villager added.\nHonourable Winston Chitando, who is also the Minister of Mines and Mining Development, said rural industrialisation is key to achieving Vision 2030.",
            "time": "09:09",
            "date": "26 Feb 2025"
        },
        {
            "title": "Harare City Council’s chaotic management manifests on the roads",
            "href": "https://www.zbcnews.co.zw/harare-city-councils-chaotic-management-manifests-on-the-roads/",
            "content": "Story by Theophilus Chuma\nTHE disarray within the management of Harare City Council, as revealed through the ongoing Commission of Inquiry, has extended to the city’s roads.\nThere have been alarming revelations that the traffic management system in Harare is in a state of disrepair with compelling evidence pointing to the failure of the system, with traffic accidents increasingly characterising numerous intersections across the city, primarily due to non-functional traffic lights.\nThe city fathers have acknowledged that Harare’s traffic management infrastructure is severely compromised, operating at a mere half of its installed capacity.\n“We only have 103 traffic lights that are working while the other 150 are not functioning. It’s a serious challenge that we have,” said Harare Mayor, Councillor Jacob Mafume.\nWhile the city’s infrastructure bleeds, executives at Town House are fattening their pockets with evidence presented at the Commission of Inquiry showing the Town Clerk’s monthly salary is pegged at US$27 000.\nThe total salary bill for executives was estimated at half a million United States dollars monthly, prioritised over the cost of repairing damaged infrastructure.\nHarare’s traffic situation has degenerated into a jungle, ranging from traffic accidents to unmanageable traffic congestion.",
            "time": "09:09",
            "date": "26 Feb 2025"
        }
    ]
}