{
    "news": [
        {
            "title": "Devolution funds spur development across the country",
            "href": "https://www.zbcnews.co.zw/devolution-funds-spur-development-across-the-country/",
            "content": "\nStory by Tafara Chikumira, Midlands Bureau Chief\nDEVOLUTION funds have become a practical development tool across the country after the commissioning of an Early Childhood Development (ECD) Centre in Mvuma.\nThe Second Republic continues to address the schools’ deficit, with the establishment of Blinkwater Early Childhood Development Centre in Mvuma district expected to improve access to education, with plans afoot to develop the facility into a fully-fledged primary school in the near future.\nThe ECD centre, with a carrying capacity of 100 learners has been welcomed as a game changer in the educational needs of the Mvuma community.\n“We decided to establish an ECD Blinkwater block after realising that children were exposed to danger by crossing major highways to school.  We establish this school using devolution funds and council funds. After that, we are also going to develop a primary school here. We are indeed grateful to the government for releasing the devolution funds in time,” Mvuma Rural District Council chief executive officer, Mr Lovemore Chatikobo said.\nThe community is equally excited by the new facility which confirms the Second Republic’s inclusive development is in motion.\n“Our young children used to travel long distances. So with this facility is going to be helpful. We did not expect this from our President. What he did, we hope this will be taken to some other areas, around here. At least it shows that our government has a good vision, and also recognises young learners from this area,” said one local resident.\n“The construction of this block has helped a lot here. The reason being that the learners used to travel long distances. We thank our government for addressing this issue. In fact, there was no school at all around this place. I want to commend our government for the sterling efforts in mobilising locally available resources towards construction of the ECD centre,” added another.\nThe government has promised to continue with its developmental trajectory in line with Vision 2030.\n“I applaud the new dispensation under the able and visionary leadership of President Emmerson Mnangagwa of the Republic of Zimbabwe for implementing rural development 8,0 vision 2030 accelerator model in an endeavour to modernise and industrialise marginalised areas underpinned by the development approach of leaving no one and no place behind,” Midlands Minister of State for Provincial Affairs and Devolution, Honourable Owen Ncube said.\n“The Second Republic through the Ministry of Primary and Secondary Education, local authorities and private sector, is providing modern infrastructure to ensure all learners both in rural and urban schools are empowered to excel in their studies.",
            "time": "20:34",
            "date": "07 Jan 2025"
        },
        {
            "title": "Crane mishap at Trabablas Traffic Interchange results in loss of life",
            "href": "https://www.zbcnews.co.zw/crane-mishap-at-trabablas-traffic-interchange-results-in-loss-of-life/",
            "content": "Story by ZBC News Reporter\nOne person died when two cranes at the Trabablas Traffic Interchange in Harare collapsed this Monday afternoon after a mechanical failure that occurred during the de-erection operation.\nTEFOMA Project Manager for Trabablas Traffic Interchange project, Engineer Kudakwashe Maguta confirmed that the deceased was an employee of Manzlink, a contracted rigging specialist company at the site.\n“Tefoma Construction (Pvt) Ltd regrets to report a fatal injury following a mechanical failure during crane de-erection operations at the Trabablas Interchange project site on 6 January 2025. The board of directors and management extend their sincere condolences to the deceased’s family, friends, and colleagues. The incident occurred during the dismantling of a static tower crane by Manzlink (Pvt) Ltd (Manzlink), our contracted rigging specialist firm.”\nHe added, “The mechanical failure resulted in the collapse of both the static tower crane and the mobile crane being used for the de-erection process. The deceased was an employee of Manzlink, the specialist subcontracted company at the site.",
            "time": "20:34",
            "date": "07 Jan 2025"
        },
        {
            "title": "Mberengwa district urged to take active role in tree planting",
            "href": "https://www.zbcnews.co.zw/mberengwa-district-urged-to-take-active-role-in-tree-planting/",
            "content": "\nStory by Courage Bushe\nMitigating the effects of climate change through protecting and planting trees dominated proceedings at a tree planting day commemoration held at Kushinga Secondary School in Mberengwa district.\nRepresenting the First Lady, Dr Auxillia Mnangagwa at the tree planting day at Kushinga Secondary School this Monday, Mberengwa District Development Coordinator, Mr Vafios Hlabati urged the people of Mberengwa to take an active role in planting trees in their respective communities as a measure to mitigate effects of climate change.\n“On behalf of Mberengwa district, I want to thank the First Lady, Dr Auxillia Mnangagwa for spearheading this programme. We want to urge all of you here present to take a leading role in planting trees.\n“By doing so, we will make sure that climate change won’t affect our communities. I strongly believe that by planting trees, we are poised for the greater future without climate change obstacles.”",
            "time": "20:34",
            "date": "07 Jan 2025"
        },
        {
            "title": "Chief Chivi described as a distinguished leader and unifier",
            "href": "https://www.zbcnews.co.zw/chief-chivi-described-as-a-distinguished-leader-and-unifier/",
            "content": "\nStory by Mercy Bofu-Matinha\nChief Chivi who died on the 1st of this month and was declared a liberation war hero has been buried at his rural home in Maregere Village.\nThe Chivi community, government officials, the ZANU PF party, and veterans of the liberation struggle gathered at Maregere homestead to bid farewell to Chief Chivi who died at the age of 105.\nThe late traditional leader was described as an exemplary leader who led development programmes in his area.\n“We are saddened by the death of our traditional leader who led by example in his area. He was someone approachable and used to assist community members in times of need,” said one of his subjects.\n“He used to encourage us to be part of programmes that empower us and our children, and he would always lead from the front,” added another.\nChief Mourner, , Masvingo Minister of State for Provincial Affairs and Devolution Honourable Ezra Chadzamira described Chief Chivi as a distinguished war collaborator and a selfless leader, sentiments shared by the Chiefs Council and the ruling ZANU PF party.\n“We gather here today to celebrate and pay our last respects to the life of a selfless leader, the late Chief Chivi, Cde Tavagwisa Magura, a gallant and distinguished war collaborator and exemplary leader. Masvingo Province has been left poorer and with a void too hard to fill as Cde Tavagwisa Magura was an inspiration in our fight for independence, autonomy, economic emancipation and in defending our national sovereignty through unmatched commitment and dedication to harmony and national security,” he said.\n“As Chiefs, we are saddened by the death of one of us, and he used to be part of all our programmes. He has always been one of our advisors given his age and experience,” Senator Chief Chitanga who was representing the Chiefs Council said.\n“As a party, we salute Chief Chivi for his contribution to unity and development in his area. He would not miss our party meetings because he was a district leader before being a chief, and he used to support us a lot,” added ZANU PF Masvingo Provincial Chairperson, Senator Robson Mavhenyengwa.\nThe Magura family expressed gratitude to the government for supporting them during their time of grief.\n“We appreciate the support we got from government, the ZANU PF party and the community at large. Here we lay to rest our unifier, our father, and our tower. Hence, we are saddened as a family,” Mr Petros Magura said.",
            "time": "20:34",
            "date": "07 Jan 2025"
        },
        {
            "title": "Pathway leading to Madzibaba Nzira’s grave displaces dozens of graves",
            "href": "https://www.zbcnews.co.zw/pathway-leading-to-madzibaba-nziras-grave-displaces-dozens-of-graves/",
            "content": "Story by Fairstars Mukungurutse\nTHE late Madzibaba Godfrey Nzira’s grave at Chitungwiza Cemetery has sparked controversy after a path leading to his grave was built on top of other graves.\nThe late spiritual leaders grave easily catches the eye of anyone who might be visiting Chitungwiza cemetery.\nHowever, the path leading to his grave allegedly built by church members and relatives has sparked controversy after desecrating several graves.\n“That’s inhumane. We should respect the dead. Those with relatives buried here don’t even have a clue where their relative’s remains are buried now,” said one resident.\n“This is not allowed. In our culture desecrating a grave is taboo,” voiced another.\n“We don’t know what’s so special about this person to the extent of displacing other graves.\n“The town council is answerable. How can they allow something like this to happen, relatives of the deceased must sue them,” another added.",
            "time": "20:34",
            "date": "07 Jan 2025"
        }
    ]
}