{
    "news": [
        {
            "title": "Govt pushes for new Occupational Safety and Health law",
            "href": "https://www.zbcnews.co.zw/govt-pushes-for-new-occupational-safety-and-health-law/",
            "content": "Story by Mercy Bofu-Matinha\nGOVERNMENT says it is pushing for the enactment of a new Occupational Safety and Health law expected to holistically address issues of safety at workplaces.\nThe Engineers’ Occupational Safety and Health (OSH) Workshop is currently underway in Masvingo, with the Minister of Public Service, Labour and Social Welfare Honourable Edgar Moyo having highlighted government’s concerns over occupational injuries and deaths.\n“The injury statistics over the past three-year period show a declining trend but, certainly remain highly elevated because of the loss of lives which is a major concern to the government. In this regard, the government will do everything possible to push for a new OSH law (The OSH Act) that should help us all as a nation to arrest this needless loss of lives at work as well as stop the horrendous experiences suffered by injured workers and their Families,” Honourable Moyo said.\nEngineers were also challenged to lead innovation and adopt technologies that revolutionise their approach to Occupational Health and Safety.\n“We are aware of the importance of OSH in fostering sustainable development. As a Province, we face unique challenges related to the safety of workers, particularly in industries such as mining, agriculture, and manufacturing. It is in this regard that the work you do as engineers and OSH professionals is invaluable,” Masvingo Minister of State for Provincial Affairs and Devolution, Honorable Ezra Chadzamira said.\n“Your expertise and commitment to safeguarding the health and safety of workers are central to creating a productive and secure working environment for all. The theme, “Occupational Safety and Health: Technology and the Future of Work,” is relevant in today’s ever-evolving industrial landscape. As technology continues to shape the future of work, it is crucial that we embrace these advancements to create safer and more efficient workplaces.”\nThe National Social Security Authority (NSSA) revealed that injury figures have been dropping for the past years and as an institution, they expect the OSH bill to harmonise all the OSH related laws.\n“The number one deliverable of the OSH bill is to harmonise all the small segments of legislations which currently exist in different sectors in our industry so that we have a single thrust which we can use and lay upon to leverage and make sure that we can supervise all the systems in terms of Occupational Safety and Health,” NSSA Board Chairman, Dr Emmanuel Fundira said.",
            "time": "20:41",
            "date": "20 Mar 2025"
        },
        {
            "title": "Several feared dead in early morning collision at Dzivarasekwa turn-off",
            "href": "https://www.zbcnews.co.zw/several-feared-dead-in-early-morning-collision-at-dzivarasekwa-turn-off/",
            "content": "Story by Fairstars Mukungurutse\nSEVERAL people are feared dead and others seriously injured following a tragic accident early Wednesday morning at the Dzivarasekwa turn-off along Bulawayo Road. The collision involved a commuter omnibus, a haulage truck, and a UD truck.\nThe Dzivarasekwa turn-off area has become notorious for frequent fatal accidents.",
            "time": "20:41",
            "date": "20 Mar 2025"
        },
        {
            "title": "Seven people perish in Dzivarasekwa accident",
            "href": "https://www.zbcnews.co.zw/seven-people-perish-in-dzivarasekwa-accident/",
            "content": "Story by Fairstars Mukungurutse\nPOLICE has confirmed that seven people died while eight others were seriously injured after a commuter omnibus, a haulage truck and a UD truck collided at the Dzivarasekwa Turn-Off along Bulawayo Road early Wednesday morning.\nThe Dzivarasekwa turn-off area has become a high accident zone.\nAccording to eyewitnesses, the commuter omnibus was hit from behind after the driver encroached into the lane of the haulage truck while reversing to pick up a passenger.\nAfter losing control of his vehicle, the driver crashed onto a stationary Nissan UD truck.\n“The accident occurred just before 5 am. A woman wanted to board the kombi so the driver reversed to pick up the passenger and there was a haulage truck coming from behind leading to the fatal crash,” an eyewitness said.\n“I am one of the first responders to the scene. When we arrived we tried to assist those who were critical, unfortunately we found some who were already deceased. We had to do CPR then managed to help a few and mobilised ambulances to come and ferry the injured to the hospital. The police came through to make sure the scene was properly managed,” a community member said.\n“This area has become a black spot, too many fatalities. We plead with responsible authorities for urgent assistance” a resident said.\n“The traffic lights are not even working and this exacerbates the situation,” another community member added.\nZimbabwe Republic Police Spokesperson Commissioner Paul Nyathi confirmed the incident.",
            "time": "20:41",
            "date": "20 Mar 2025"
        },
        {
            "title": "50 Chefs compete in Amai’s Traditional Cook-out Competition in Harare",
            "href": "https://www.zbcnews.co.zw/50-chefs-compete-in-amais-traditional-cook-out-competition-in-harare/",
            "content": "Patience Nyagato\nPROFESSIONAL chefs, along with 50 other participants, including tertiary students, community members, and individuals with disabilities, are currently taking part in the Amai’s Traditional Cook-out Competition held at Belvedere Technical Teachers College in Harare.\nHonourable Barbra Rwodzi, the Minister of Tourism and Hospitality Industry, emphasised that such cook-out competitions play a crucial role in promoting local hospitality tourism.",
            "time": "20:41",
            "date": "20 Mar 2025"
        },
        {
            "title": "Govt relocates Dema tollgate, easing costs for motorists",
            "href": "https://www.zbcnews.co.zw/govt-relocates-dema-tollgate-easing-costs-for-motorists/",
            "content": "Story by Peter Chivhima\nGOVERNMENT has started relocating tollgates from areas close to residential zones, with new facilities set to be transformed into modern toll plazas.\nMotorists in Seke have welcomed government’s decision to relocate Dema tollgate and transform the new facility into a toll plaza.\n“Sometimes I pass this area four to six times because I have a small business I am operating in this area so I end up paying a lot of money. So if this tollgate is relocated I am convinced that I will make a good profit,” a motorist said.\n“As a community member it means that we are going to pay less because transport operators will no longer paying for toll fees,” a community member said.\nThe construction of the Toll Plaza is also expected to create jobs for youths.\n“I am excited that the majority of those who will be employed are from this community. I want to thank His Excellency Cde Emmerson Mnangagwa for his vision,” Seke legislator Honourable Manyaradzi Kashambe said.\nZINARA Board Chairperson, Dr George Manyaya and the Chairperson of the Parliamentary Portfolio Committee on Transport and Infrastructural Development, Honourable Karikoga, who toured the new site for the Dema toll plaza this Tuesday, confirmed that several tollgates across the country will be relocated to about 40 kilometres from every town.",
            "time": "20:41",
            "date": "20 Mar 2025"
        }
    ]
}