{
    "news": [
        {
            "title": "Heritage-based Education Curriculum gains momentum, prioritising inclusivity and infrastructure",
            "href": "https://www.zbcnews.co.zw/heritage-based-education-curriculum-gains-momentum-prioritising-inclusivity-and-infrastructure/",
            "content": "Story by Kenias Chivuzhe\nTHE uptake and implementation of the Heritage-Based Education Curriculum is on course, with issues of inclusivity and infrastructural development at the centre of the strategy to deliver quality education under the Second Republic.\nTo assess progress recorded so far in the construction of schools and classroom blocks, the Ministry of Primary and Secondary Education has embarked on schools joint monitoring visits countrywide.\nPrimary and Secondary Education Minister Honourable Torerai Moyo who led a team in Manicaland province, expressed satisfaction with progress in the implementation of the heritage-based curriculum, revealing plans to construct 125 schools and 350 classroom blocks this year.\n“The issue of inclusive education is being respected in all our schools and we noticed that ramps have been established in all learning facilities as well as ablution facilities. We are also looking at libraries, science and computer laboratories to ascertain whether we are in line with the expectations of the National Development Strategy. As you are aware, we have rolled out the heritage-based curriculum.\n“We are targeting to build more than 350 classroom blocks. We also want to refurbish the classrooms so that the environment prevailing is conducive to effective learning. We are targeting not less than 125 schools in 2025. These are the key legacy projects that the Second Republic is doing in trying to provide quality, relevant and equitable education,” he said.\nManicaland education authorities and development partners concurred on the need to improve the quality and access to education in the country.\n“We are implementing the heritage-based curriculum that is focusing on the production of goods and services and which is premised on the philosophy of ‘Unhu’ which encourages the impartation of the identity for our students must be able to identify themselves as Zimbabweans. In that respect, we are mounting workshops to ensure that all our stakeholders in education receive some training concerning the tenancy of the heritage-based curriculum so that we advertise the curriculum for acceptance by stakeholders and learners.",
            "time": "06:29",
            "date": "07 Mar 2025"
        },
        {
            "title": "Gwanda Council enhances service delivery with new equipment and motorcycles",
            "href": "https://www.zbcnews.co.zw/gwanda-council-enhances-service-delivery-with-new-equipment-and-motorcycles/",
            "content": "Story by Providence Maraneli\nTHE government’s ongoing commitment to transforming communities and providing modern public services continues to take shape, with Gwanda Rural District Council recently procuring essential service equipment.\nAligned with the Second Republic’s ethos of leaving no one and no place behind, Gwanda Rural District Council is making significant strides in improving service delivery to its citizens.\nThis is reflected not only in the procurement of service equipment through devolution funds but also in the provision of 27 motorcycles for councilors, who previously had to walk over 20 kilometers to fulfil their duties.\n“We have used RDC funds to procure a tipper truck, a backhoe loader and motorcycles for the councilors. We realised that some of the wards are inaccessible and it was difficult for our councilors to serve their communities and hence we decided to procure these for them.\n“With Matabeleland south province largely rural, there is consensus among local leadership that the provision of motorcycles and the procurement of service equipment by the rural district council will go a long way in the implementation of the inclusive development agenda,” Gwanda RDC CEO, Mr Ranganai Sibanda said.\n“This kind gesture serves to ensure that councilors can efficiently access all areas hence simultaneously fostering greater engagement and coordination in the province’s development activities,” Matabeleland South Minister of State for Provincial Affairs and Devolution, Honourable Evelyn Ndlovu said.\n“This resonates well with President Emmerson Mnangagwa’s mantra of leaving no one and no place behind. It indeed embodies the President’s vision of ensuring that no one or no place is left behind in pursuit of prosperity and development.”\nThe government is on a drive to build modern communities.",
            "time": "06:29",
            "date": "07 Mar 2025"
        },
        {
            "title": "Bubi-Lupane poised for bountiful harvest",
            "href": "https://www.zbcnews.co.zw/bubi-lupane-poised-for-bountiful-harvest/",
            "content": "Story by Mhlomuli Ncube\nBUBI-Lupane Irrigation Scheme is poised for yet another good season after its members successfully secured crop financing through affordable loans.\nAfter establishing a village business unit that has become the national template of all-year-round irrigation, the Agricultural and Rural Development Authority (ARDA) administered scheme continues to contribute to national food security.\nThis year, the farmers planted a 120-hectare maize crop with funding to the tune of US$60 000.\nARDA assisted the Irrigation Scheme in securing the critical package, oiling the government’s rural development agenda in an area once famed for its barren desert conditions but now turned into an agriculture production hub.\nThe farmers running the scheme are excited about current production settings.\n“We have 120 hectares of maize under cultivation using two pivots. The third pivot is yet to be used as we await more funding and as soon as we get it, we will start planting. As you can see for yourselves our crop is good and we are satisfied,” Bubi-Lupane Irrigation Scheme Chairperson, Mr Gerald Khumalo said.\nThe farmers in the scheme have also received modern day scientific knowledge on farming as the Second Republic emphasises the need to take agriculture as a business.",
            "time": "06:29",
            "date": "07 Mar 2025"
        },
        {
            "title": "Manica Diamonds seek to mount strong title challenge this season",
            "href": "https://www.zbcnews.co.zw/manica-diamonds-seek-to-mount-strong-title-challenge-this-season/",
            "content": "Story by Kenias Chivuzhe\nMANICA Diamonds are seeking to continue their winning streak as they date FC Platinum in a Castle Lager Premier Soccer League encounter at Mandava Stadium this Saturday.\nFor the first time in three seasons, the Gem Boys managed to win their first match of the season after overcoming Yadah one-nil at Sakubva Stadium last week.\nThe arrival of Ghanaian attacker, Emmanuel Paga and winger Issa Sadiki from Dynamos, and the duo of Ransom Pavari and Lawrence Mhlanga from FC Platinum has given the Gems Boys hope.\n“The win against Yadah FC is giving us more energy to continue producing positive results. We have a setback where Liberty Masvaure had a fracture while Ransom Pavari has an angle injury. We have players to fill up the positions as we aim for a win.\n“Our team is very strong in defense as we have our goalkeeper Tedious Baye, and defenders who include Lawrence Mhlanga, Farai Banda, Ask Rupande, Chipo Tsodzo among others. In the past two seasons, we were failing to win the first game of the season but this time around we have managed to win. This gives us hope to have a good season as we aim to be champions. We ended last season on number four and we want to improve from that position to finish on number one or two,” Manica Diamonds Head Coach, Jairos Tapera said.\nThe Mutare-based outfit will miss the services of utility Rainsome Pavari who joined from FC Platinum this year, while defender Liberty Masvaure is also nursing a fracture.\nManica Diamond fans are optimistic of a good season but warned their team against complacency when they face FC Platinum.\n“We are happy with the team but there is need to improve on our attacking department. We need to score goals and we have a tough game with FC Platinum away. We need to play offensive football to win the match,” a football supporter said.",
            "time": "06:29",
            "date": "07 Mar 2025"
        },
        {
            "title": "Tobacco marketing season reaches US$5.45 per kilogram on second auction day",
            "href": "https://www.zbcnews.co.zw/tobacco-marketing-season-reaches-us5-45-per-kilogram-on-second-auction-day/",
            "content": "Story by Tendai Munengwa",
            "time": "06:29",
            "date": "07 Mar 2025"
        }
    ]
}