{
    "news": [
        {
            "title": "Discipline and legacy highlighted as key; Brigadier General Million Ndlovu takes over command of Two Infantry Brigade",
            "href": "https://www.zbcnews.co.zw/discipline-and-legacy-highlighted-as-key-brigadier-general-million-ndlovu-takes-over-command-of-two-infantry-brigade/",
            "content": "Story by Peter Chivhima\nDISCIPLINE among members of the Zimbabwe Defence Forces (ZDF) has been identified as a vital component in the country’s defence and security apparatus.\nThe two Infantry Brigade has a new command after Brigadier General Million Ndlovu took over from Brigadier General Charles Mashava at a colourful handover and takeover ceremony held in Harare this Wednesday.\nHanding over the command and Brigade formation colours, Brigadier General Mashava implored his successor to carry forward the Brigade’s legacy of excellence and commitment to service, while Brigadier General Ndlovu pledged loyalty to the nation.\n“In that regard, I want to urge my successor to take note of those projects that remain outstanding and embrace them so that the dream reaches fruition. That leaves me to thank Commander ZNA for giving me the opportunity to lead this great formation and for me to preside over this important parade. Your wise counsel and guidance has always given us the impetus and energy to carry or also embark on the new journey and mandate,” said Infantry Brigade Outgoing Commander, Brigadier General Mashava.\n“As I take over Command from, my former DS / teacher, Brigadier General Charles Mashava who taught me a lot during his days at the Staff College, I would like to thank the outgoing Commander for his selfless service to the two Infantry Brigades. I will endeavour to build from where he left and I will always knock on his door for advice and wisdom, he will no longer be my DS but will be my consultant,” said Infantry Brigade Incoming Commander, Brigadier General Ndlovu.\n“My clarion call to service to all the officers and men of 2 Infantry Brigade is to continue to give the same support that you were rendering to the outgoing commander. I want us to work as a team together to fulfil our obligation as a brigade,”\nCommander Zimbabwe National Army (ZNA) Lieutenant General Anselem Sanyatwe challenged the incoming Commander to consolidate the Brigade’s achievements and mission of safeguarding national security.\n“The people of Zimbabwe have high hopes and expectations for the future and as the Zimbabwe National Army, we should ensure that the conducive and tranquil environment prevails so that all government developmental programmes, citizenry of this nation and its visitors alike enjoy a sense of belonging and security in this beautiful motherland. We should all therefore understand the government’s vision for development in its entirety to contribute meaningfully to improving the lives and security of our people in this regard, the modernization of the ZNA’s capabilities is one of my priorities despite the prevailing economic challenges. We shall therefore continue to engage government through the ministry of defence to ensure that ZNA gets the requisite equipment to ensure that it remains a formidable force, operationally ready and capable of responding rapidly to any eventuality,” said Commander ZNA, Lieutenant General Anselm Sanyatwe.\nBrigadier General Mashava has been appointed ZNA Director General of Civil Military Relations at the ZDF Headquarters.\nMeanwhile, in a separate ceremony, Commander Air Force of Zimbabwe Air Marshal Jacob John Nzvede presided over the promotion and investiture of Air Commodore Ekironi Madzanira who has been elevated from the rank of Group Captain to Air Commodore upon his retirement.",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Govt allocates funds for construction of 80 new schools",
            "href": "https://www.zbcnews.co.zw/govt-allocates-funds-for-construction-of-80-new-schools/",
            "content": "Story by Fungai Jachi\nTHE Government says it remains committed to fulfilling its top priorities in the education sector, with funds for the construction of at least 80 new schools having been availed.\nIn response to a motion moved in the National Assembly on the state of infrastructure in schools as well as the teacher-pupil ratio among other issues, Primary and Secondary Education Minister Honourable Torerai Moyo who presented a ministerial statement in Parliament this Tuesday, assured legislators that the construction of schools is on course as funds have been availed.\n“In the 2025 school calendar, we have secured adequate resources to construct new schools. We are targeting not less than 120 new schools including 30 new schools, we have already received funding from the Ministry of Finance through the Building Society and they will be distributed to all the provinces. We have a partner who has offered us funding for 50 schools. 40-day schools and 10 boarding schools. We are constructing climate-proof schools,” he said.\nHe also gave an update on the recruitment of teachers and registration of satellite schools.",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Zim pushes for investment in fertiliser production to address import challenges",
            "href": "https://www.zbcnews.co.zw/zim-pushes-for-investment-in-fertiliser-production-to-address-import-challenges/",
            "content": "Story by Fairstars Mukungurutse\nINVESTMENT in the fertiliser production value chain took centre stage when the Ministry of Industry and Commerce appeared before the Parliamentary Portfolio Committee on Industry and Commerce at the New Parliament Building in Mt Hampden this Tuesday.\nWith the country’s fertiliser industry operating below capacity due to various macroeconomic factors, Zimbabwe has become a perennial importer of fertiliser.\nAppearing before the Parliamentary Portfolio Committee on Industry and Commerce, officials from the Ministry of Industry and Commerce attributed the reliance on imports to a number of challenges.\n“On the fertiliser issue, we do have a five-year fertiliser roadmap, which we have always been implementing together with the fertiliser companies. I think the key issue, as far as the fertiliser companies are concerned, is the timeous payment, you know, it does affect the cash flows.\n“The issue of electricity, as well as the foreign currency availability for them to bring in raw materials also included. What is key from the value chain of the fertiliser, we know that Sable Chemicals is the key company that is to produce ammonium nitrate in a timeous manner, we have actually been advising them that it is not good for us to be importing when we actually have the resources locally,” said Industry Development chief director, Ms Florence Makombe.\n“So it’s an area, you know, which we have to accelerate policy intervention, assisting that sector, because they also need financing to some extent and timeous payment so that at least they can efficiently place orders on raw materials because we’ve been competing with other countries in the region.\n“They have indicated to us that they would require something, I think, Sable Chemicals would require something in the region of about US$3 million per month. But I think the challenge is, that they decided to retool the company. So they are focusing at the moment on an Afreximbank loan for them to retool their company, which has taken, some time. But we are monitoring them and trying to see if they can come back to be producing timeously.\n“They have indicated to us that maybe starting in March they should be able to start producing uranium nitrate. Dorowa, I think, is a company also that has got raw materials, but there is financing that is required for Dorowa to be up and running, and also the issues of challenges of electricity are also affecting Dorowa,” she said.\n“We have, I think, 200 years of resource of phosphate in the Dorowa. What it takes is a dozer, an excavator, a tipper, and perhaps a conveyor belt into the plant, and an unlimited or uninterrupted quality supply of electricity in the plant.\n“We have a five-year road map which our chipper has maintained. And that five years have been derailed because of poor funding and also corrected directly, taking measures that might not need money because if we say, for instance, we are going to take three weeks of uninterrupted supply to Dorowa so that we can manufacture the cement, the fertilizer we need, we will do that. And the total demand of the country and utilisation of power is not affected.\n“We can shut them out for another three weeks by giving them power for three hours, which is exactly the time they need to power up their plant. And then it goes. Then whatever is inside goes to waste, because when they power up that has got to be taken as waste,” said Permanent Secretary in the Ministry of Industry and Commerce, Dr Thomas Utete Wushe.\n“So we need to be serious about fertilizer as a nation so that we can be self-sufficient and therefore be able to give our input. Agriculture and mining are the mainstays of the economy, and this is where the ministry comes in to value add. We should make sure that these input costs are maintained at lower levels. So, chairman and members, we have work to do. And I am very happy because, at the very first cabinet meeting, His Excellency came out very strongly about the cost of the process, about looking at how we should be competitive,” he said.\nChairperson of the Parliamentary Portfolio Committee on Industry and Commerce Honourable Clement Chiduwa underscored the need to accelerate investment in the fertiliser value chain.",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Victoria Falls’ pestigious ‘Wetland City’ status to boost conservation and sustainable tourism",
            "href": "https://www.zbcnews.co.zw/victoria-falls-pestigious-wetland-city-status-to-boost-conservation-and-sustainable-tourism/",
            "content": "Story by Tichaona Kurewa\nSTAKEHOLDERS are optimistic that the prestigious “Wetland City” status accorded to the City of Victoria Falls will further boost conservation efforts and sustainable tourism in the area.\nThe City of Victoria Falls was early this year accredited a “Wetland City” status, in recognition of Zimbabwe’s outstanding conservation efforts.\nThe Ramsar Convention on Wetlands, which is the accrediting board, outlined some of the benefits that come with the status.\n“The benefits of having to be accredited as a Wetland City is really a demonstration of how you are taking care of the wetlands in the city, but also for the local government, for the mayor of the town, bridging with the communities, businesses and public sector to say the reason we are saving the natural environment and also the wetlands, in particular, is because they matter for people.\n\n“So it’s a really great opportunity for Victoria Falls, to be able to share with the world their experience, but also for local citizens in this city to know why the wetlands matter,” said Ramsar Convention on Wetlands Secretary General, Dr Musonda Mumba.\nVictoria Falls authorities and tourism players predict a surge in visitors to the city.",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Climate change resilience guidelines for state enterprises launched",
            "href": "https://www.zbcnews.co.zw/climate-change-resilience-guidelines-for-state-enterprises-launched/",
            "content": "Story by Stanley James, Business Editor\nTHE government has reaffirmed its commitment to sustainable development following the rollout of Climate Change Resilience Guidelines for State Enterprises and Parastatals (SEPs).\nIt emerged during the official launch of the guidelines in Harare this Tuesday that despite contributions by the State Enterprises and Parastatals (SEPs) to national development, most of them lack policy roadmaps to Zimbabwe’s climate change agenda.\nThe guidelines are expected to ensure that SEPs embrace low carbon emissions and climate resilience.\n“State Enterprises represent a powerful policy tool for the Government of Zimbabwe to implement policies that will help the country’s climate change mitigation and adaptation strategies, The SEPs with their significant economic influence and capacity to adopt sustainable practices can play a key role in driving climate action,” said State Enterprises Restructuring Agency executive director, Mr Onesimo Musi.\nThe SEPs are also considered strategic in achieving the climate change mitigation agenda.\n“The adoption of climate change resilience Guidelines for the SEPs is expected to significantly and positively impact the sector, this is against the background that the guidelines will provide a framework for the SEPs to integrate climate change considerations into their policies, strategies and operations, thereby enhancing their resilience and contributing to the country’s sustainable development goals,” Ministry of Environment, Climate and Wildlife chief director, Mr Washington Zhakata said.\nThe government is dedicated to aligning its climate change policies with the UN Framework Convention and the Paris Agreement.",
            "time": "18:37",
            "date": "26 Feb 2025"
        }
    ]
}