{
    "news": [
        {
            "title": "President Mnangagwa mourns Seke Road victims, calls for stiffer traffic measures",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-mourns-seke-road-victims-calls-for-stiffer-traffic-measures/",
            "content": "Story by ZBC Reporter\nPRESIDENT Emmerson Mnangagwa says government is working on new and robust measures to clamp down on road traffic accidents.\nIn a statement consoling families of the 17 people who perished in a tragic accident along Seke Road in Chitungwiza this Tuesday,  President Mnangagwa said the nation cannot continue losing lives in such horrendous ways, adding that new measures must be enforced across various institutions responsible for road use.",
            "time": "06:52",
            "date": "24 Jul 2025"
        },
        {
            "title": "Mash West Heroes Acre upgrade nears phase one deadline",
            "href": "https://www.zbcnews.co.zw/mash-west-heroes-acre-upgrade-nears-phase-one-deadline/",
            "content": "Story by Tamuka Charakupa\nCHINHOYI – CONSTRUCTION works at the Mashonaland West Provincial Heroes Acre in Chinhoyi are progressing steadily, with authorities expressing confidence that the first phase of the facelift project will be completed within the targeted 21 days.\nWith just seven days remaining, key milestones have already been achieved, including the near-completion of four ablution blocks, which are now at the roofing stage.\n“We are on course in terms of achieving our targets. We are now at the roofing stage for the ablution facilities and the guard room. This week, we are also going to sink boreholes, erect water tanks, and finish all the internal work. We are also going to install the perimeter fence in the coming week.  Phase one is expected to be completed on or before the 21-day target. After that, we commission and begin phase two,” Project Coordinator, Lieutenant-Colonel Tichaona Masanganise said.\nLieutenant-Colonel Masanganise highlighted that the project is not just infrastructural but symbolic, aimed at preserving national memory and honouring liberation heroes buried at the site.\n“Places like the Chinhoyi Provincial Heroes Acres carry deep national history as far as the liberation struggle is concerned. These sites are sacred and preserving them is not only a duty to history, but a message to future generations about the price of freedom,” he said.\nDuring an inspection of the ongoing works, Air Vice Marshal (Retired) Dennis Jaricha, Vice Board Chairperson of the Zimbabwe Defence Forces (ZDF) Hunyani Farm, applauded the project’s pace and progress.",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "Zimbabwe Gender Commission celebrates decade of championing gender justice",
            "href": "https://www.zbcnews.co.zw/zimbabwe-gender-commission-celebrates-decade-of-championing-gender-justice/",
            "content": "Story by Tamuka Charakupa\nTHE Zimbabwe Gender Commission is celebrating a decade of championing gender equality and justice, with the institution confirming to have resolved over 4 000 gender-related cases over the years.\nThe Mashonaland West Gender Forum hosted in Chinhoyi this Tuesday brought to the spotlight the need for increased gender balance amid concerns of men suffering in silence.\n“As traditional leaders, we have witnessed firsthand the positive impact of the Zimbabwe Gender Commission, particularly in addressing gender-based violence in our communities. Their interventions have brought justice and healing to many, especially women and girls who for long suffered in silence. I also want to highlight the growing concern around men who are quietly enduring abuse and feel ashamed to speak out due to societal expectations. Gender-based violence affects everyone, and we must increase awareness and support systems for male victims as well,” traditional leader, Chief Nemakonde said.\n“The Zimbabwe Gender Commission is helping expose historical injustices against the girl child, such as child marriages and denial of education. Through advocacy and policy influence, the Commission is promoting equal opportunities in education, leadership, and economic participation, breaking long-standing cycles of marginalisation and ensuring a fairer future for girls,” Institute for Young Women Development official, Mr Kudakwashe Munemo said.\nGovernment says to date, at least over 4000 gender-related cases have been resolved, influencing key initiatives such as the establishment of a dedicated call centre and decentralisation of offices as explained by Zimbabwe Gender Commission chairperson, Dr Nyepudzai Nyangulu.\n“While we celebrate institutional achievements, it is also important that we reflect on successes made in the gender sector as a collective over the past decade. Among the key milestones are pivotal legislative reforms which include the Amendment of the Marriages Act (2022) which raised the legal marriage age to 18, ending child marriages and recognised unregistered customary marriages, protecting women from exploitation. Data Protection Act (2021) which strengthens protection of women and children from online violence. Education Amendment Act of 2020, ensuring that girls are not excluded from education due to pregnancy or motherhood and the recently launched National Gender Policy, meant to give effect to constitutional provisions.”",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "Fake goods uncovered in Harare tuck shops",
            "href": "https://www.zbcnews.co.zw/fake-goods-uncovered-in-harare-tuck-shops/",
            "content": "Story by Stanley James, Business Editor\nHARARE – ZIMBABWE has stepped up efforts to stamp out the selling of counterfeit products in the market, amid fears they expose consumers to health risks.\nDuring a routine inspection exercise in downtown Harare this Tuesday, a number of tuck shops were found with fake products, including mealie meal packages in large quantities.\nInspectors from the Consumer Protection Commission and the Trade Measures Department under the Ministry of Industry and Commerce were accompanied by the members of the Zimbabwe Republic Police to investigate the fake products after whistle-blowers had contacted them.\n“This is the fake Pearlenta which is not even our product you can see all the features of the commodity do not tally with our prescribed trade or logo features meaning that there is something being done in terms of what they ate doing here now the next step is to look at the contents or what is inside after realising or discovering wrong packaging,” Quality Assurance Supervisor for National Foods Limited, Mr Nyasha Mudita said.",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "17 people killed in horror collision between truck and commuter omnibus",
            "href": "https://www.zbcnews.co.zw/17-people-killed-in-horror-collision-between-truck-and-commuter-omnibus/",
            "content": "Story by ZBC Reporter\nSEVENTEEN people have died after a 30-tonne haulage truck veered off the road, encroached into the oncoming lane, and collided with a commuter omnibus along Seke Road in Chitungwiza this Tuesday morning.",
            "time": "06:53",
            "date": "24 Jul 2025"
        }
    ]
}