{
    "news": [
        {
            "title": "Zim welcomes Asian travel agents amid growing tourism appeal",
            "href": "https://www.zbcnews.co.zw/zim-welcomes-asian-travel-agents-amid-growing-tourism-appeal/",
            "content": "Story by Tichaona Kurewa\nZIMBABWE is currently hosting nine travel agents from key Asian markets, including Singapore, Hong Kong, and the Philippines.\nThe agents arrived in the country this Friday through the Victoria Falls International Airport, courtesy of Qatar Airways, Thompsons Africa, and Gateway Singapore.\nAs part of a familiarisation tour, the agents will experience the country’s iconic attractions, such as the Victoria Falls rainforest, The Boma dining experience, and site inspections of various accommodation facilities in Victoria Falls.\nThis tour highlights Zimbabwe’s increasing appeal to new markets, particularly in Asia. With Hong Kong’s outbound tourism market projected to reach 863.2 million by 2025, Zimbabwe is poised to capitalise on this growth.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Motorbikes(50) commissioned for Mberengwa councillors to boost service delivery",
            "href": "https://www.zbcnews.co.zw/motorbikes50-commissioned-for-mberengwa-councillors-to-boost-service-delivery/",
            "content": "Story by Courage Bushe\nGOVERNMENT has commissioned 50 motorbikes for Mberengwa Rural District Council through devolution and internally generated funds.\nAs the government continues with the devolution agenda, Mberengwa District Councillors have received 50 motorbikes to accelerate developmental projects.\n“Today’s occasion marks yet another major milestone in our efforts to enhance public service delivery and community engagement. These motorbikes will facilitate our mobility, enabling us to connect with constituents more effectively,” said a beneficiary.\n“Equipment recapitalisation is a key driver in the achievement of the National Development Strategy 1. We appreciate this and, we are going to reach every part of the community,” said a beneficiary.\nMberengwa Rural District Council Chairperson, Councillor Garisikai Moyo hailed the Government’s devolution strategy.\n“We appreciate this, we managed to secure this on our own, we need to improve and up our game in service delivery. This will enhance their mobility in their respective wards, resulting in the effective and efficient coordination of developmental activities throughout the 35 wards,” he said.\nThe Government has reaffirmed commitment to the turnaround of local authorities.\n“The commissioning of these motorbikes confirms the Second Republic’s desire for speedy and impactful people-centric and results oriented implementation of programs and projects as we move towards the attainment of a prosperous and empowered upper-middle income society, earlier than 2030,” said Midlands Province director coordination, Mr Kudakwashe Machako.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Kuvimba Mining house unveils “green belt” initiative",
            "href": "https://www.zbcnews.co.zw/kuvimba-mining-house-unveils-green-belt-initiative/",
            "content": "Story by Tapiwa Machemedze\nKUVIMBA Mining House has unveiled a “green belt” initiative targeting to plant at least 100 000 trees at its mines this year under an environmental sustainability programme.\nThe initiative which will be conducted annually dovetails with the national drive focusing on interlinked interventions such as tree planting.\n21-year-old Vongai Chimbunde engages her fellow graduate trainee, Florence Mangai in a deep conversation as they make their way to participate in a programme that will not only help their future but generations beyond.\nUnmindful of the scorching heat, they get busy joining their colleagues to relay tufts of grass as part of rehabilitating the environment at Freda Rebecca Mine after the construction of a new Tailings Storage Facility (TSF).\n“It is very important to me in terms of maintaining the natural environment since I am doing mining engineering, we have to consider the ecosystem left after we are done with the mining process,” Chimbunde said.\n“Well it is important for me as a SHEQ student because we are restoring nature, and we are showing the importance of biodiversity to us as a mining company,” Mangai said.\nUnveiled at Freda Rebecca Mine in Bindura this Friday, the sustainability campaign aims to promote environmental stewardship and build environmental resilience across mines under Kuvimba Mining House.\n\nThe programme is double fold, interlinked to afforestation while also acting as a critical tool to control soil erosion.\n“From our TSF extension, we moved a lot of soil and vegetation, clearly the natural habitat has been disturbed so we have to go some way in restoring the natural environment to what it was, so it’s just the beginning. This year alone, we planted 10 000 trees in January, and we added another 800 last week, and today we are doing 1 000,” said Freda Rebecca Mine managing director, Mr Patrick Shayawabaya.\nThe local leadership has hailed the initiative as critical in promoting sustainable woodland management practices.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "GeoPomona waste-to-energy project enters final construction phase",
            "href": "https://www.zbcnews.co.zw/geopomona-waste-to-energy-project-enters-final-construction-phase/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE GeoPomona Waste to Energy Project is entering its final construction phase and continues to garner widespread support from key partners, including the country’s largest commercial bank, CBZ Holdings.\nA delegation from CBZ, led by Group Chief Executive Officer Mr Lawrence Nyazema, visited the project in Harare this Thursday.\nSince taking over waste collection responsibilities from the City of Harare last year, GeoPomona has made a significant impact, collecting an average of 1 500 tonnes of solid waste per day from illegal dumpsites.\nWith the sorting plant at the waste management project site in Harare now complete, the firm awaits construction of the main waste-to-energy plant which will generate at least 22 megawatts of electricity once operational.\n“This project is the first of its kind in Africa and we are excited to continue supporting GeoPomona until the project gets to finality. The modern equipment at this site attests to the effectiveness of the project as a solution to the waste management challenges faced by Harare,” Nyazema said.\nGeoPomona Chief Executive Officer Dr Dilesh Nguwaya owes the success of the project to their partners who are providing key support.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Zim celebrates progress in promoting gender equality and women’s empowerment",
            "href": "https://www.zbcnews.co.zw/zim-celebrates-progress-in-promoting-gender-equality-and-womens-empowerment/",
            "content": "Story by Kenias Chivuzhe\nTHE International Women’s Day commemorations, held this Friday in Marange, Manicaland Province, provided an opportunity to reflect on the progress made in advancing gender equality and empowering women.\nThousands of individuals gathered at Munyarari Primary School in Marange, Mutare Rural, where women expressed their gratitude for the support received from both the government and development partners in furthering their empowerment.\n“We are appreciative of the support for us women with disabilities to start business ventures. We are being supported to start agricultural projects. The inclusive development thrust by President Emmerson Mnangagwa is transforming our lives,” a community member said.\n“The empowerment drive has capacitated us not to over-rely on men for survival. The empowerment programmes are improving our worth in society. We also want to thank the Women’s Bank for giving us money to start businesses. The support has transformed my life,” another added.\nDevelopment partners reflected on the strides made in the promotion of gender equality and women empowerment in Zimbabwe.\n“Zimbabwe has shown promising progress in advancing women’s equality. We will continue to support gender equality in our collaborative efforts. We want to guarantee access to technology and support the fight to end all forms of violence against women. Let us commit ourselves to promote gender equality and empowerment,” United Nations Resident Coordinator His Excellency Edward Kallon said.\n“Through the Team Europe initiative on gender equality, we are supporting this cause with over €280 million from 2021 to 2027. We also recently committed an additional €7 million to further strengthen these efforts.\n“Additionally, the European Investment Bank and STANBIC Bank have launched a €20 million gender facility to provide loans to women-owned businesses. This is because we believe that by investing in women, we are investing in Zimbabwe’s future,” Swedish Ambassador to Zimbabwe Mr Per Lindgarde stated.\nThe government says while empowerment initiatives are bearing fruit, priority should also be on fighting vices such as discrimination, child sexual exploitation and gender-based violence.\n“As Manicaland province, we are enjoying investments aiming to uplift the lives of women. Jopa Safe Market, Hauna Processing Plant, Cynara Diary and Chikanga mushroom project are some of the flagship investments brought to the province to uplift women. We are proud that impactful change is noticeable among these and many women in Manicaland.",
            "time": "18:28",
            "date": "09 Mar 2025"
        }
    ]
}