{
    "news": [
        {
            "title": "Challenged but not forsaken,’ disabled woman pens book to share life story",
            "href": "https://www.zbcnews.co.zw/challenged-but-not-forsaken-disabled-woman-pens-book-to-share-life-story/",
            "content": "Story by Jerold Sasa\nA 50-year-old woman with disability from Marondera, Christina Tsitsi Gororo has written a book to share her life’s trials and tribulations.\nThe book titled: ‘Challenged but not forsaken,’ is a narration of Christina’s life from the time she became disabled at the age of 10.\nA weaver, tailor and designer by profession Gororo uses her legs for all her work including typing on her laptop and writing.\n“My book is the story of my journey of life from birth which I testify about my victories and defeats, sadness and happiness. I managed to pen down my struggles and questions as I sought answers for the suffering that had befallen me. ‘Challenged but not forsaken,’ is a book that encourages, motivates and inspires those who are having challenges in life to have hope and understand that though they may be having challenges, they must never think that they are forsaken,” she said.\nAs if her life challenges were not enough, she encountered another frustrating experience as she was writing her book which almost forced her to abandon the mission.",
            "time": "08:44",
            "date": "24 Apr 2025"
        },
        {
            "title": "Tragic collision with elephant claims life on Kazungula Road",
            "href": "https://www.zbcnews.co.zw/tragic-collision-with-elephant-claims-life-on-kazungula-road/",
            "content": "Story by Tichaona Kurewa\nONE person diedandfive were injured after a vehicle collided with an elephant on Kazungula Road Wednesday eveningapproximately40 kilometres from Victoria Falls.\nThe incident involved a Toyota Isiswhichcollided with a sub-adult female elephant.\nAccording to reports, thedriver of the vehiclewas travelling towards Victoria Falls City and attempted to overtake a stationary vehicle displaying hazard lights, unaware of the danger ahead.\nThe vehicle struck the elephant, whichsubsequently landed on the roof of the car.\nIt was revealed that the stationary vehicle had come to a haltin an effort toavoid a collision with the same elephant.\nTheforce of the impactpropelled the vehicle approximately 100 metres into the bush, with the elephant still atop it. All six occupants of thevehiclewere trapped inside.\nTragically, the front-seat passenger was pronounced dead at the scene.",
            "time": "08:44",
            "date": "24 Apr 2025"
        },
        {
            "title": "Liberation War Hero Cde Rachel Chatora laid to rest with military honours",
            "href": "https://www.zbcnews.co.zw/liberation-war-hero-cde-rachel-chatora-laid-to-rest-with-military-honours/",
            "content": "Story by ZBC Reporter\nFREEDOM fighter Cde Ndai Rachel Chatora who died on April 19 has been laid to rest at Plot 2, Riverview Farm in Bindura.",
            "time": "08:44",
            "date": "24 Apr 2025"
        },
        {
            "title": "ZITF launches inaugural rural industrialisation Indaba",
            "href": "https://www.zbcnews.co.zw/zitf-launches-inaugural-rural-industrialisation-indaba/",
            "content": "Story by Lisa Masuku-Kurira",
            "time": "08:45",
            "date": "24 Apr 2025"
        },
        {
            "title": "Artists applaud devolution agenda for empowering grassroots talent",
            "href": "https://www.zbcnews.co.zw/artists-applaud-devolution-agenda-for-empowering-grassroots-talent/",
            "content": "Story by ZBC Reporter\nARTISTS have hailed the Second Republic’s devolution agenda, citing it as a transformative force that has opened up new avenues for creative expression and community engagement.\nSpeaking at the District Independence Day celebrations held at Darwin High School in Mt Darwin, Precious Makomo, the leader of the musical group Precious Makomo and the God’s Saints, said the commemorations gave local performers a rare opportunity to showcase their talent.\n“Whenever we get these platforms, we use them to preach against social ills affecting the youth, like drug and substance abuse,” Makomo said.",
            "time": "08:45",
            "date": "24 Apr 2025"
        }
    ]
}