{
    "news": [
        {
            "title": "Security Services benefit from Presidential Solarised Borehole Programme",
            "href": "https://www.zbcnews.co.zw/security-services-benefit-from-presidential-solarised-borehole-programme/",
            "content": "Story by Aifheli Mudau\nTHE Government’s target to sink 35 000 solarised boreholes by 2025 is well on course, with Imbizo Barracks in Bulawayo being the latest to benefit from the initiative.\nAs part of efforts to accelerate the Presidential Solarised Boreholes Programme across the country, the Ministry of Finance, Economic Development and Investment Promotion handed over three solarised boreholes this Friday.\n“Water challenges are now a thing of the past and we are sure that this project will have an impact on all of us including the surrounding communities. Development and peace are intertwined and as such this will give the security services time to concentrate much on their duties,” Zimbabwe National Army Chief of Staff Quartermaster Staff, Major General Simo Maseko said.\nThe Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube said the programme speaks to the aspirations of Vision 2030.",
            "time": "18:08",
            "date": "03 May 2025"
        },
        {
            "title": "A Life in darkness, Matavire family’s struggle with visual impairments",
            "href": "https://www.zbcnews.co.zw/a-life-in-darkness-matavire-familys-struggle-with-visual-impairments/",
            "content": "Story by Gay Matambo\nPERSONS with disability often face marginalisation, lack of access to employment and life opportunities owing to their incapacity.\nOne often wonders what the daily struggles of a family comprising of seven visually impaired members include.\nWhenever it is dark, we rush to find comfort and security in a place where there is light, but for the Matavire family nature and genetics was not so kind as it embedded darkness in their everyday lives.\nMrs Maria Matavire and her husband of village 18 in Feversham area, Chiredzi North who are both visually impaired, never dreamt that all their five children were also going to inherit the same impairment.\nThere is an adage which says “when going through difficult times, there are few friends to help you”, and this has made the family learn to get on with their day to day lives on their own, despite the huge risk of hurting themselves in the process.\n“When I gave birth to my first child, after noticing that he could not see we took him to the Doctors in Morgenster and they told us to return with him at the age of five. We went back and they said they could not figure out how to help him regain his eyesight.\n“With my second born, I decided to go to give birth in Mozambique where I was born. The doctors confirmed she could see when she was born, and when we were walking home from the hospital that is when my aunt told me that the baby could not see anymore. So this has been the trend, on all of my children. When they were born the midwives told us they could see but shortly after, a few days at most, the elders would confirm that the children could not see anymore. I have learnt to do things on my own. I cook, fetch water and clean on my own. Sometimes our relatives assist us but we have learnt to do things on our own,” Mrs Matavire said.\nThe couple’s wish is to know what caused the blindness of their children and maybe, if it is an illness that can be cured, they hope that maybe in future, their children will be able to regain their eyesight.\n“If funds would permit I would be more than happy to know what caused the blindness and get to the bottom of this because with me, I could see when I was born up to the age of seven and my parents said measles caused the loss of my eyesight same with my wife she could see when she was born. For me, my wish is to know the cause of this demise that has befallen my family.\n“Back then I used to own goats but I lost most of them from diseases so we would sell the goats to make ends meet and even pay school fees for the children who are at school at Copota School of the blind in Masvingo.\n“At the moment it is a bit difficult for us. I do not want to lie though the future is bright because the children are registered under the government’s BEAM programme,” Mr Shackmore Matavire said.\nAlthough relatives and neighbours seem to share their pain, they can only do so much.\n“I am the grandmother and the family lives with me here. It is a sore sight to see my children and grandchildren like this. I have always asked myself what caused this but I have no answers,” Gogo Matavire said.",
            "time": "18:08",
            "date": "03 May 2025"
        },
        {
            "title": "Young Women4ED launches goat rearing project in Tsholotsho",
            "href": "https://www.zbcnews.co.zw/young-women4ed-launches-goat-rearing-project-in-tsholotsho/",
            "content": "Story by Mhlomuli Ncube\nTHE Young Women for Economic Development has launched a goat-rearing project focused on empowering young women in Matabeleland North’s Tsholotsho area.\nThere was jubilation at Mhlabangubo Primary School this Thursday when the goat project was rolled out.\nThe beneficiaries expressed joy at the potential of the initiative to transform their lives.\n“This is an important project where I have received a starting point in my drive to do goat keeping as a business. I want to thank the government and the President for giving me this opportunity,” a beneficiary said.\n“I will look after my goats and grow them to a herd that sustains my business,” another beneficiary said.\n“For me as a woman, this means a lot. It means being involved in a business mainly a preserve for man. Thank you, President Mnangagwa,” a beneficiary added.\nThe project seeks to ensure women are kept in the mainstream national means of production and economic development.",
            "time": "18:08",
            "date": "03 May 2025"
        },
        {
            "title": "Workers pleased with govt’s commitment to improve their welfare",
            "href": "https://www.zbcnews.co.zw/workers-pleased-with-govts-commitment-to-improve-their-welfare/",
            "content": "Story by Tendai Munengwa\nAS Zimbabwean workers commemorated May Day this Thursday, improving employee welfare emerged as the central focus, with the government receiving praise for its willingness to engage workers and address their concerns through dialogue.\nIn the capital, Harare, the Zimbabwe Confederation of Public Sector Trade Unions (ZCPSTU), in partnership with the Public Service Commission, hosted the commemorations. The event drew representatives from various progressive workers’ associations across sectors.\n“We are happy with the government’s move to afford us opportunities to dialogue on our welfare. We are managing to present our concerns and while some are taking time to be resolved, the government is not paying a deaf ear to the workers,” Zimbabwe Confederation of Public Sector Trade Unions president, Cecilia Alexander said.\n“The issue of remuneration of our teachers is the biggest challenge but we continue to urge government to come to the table as our challenges can only be resolved through dialogue,” PTUZ Secretary General, Raymond Majongwa said.\n“We have most of the presentation being listened to. We want to thank the government for availing incentives that will enable teachers to keep going,” ZIMTA CEO, Sifiso Ndlovu notes.\n“The hospital and health sectors as a whole is being overwhelmed, we are happy that the government is recruiting and trying more nurses but the gap is big so we call for mass recruitment and training so that we fill the gap,” Nurses Associations representative, Maxwell Muchato said.",
            "time": "18:08",
            "date": "03 May 2025"
        },
        {
            "title": "Govt launches fumigation blitz to combat Mbare bed bug crisis",
            "href": "https://www.zbcnews.co.zw/govt-launches-fumigation-blitz-to-combat-mbare-bed-bug-crisis/",
            "content": "Story by John Nhandara\nTHE government has launched a fumigation blitz in Harare’s Mbare suburb to get rid of bed bugs which have been reported in the high-density area.\nThe fumigation blitz is in response to the escalating bed bugs infestation mostly in residential flats such as Matererini.\n“We appreciate the efforts by all stakeholders because we are having a torrid time here in Mbare,” a resident said.\n“We are relieved that government has intervened, we hope this will be a continuous process until we get rid of bedbugs,” another added.\n“This is a milestone to address the pressing issue of bedbugs. We have witnessed concerted efforts from all stakeholders to eliminate bedbugs and achieve the desired results within the shortest possible time possible,” Deputy Minister of Information, Publicity and Broadcasting Services, Dr Omphile Marupi stated.\nApart from the fumigation blitz, plans are underway for the construction of new blocks of flats in Mbare and refurbishment of the old ones.\n“We must work together. Please cooperate with those fumigating your houses. We have been sent with the President to fumigate all the places here in Mbare. Government is aware of this challenge. We have a programme to build new blocks of flats and also refurbish all the 53 old blocks of flats,” the Minister of Local Government and Public Works, Honourable Daniel Garwe said.",
            "time": "18:08",
            "date": "03 May 2025"
        }
    ]
}