{
    "news": [
        {
            "title": "Manicaland to host the 18th Sanganai/Hlanganani Tourism Expo",
            "href": "https://www.zbcnews.co.zw/manicaland-to-host-the-18th-sanganai-hlanganani-tourism-expo/",
            "content": "Story by Kenias ChivuzheManicaland province will host the 18th edition of the Sanganai/Hlanganani World Tourism Expo as the prime tourism event that was only being held in Bulawayo for the past 17 years is now being taken to other provinces in line with the devolution agenda.In an interview during the tour of Mutare Sports Club in Mutare, which will be the main venue for Africa’s premier tourism event between the 10th and the 12th of September, the Minister of Tourism and Hospitality Industry, Honourable Babra Rwodzi spoke on the decision to take the tourism event to Manicaland province.“The decision that prompted us to host Sanganai away from the usual venue for the past 17 years, which is ZITF in Bulawayo, is to follow the vision of the President and achieve Vision 2030 of an upper middle income economy,” she said.“We have realised that we are one of the key ministries which are pillars to the economy of the country and the President has, since 2017, been telling the world that ‘I will achieve an upper middle income economy by devolving my economy and by taking all the programmes of the government to every corner of the country, leaving no one and no place behind’. Sanganai is a huge event, and we thought the event would contribute towards the growth of GDP in Manicaland.“We did not randomly choose Manicaland, but we agreed that every year, we must have a destination that we speak loud about so as to promote and market it. As a strategy, we want to go to different provinces every year. Victoria Falls is well known as one of the Seven Wonders of the World, but Victoria Falls is not Zimbabwe. This year, we are in Manicaland, and next year, we will be in Masvingo before moving to Mashonaland West. We want to promote local destinations.“We need to promote Nyanga, Hotsprings and our mountains among other destinations. Mutare Sports club will host the main events this year. Last year, tourism contributed 12 percent to the GDP overtaking agriculture due to the El Nino induced drought and mining due to the fluctuation of the prices. Hence, tourism is important for the country.”Manicaland Minister of State for Provincial Affairs and Devolution, Advocate Misheck Mugadza is convinced that his province will benefit from hosting the event.“We are happy to be hosting this event this year and we can see that the President’s devolution policy is being implemented and as Manicaland we are ready for the challenge.“Manicaland has many outstanding tourism destinations that include Nyangani Mountains, Mutarazi falls and Zipline, Nyangome Falls, Bridal Falls, Nyachowe Falls and many more tourism destinations.“This place should be able to accommodate the event. We were projecting the tourism sector in Manicaland to contribute seven percent to the provincial GDP, but with the province hosting this big event we are now projecting it to contribute over ten percent to the provincial GDP,” he said.The Sanganai/Hlanganani World Tourism Expo is an annual tourism trade fair organised by the Zimbabwe Tourism Authority to showcase a wide range of Africa’s best tourism products, and attracts international visitors, exhibitors, investors, suppliers, buyers and the media from across the world.\nStory by Kenias Chivuzhe\nManicaland province will host the 18th edition of the Sanganai/Hlanganani World Tourism Expo as the prime tourism event that was only being held in Bulawayo for the past 17 years is now being taken to other provinces in line with the devolution agenda.\nIn an interview during the tour of Mutare Sports Club in Mutare, which will be the main venue for Africa’s premier tourism event between the 10th and the 12th of September, the Minister of Tourism and Hospitality Industry, Honourable Babra Rwodzi spoke on the decision to take the tourism event to Manicaland province.\n“The decision that prompted us to host Sanganai away from the usual venue for the past 17 years, which is ZITF in Bulawayo, is to follow the vision of the President and achieve Vision 2030 of an upper middle income economy,” she said.\n“We have realised that we are one of the key ministries which are pillars to the economy of the country and the President has, since 2017, been telling the world that ‘I will achieve an upper middle income economy by devolving my economy and by taking all the programmes of the government to every corner of the country, leaving no one and no place behind’. Sanganai is a huge event, and we thought the event would contribute towards the growth of GDP in Manicaland.\n“We did not randomly choose Manicaland, but we agreed that every year, we must have a destination that we speak loud about so as to promote and market it. As a strategy, we want to go to different provinces every year. Victoria Falls is well known as one of the Seven Wonders of the World, but Victoria Falls is not Zimbabwe. This year, we are in Manicaland, and next year, we will be in Masvingo before moving to Mashonaland West. We want to promote local destinations.\n“We need to promote Nyanga, Hotsprings and our mountains among other destinations. Mutare Sports club will host the main events this year. Last year, tourism contributed 12 percent to the GDP overtaking agriculture due to the El Nino induced drought and mining due to the fluctuation of the prices. Hence, tourism is important for the country.”\nManicaland Minister of State for Provincial Affairs and Devolution, Advocate Misheck Mugadza is convinced that his province will benefit from hosting the event.\n“We are happy to be hosting this event this year and we can see that the President’s devolution policy is being implemented and as Manicaland we are ready for the challenge.",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Manama Hospital rehabilitates mothers’ shelter, theatre",
            "href": "https://www.zbcnews.co.zw/manama-hospital-rehabilitates-mothers-shelter-theatre/",
            "content": "Story by Providence Maraneli\nThe refurbishment of Gwanda’s Manama Hospital theatre and the waiting mothers shelter is now at an advanced stage and the health institution is expected to receive modern theatre equipment from government this year.\nFor years, Manama Hospital has been battling security challenges on the waiting mother’s shelter, with cases of assault having been recorded in the past.\nAs such, the institution, which serves as the referral centre for rural health centres in Beitbridge, Gwanda and Matobo, has prioritised the refurbishment of the waiting mothers’ shelter to provide a safe environment for the pregnant women.\nA theatre is also being refurbished after Vice President Kembo Mohadi toured the institution late last year and called on responsible authorities to prioritise the refurbishment of the 85 year old health institution.\n\n“Currently we are rehabilitating the waiting mothers’ shelter to meet the modern standards and some works are also being done in the theatre as we wait for the modern theatre equipment. Once we have these working, it will improve our service to the communities we serve,” said Manama Hospital medical superintendent, Dr Solomon Madondo.\nGwanda South legislator, Honourable Omphile Marupi, who toured Manama hospital this Tuesday, reaffirmed the Second Republic’s commitment to improving the health sector.",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "27 people drown as Masvingo’s rivers flood",
            "href": "https://www.zbcnews.co.zw/27-people-drown-as-masvingos-rivers-flood/",
            "content": "\nStory by Mercy Bofu-Matinha\nAs the rains continue to fall across the country, many rivers are flooding including in Masvingo where a record 27 people have drowned since the beginning of the year.\nThis Wednesday residents of Masvingo woke up to a flooded Shakashe River, with many buildings near the river having been affected including the popular joint in the province, Caravan Park.\nMotorists and pedestrians could be seen trying to capture some pictures of the floods, with senior residents saying they last witnessed such an incident more than 20 years ago.\n“I was surprised to see such kind of flooding along Shakashe River, we last experienced this around 2000 during the cyclone Eline era. With such flooded rivers it is our duty as parents to ensure the safety of our children,” said a resident.",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zvishavane district benefits from Presidential War Veterans Fund",
            "href": "https://www.zbcnews.co.zw/zvishavane-district-benefits-from-presidential-war-veterans-fund/",
            "content": "Story by John Nhandara\nWar veterans, ex-political prisoners, detainees and restrictees have gathered in Mapanzure, Zvishavane district for the Presidential War Veterans Fund launch.",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "ZRP ramps up fight against cattle rustling",
            "href": "https://www.zbcnews.co.zw/zrp-ramps-up-fight-against-cattle-rustling/",
            "content": "Story by Mercy Bofu-Matinha\nCases of stock theft continue to increase in areas between Bikita and Buhera and the Zimbabwe Republic Police (ZRP) has intensified awareness campaigns against cattle rustling in the affected areas.\nWith 215 people having been arrested and 419 cases of stock theft having been recorded in Masvingo province in 2024, communities around Bikita have been urged to work with the police to curb the vice.\nThe plea was made at an awareness campaign meeting held in Budzi area of Bikita by the Zimbabwe Republic Police this Tuesday.\n“As ZRP, we are moving around the country educating communities on the importance of looking after their cattle. This area of Bikita is one of the most affected as thieves are operating between this area and Buhera. We are saying, let’s work together to ensure those criminals are arrested. Our goal is to ensure an increased herd for our country,” ZRP National Anti-Stock Theft Unit coordinator, Commissioner Wicklef Makamache said.\nCommunity members applauded the ZRP for increasing their visibility in rural communities saying they are looking forward to a decrease in crime rate.",
            "time": "08:34",
            "date": "13 Feb 2025"
        }
    ]
}