{
    "news": [
        {
            "title": "Midlands benefit from Young Women 4ED goat pass-on scheme",
            "href": "https://www.zbcnews.co.zw/midlands-benefit-from-young-women-4ed-goat-pass-on-scheme/",
            "content": "Story by Courage Bushe\n100 goats have been distributed in the Midlands Province under the Young Women 4ED goat pass-on scheme, which aims to empower rural communities and uplift livelihoods.\nThe organisation has launched the Presidential Goat Pass-on Scheme in Shurugwi district at Vungwi Primary School this Monday, where over 300 women from eight districts benefited from the scheme.\n“These goats will play a crucial role in changing livelihoods, especially here in remote areas, and we want to thank the government for this initiative,” a beneficiary said.\nAnother said, “As young women, we are excited and hopeful for a better future from this gesture. This will surely empower us economically.”\nYoung Women 4ED National Chairperson, Honourable Tatenda Mavetera encouraged young women from the Midlands Province to take advantage of economic empowerment programmes being availed to them by government.\nShe said, “I want to take this opportunity to urge and implore ladies to take advantage of these government programmes. I believe this programme will leave you empowered economically.”",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "13 marooned island farmers rescued in Chipinge",
            "href": "https://www.zbcnews.co.zw/13-marooned-island-farmers-rescued-in-chipinge/",
            "content": "Story by Kenias Chivuzhe\n13 people who were marooned at Lisungwe Island in Chipinge have been rescued following a two-day operation.\nThe island is on the Save River in Mahenye area which lies between Chipinge and Chiredzi districts,\nThe rains recently experienced in the country have resulted in water levels along Save River increasing, with 15 people who practice farming at Lisungwe Island having been marooned.\nHowever, 13 of the marooned people have since been rescued by the Chipinge District Civil Protection Unit (CPU), which received assistance from Mahenye Chilo Gorge Lodge and Gonarezhou Conservation Trust.\nChipinge District Development Officer Mr William Mashava said, “On Sunday 16 February 2025, we received news that there are people trapped by water at Lisungwe Island. Yesterday, we rescued six people using boats. Today, we have rescued seven people to make them 13. The people we rescued disclosed that there are two people at the Island who are refusing to be evacuated.",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Mlambaphele community lauds government digitalisation drive",
            "href": "https://www.zbcnews.co.zw/mlambaphele-community-lauds-government-digitalisation-drive/",
            "content": "Story by Providence Maraneli\nGovernment thrust to bridge the digital divide between the once marginalised communities and urban areas continues to gain traction, with the Mlamphelele community of Gwanda South set to benefit from the POTRAZ tower relocation programme.\nOn our way to Mankonkoni Irrigation Scheme along the Shashe River in Gwanda South, we passed through a business centre in Mashaba area and we asked for a spot to make a call because of network challenges.\nTo our surprise, we were told that we only needed to have a neighbouring Botswana network line to make calls because all three Zimbabwean networks were not available in the border-lying area.\nThis scenario poses difficulties to the villagers who cannot cross the flooded Shashe River during rainy season which makes it difficult to communicate.\n“We only buy MASCOM and sell it around here because our local network is not there and now with the rains we can’t cross to Botswana to order so it’s a challenge,” said a community member.\n“There is no network even if you have a problem you can’t call an ambulance,” said another community member.\n“There is an information gap around this area because of network,” added a community member.\nAll hope is, however, not lost after the Posts and Telecommunications Regulatory Authority Zimbabwe (POTRAZ) through its tower relocation programme has started the erection of a tower at Mlambaphele border post which the local leadership say will bridge the information gap that existed between the border lying areas and the urban areas.\n“I am happy that we have been remembered, it has been difficult for people here, they could not communicate, we have cattle rustlers but even when we try to coordinate raids on cattle rustlers there was no way. If someone is sick you cannot call the ambulance, but with what is going on we are hopeful now,” said Headman Rantasi.\n“This will solve most of our challenges in this area, we have elephants that destroy fields and one has to travel to Gwanda to deliver the message. This is a welcome move,” said area councillor, Cde Andrew Ndlovu.",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Preparations on course as Byo hosts youths",
            "href": "https://www.zbcnews.co.zw/preparations-on-course-as-byo-hosts-youths/",
            "content": "Story by Aifheli Mudau\nPreparations for the National Youth Day set to be held in Bulawayo this Friday are progressing well with stakeholders working round the clock to make the day a success.\nAll roads from the breadth and length of Zimbabwe will this Friday lead to Bulawayo where the National Youth Day celebrations will be held.\nThis year’s celebrations will start a day before the main event to cater for the inaugural youth festival that will see all organisations dealing with youth affairs taking part.\n“We are moving very well with the preparations and will start the celebrations on Thursday,” said ZANU PF Bulawayo Provincial Youth chairperson, Thompson Shereni.\n“We urge all youths to be there since this day is theirs,” said ZANU PF Bulawayo Provincial spokesman, Cde Archbold Chiponda.\n“I am already here in Bulawayo to make sure we work together with all to prepare for the big day,” said deputy the Minister of Youth Empowerment, Development and Vocational Training, Honourable Kudakwashe Mupamhanga.",
            "time": "20:38",
            "date": "17 Feb 2025"
        },
        {
            "title": "Govt’s devolution funds lauded as game changer in local development",
            "href": "https://www.zbcnews.co.zw/govts-devolution-funds-lauded-as-game-changer-in-local-development/",
            "content": "Story by Tichaona Kurewa\nLocal authorities have commended government for availing devolution funds which have become a game changer in local development and advancing the attainment of Sustainable Development Goals (SDGs).\nA regional SDGs Localisation and Voluntary Reviews Capacity Building Workshop recently held in Victoria Falls saw parties being implored to localise and integrate development goals into local communities.\nIt is in this context that local authorities are an essential vehicle in the implementation of various projects to attain the SDGs.\nLocal authorities are cognisant of this role and testify that the devolution fund is a game changer as it is funding projects such as solarised boreholes, clinics and schools, among others.\nMutasa RDC’s chief executive officer (CEO), Mr. George Bandura said, “The availing of devolution funds, as it does, is the prime financial enablement vehicle that government uses in the attainment of the Sustainable Development Goals.”\n“Devolution funds are a funding source which will enable local authorities to implement some of the projects which will support Vision 2030 through the implementation of SDGs. So we must have that oiling in the form of devolution funds to enable local authorities to deliver on their projects,” added Murewa RDC’s CEO Dr Alois Gurajena.",
            "time": "20:38",
            "date": "17 Feb 2025"
        }
    ]
}