{
    "news": [
        {
            "title": "Tsvingwe–St Augustine’s bridge repairs near completion",
            "href": "https://www.zbcnews.co.zw/tsvingwe-st-augustines-bridge-repairs-near-completion/",
            "content": "\nStory by Kenias Chivuzhe\nTHE business community in Penhalonga, Manicaland Province, is set to breathe a sigh of relief as authorities move swiftly to repair the damaged Tsvingwe–St Augustine’s High School Bridge, with completion expected within the next ten days.\nThe bridge, which collapsed three weeks ago, has long served as a critical link for economic activities in Tsvingwe, connecting residents, schools, and mining operations on both sides of the road.\nIts destruction forced vehicles to take lengthy detours, severely affecting business operations and daily commuting.\n“This bridge was damaged three weeks ago after being constructed a long time ago. We are happy with the swift action by our local legislator Misheck Mugadza and the government led by President Emmerson Mnangagwa to start reconstruction works. We were now using routes that are very far away to reach our destinations,” community member said,\n“We want to thank our legislator Mugadza and President Mnangagwa for moving with speed to reconstruct this bridge.Its damage is causing a lot oftravellinginconveniences,” a traveller said.\n“This bridge isvery importantfor everyone as its damage affected the movement of vehicles. The reconstruction works come as good news to residents, especially to our children who were facing challenges crossing on their way to school,” a parent said.\nManicaland Roads Construction Engineer Patrick Muropa says the road will be open for public use after a duration of ten days revealing plans to construct a bigger bridge along the same route which also links St Augustine’s high school.\n“As thedepartmentofroads, we have come to repair the bridge using the whole of government approach so that we repair it in a shortperiod of time. Weare going togive the bridge 10 more days after pouring concrete for curing and we are appealing to residents to be patient with us during construction works. The bridge was deformed due tohaveloads and edging. This is a temporary phase and we are also going to construct atwo barrelbridge at the same river course,” Engineer Muropa said.\nMutasa South legislator Advocate Mugadza who is also the Manicaland minister of state for provincial affairs and devolutionalsorevealed the decision to construct a bigger bridge soon after repairing the oldbridge.\n“It was now impossible for vehicles to pass through this bridge but because of President Mnangagwa’s whole of government policy, relevant government departments and council among other stakeholders moved in swiftly following this emergency,” he said.",
            "time": "09:30",
            "date": "20 Apr 2025"
        },
        {
            "title": "Rovos rail tourists safely arrive in Victoria Falls after train accident",
            "href": "https://www.zbcnews.co.zw/rovos-rail-tourists-safely-arrive-in-victoria-falls-after-train-accident/",
            "content": "\nStory by Tichaona Kurewa\nINTERNATIONAL tourists who were on board the Rovos Rail train that was involved in an accident near Gwanda this Friday, are now safely in the resort city of Victoria Falls.\nThe tourists, expressed heartfelt gratitude to the Zimbabwean government and various stakeholders for the support they received after their luxury train was involved in an accident with a goods train in Gwanda this Friday.\nNow safely in the iconic resort city, the visitors were in high spirits, eager to enjoy the beauty and attractions of Victoria Falls, despite the unfortunate events earlier in their journey.\n“I am a tourist from the United Kingdom. Accidents happen everywhere, and we are just happy to finally be here. We thank everyone for the support. I am looking forward to a lot of fun the weather is lovely today. Victoria Falls is beautiful,” a tourist said.\n“I cannot wait to enjoy Victoria Falls. I am happy to be here and sure I will have a great time. I am also excited to try local cuisines,” an international traveller said.",
            "time": "09:30",
            "date": "20 Apr 2025"
        },
        {
            "title": "Ministers visit injured tourists after Rovos train accident",
            "href": "https://www.zbcnews.co.zw/ministers-visit-injured-tourists-after-rovos-train-accident/",
            "content": "Story by Lisa Masuku-Kurira\nTHE Minister of Tourism and Hospitality Industry, Honourable Barbara Rwodzi, together with the Minister of State for Provincial Affairs and Devolution for Bulawayo, Honourable Judith Ncube, visited injured crew members from the Rovos Rail train accident who are currently admitted at Mater Dei Hospital in Bulawayo and Gwanda Hospital.\nDuring the hospital visits, the ministers interacted with the accident victims, who were all reported to be in stable condition.\nMany of the tourists expressed deep appreciation for the warmth and care they received from Zimbabwe’s medical professionals and citizens.\nOne of the accident survivors, Cherilo Fagan, a tourist from California, USA, remained in high spirits despite her unexpected detour to a hospital bed.\n“You guys are lovely, I must say. The love and warmth have been really amazing,” Fagan said.\nWith her goal being of touring all the continents, the American national is eager to explore the country’s magnificent falls,\n“We started off in Capetown. The goal was to get to Victoria Falls. Then things happened. I have a goal to visit all the continents. I grew up travelling, so I saved up my money to make sure I get to realise my dream of travelling all the continents,” Fagan said.\nOf the 47 international tourists who were involved in a train accident, four of them were doctors, and these helped calm the situation before those who were injured were ferried to the hospital.\n“Among all of us, we discovered that there were four doctors on the train. This helped a lot. Above all, the Zimbabwean Police and medical experts acted swiftly. This is one of the main factors that contributed to ensuring there were no fatalities,” another tourist, Peter Anderson said.\nHearing all the positive reviews from interacting with the train accident victims, the government said Zimbabwe’s policy of being a friend to all and an enemy to none is bearing fruit.",
            "time": "09:30",
            "date": "20 Apr 2025"
        },
        {
            "title": "National Prosecuting Authority enhances prosecutor efficiency in Mashonaland Central",
            "href": "https://www.zbcnews.co.zw/national-prosecuting-authority-enhances-prosecutor-efficiency-in-mashonaland-central/",
            "content": "Story by Tapiwa Machemedze\nTHE National Prosecuting Authority (NPA) is ramping up efforts to strengthen its workforce and enhance service delivery, with prosecutors in Mashonaland Central Province already reaping the benefits of these initiatives.\nAs part of its latest efforts to improve employee welfare, the NPA has provided a new staff bus to the Bindura Magistrates Court to address longstanding transport challenges faced by prosecutors.",
            "time": "09:30",
            "date": "20 Apr 2025"
        },
        {
            "title": "Fake job adverts lure desperate job seekers into scam",
            "href": "https://www.zbcnews.co.zw/fake-job-adverts-lure-desperate-job-seekers-into-scam/",
            "content": "Story by Theophilus Chuma, Investigative Editor\nA syndicate of recruiting agents is prowling on desperate job seekers, fleecing them of their hard-earned cash through non-existing job promises.\nThe adverts are printed in bold black and white, listing what appear to be attractive packages for job seekers that include accommodation and a starting salary of between US$200 and US$300 for a post as a security guard or shop merchandiser.\nAdverts are strategically placed across residential suburbs, waiting for the next catch on innocent victims who are made to pay an agent consultation fee of US$40 before they can be linked to the job.\n23-year-old Hazvinei Foroma (not her real name) is among many lured into this web of fake promises.\n“I got the number of the agent from a WhatsApp group and contacted them over a job that was said to be in a supermarket. He asked for US$40 but I told him I had US$20, which I paid on the agreement I was going to pay the balance after I got my first salary,” she said.\nBut there is no guarantee that after paying this fee, the job will be available.\n“I was told to go and start work on a Monday, but when I got to the place, I was told a different story,” another victim said.\nAfter hearing this story, the ZBC News placed a call to the agent.\nThe conversation with the agent seals the fears from a previous engagement with another recruiting agent.\nHe had demanded cash payment before he could provide details of the job.\nThe job adverts were not clear on the number of candidates needed for the vacancy, leaving the possibility of the agent collecting more money for a non-existing placement.",
            "time": "09:30",
            "date": "20 Apr 2025"
        }
    ]
}