{
    "news": [
        {
            "title": "2025 legal year to be opened in Bulawayo",
            "href": "https://www.zbcnews.co.zw/2025-legal-year-to-be-opened-in-bulawayo/",
            "content": "Story by ZBC Reporter\nThe 2025 legal year will be officially opened this Monday with the main event being held in Bulawayo, where Chief Justice Luke Malaba will preside over proceedings, setting the tone for the judiciary.\nThe official event, which marks the beginning of the judicial calendar, will this year be held at the Bulawayo High Court, marking a historic departure from the traditional venue at the Constitutional Court in Harare.\nOther similar ceremonies to open the legal year will also be held simultaneously across the country, led by Constitutional Court judges, with the Harare ceremony being presided over by Deputy Chief Justice Elizabeth Gwaunza.",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "Govt intensifies efforts to end HIV/AIDS in children",
            "href": "https://www.zbcnews.co.zw/govt-intensifies-efforts-to-end-hiv-aids-in-children/",
            "content": "Story by Peter Chivhima\nTHE government is intensifying efforts to end HIV and AIDS in children, tackling disparities in treatment and care as the nation works towards ending HIV and AIDS by 2030.\nIn a bid to accelerate progress towards ending HIV/AIDS in children, the government has announced plans to intensify its focus on improving HIV treatment, diagnosis, and care for young people in 2025.\nAccording to officials, despite progress made in the fight against HIV and AIDS, children remain disproportionately affected, with treatment rates falling below target.",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "Food distribution programme to continue",
            "href": "https://www.zbcnews.co.zw/food-distribution-programme-to-continue/",
            "content": "Story by Mhlomuli Ncube\nTHE Government says it will continue with food distribution programmes to vulnerable families and will make reviews in March when harvest for the first crops begins.\nAfter a devastating El-Nino induced drought season, the Second Republic came up with intervention measures for affected families, and food distribution became the salvation for many vulnerable communities across the country.\nNow with rains being experienced across the country reviving hopes of good harvests, the government continues to reiterate that no citizen will go hungry and promised to review the food programme only when assured that adequate food is available nationwide.",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "Bindura hailstorm leaves 14 families homeless",
            "href": "https://www.zbcnews.co.zw/bindura-hailstorm-leaves-14-families-homeless/",
            "content": "Story by ZBC News Reporter\n14 families were left homeless following a hailstorm that hit Bindura district in Mashonaland Central province.\nThe hailstorm which affected the province left fourteen families stranded forcing provincial leadership to visit the area to assess the damage.\nThe delegation led by Mashonaland central provincial affairs and devolution Honourable Christopher Magomo visited the area to assess the damage and come up with strategies of assisting the hailstorm victims.",
            "time": "06:31",
            "date": "14 Jan 2025"
        },
        {
            "title": "2024 A Level results out",
            "href": "https://www.zbcnews.co.zw/2024-a-level-results-out/",
            "content": "Story by Farai Gwaze\nThe 2024 Zimbabwe School Examinations Council (ZIMSEC) Advanced Level results are out.\nThe results were announced at a news conference addressed by ZIMSEC Chairperson, Professor Paul Mapfumo in Harare this Friday.\nThe results reflect that 94 percent of students who wrote a minimum of two subjects passed the examinations.\n“The total number of candidates who sat for the November 2024 examinations was 33585 compared to 34427 in 2023. This translates to a decrease of 852 candidature yielding a percentage decrease of 2.47%. For those who wrote two or more subjects, 31 443 obtained Grade E or better. This translates to a 94.58% pass rate. The total number of school candidates who set for November 2024 was 29,041 while in 2023 the number was 29,910.\n“28,900 candidates wrote two or more subjects in November 2024. Of these, 27,509 obtained grade E or better in two or more subjects, achieving a percentage of 95.18%. The total number of private candidates who sat for the November 2024 examinations was 4544 while in 2023 the number was 4527,” Professor Mapfumo said.",
            "time": "06:31",
            "date": "14 Jan 2025"
        }
    ]
}