{
    "news": [
        {
            "title": "Infrastructure development changes face of Harare",
            "href": "https://www.zbcnews.co.zw/infrastructure-development-changes-harares-face/",
            "content": "Story by Bruce Chahwanda\nHARARE province has witnessed massive infrastructure development in 2024 with roads and houses being constructed alongside an industrial boom which has changed the face of the capital city.\nEntrenching the Second Republic’s thrust of Nyika inovakwa nevene vayo/Ilizwe lakhiwa ngabanikazi balo, Harare metropolitan province has been one of the major beneficiaries of infrastructure development in 2024.\nThe rolling out of housing projects through public private partnerships saw housing targets being met on time while road infrastructure refurbishment and construction ahead of the 44th SADC Summit has been one of the major success stories.\nThe completion of Robert Mugabe International Airport VVIP pavilion, pharmaceutical warehouse, Varun Beverages expansion programme and the Champion Foods Milling Plant were among the signature projects in the province.\nThe ongoing construction of the colossal Trabablas Traffic Interchange is also progressing well as the humongous project nears completion.\nUpon completion in the next few months, the structure which is the biggest outside South Africa, will change the face of the city with other roads already open to traffic as the focus shifts to the final touches.",
            "time": "08:41",
            "date": "01 Jan 2025"
        },
        {
            "title": "Government set to unveil new child online protection policy",
            "href": "https://www.zbcnews.co.zw/government-set-to-unveil-new-child-online-protection-policy/",
            "content": "Story by Tichaona Kurewa\nThe government is developing a comprehensive Child Online Safety Policy, expected to be finalised by the first quarter of the new year.\nThe policy is meant to create a safe online environment for children and adolescents, addressing concerns around cyber-bullying, online grooming, exposure to harmful content, and data privacy violations.\nThe Permanent Secretary in the Ministry of Information Communication Technology, Postal and Courier Services, Dr Beaullah Chirume indicated that a public consultation process has since been instituted to gather information from various stakeholders on the proposed policy.",
            "time": "08:41",
            "date": "01 Jan 2025"
        },
        {
            "title": "Transport operators urged to shun unreasonable daily targets",
            "href": "https://www.zbcnews.co.zw/transport-operators-urged-to-shun-unreasonable-daily-targets/",
            "content": "Story by Fairstars Mukungurutse\nTRANSPORT operators have been urged to desist from setting unreasonable targets which are exerting unnecessary pressure on drivers, leading to an increase in road traffic accidents.\nWith statistics indicating that 94 percent of road accidents are due to human error, the Traffic Safety Council of Zimbabwe (TSCZ) has implored transport operators to shun unreasonable daily targets for drivers as they end up defying road rules and regulations.\n“We urge transport operators to avoid giving hard targets. When you do an analysis of the accidents, particularly during this festive season, they are a result of speeding, and we believe they are a result of targets given to drivers that forces the driver to go beyond their limits. Our appeal to operators is to avoid giving those targets, they are not helpful, they endanger passengers,” said TSCZ’s managing director, Mr Munesu Munodawafa.\nAcknowledging the risk associated with high daily targets, local transport operators highlighted measures put in place to curb road carnage during the crossover into the New Year.\n“We have a team which engages even the passengers on board because they spend more time with the drivers than us. We urge them to report to us whenever they feel like their lives are in danger and we take action,” said transport operator, Dr Afra Nhanhanga.",
            "time": "08:41",
            "date": "01 Jan 2025"
        },
        {
            "title": "Youths rally each other to play role in national development",
            "href": "https://www.zbcnews.co.zw/youths-rally-each-other-to-play-role-in-national-development/",
            "content": "Story by Farai Gwaze\nYouths continue to rally each other towards playing a key part in the country’s attainment of an upper middle income society by 2030.\nZimbabwe youth council board member, Mr Tinashe Ngirandi highlighted government’s efforts to ensure youth participation in national development.\n“Generally, young people have supported NDS1 through one of its pillars which looks at increasing youth participation, decision making and also in developmental processes… We have seen young commissioners being appointed and part of boards. We have seen an increase in young parliamentarians showing that young people are taking the call of NDS1 to increase youth participation,” Ngirandi said.",
            "time": "08:41",
            "date": "01 Jan 2025"
        },
        {
            "title": "47 murder cases reported between 20 and 26 December 2024",
            "href": "https://www.zbcnews.co.zw/47-murder-cases-reported-between-20-and-26-december-2024/",
            "content": "Story by Peter Chivhima\nThe country continue to witness an alarming surge in violence, with 47 murder cases reported across the country between December 20 and 26 this year.\nThe disturbing statistics were confirmed by Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, in a statement released on Friday evening.\nAccording to Commissioner Nyathi, most murder cases resulted from disputes at social gatherings during Christmas celebrations, often triggered by excessive beer drinking.\nAdditionally, attacks by unknown suspects, particularly on individuals walking alone at night, contributed to the high number of murders.\nThe ZRP also attributed the rise in murder cases to conflicts over love relationships.\nAmong the disturbing cases is one of Mastard Chauke, aged 22, who is now facing a murder charge for allegedly killing Ostern Mangaru (29) on Christmas Day, with a stone during a beer-fuelled dispute in Mwenezi.\nLearnmore Mudzengi (36) of Shurugwi is also in trouble over allegations of stabbing his brother, Sydney Mudzengi (21) to death following a misunderstanding at Musavezi Business Centre in Shurugwi.\nIt is alleged the conflict arose over a missing pool token.",
            "time": "08:41",
            "date": "01 Jan 2025"
        }
    ]
}