{
    "news": [
        {
            "title": "Thorngroove artists turn clay into stories of culture and identity",
            "href": "https://www.zbcnews.co.zw/thorngroove-artists-turn-clay-into-stories-of-culture-and-identity/",
            "content": "Story by Zanele Ndlovu\nIN a small workshop nestled in Thorngroove, Bulawayo, a team of passionate creatives is transforming clay into artwork which ranges from kitchenware to decorative vases and plates.\nEach piece is individually designed and handcrafted with passion and style to create a unique product. These artists do not just mould ceramics, they mould stories.\nInspired by Zimbabwe’s rich wildlife and cultural heritage, much of their artwork prominently features bold depictions of the Big Five alongside traditional patterns drawn from Shona and Ndebele artistic motifs.\nAmong the team is a female painter, Marion Moyo, who stands confidently in a male-dominated space, proving that creativity knows no gender.\n“When I arrived, I was told the company still existed. I had left my pieces at the art gallery and had come to collect my money. That’s how I ended up here. I had studied at Mzilikazi and, though I had never drawn on ceramics before, only canvas, I passed the interview. I was the only woman among 33 men in the art production industry. But I never felt intimidated. I challenged myself to stand out. Art and pottery are my passion; they keep me going,” she said.\nColin Mpofu, a highly experienced and decorated artist, says art is more than his profession, it’s his identity.\n“First of all, we are given concepts, and then I express them in a way that someone can easily understand, depending on the colours that are wanted. Sometimes they can make demands, like they want certain colours and variations, hence I sit down and get cracking on it. Each piece can take me about two weeks, and then I hand it over to glazing. This is my life.\n“I am passionate about art. I joined ceramics in 1995, so that is about 29 years. I could say I have spent my whole life here. With this work, we can take our kids to school and support the family through this art. Apart from this, I do canvas art to supplement my income,” he noted.",
            "time": "08:43",
            "date": "20 Jul 2025"
        },
        {
            "title": "Masakadza electrification sparks growth and community empowerment drive",
            "href": "https://www.zbcnews.co.zw/masakadza-electrification-sparks-growth-and-community-empowerment-drive/",
            "content": "Story by Tafara Chikumira\nMASAKADZA business centre in Gokwe North District has been powered with electricity, a development that has triggered downstream success.\nThe arrival of electricity, delivered under the government’s rural industrialisation drive, is expected to significantly boost local economic activity with community members applauding the upgrade.\n“We are very grateful for this development that has been initiated in our area. Our businesses will now flourish with the coming into power set to help,” one of the beneficiaries said.\n“Our schools now have electricity.  This means that our children can now learn some subjects like ICT with ease. They can now study in a good environment,” another beneficiary noted.\n“The base station has come at the right time. We were having challenges in seeking help in times of emergencies. We are indeed experiencing meaningful help in our area,” one of the beneficiaries added.",
            "time": "08:43",
            "date": "20 Jul 2025"
        },
        {
            "title": "Over five million benefit from GBV Spotlight Initiative in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/over-five-million-benefit-from-gbv-spotlight-initiative-in-zimbabwe/",
            "content": "Story by Memory Chamisa\nThe government says it remains firmly committed to eliminating Gender Based Violence (GBV), as it acknowledges significant gains made through the Spotlight Initiative, a global UN-EU-funded programme.\nSpeaking to ZBC News, the Minister of Women Affairs, Community, Small and Medium Enterprises Development, Senator Monica Mutsvangwa, said the programme has surpassed its original target, reaching over five million beneficiaries, more than double the projected two million.\n“The Zimbabwe Spotlight Initiative Country programme has recorded significant gains. Of note is the High-Level Political Compact (HLPC) on Gender Based Violence which was signed by the President in October 2021, and has demonstrated a high-level political commitment to end violence against women and girls as well as harmful practices, including child marriages. To date, the Zimbabwe Spotlight Initiative programme has reached over five million beneficiaries exceeding the targeted two million,” she said.",
            "time": "08:43",
            "date": "20 Jul 2025"
        },
        {
            "title": "Chirumanzu Chieftainship dispute resolved as new Chief is installed",
            "href": "https://www.zbcnews.co.zw/chirumanzu-chieftainship-dispute-resolved-as-new-chief-is-installed/",
            "content": "Story by Tafara Chikumira, Midlands Bureau Chief\nTHE Chirumanzu chieftainship wrangle has finally been put to rest following the installation of a new substantive Chief at a colourful ceremony held in Chirumanzu this Friday.\nIt was celebration time as the Chirumanzu community witnessed the installation of Abrahim Marufu Nyamande as the substantive chief following years of bickering that saw the chieftainship wrangle spilling into the courts.\nBorn some 65 years ago, Nyamande is the 18th chief of the Shumba Mhaze clan after taking over from Gerald Mudzengi, who died in 2019.\n“We have been yearning for decisive leadership. Now that our substantive chief has been installed, we believe it is time for development,” a villager said.\n“We are a community that is in a massive development drive. The installation of the Chief will give us more power to continue with this development,” a community member said.\n“We currently have a cooking oil refinery plant, and we hope the Chief will push for the production of more sunflower so that we can push for the utilisation of the plant,” another villager said.\nThe installation ceremony was witnessed by the National Chiefs’ Council leadership, which made it clear that it is not amused by the current tendency of taking the chieftainship disputes to courts.\n“Courts are not the ones who have the mandate to choose chiefs, but this is the responsibility of the responsible clan. The law is simple. If the family has a dispute, such disputes should be resolved by the local chiefs.  If it fails, this should be solved within the province instead of rushing to the courts. As a council, we respect that which comes from the province and thus what stands. Yes, it took time for your installation due to bickering, but going forward, don’t take grudges,” President of the chiefs’ council, Chief Mtshane Khumalo said.\nThe government took time to spell out the mandate of the newly installed chief as the engine of development within the area of his jurisdiction.",
            "time": "08:43",
            "date": "20 Jul 2025"
        },
        {
            "title": "Schools get green light for August holiday lessons",
            "href": "https://www.zbcnews.co.zw/schools-get-green-light-for-august-holiday-lessons/",
            "content": "Story by Peter Chivhima\nTHE government has granted permission for schools to conduct vacation lessons for Grade seven, Form four, and Upper six examination classes during the August 2025 holiday.",
            "time": "08:43",
            "date": "20 Jul 2025"
        }
    ]
}