{
    "news": [
        {
            "title": "Parliament’s role in national security under spotlight",
            "href": "https://www.zbcnews.co.zw/parliaments-role-in-national-security-under-spotlight/",
            "content": "Story by Patience Nyagato\nTHE role of parliament in defending the constitution and national security came under the spotlight when the Deputy Senate president, Lieutenant General (Retired) Michael Nyambuya made a presentation at the Zimbabwe National Defence University in Mazowe this Thursday.\nSpeaking to attendees, Lt General (Retired) Nyambuya emphasised parliament’s crucial responsibility in defending the constitution, overseeing the democratic process, and ensuring national security.\n“Parliament must legislate, oversee as well as represent the people. So Parliament’s role in ensuring that it carries out oversight on security is that it must ensure that the process of government is going smoothly, resources are allocated to ensure that security services are adequately sponsored and that government and its agencies act constitutionally within the parameters of the law so that everybody in the nation is secure. Parliament must also ensure that multi-party democracy policy as enshrined in the constitution is observed,” he said.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "VP Chiwenga lights independence flame in Gweru",
            "href": "https://www.zbcnews.co.zw/vp-chiwenga-lights-independence-flame-in-gweru/",
            "content": "Story by Tafara Chikumira\nVICE President General (Retired) Dr Constantino Chiwenga officially lit and handed over the independence flame to the Midlands province this Thursday, setting the stage for the display of the flame across the province which hosts this year’s Uhuru celebrations.\nIn his remarks, VP Chiwenga says the independence flame is a constant reminder of the need for Zimbabweans to respect the ethos of the liberation struggle which binds the nation together going forward.\n“The Independence Flame we light today represents the spirit and undying hope which guided our struggle for freedom. It symbolises the resilience and determination of the Zimbabwean people, including their resolve to win and defend their sovereignty by all means necessary.\n“As we celebrate 45 years of independence, we acknowledge our progress as a people and the challenges that remain.  It embodies the promise that, despite the challenges we face, our commitment to uphold the ideals of our liberation will never waver. The Independence Flame, too represents the spirit of unity, hope, and determination that has fueled our journey as a nation,” he said.\nThe lighting of the independence flame at the historical monument is significant as the Mtapa Hall hosted the ZANU congress of 1964 which came with a resolution for the commencement of an armed struggle against the white settler regime.\nThe Midlands provincial leadership welcomed the independence flame, while some government ministers who attended the occasion at Mtapa Hall in Gweru, weighed in saying the country’s independence should be cherished as it came through a gruelling war where sons and daughters of the soil lost their lives.\n“This flame is a symbol of supreme sacrifice and resilience by the veterans of the liberation struggle. Let us cherish what the living and those who lost their lives sacrifices which brought what we enjoy to this very day,” Minister of Veterans of the Liberation Struggle Affairs, Senator Monica Mavhunga said.\n“This occasion not only marks a significant moment in our national calendar, but also serves as a vibrant reminder of our shared history, resilience, and the enduring spirit of our people. Independence is not merely a date on our calendar, it is a living legacy that embodies our shared struggles, triumphs, and aspirations as a nation. It beckons us to reflect on our progress and to celebrate our achievements. Today, we reaffirm our commitment to uphold the values of unity, peace, and cultural heritage that bind us as a nation,” Minister of Home Affairs and Cultural Heritage Hon Kazembe Kazembe added.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Zvishavane FBC housing project alleviates urban housing challenges",
            "href": "https://www.zbcnews.co.zw/zvishavane-fbc-housing-project-alleviates-urban-housing-challenges/",
            "content": "Story by Courage Bushe\nPUBLIC private partnerships continue to bear fruit as witnessed by the completion of 100 housing units and servicing of 1 800 residential stands by a local financial institution in Zvishavane.\nZvishavane town is undergoing massive transformation, courtesy of infrastructure projects being implemented by various stakeholders.\n“The government is working to ensure that the cost of doing business in Zimbabwe is manageable so that housing developments remain within reach for many citizens. It is in this vein that we complement government efforts of leaving no one and no place behind. Our mandate as the private sector is to ensure that Vision 2030 is achieved. We call other private players to follow suit and make sure the national target is achieved,” FBC Holdings Limited Group CEO, Mr Trynos Kufazvinei said.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Glen View roadworks begin as govt tackles urban infrastructure crisis",
            "href": "https://www.zbcnews.co.zw/glen-view-roadworks-begin-as-govt-tackles-urban-infrastructure-crisis/",
            "content": "Story by John Nhandara\nTHE Government has commenced an extensive road rehabilitation programme targeting high-density suburbs in Harare, in a move welcomed by residents who have endured years of deteriorating road infrastructure owing to the council’s failure to repair intra-city roads.\nTransport and Infrastructural Development Minister, Honourable Felix Mhona this Monday assessed progress on some of the roads being rehabilitated in Glen View.\nCurrently, significant work is underway on 11th Street in Glenview, from Patrenda Road up to Willowvale Road, where heavy machinery and construction crews have been deployed, signalling government determination to address issues of potholes and poor road infrastructure.\n“The Second Republic is walking the talk. We have done roads in Warren Park and we are continuing. Roads in Dzivaresekwa will also receive attention. We have descended on Glen View as this road is important. We are rehabilitating it up to Rothmans,” Minister Mhona said.\nThe road, which serves as a vital link for commuters and businesses, had become heavily riddled with potholes, causing traffic congestion and posing a risk to motorists.",
            "time": "20:40",
            "date": "10 Apr 2025"
        },
        {
            "title": "Govt urges APNAC members to intensify efforts against corruption",
            "href": "https://www.zbcnews.co.zw/govt-urges-apnac-members-to-intensify-efforts-against-corruption/",
            "content": "Story by Mercy Bofu-Matinha\nMEMBERS of the African Parliamentary Network Against Corruption (APNAC) have been challenged to ensure the fulfilment of their mandate of working towards the eradication of corruption and promotion of good governance.\nThe recent induction workshop for the APNAC held in Masvingo saw members being called upon to work with existing government structures in the fight against corruption.\n“The mandate of APNAC calls on its members to work towards the eradication of corruption, the promotion of good governance, and the strengthening of democratic processes. While APNAC plays a vital role in advocating for anti-corruption measures, APNAC must not work against the existing government structures in the fight against corruption, including the Zimbabwe Anti-Corruption Commission, the Prosecutor-General’s Office and other relevant bodies,” the Deputy Speaker of Parliament, Honourable Tsitsi Gezi said.\nAPNAC Chairperson, Senator Chief Chikwaka said their work will be aligned with regional and national frameworks on corruption.\n“The APNAC Zimbabwe chapter as an affiliate of APNAC Africa chapter we are grateful to the Parliament of Zimbabwe for organising this programme to equip us with knowledge and skills in combating corruption. Corruption is a cancer in our community and these Legislators present today have shown a willingness to fight this scourge,” Senator Chief Chikwaka said.\nRelevant bodies in the fight against corruption pledged commitment to work with APNAC.\n“In this meeting, ZACC is just confirming that it is an institution which is national and working with various institutions. We continue to work together with institutions like APNAC as we fulfil our mandate of combating corruption,” a Representative of the Zimbabwe Anti-Corruption Commission, Dr Munyaradzi Magiga said.",
            "time": "20:40",
            "date": "10 Apr 2025"
        }
    ]
}