{
    "news": [
        {
            "title": "Gweru hosts thrilling ZRP Commissioner General’s road race",
            "href": "https://www.zbcnews.co.zw/gweru-hosts-thrilling-zrp-commissioner-generals-road-race/",
            "content": "Story by Tafara Chikumira\nTHIS year’s edition of the Zimbabwe Republic Police (ZRP) Commissioner General’s race lived up to its billing with athletes from across the country converging at Mkoba Teachers’ College in Gweru this Saturday to compete in the 21-kilometre race.\nIn the men’s category, the army side Black Rhinos’ Moses Tarakinyu proved to be the master of the game after occupying first while his teammate Tatenda Hove settled for second place.\n“The exercise I have been putting in made it possible for me to achieve this feat. I want to thank the ZRP for allowing us to showcase our talent like this,” Tarakinyu said.\nTarakinyu is a seasoned runner who recently won the BTC 42-kilometre marathon in Botswana after clocking two hours 14 minutes.\nIn the women’s category, it was Zimbabwe Prisons and Correctional Services’ Caroline Mhandu who won gold.\n“I want to encourage people to keep on exercising as this will help in dealing with some chronic diseases,” she stated.",
            "time": "06:36",
            "date": "04 May 2025"
        },
        {
            "title": "Govt freezes land use changes for 90 days",
            "href": "https://www.zbcnews.co.zw/govt-freezes-land-use-changes-for-90-days/",
            "content": "Story by Wellington Makonese\nTHE Ministry of Local Government and Public Works has imposed a 90-day moratorium on processing applications for land use and reservation changes, effective on May 2, 2025.\nIn a statement issued Friday, the Ministry said the moratorium immediately halts all related permit activities by local authorities.\nDriven by concerns over disruptive developments in residential areas and numerous public complaints, the government aims to improve built environment management nationwide, aligning with the goal of an upper-middle-income economy by 2030.\nThe moratorium, under the Regional, Town and Country Planning Act, covers changes of use, special consent, regularisation, subdivisions, consolidations, and reservation changes.",
            "time": "06:36",
            "date": "04 May 2025"
        },
        {
            "title": "Security Services benefit from Presidential Solarised Borehole Programme",
            "href": "https://www.zbcnews.co.zw/security-services-benefit-from-presidential-solarised-borehole-programme/",
            "content": "Story by Aifheli Mudau\nTHE Government’s target to sink 35 000 solarised boreholes by 2025 is well on course, with Imbizo Barracks in Bulawayo being the latest to benefit from the initiative.\nAs part of efforts to accelerate the Presidential Solarised Boreholes Programme across the country, the Ministry of Finance, Economic Development and Investment Promotion handed over three solarised boreholes this Friday.\n“Water challenges are now a thing of the past and we are sure that this project will have an impact on all of us including the surrounding communities. Development and peace are intertwined and as such this will give the security services time to concentrate much on their duties,” Zimbabwe National Army Chief of Staff Quartermaster Staff, Major General Simo Maseko said.\nThe Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube said the programme speaks to the aspirations of Vision 2030.",
            "time": "06:36",
            "date": "04 May 2025"
        },
        {
            "title": "A Life in darkness, Matavire family’s struggle with visual impairments",
            "href": "https://www.zbcnews.co.zw/a-life-in-darkness-matavire-familys-struggle-with-visual-impairments/",
            "content": "Story by Gay Matambo\nPERSONS with disability often face marginalisation, lack of access to employment and life opportunities owing to their incapacity.\nOne often wonders what the daily struggles of a family comprising of seven visually impaired members include.\nWhenever it is dark, we rush to find comfort and security in a place where there is light, but for the Matavire family nature and genetics was not so kind as it embedded darkness in their everyday lives.\nMrs Maria Matavire and her husband of village 18 in Feversham area, Chiredzi North who are both visually impaired, never dreamt that all their five children were also going to inherit the same impairment.\nThere is an adage which says “when going through difficult times, there are few friends to help you”, and this has made the family learn to get on with their day to day lives on their own, despite the huge risk of hurting themselves in the process.\n“When I gave birth to my first child, after noticing that he could not see we took him to the Doctors in Morgenster and they told us to return with him at the age of five. We went back and they said they could not figure out how to help him regain his eyesight.\n“With my second born, I decided to go to give birth in Mozambique where I was born. The doctors confirmed she could see when she was born, and when we were walking home from the hospital that is when my aunt told me that the baby could not see anymore. So this has been the trend, on all of my children. When they were born the midwives told us they could see but shortly after, a few days at most, the elders would confirm that the children could not see anymore. I have learnt to do things on my own. I cook, fetch water and clean on my own. Sometimes our relatives assist us but we have learnt to do things on our own,” Mrs Matavire said.\nThe couple’s wish is to know what caused the blindness of their children and maybe, if it is an illness that can be cured, they hope that maybe in future, their children will be able to regain their eyesight.\n“If funds would permit I would be more than happy to know what caused the blindness and get to the bottom of this because with me, I could see when I was born up to the age of seven and my parents said measles caused the loss of my eyesight same with my wife she could see when she was born. For me, my wish is to know the cause of this demise that has befallen my family.\n“Back then I used to own goats but I lost most of them from diseases so we would sell the goats to make ends meet and even pay school fees for the children who are at school at Copota School of the blind in Masvingo.\n“At the moment it is a bit difficult for us. I do not want to lie though the future is bright because the children are registered under the government’s BEAM programme,” Mr Shackmore Matavire said.\nAlthough relatives and neighbours seem to share their pain, they can only do so much.\n“I am the grandmother and the family lives with me here. It is a sore sight to see my children and grandchildren like this. I have always asked myself what caused this but I have no answers,” Gogo Matavire said.",
            "time": "06:36",
            "date": "04 May 2025"
        },
        {
            "title": "Young Women4ED launches goat rearing project in Tsholotsho",
            "href": "https://www.zbcnews.co.zw/young-women4ed-launches-goat-rearing-project-in-tsholotsho/",
            "content": "Story by Mhlomuli Ncube\nTHE Young Women for Economic Development has launched a goat-rearing project focused on empowering young women in Matabeleland North’s Tsholotsho area.\nThere was jubilation at Mhlabangubo Primary School this Thursday when the goat project was rolled out.\nThe beneficiaries expressed joy at the potential of the initiative to transform their lives.\n“This is an important project where I have received a starting point in my drive to do goat keeping as a business. I want to thank the government and the President for giving me this opportunity,” a beneficiary said.\n“I will look after my goats and grow them to a herd that sustains my business,” another beneficiary said.\n“For me as a woman, this means a lot. It means being involved in a business mainly a preserve for man. Thank you, President Mnangagwa,” a beneficiary added.\nThe project seeks to ensure women are kept in the mainstream national means of production and economic development.",
            "time": "06:36",
            "date": "04 May 2025"
        }
    ]
}