{
    "news": [
        {
            "title": "Father rapes eight-year-old daughter",
            "href": "https://www.zbcnews.co.zw/father-rapes-eight-year-old-daughter/",
            "content": "Story by Courage Bushe\nA 54-year-old man from Mberengwa has appeared in court for allegedly raping his eight-year-old daughter.\nIt is alleged that sometime in December last year, the complainant was at their homestead in the company of her father and four-year-old sister.\nThe court heard that when the victim retired to bed in the company of her sister, their father followed them and forced the complainant to sleep on his bed, while the young sister slept on a floor mate.\nThe accused allegedly took advantage of the situation and raped the eight-year-old girl.",
            "time": "18:30",
            "date": "08 Jan 2025"
        },
        {
            "title": "Revitalisation of NRZ on course",
            "href": "https://www.zbcnews.co.zw/revitalisation-of-nrz-on-course/",
            "content": "Story by Yolanda Moyo\nGOVERNMENT is on the verge of concluding a deal to secure an external credit line to capacitate the National Railways of Zimbabwe (NRZ), a key parastatal in the country’s logistics and transportation sector.\nNRZ was once a cornerstone of Zimbabwe’s transport and logistics sector, playing a pivotal role in the country’s economic development.\nRecognising the strategic importance of a modern and efficient railway system, the Minister of Finance, Economic Development and Investment Promotion Professor Mthuli Ncube revealed government is close to finalising a deal aimed at revitalising the NRZ.\nHe said, “The revival of the NRZ is critical for lowering the costs of doing business by reducing the cost of transportation especially bulk transportation. For NRZ, we are supporting it to source a credit from outside to fix the railway line, get more rolling stock and to fix the signaling system. So we are close to concluding a deal for an external credit line. l think we will see some progress during 2025 so that we can get some of the heavy trucks off the roads. We need to shift all that cargo to the railway infrastructure and this can be done commercially and profitably so that we can be able to service the loan.”",
            "time": "18:30",
            "date": "08 Jan 2025"
        },
        {
            "title": "Manicaland province increases milk output",
            "href": "https://www.zbcnews.co.zw/manicaland-province-increases-milk-output/",
            "content": "Story by Kenias Chivuzhe\nThe drive to increase milk production to meet national demand of more than 150 million litres is on track, with Manicaland province recording a 27 percent increase after the introduction of the presidential silage programme in 2022.\nEfforts to increase national milk production are yielding positive results, with small-scale farmers playing an active role.\nCynara Dairy Farmers Cooperative in Mutasa South is one of the success stories under the Second Republic’s inclusive development agenda.\n“We started our operations in 2017 and our production was 4 600 litres and in 2024 we increased our production to 67 000 litres. We are looking forward to reach 300 000 litres by end of this year as we have increased our herd,” said chairperson of Cynara Dairy Farmers Cooperative, Francis Musunzuru.\nSmall-scale dairy farmers in the area have benefited from government support, which has given impetus to their milk production ventures.\n“We have partners selling affordable dairy calves to us at $100 each. We were also given an artificial insemination kit to grow our herd,” said a dairy farmer.\n“The presidential silage scheme is helping us a lot in improving the volume of milk we produce due to increased supply of feeds,” said a dairy farmer.\n“We are looking forward to growing our herd as we are being supported by the government,” said another dairy farmer.\n“We are happy with the support but we can produce more if our herd is increased. We are planning to produce feeds locally to reduce production costs,” said a dairy farmer.\nGovernment support has been the major driver of growth in the dairy sector.\n“Since the introduction of the presidential silage scheme, Manicaland province recorded 27 percent growth in terms of milk production. We want to thank the government and President Mnangagwa for supporting farmers to increase productivity,” Mutare regional chairperson of Zimbabwe Association of Dairy Farmers, Mrs Rudo Sithole said.",
            "time": "18:30",
            "date": "08 Jan 2025"
        },
        {
            "title": "Government steps up efforts to rescue Mudzi trapped miners",
            "href": "https://www.zbcnews.co.zw/government-steps-up-efforts-to-rescue-mudzi-trapped-miners/",
            "content": "Story by Jerold Sasa\nGOVERNMENT has stepped up efforts to locate three illegal miners who are believed to have been trapped in a disused gold mine in Makaha area of Mudzi district for the past three days.\nA high-powered government delegation led by chairperson of the Provincial Civil Protection Unit and traditional leaders descended on Makaha area this Tuesday as efforts to locate the trapped illegal miners are being stepped up.\nThe trio which was operating in a disused mine is suspected to have been trapped after heavy rains which pounded the area recently.\nThe Permanent Secretary of Mashonaland East province, Mr Tavabarira Kutamahufa said, “As government, we have stepped up efforts to locate the miners in whatever state and we are calling for assistance to beef up our resources.”\n“This is a very unfortunate incident in our area and we are hoping that our rescue operations will yield some positive results,” Chief Nehombo said.\nRepresenting miners, Mr Mudyiwa Mashonganyika said, “As miners, this is a very unfortunate incident and we are pulling our resources together as we seek to identify where the guys could be.”\nFamily members who have been at the scene since day one, are holding on to the hope that their relatives will be rescued alive.",
            "time": "18:30",
            "date": "08 Jan 2025"
        },
        {
            "title": "Devolution funds spur development across the country",
            "href": "https://www.zbcnews.co.zw/devolution-funds-spur-development-across-the-country/",
            "content": "\nStory by Tafara Chikumira, Midlands Bureau Chief\nDEVOLUTION funds have become a practical development tool across the country after the commissioning of an Early Childhood Development (ECD) Centre in Mvuma.\nThe Second Republic continues to address the schools’ deficit, with the establishment of Blinkwater Early Childhood Development Centre in Mvuma district expected to improve access to education, with plans afoot to develop the facility into a fully-fledged primary school in the near future.\nThe ECD centre, with a carrying capacity of 100 learners has been welcomed as a game changer in the educational needs of the Mvuma community.\n“We decided to establish an ECD Blinkwater block after realising that children were exposed to danger by crossing major highways to school.  We establish this school using devolution funds and council funds. After that, we are also going to develop a primary school here. We are indeed grateful to the government for releasing the devolution funds in time,” Mvuma Rural District Council chief executive officer, Mr Lovemore Chatikobo said.\nThe community is equally excited by the new facility which confirms the Second Republic’s inclusive development is in motion.\n“Our young children used to travel long distances. So with this facility is going to be helpful. We did not expect this from our President. What he did, we hope this will be taken to some other areas, around here. At least it shows that our government has a good vision, and also recognises young learners from this area,” said one local resident.\n“The construction of this block has helped a lot here. The reason being that the learners used to travel long distances. We thank our government for addressing this issue. In fact, there was no school at all around this place. I want to commend our government for the sterling efforts in mobilising locally available resources towards construction of the ECD centre,” added another.\nThe government has promised to continue with its developmental trajectory in line with Vision 2030.\n“I applaud the new dispensation under the able and visionary leadership of President Emmerson Mnangagwa of the Republic of Zimbabwe for implementing rural development 8,0 vision 2030 accelerator model in an endeavour to modernise and industrialise marginalised areas underpinned by the development approach of leaving no one and no place behind,” Midlands Minister of State for Provincial Affairs and Devolution, Honourable Owen Ncube said.\n“The Second Republic through the Ministry of Primary and Secondary Education, local authorities and private sector, is providing modern infrastructure to ensure all learners both in rural and urban schools are empowered to excel in their studies.",
            "time": "18:31",
            "date": "08 Jan 2025"
        }
    ]
}