{
    "news": [
        {
            "title": "Zimparks bolsters wildlife security with graduation of 53 rangers",
            "href": "https://www.zbcnews.co.zw/zimparks-bolsters-wildlife-security-with-graduation-of-53-rangers/",
            "content": "Story by Tamuka Charakupa\nTHE Zimbabwe Parks and Wildlife Management Authority (Zimparks) says it is strengthening mechanisms to combat wildlife crime.\nThis comes as 53 rangers graduated at a pass-out parade at Chinhoyi Caves in Mashonaland West province this Saturday.\nThe graduating group comprises 29 female rangers under the Akashinga and Peace Parks Foundation (PPF) initiative and 24 male counterparts from Zimparks.\nThe new recruits completed a rigorous three-month paramilitary training programme that covered foot and arms drills, advanced weapons handling, bushcraft, and law enforcement, among other disciplines.\n“I am so delighted to have undergone this training. It has not only sharpened my skills, but also deepened my understanding of the critical importance of wildlife conservation,” one graduate said.\n“This was a tough challenge that required full dedication and courage. I am grateful for the opportunity, especially as a woman making strides in a traditionally male-dominated field,” another noted.\nSpeaking at the pass-out event, Zimparks Mid-Zambezi Senior Regional Manager, Mr Felix Chimeramombe, said the initiative is the result of a tripartite agreement between ZIMPARKS, the Peace Parks Foundation, and Akashinga.\n“These rangers represent a broad national outlook. The recruitment process involved meticulous consultation with local stakeholders and aligns with the Government of Zimbabwe’s devolution agenda which aims to transform communities, districts, and provinces into economic hubs, thereby contributing to the country’s goal of attaining upper-middle-income status by 2030,” he said.",
            "time": "20:37",
            "date": "15 Jun 2025"
        },
        {
            "title": "Midlands Hotel gutted by fire",
            "href": "https://www.zbcnews.co.zw/midlands-hotel-gutted-by-fire/",
            "content": "Story by Tafara Chikumira\nGWERU – The Midlands Hotel in Gweru was gutted by fire which destroyed property and reduced a room to ashes Friday evening.\nThe fire has left a trail of destruction at the facility, although no injuries or fatalities were recorded.\nPreliminary investigations by the fire fighting department point to an electrical fault as the cause of the fire.\n“When we got an SOS about the fire around 7pm we managed to rush to the scene. We had to use our ladders to climb to the first floor since the doors to the stairs were locked. We had to break the ceiling to contain the fire since it was already spreading.  All the goods including the beds and the clothing for the tenants were burnt by the fire. We however managed to contain it before it had spread further.  Our investigations so far point to a water heating kettle which we suspect to have been left on and led to the fire outbreak,” said Gweru City Council chief fire officer, Mr Felix Muguti.\nTenants who spoke ZBC News praised the timely intervention of the fire brigade team.",
            "time": "20:37",
            "date": "15 Jun 2025"
        },
        {
            "title": "ZRP Tomlinson depot renamed Chimoio Camp",
            "href": "https://www.zbcnews.co.zw/zrp-tomlinson-depot-renamed-chimoio-camp/",
            "content": "Story by Josephine Mugiyo, Diplomatic Correspondent\nHARARE – President Emmerson Mnangagwa says the renaming of Tomlinson Depot to Chimoio Camp marks yet another milestone and a step towards dismantling the remaining colonial legacies.\nHe was speaking at the commissioning of new housing units for the Zimbabwe Republic Police in Harare this Friday, which coincided with the renaming of the key institution.\nThe renaming is a move from the colonial names that had been given to key institutions across the country.\nThe Second Republic is on a drive to replace colonial names at key institutions with those that speak to the country’s history and identity.\n“Colonialism saw the naming of places and institution being used as a means of dispossession, both physically and psychologically, for asserting dominion over our land and us its rightful owners. As such, following the advent of the Second Republic, my administration took a deliberate decision to accelerate the name changes of numerous strategic national institutions, buildings and streets across the country. This bold move is designed for the memorialisation and recognition of our rich liberation history, as well as the prominent figures who helped to shape it,” he said.\nRenaming Tomlinson Depot to Chimoio is an honour to those who perished at the Chimoio Massacre 1977.\n“The renaming of this depot to Chimoio Camp marks yet another milestone and step towards dismantling the remaining colonial ‘legacies. The sacrifices made by our gallant sons and daughters, including at Chimoio Camp, should inspire our officers to conduct their duties diligently. Through such deliberate initiatives, we are giving our country a truly Zimbabwean identity and memorialising the significance of Chimoio Camp in Mozambique, among other places, and incidents that connect us permanently to the liberation struggle. In doing so, we are paying special tribute to our brothers and sisters in the Frontline States, both departed and living,” he explained.\nPresident Mnangagwa also commissioned four new blocks of flats comprising of 96 units.\nHe emphasised the need for government to provide decent accommodation.\n“The need for housing remains a priority for the government and the country’s uniformed forces are not being left behind.The importance of decent accommodation for any employee cannot be overemphasised. To this end, the commissioning of four blocks of residential flats is part of my government efforts towards ensuring better working and safe conditions for our public officers. Our public servants require safe and good places to stay with their families for them to be effective in the delivery of quality services,” noted the President.",
            "time": "20:37",
            "date": "15 Jun 2025"
        },
        {
            "title": "Govt rolls out nationwide housing projects for ZRP Officers",
            "href": "https://www.zbcnews.co.zw/govt-rolls-out-nationwide-housing-projects-for-zrp-officers/",
            "content": "Story by Peter Chivhima\nHARARE – SEVERAL housing projects for the security sector are on the cards countrywide, with the successful implementation of the Chimoio Camp Housing Scheme in Harare being a reference point.\nThe four flats commissioned in Harare this Friday have a combined total of 96 housing units for members of the Zimbabwe Republic Police.\nZBC News spoke to some of the beneficiaries of the initiative, which is aimed at providing decent and secure accommodation to civil servants, recognising the vital role police officers and other security service officers play in maintaining law and order.\n“I am so excited that I have been allocated accommodation here and this will go a long way in motivating me because I was finding it difficult to travel. I want to thank His Excellency President Emmerson Mnangagwa for this project,” Sergeant Caroline Vuma, a beneficiary of the project said.\nAnother beneficiary, Superintendent Molin  Rumbwere also said, “I want to thank His Excellency for giving us accommodation, we are no longer stressed when comes to the issue of travelling and accommodation.”\nThe Minister of Home Affairs and Cultural Heritage, Honourable Kazembe Kazembe revealed that similar projects will be rolled out nationwide.\n“It is an on-going project and we are going to roll out such projects countrywide. The President has made it clear that our Police officers5 must have decent accommodation.  I can confirm that there are on-going projects including in Dotito in Mashonaland Central province,” he indicated.",
            "time": "20:37",
            "date": "15 Jun 2025"
        },
        {
            "title": "Behaviour change model transforming men’s health in Insiza",
            "href": "https://www.zbcnews.co.zw/behaviour-change-model-transforming-mens-health-in-insiza/",
            "content": "Story by Providence Maraneli\nMBONDO, INSIZA SOUTH –THE National AIDS Council (NAC) has intensified its grassroots fight against HIV and AIDS, prostate cancer, child sexual exploitation, and other chronic illnesses through the innovative Behaviour Change Community Motivators Model (BCCM).\nA group of 20 men convened at Mbondo Business Centre, in what resembled a traditional dare (men’s court), not for social matters, but to discuss pressing health issues.\nThey awaited their facilitator an elderly woman armed with a pen and notebook, who soon arrived to lead the session.\nShe is Gogo Dorcas Mpofu, a dedicated Behaviour Change Community Motivator trained by NAC to lead peer-based discussions with men in rural communities.\nHer sessions address topics ranging from HIV and AIDS, prostate cancer, and sexually transmitted infections, to gender-based violence and child sexual exploitation.\n“Men are now attending in large numbers, which is encouraging. We are seeing a real shift. I engage them on health-seeking behaviour and the importance of early diagnosis. It is gratifying to witness this transformation,” Gogo Mpofu said.\nLocal men expressed how the programme has changed their attitudes and encouraged them to seek medical attention.\n“We have learnt the importance of early testing and treatment. I went to the hospital after one of these meetings, and my condition was addressed,” an elderly man said.\n“Men here are now more health-conscious, and we are thankful for this intervention,” one of the men said.",
            "time": "20:37",
            "date": "15 Jun 2025"
        }
    ]
}