{
    "news": [
        {
            "title": "ZBC to launch Luzibo FM, a heritage-based educational radio station",
            "href": "https://www.zbcnews.co.zw/zbc-to-launch-luzibo-fm-a-heritage-based-educational-radio-station/",
            "content": "Story by Buhlebenkosi Makwelo\nBULAWAYO – THE Zimbabwe Broadcasting Corporation (ZBC)’s new radio station, Luzibo FM is set to deliver educational programming in line with the heritage-based education curriculum.\nThe station, located at ZBC’s Montrose studios in Bulawayo, is the product of a collaborative effort between ZBC, the Ministry of Primary and Secondary Education, and UNICEF. It will primarily broadcast radio lessons and edutainment content targeting learners across Zimbabwe.\n“This one is an educational radio station. Anything to do with education involves the Ministry of Primary and Secondary Education as a stakeholder, and our partners, UNICEF, as well. This channel will be educational-based. Once we talk of education, remember we are referring to the heritage-based curriculum, and that is what we are focusing on,” ZBC Director of Radio Services, Mr Albert Chekayi said.\nThe name “Luzibo”, which means “knowledge”, was chosen for its representation of Zimbabwe’s cultural and linguistic diversity.\nIt resonates across multiple local languages, including Kalanga, Nambya, Tonga, Shona, Venda, and Sotho.\n“Zimbabwe is a rich country in cultural diversity, and Luzibo simply means knowledge. And it is Luzibo in Kalanga, Nambya, Tonga, it is Ruzivo in Shona, and our payoff line is ‘Amasiko, Imfundo, Ulwazi,’ which is our culture, education, and knowledge. You can also go to Venda and Sotho, they’ve almost the same way of pronouncing Luzibo, and just on its own, it covers seven languages, just one name, that’s why we came up with that name,” Mr Chekayi said.",
            "time": "18:48",
            "date": "17 Jul 2025"
        },
        {
            "title": "Zimbabwe eyes Olympic growth as IOC commits to stronger support",
            "href": "https://www.zbcnews.co.zw/zimbabwe-eyes-olympic-growth-as-ioc-commits-to-stronger-support/",
            "content": "Story by Abigirl Tembo\nBOOSTING support for local athletes ahead of the 2028 Olympics, implementing sports development partnerships, and expanding access to Olympic Solidarity scholarships took centre stage when International Olympic Committee (IOC) president, Dr Kirsty Coventry, paid a courtesy call on the Acting President, General Retired Dr Constantino Chiwenga in Harare this Thursday.\nAs preparations for the Los Angeles 2028 Olympic Games gather pace, Zimbabwe has been challenged to sharpen its focus on strengthening athlete support, leveraging international partnerships, and building lasting Olympic legacies.\n“The Honourable Acting President welcomed me home, and we discussed Zimbabwe’s participation in the AUSC Region V youth games. The team did very well, the best that it has done to date and we are very proud of that. We also discussed different sporting opportunities, specifically in and around the Los Angeles 28 Olympic team and working with the National Olympic Committee, and specifically our sprinters who are based in the U.S, on how we could get additional support to them and what that can look like.\n“From the International Olympic Committee, we give Olympic Solidarity scholarships that have already started through the National Olympic Committees. We also spoke on how we can continue working together in terms of finding different opportunities for the country. We also spoke about the importance of implementing some of the Memoranda of Understandings that we already have as a country, specifically with China,” she said.",
            "time": "18:48",
            "date": "17 Jul 2025"
        },
        {
            "title": "NDS1 interface in Mash West highlights gains and gaps in implementation",
            "href": "https://www.zbcnews.co.zw/nds1-interface-in-mash-west-highlights-gains-and-gaps-in-implementation/",
            "content": "Story by Tamuka Charakupa\nCHINHOYI-PROVINCIAL heads in Mashonaland West met this week to assess progress under the National Development Strategy One (NDS1), with the engagement highlighting key achievements and the continued need for collaboration under the whole-of-government approach.\nThe interface, held in Chinhoyi, provided a comprehensive review of sectoral performance as Zimbabwe accelerates its march towards Vision 2030.\nOne of the key milestones presented was in the agriculture sector, with winter wheat production exceeding expectations.\n“On wheat production, the province has surpassed the target of 34 500 hectares by 3 % to 35 525. Our concern, however, is on the late disbursement of PIP inputs. If these were given on time, we could easily surpass our average target yield on 5.5 tonnes per hectare; however, a 5.2 tonnes per hectare target is possible,” Mashonaland West Provincial Agritex Officer, Mrs Evelyn Ndoro said.\nOn the tobacco front, the province is poised to benefit from the ongoing marketing season, with several contractors already operating.\n“Harvesting of summer crops is tailing off, with most farmers now threshing and marketing. Tobacco marketing is ongoing, with 19 contractors buying tobacco in the past week. As a province, our mass is 97 million kilograms with a value to date of 314,357 USD. However, 23 percent of the planted area still has stalks standing. Four teams comprising TIMB, Plant Quarantine, and Agritex are on the ground in Makonde, Zvimba, and Hurungwe districts, following up with errant farmers,” Mrs Ndoro added.\nHowever, concerns were raised in the health sector, with malaria remaining a persistent challenge. Since January, the province has recorded over 23 000 cumulative cases and 75 deaths.\n“We continue to emphasise preventive care and community health outreach to reduce avoidable deaths. Makonde leads with 28 deaths, followed by Hurungwe with 22. Risk communication and community engagement activities are ongoing, including health education, distribution of IEC materials at clinics and in communities, weekly radio campaigns on Platinum FM, and mobile outreach across all districts,” said Provincial Medical Director, Dr Celestino Dhege.",
            "time": "18:48",
            "date": "17 Jul 2025"
        },
        {
            "title": "Harare roads under siege as pirate taxis defy enforcement",
            "href": "https://www.zbcnews.co.zw/harare-roads-under-siege-as-pirate-taxis-defy-enforcement/",
            "content": "Story by Peter Chivhima\nPIRATE taxis continue to wreak havoc and endanger lives on the country’s roads, despite repeated warnings and enforcement offensives by law enforcement agents.\nTheir reckless conduct is not only causing chaos and traffic jams but also putting innocent lives at risk each day.\nFrom speeding to dangerous overtaking and blatant disregard for traffic signals, these Mushikashika operators have turned the country’s roads into death traps.\n“This is not good, I think the police must work together with commuter omnibus operators so that there is order in town. Look at what is happening here, they are loading and offloading passengers in the middle of the road. This is bad,” a commuter, Mr Barnabas Mapisa said.\n“We are no longer comfortable coming and doing business here because of mushikashika,” another commuter, Vimbai Maredza added.\nZBC News revisited several well-known hotspots in Harare this Monday, where it seems the situation is getting worse when compared to the past years, as commuter omnibus crews continue to flout road rules.\nPublic outrage is even louder than ever, and their cry is for guaranteed safety.\n“We are no longer safe to travel in town because these kombie crews behave as if they are the owners of the road. It is so sad. The police should do something,” a Harare resident, Ms Kundai Kuyeri noted.\n“I think the police must also arrest both the owners of the commuter omnibuses for flouting road regulations, and by doing that, this will deter them from giving bad drivers their vehicles,” Harare resident Mr Thomas Kachiti said.\nAnother Harare Resident, Mr Morgan Chakaipa, said, Harare is no longer safe with these mushikashika operators because they do not even care for our safety.",
            "time": "18:48",
            "date": "17 Jul 2025"
        },
        {
            "title": "Emmerson Dambudzo Mnangagwa Law School construction works almost complete",
            "href": "https://www.zbcnews.co.zw/emmerson-dambudzo-mnangagwa-law-school-construction-works-almost-complete/",
            "content": "Story by Tafara Chikumira\nCONTRACTORS at the Emmerson Dambudzo Mnangagwa Law School, a branch of the Midlands State University (MSU) in Kwekwe, have introduced night shifts as they target to beat the August deadline to finish the first phase of the project.\nIt is all hands on deck as contractors at the law school target to ensure the main structure at the facility is completed before this year’s graduation ceremony scheduled for September at the site.\nAuthorities are grateful to the government for availing the necessary funding towards the infrastructure, which is part of the Second Republic’s priority projects.\n“Every material is now on site, we are only left with fitting the windows and roofing, which we hope will be done in the next two weeks. We angle to fix the road infrastructure as well as do the necessary plumbing for the facility to be usable,” the institution’s acting vice chancellor, Professor Grace Mugumbate, said.\nThe government is equally impressed by the progress at the facility, which feeds into the National Development Strategy One.",
            "time": "18:48",
            "date": "17 Jul 2025"
        }
    ]
}