{
    "news": [
        {
            "title": "Devolution funds spur growth as Mvurwi charts path to municipality",
            "href": "https://www.zbcnews.co.zw/devolution-funds-spur-growth-as-mvurwi-charts-path-to-municipality/",
            "content": "\nStory by Tapiwa Machemedze\nMVURWI town which has been experiencing rapid growth is targeting to achieve municipal status after the commissioning of several projects in line with its aspirations.\nDevolution-funded initiatives, including sewer ponds with the capacity to support 23 000 households, a refuse compactor, and a fire tenderwere commissioned by the government in Mvurwi this Friday.\nThe servicing of 600 medium-density stands has also commenced, with residents welcoming these positive developments.\n“We are happy and hopeful that the new refuse compactor will improve service delivery. We also expect the fire tender to help mitigate the danger of fires. However, we urge the council to ensure that the hydrants are functioning properly, otherwise, the fire tender will be ineffective,” one of the beneficiaries said.\n“As young people, we applaud the devolution fund for making projects possible. However, we cannot afford the current stands and call upon the council to support us by availing high-density stands tailored for the youth,” another beneficiary noted.\nMvurwi Town Council leaders praised the devolution funds for contributing towards the completion of projects.\n“As Mvurwi Town Council, our vision aligns with the national agenda. His Excellency, Cde E.D. Mnangagwa and his government have emphasised the goal of achieving an upper-middle-income society. We are committed to that vision and are also working toward attaining municipal status, which is why we have commissioned these projects today,” Mvurwi Town Clerk, Dr Sheryl Nyakudya said.\n“With regard to the minimum service delivery standards recently set by the government, I can confidently say that Mvurwi is ahead, we are leading. Agriculture is the backbone of our town, so our vision is to establish support services that promote not only agriculture but also manufacturing. We also plan to establish an agricultural university to ensure young people can acquire skills and perfect their trade,” Mvurwi Town Chairman Tonderai Samhu added.",
            "time": "18:32",
            "date": "06 Jul 2025"
        },
        {
            "title": "Presidential Poultry Programme Empowers Shurugwi Communities and Schools",
            "href": "https://www.zbcnews.co.zw/presidential-poultry-programme-empowers-shurugwi-communities-and-schools/",
            "content": "\nStory by Courage Bushe\nTHE ruling ZANU PF party’s empowerment programmes are transforming communities, with six schools in Shurugwi North being the latest to benefit from a poultry scheme.\nIn the Midlands Province, Sebanga Adventist Primary School, Charles Wraith Primary, Parkinson Secondary, Tongogara High School, and Juchuta Secondary School received poultry starter packs under the scheme.\nIn addition, Takunda Secondary School was equipped with a solar-powered borehole, aimed at supporting agricultural projects and improving water access.\nBeneficiaries expressed gratitude for the support, praising the Second Republic for prioritising community empowerment through practical farming initiatives.\n“President Emmerson Mnangagwa has ensured that, as communities, we are empowered. Today, we are receiving chicks under the Presidential Poultry programme, and they will go a long way in improving nutrition within our communities. Furthermore, if fully supported, many will be able to start additional projects from this initiative,” one of the beneficiaries said.\n“We are excited about this programme, we are going to ensure it becomes a success such that we will be able to sustain the livelihoods of our families,” another beneficiary noted.",
            "time": "18:32",
            "date": "06 Jul 2025"
        },
        {
            "title": "Govt condemns shoddy work at Bhale Clinic project",
            "href": "https://www.zbcnews.co.zw/govt-condemns-shoddy-work-at-bhale-clinic-project/",
            "content": "Story by Mhlomuli Ncube\nTHE government has condemned shoddy workmanship at the ongoing construction of Bhale Rural Health centre in Hwange District, imploring the contractor to shape up.\nThe project, for which the government allocated US$200 000, has left both officials and the local community disappointed after inspections revealed substandard structures already showing signs of deterioration.\nThe two small buildings, intended to house critical health services, have begun falling apart before completion, a situation that failed to impress the Special Adviser to the President on Monitoring of Government Programmes, Dr Joram Gumbo, who toured the facility on Thursday accompanied by government officials and community members.\n“They are breaking apart before we have even started using them. The window latches are also coming apart, and some of the door hinges are already coming apart. Especially for a health post building, it does not meet our minimum requirements for a medical facility,” Hwange DMO, Dr Fungai Musinami said.\n“For this clinic, we are not happy. Locals should be involved in tenders for such projects. We cannot even talk about this clinic, let alone inviting dignitaries to see such shoddy work, no, we are disappointed and we think this should be destroyed and rebuilt afresh,” Traditional Leader, Chief Nekatambe added.",
            "time": "18:33",
            "date": "06 Jul 2025"
        },
        {
            "title": "Harare teenager arrested for attempting to sell human foetus",
            "href": "https://www.zbcnews.co.zw/harare-teenager-arrested-for-attempting-to-sell-human-foetus/",
            "content": "Story by ZBC Reporter\nA 19-year-old man has been arrested in Harare after allegedly attempting to sell a human foetus he claimed was beef.\nThe suspect, identified as Stelly Marecha, is in police custody following his arrest at the corner of Mbuya Nehanda and Albion Streets in the capital’s Central Business District.\nAccording to a police statement, Marecha reportedly discovered the foetus wrapped in a black plastic bag discarded in a bin at the busy intersection.",
            "time": "18:33",
            "date": "06 Jul 2025"
        },
        {
            "title": "ZRP engaged in devolution programme awareness",
            "href": "https://www.zbcnews.co.zw/zrp-engaged-in-devolution-programme-awareness/",
            "content": "Story by Theophilus Chuma\nGOVERNMENT is strengthening the devolution drive through enhanced knowledge building among key stakeholders, including the Zimbabwe Republic Police.\nAddressing a group of police superintendents at Mkushi Police Academy in Harare this Friday, Permanent Secretary for Presidential Affairs and Devolution, Engineer Tafadzwa Muguti, stressed the critical role of law enforcement in promoting transparency, accountability, and local responsiveness under the national devolution agenda.\n“There are trends of commercial crime that is happening. Let us be alive to what is happening across business that are conducting money laundering, but this is being done so discreetly and under the guise of legitimate business,” he said.\nThe lecture focused on enhancing capacity among law enforcement leaders to align policing duties with the principles of devolution, which is key to inclusive governance and development.",
            "time": "18:33",
            "date": "06 Jul 2025"
        }
    ]
}