{
    "news": [
        {
            "title": "Inmates showcase culinary skills in cook out competition",
            "href": "https://www.zbcnews.co.zw/inmates-showcase-culinary-skills-in-cook-out-competition/",
            "content": "Story by Courage Bushe\nINMATES from across the Midlands Province had a rare opportunity to showcase their culinary skills and engage in a cultural exchange during a traditional cookout competition held at Kwekwe Prison this Friday.\nThe cookout competition was oversubscribed as people jostled to witness the event which has gained traction across the country.\nThe competition saw 12 male and eight female inmates showcasing their culinary skills, to encourage the adoption of healthy and affordable traditional foods in prisons.\n“This is a good platform for us to learn and exchange notes. We are grateful to the Mother of the Nation for giving us this learning platform,” a prisoner said.\n“We will apply this knowledge when we leave this place because we now know how they can help us. We know about traditional foods that our forefathers used to eat and we are now taking this knowledge and applying it in our lives,” another added.\nGovernment says taking Amai Mnangagwa’s cooking competition to prisons is a positive step towards rehabilitating inmates and preparing them for reintegration into society.\n“The competition shows how Amai is committed to making sure that inmates are remembered and integrated into society.  This demonstrates the mantra of leaving no one and no place behind.  We believe that after this competition, inmates will gain culinary skills that will help them in their lives after incarceration,” Midlands Minister of State for Provincial Affairs and Devolution Honourable Owen Ncube said.",
            "time": "06:08",
            "date": "22 Mar 2025"
        },
        {
            "title": "JSC swears in 12 new magistrates in push for efficient justice delivery",
            "href": "https://www.zbcnews.co.zw/jsc-swears-in-12-new-magistrates-in-push-for-efficient-justice-delivery/",
            "content": "Story by Fairstars Mukungurutse\nTHE Judicial Service Commission (JSC) has sworn in 12 new magistrates at the Harare Magistrates Court this Friday, amid calls for transparency and accountability in the delivery of justice.\nBriefing the media after presiding over the ceremony, Chief Magistrate Vongai Guwuriro underscored the crucial role of the new magistrates towards efficient justice delivery.\n“The Judicial Service Commission is on a deliberate strategic push to ensure that we continue decentralising and making sure that we have courts in so many districts around Zimbabwe. So they are coming to add to the magistrates that we already have and assist in the elimination of the case backlog. As of today, with their addition, we now have 253 magistrates who can sit in our courts and preside over cases.”\nThe chief magistrate also cautioned the newly-recruited magistrates against engaging in corrupt practices.",
            "time": "06:08",
            "date": "22 Mar 2025"
        },
        {
            "title": "US$1.2 million wastewater treatment plant commissioned in Kariba",
            "href": "https://www.zbcnews.co.zw/us1-2-million-wastewater-treatment-plant-commissioned-in-kariba/",
            "content": "Story by Tamuka Charakupa\nLISTED crocodile-producing entity, Padenga Holdings, has commissioned a US$1.2 million wastewater treatment plant in Kariba in a move set to enhance compliance with local and international environment conservation obligations.\nThe commissioning of the plant is the firm’s latest move to conform to international environmentally sustainable practices.\nPadenga Agri-business’s(a subsidiary of Padenga Holdings) Chief Executive Officer, Mr Garry Sharp said the investment speaks to adherence to environmentally sustainable standards.\n“We have an obligation to sustainability for the benefit of citizens of Zimbabwe, to protect resources for future generations. Secondly, we have to demonstrate to our customers that we are conforming to environmentally sustainable standards.”\nEnvironmental Management Agency (EMA) Director for Environmental Protection Mr Christopher Mushava reiterated the need for a collective effort in mitigating the effects of climate change, pollution and biodiversity loss.\n“We strongly appreciate the strategic decision that Padenga Holdings has taken, to respond to the law enforcement efforts in this manner. We hope that other enterprises whose operations produce pollution are watching and will also invest and implement sustainable practices in their operations.\n“The time to thrive on externalising pollution is slowly coming to an end as the process of strengthening environmental legislative framework and all the relevant statutory instruments to ensure compliance is at an advanced stage.\n“The National Development Strategy 1 considers environmental protection, climate resilience and natural resources management as key enablers for the attainment of Vision 2030 and the Sustainable Development Goals,” Mr Mushava said.",
            "time": "06:08",
            "date": "22 Mar 2025"
        },
        {
            "title": "Insurance and Pensions Amendment Bill set for public consultations",
            "href": "https://www.zbcnews.co.zw/insurance-and-pensions-amendment-bill-set-for-public-consultations/",
            "content": "Story by Peter Chivhima\nTHE Insurance and Pensions Amendment Bill of 2024 has received majority endorsement from lawmakers after it was taken to Parliament for review this Thursday.\nLegislators are convinced that the bill will instill confidence within the sector but highlighted the need to also align the bill to the needs of the elderly and people with disabilities.\n“Some come to corruptly take away people’s money and abuse contributions by members, so IPEC must have enough regulatory powers to deal with such,” Gutu South Legislator Honourable, Pupurai Togarepi said.\nMurewa West Legislator, Honourable Farai Jere states that the protection of pensioners is crucial as their role is vital and can not be overlooked.\n“We fully support the amendment of the bill, which has undergone a thorough review. Considering the issues discussed, including internet access, the welfare of our people, the challenges faced by our pensioners, and the shortcomings in our insurance companies, it is clear that the current bill is outdated.”\nThe Insurance and Pensions Commission (IPEC) Amendment Bill, 2024, seeks to enact significant changes to the Insurance and Pensions Commission Act [Chapter 24:21].",
            "time": "06:08",
            "date": "22 Mar 2025"
        },
        {
            "title": "Govt extends deadline for November ZIMSEC exam fees payment",
            "href": "https://www.zbcnews.co.zw/govt-extends-deadline-for-november-zimsec-exam-fees-payment/",
            "content": "Story by Peter Chivhima\nTHE government has extended the deadline for the payment of the ZIMSEC November 2025 examination fees to May 16.\nThis was announced by the Minister of Primary and Secondary Education, Honourable Torerayi Moyo, on the sidelines of the Senate question and session at the New Parliament Building in Mt Hampden this Thursday.\n“The public examination fees were scheduled to be paid on or before March 28, but we received a request from Parliamentarians this afternoon that the date be extended. In consultation with the stakeholders, we have agreed that the date be extended to May 16,” the Minister said.",
            "time": "06:08",
            "date": "22 Mar 2025"
        }
    ]
}