{
    "news": [
        {
            "title": "Historic liberation struggle site in Gweru gets new look",
            "href": "https://www.zbcnews.co.zw/historic-liberation-struggle-site-in-gweru-gets-new-look/",
            "content": "Story by Tafara Chikumira\nTHE transformation of Mtapa Hall in Gweru into a national monument is progressing well, with workers on site.\nLocated in the middle of one of Gweru’s oldest high-density suburbs of Mtapa is a building of historical significance by the name Mtapa Hall.\nThe building is famed for having hosted the first ZANU congress in 1964, ushering in a political leadership that would complement other political movements in fighting the liberation struggle.\nPresident Emmerson Mnangagwa was among the many nationalists who attended the congress which saw the late national hero, Cde Ndabaningi Sithole being elected President, while the late former President Robert Mugabe was elected Secretary General.\nThe hall has since been identified as a historical monument due to its significance after the newly formed political outfit came up with a resolution to wage an armed struggle against the settler regime and correct some injustices that were being perpetrated by the white minority against the indigenous black majority.\nWhile the hall held this essential congress, nationalists had to strategise and come up with new ways of meeting and discussing the way forward after the hall became a no-go area as soon as the white minority got wind of the decisive congress, leading to the ban of ZANU a year later by the Ian Smith regime.\n“I only came to Gweru in 1969. However, the situation had changed then, we would do meetings inside people’s houses as it was no longer possible to host political meetings in the hall. One of us would play surveillance on top of the roof and as soon as they see police officers approaching, they will whisper and we would go dead silent. We needed to be extra vigilant and the hall was mainly used for boxing after the 1964 congress,” nationalist, Cde Parwaringira Matiki said.\n74-year-old war veteran, Cde Joseph Bvura says after the congress, it was no longer possible to use the hall as all eyes were now fixed on the infrastructure.\n“When I tried crossing to Mozambique, we were stopped by the colonialists. I had to come here but it was no longer easy to say I was looking for ZANU. We were using the name the People’s Movement. We used to meet at the Gweru River there or sometimes in people’s houses. We only managed to use this building well after independence thus when we started hosting meetings in the hall.”\nThe transformation of the historical hall into a national monument has brought about positive change to the Mtapa suburb.\nThe hall has received massive renovations and a solar-powered borehole has since been installed to provide clean water to the people, and the government is happy with the development.\n“The President’s mantra that no one and no place should be left behind in national development is being experienced across the country. Today we see this Mtapa Hall getting some renovations. The idea to decentralise Independence Celebrations is changing the Midlands. President Emmerson Mnangagwa is a visionary leader who is transforming communities,” Minister of Home Affairs and Cultural Heritage Honourable Kazembe Kazembe said.",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Mbare Musika Traders Mall complete and set to open this week",
            "href": "https://www.zbcnews.co.zw/mbare-musika-traders-mall-complete-and-set-to-open-this-week/",
            "content": "Story by John Nhandara\nTHE Mbare Musika Traders Mall in Harare is now complete and set for opening this week.\nMbare Musika traders, whose wares were destroyed by fire late last year, are breathing a sigh of relief following the completion of a new mall that will accommodate up to 1 000 traders.\n“When our wares were destroyed by fire, we never thought we would get this kind of a facility so we are grateful to the government,” Mbare Retail Traders Association’s Chairperson Erasmus Bofo said.\nThis Monday, a government ministerial delegation assessed progress in the construction of the mall, which is set to be commissioned this week.\n“We came as ministers to see progress before the commissioning of this project by His Excellency on Friday and we are satisfied with the progress,” the Minister of Local Government and Public Works Honourable Daniel Garwe noted.\n“The first phase of the market is complete. Government is now ironing out some issues with traders on allocations and after that, the traders will be accommodated,” Harare Metropolitan Minister of State for Provincial Affairs and Devolution Senator Charles Tawengwa stated.",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Sakubva communities receive relief under ZANU PF empowerment programme",
            "href": "https://www.zbcnews.co.zw/sakubva-communities-receive-relief-under-zanu-pf-empowerment-programme/",
            "content": "Story by Oliver Karuru\nTHE ruling ZANU PF party is walking the talk on its promises to support the vulnerable members of the community through food relief and empowerment programmes.\nSakubva’s vulnerable members from Mutare’s Central 13 wards this Saturday received rice, flour and chicks sourced by local legislators from the ruling party as the revolutionary movement walks the talk on its promise to empower and support vulnerable communities.\n“We want to thank President Emmerson Mnangagwa and the first lady for ensuring that people with disabilities are recognised in society. The move to send local legislators to give us rice, flour, and chicks for projects is highly appreciated,” a beneficiary said.\n“I am grateful that we have been given chicks to start poultry projects as persons with disabilities. We have also been given flour to start bakery projects. We want to work for ourselves as persons with disabilities,” a community member said.\n“This is a surprise, and we thank our legislators for assisting the vulnerable. We thank President Mnangagwa for providing food to the vulnerable, and we pray for him to continue receiving blessings,” a beneficiary said.\n“The move to support the vulnerable by the party leaders is testimony that we have a caring leadership,” a ZANU PF party member said.\nThe ZANU PF local leadership spoke on the donation of rice from President Mnangagwa and other food items to start income generation projects.\n“We want to thank Senator Irine Zindi and Women’s Quota legislator, Cde Getrude Mutandi for supporting our people in times of need. It is a good thing to engage and support the electorate. We are giving people food as they are still harvesting their fields,” Central Committee Member, Cde Issau Mupfumi said.",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "MSU Expands Infrastructure to Boost Innovation and Skills Training",
            "href": "https://www.zbcnews.co.zw/msu-expands-infrastructure-to-boost-innovation-and-skills-training/",
            "content": "Story by Wellington Makonese\nTHE Construction of the Emmerson Mnangagwa Campus in Kwekwe is progressing steadily as part of Midlands State University’s multi-campus strategy, which aims to provide modern infrastructure to support enhanced education.\nProgress continues on the construction of the MSU multi-campus facility in Kwekwe, which will host three faculties, including the Emmerson Mnangagwa Law School, as the Second Republic accelerates efforts to modernise infrastructure while advancing Education 5.0.\nThis development aligns with the government’s commitment to ensure no region is left behind in the pursuit of national development.\n“The ED Mnangagwa Campus is being constructed in honour of the President on a 229-hectare site, and we know it will boost the local economy. It will include a Faculty of agriculture and natural resources Built Environmental, with research and services already underway at the site. We aim to build a strong livestock and wildlife centre as part of the agro-industrial park,” Principal Lecturer, Masvingo Polytechnic, Engineer Modify Zvenhamho said.\nAs part of the engineering workmanship, Students have been integrated into the project to gain practical work experience.\n“What we are providing our students is industrial exposure. Trussing is being done by Masvingo Polytechnic students, and the work began in September last year. We expect completion soon,” Vice Chancellor, Midlands State University (MSU), Professor Victor Ngonidzashe Muzvidziwa said.",
            "time": "06:31",
            "date": "08 Apr 2025"
        },
        {
            "title": "Advocate Mudenda elected to lead key IPU Committee on global issues",
            "href": "https://www.zbcnews.co.zw/advocate-mudenda-elected-to-lead-key-ipu-committee-on-global-issues/",
            "content": "Story by ZBC Reporter\nPROCEEDINGS at the 150th Inter-Parliamentary Union (IPU) Assembly and related meetings began on Friday in Uzbekistan, with the Speaker of Parliament, Advocate Jacob Mudenda being unanimously elected by the Africa Geopolitical Group to chair a newly formed Committee.\nThe election is a clear show of confidence in his leadership, vast experience on Parliamentary legal issues and drafting capabilities, Speaker Mudenda was elected by the Africa Geopolitical Group to chair the newly constituted Committee tasked with the arduous assignment of drafting a proposal for an emergency Item for possible inclusion on the agenda of the 150th IPU Assembly and related meetings.\nThe proposed resolution will address rising global conflicts, particularly in the Middle East and Africa, alongside the global impacts of climate change. The resolution combines proposals from the Arab Group and the Seychelles delegation. The Arab Group’s resolution focuses on global conflicts, while the Seychelles delegation addresses the debilitating effects of climate change on sustainable development.\nThe drafting committee, which includes representatives from Algeria, Djibouti, Morocco, Seychelles, Burkina Faso, Zambia, Côte d’Ivoire, Senegal, the Democratic Republic of Congo, and Zimbabwe, began its work on Saturday.\nIn another development, Honourable Maureen Kademaunga, who is a part of the Zimbabwean delegation in Uzbekistan was nominated to serve on the Bureau of the IPU Committee on Science and Technology. Her tenure will begin in October 2025 during the 151st IPU Assembly in Geneva, Switzerland.\nThe Africa Geopolitical Group Meeting was preceded by the SADC PF Group Meeting at the IPU, chaired by the newly elected Speaker of the Parliament of Botswana Retired Honourable Dr Dithapelo Lefoko Keorapetse, Speaker of the Parliament of Botswana.",
            "time": "06:31",
            "date": "08 Apr 2025"
        }
    ]
}