{
    "news": [
        {
            "title": "A season of giving: Norton’s vulnerable receive essential support",
            "href": "https://www.zbcnews.co.zw/a-season-of-giving-nortons-vulnerable-receive-essential-support/",
            "content": "Story by Tamuka Charakupa\nGOVERNMENT is harnessing the societal approach in cushioning the less privileged during the festive season, with the vulnerable in Norton receiving an assortment of groceries and wheelchairs for persons with disabilities.\nFor Sekuru Daniford Makedenge of Norton’s Katanga high-density suburb, whose lower part of the body was paralysed as a result of prostate cancer detected in July, a wheelchair is all he longed for.\n“I am grateful to Councillor Machemedze for remembering me during this time of the year. After my operation, everything changed and I lost my dignity as I had to rely on my relatives for everything,” he said.\n“It’s never easy to survive as a person with a disability. I am grateful for receiving a wheelchair and food hampers,” added a beneficiary.\nThe gesture, a brainchild of Norton’s Ward 7 Councillor, Mr Tinashe Machemedze, speaks to the inclusive development agenda.\n“We should help beyond political lines because Christmas is a time of giving,” said Mr Machemedze.",
            "time": "06:37",
            "date": "21 Dec 2024"
        },
        {
            "title": "Bulawayo tourism sector experiences growth",
            "href": "https://www.zbcnews.co.zw/bulawayo-tourism-sector-experiences-growth/",
            "content": "Story by Lisa Masuku\nAs the festive season kicks into high gear, the City of Bulawayo is experiencing a significant uptick in tourism, attracting both international and local visitors eager to explore the City of Kings and Queens’ heritage.\nThe Ministry of Tourism and Hospitality Industry has taken the ‘Meet and Greet’ initiative to Bulawayo and Plumtree Border Post to further promote local tourism destinations.\nA notable trend is the growing number of Zimbabweans from the diaspora returning home to explore the country’s rich heritage and stunning landscapes.\nThe returning citizens, who are eager to reconnect with their roots are, contributing to the city’s economic revival and cultural exchange.\n“I have been out of the country for more than 24 years. I brought my family with me to come and feel what Zimbabwe has to offer that they cannot experience outside Zimbabwe. Home is best honestly and we only get to appreciate it when we are outside,” said a diasporan.\n“I’m so pleased to be back in Zimbabwe. This time around l will be in Victoria Falls, it is a stunning city with incredible people,” said another diasporan.\n“The minister’s welcome made me feel at home and the brochures are amazing too definitely we will visit some of the places such as Bluehills seems like a good place,” a diasporan said.\n“I am looking forward to enjoying our food again. I have been travelling but our food will always be the best and l cannot wait to sample new restaurants in town and entertainment joints that were opened in the last three years l haven’t been around,” said another.\nThe Deputy Minister of Tourism and Hospitality Industry, Honourable Tongai Mnangagwa expressed delight at the growing number of tourists visiting Bulawayo.\n”We are thrilled to see the positive impact tourism is having on the city. The numbers so far are increasing and when we compare with the previous year, we are witnessing an increase. This initiative has been instrumental in showcasing the city’s unique offerings and encouraging people to explore its hidden gems,” he said.",
            "time": "06:37",
            "date": "21 Dec 2024"
        },
        {
            "title": "Zimbabwe commits to preserving liberation heritage and promoting cultural tourism",
            "href": "https://www.zbcnews.co.zw/zimbabwe-commits-to-preserving-liberation-heritage-and-promoting-cultural-tourism/",
            "content": "Story by Abigirl Tembo\nAs part of efforts to preserve the country’s rich cultural heritage, the Ministry of Home Affairs and Cultural Heritage through the National Museums and Monuments of Zimbabwe has embarked on an ambitious plan to document, preserve and promote liberation heritage.\nSpeaking at the National Museums and Monuments of Zimbabwe Strategic Planning Workshop in Harare this Thursday, Home Affairs and Cultural Heritage Minister Honourable Kazembe Kazembe emphasised the importance of preserving the history of Zimbabwe’s struggle for independence, including the roles played by regional countries such as Mozambique, Zambia, Botswana, Angola, and Tanzania.",
            "time": "06:37",
            "date": "21 Dec 2024"
        },
        {
            "title": "Tertiary institutions embrace Education 5.0 Model",
            "href": "https://www.zbcnews.co.zw/tertiary-institutions-embrace-education-5-0-model/",
            "content": "Story by John Nhandara\nInstitutions of higher learning, including the Management Training Bureau (MTB), are repositioning themselves as strategic training facilities for critical human capital development in line with the Heritage-Based Education 5.0 Model.\nMTB, renowned for its practical-oriented training programmes, has made significant strides to meet the evolving demands of the job market in line with the Heritage-Based Education 5.0 Model.\nThis emerged during the MTB 40th anniversary celebrations held at the institution’s headquarters in Harare Wednesday night.\n“We celebrate four decades of human capital development. We celebrate growth and diversification of MTB offerings. We have continuously adapted MTB’s curriculum so that it aligns with industry, commerce and public sector needs. In 2018 our parent ministry adopted the educated 5.0 model which speaks to the production of goods and services. It is against this background that we have also adopted a heritage based centre of excellence for life-long learning. Our pillars are based on business strategy, business research and entrepreneurship development,” said MTB Executive Director, Dr Nelson Maseko.",
            "time": "06:37",
            "date": "21 Dec 2024"
        },
        {
            "title": "Zimbabwe Gender Commission & UN unite in fighting GBV",
            "href": "https://www.zbcnews.co.zw/32322-2/",
            "content": "Story by Fairstars Mukungurutse\nA national study on violence against women in politics by the Zimbabwe Gender Commission has revealed that gender-based violence is a significant barrier to women’s full participation in politics.\nThe national study commissioned by the Zimbabwe Gender Commission in partnership with United Nations Women in Harare this Wednesday seeks to promote zero tolerance to all forms of gender-based violence against women in politics.\nThe survey revealed a worrying trend of women parliamentary candidates experiencing some form of violence including harassment, cyber-bullying, emotional and verbal abuse perpetrated by both men and women.\nChairperson of the Zimbabwe Gender Commission, Commissioner Margaret Mukahanana Sangarwe called for a multi-stakeholder approach to effectively address violence against women in the politics.\n“No single solution can eradicate this vice. Instead, we must adopt a wide array of measures across different levels to effectively address the various forms of violence women face in the political arena while taking into account the complex contexts in which these incidents occur. The report comes with a set of recommendations for multi-sectoral stakeholders on preventing and responding to violence some of which include the implementation of legislation and policies that address violence against women in politics and holding political parties accountable to gender equality and women empowerment commitments,” Commissioner Sangarwe noted.\nJapanese Deputy Ambassador to Zimbabwe Mr Hiro Yuki expressed commitment to continue supporting the country’s efforts to eradicate GBV, sentiments echoed by a representative from the French embassy Mrs Lucie Gal-Ong.",
            "time": "06:37",
            "date": "21 Dec 2024"
        }
    ]
}