{
    "news": [
        {
            "title": "Holy Cross conference centre project on track",
            "href": "https://www.zbcnews.co.zw/holy-cross-conference-centre-project-on-track/",
            "content": "Story by Tafara Chikumira\nTHE Holy Cross Conference Centre and Tourism Resort project in Chirumanzu is progressing well, amid indications that the first phase of the project will be completed by the end of April this year.\nThe centre boasts of a conference centre, a bar, and 10 modern chalets earmarked for the initial phase among other critical features.\n“We are excited by the progress of this critical project.  We are happy that the team is enthusiastic. All the materials are now on site and we hope to open to the public by May this year,” said Holy Cross project supervisor, Mr Shepherd Hloma.\nThe community has begun to enjoy benefits from the project, with tertiary students also gaining skills and experience.\n“The project has brought life to our community. I have since managed to construct a beautiful house to my name. I have also managed to buy some cattle through this project. My children can now attend school after the payment of full school fees. We are enjoying as Chirumanzu community,” a community member noted.\nAnother added, “I used to be an assistant for builders in my community.  Things have changed for the better ever since I started working here. I can now do a lot of work from plumbing to building. I have learnt several skills and I can safely say my future is bright.”\n“As a single mother, life was very tough as I had to fend for my family. I want to thank the government for this noble project where we are also engaged in demanding duties just like our male counterparts.”",
            "time": "08:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Govt prioritises electricity access for Gutu villagers",
            "href": "https://www.zbcnews.co.zw/govt-prioritises-electricity-access-for-gutu-villagers/",
            "content": "Story by Mercy Bofu-Matinha\nTHE Government continues to prioritise rural development by ensuring access to electricity, with villagers of Gutu being the latest to benefit following the commissioning of electricity transformers in the area to supply critical institutions including clinics, schools, and rural business centres.\nMr Cuthbert Marimi is one of the small business owners at Jaravaza shopping Centre in Gutu, and he is looking forward to improved business following the installation of a new electricity transformer in their area.\nApart from Jaravaza Shopping Centre, five other transformers were installed at various centres and are expected to feed into critical institutions including rural healthcare centres and schools, with the project being spearheaded by area legislator, Honourable Winston Chitando.\n“Today is a big day for this community, we had gone for more than three years without electricity because we did not have a transformer. Now that it has been installed, our small businesses are going to thrive again because we were no longer able to run butcheries, and liquor shops or store perishable goods. We thank our government for always being supportive of the rural populace,” Mr Marimi said.\nGutu central villagers gathered at various centres across their constituency at the weekend to celebrate the development implemented by the Second Republic.\n“Today after the installation of electricity transformers, our clinics will now run viably, our children will now be doing computer studies at any time. Even our rural homes are now reconnected meaning we now have smooth access to information,” a villager said.\n“The government sank more than 20 boreholes and many are now into gardening projects. Again, we are beneficiaries of the Presidential Goat and Poultry Scheme among many others,” another villager added.\nHonourable Winston Chitando, who is also the Minister of Mines and Mining Development, said rural industrialisation is key to achieving Vision 2030.",
            "time": "08:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Harare City Council’s chaotic management manifests on the roads",
            "href": "https://www.zbcnews.co.zw/harare-city-councils-chaotic-management-manifests-on-the-roads/",
            "content": "Story by Theophilus Chuma\nTHE disarray within the management of Harare City Council, as revealed through the ongoing Commission of Inquiry, has extended to the city’s roads.\nThere have been alarming revelations that the traffic management system in Harare is in a state of disrepair with compelling evidence pointing to the failure of the system, with traffic accidents increasingly characterising numerous intersections across the city, primarily due to non-functional traffic lights.\nThe city fathers have acknowledged that Harare’s traffic management infrastructure is severely compromised, operating at a mere half of its installed capacity.\n“We only have 103 traffic lights that are working while the other 150 are not functioning. It’s a serious challenge that we have,” said Harare Mayor, Councillor Jacob Mafume.\nWhile the city’s infrastructure bleeds, executives at Town House are fattening their pockets with evidence presented at the Commission of Inquiry showing the Town Clerk’s monthly salary is pegged at US$27 000.\nThe total salary bill for executives was estimated at half a million United States dollars monthly, prioritised over the cost of repairing damaged infrastructure.\nHarare’s traffic situation has degenerated into a jungle, ranging from traffic accidents to unmanageable traffic congestion.",
            "time": "08:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Rural electrification targets 1.2 million households in Mashonaland West by 2030",
            "href": "https://www.zbcnews.co.zw/rural-electrification-targets-1-2-million-households-in-mashonaland-west-by-2030/",
            "content": "Story by Tamuka Charakupa\nMASHONALAND West province has begun identifying beneficiaries of the provincial Presidential Rural Solar Installation programme set to be rolled out this April.\nThe programme is targeting to electrify at least 1.2 million households in the province by the year 2030.\nPresiding over a sensitisation meeting held in Chinhoyi on Monday morning, the Minister of State for Provincial Affairs and Devolution, Honourable Marian Chombo said, the programme is part of efforts to bridge the urban-rural gap.\n“This project is a testament to our government’s dedication to providing sustainable energy solutions and enhancing the overall quality of life for our citizens. It is part of the President’s drive to promote rural industrialisation development agenda and the realisation of the Rural Development Strategy by creating an expansion of solar-powered infrastructure. This initiative was approved, and it targets to solarise at least 1,2 million households nationwide over a period from 2025 to 2030. At least 200 000 households are expected to benefit from this project on a yearly basis from the year 2025,” she said.\nThe Permanent Secretary for Mashonaland West Provincial Affairs and Devolution, Mr Gabriel Jaji revealed that Kariba district will pioneer the initial phase of implementation, adding needy communities are first on the priority list.\n“Kariba district will pioneer the programme in the province. We have seen that it is the most vulnerable district looking at areas like Siyakobvu and Mola to mention but a few. In light of the above, all government ministries, departments, and agencies should hit the ground in making necessary preparations towards implementation of this government programme,” he said.\nLocal authorities and stakeholders, which include the Rural Electrification Agency, Rural Infrastructure Development Agency (RIDA) and Chinhoyi University of Technology(CUT), say the development does not only reduce reliance on non-renewable energy sources but also catalyse rural industrialisation.\n“We are in the process of identifying needy communities which are in blackout zones. In that regard, we are training trainers of trainers at provincial level, which we will cascade to districts and wards. REA will be supervising technical works, together with RIDA and other relevant stakeholders,” said Engineer Last Sauramba.",
            "time": "08:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Fisheries and Aquaculture Bill consultations rolled into motion",
            "href": "https://www.zbcnews.co.zw/fisheries-and-aquaculture-bill-consultations-rolled-into-motion/",
            "content": "Story by Kenias Chivuzhe\nCONSULTATIONS on the Fisheries and Aquaculture Bill have begun, with the new legislation expected to guide the country towards growing the sector into a one billion United States dollar economy by 2030.\nThe introduction of the fisheries and aquiculture department within the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development has paved way for increased efforts towards growing the fishery industry.During the consultations in Nyanga this Monday, farmers and other players in the sector made submissions on key priorities under the new legislation to grow the sector into a one billion United States dollar sector by 2030.\n“This bill is important to people in aquaculture in order to improve consumption of fish in the country. The country has been lagging behind in terms of production and sustainability of the fishery industry. There is so much money that we are losing by importing fish yet we have so many water bodies,” said a farmer.\nAnother added, “There is need for the bill to give special attention to issues of theft or fish poaching. We need the bill to unlock more funding to increase fishery projects and the establishment of processing plants.”\n“This bill should protect farmers, especially with regards to standardizing production of fingerlings and feeds production to reduce substandard products that are counterproductive. Currently, any anyone can sell fingerlings thereby jeopardising quality,” a farmer stated.\nGovernment and development partners are convinced that the enactment of the new legislation will remove a myriad of challenges affecting the growth of the aquaculture sector.\n“We realise that there are a lot of unscrupulous dealers operating within the sector who are short-changed farmers, thereby reducing productivity. Some of the feeds are being produced poorly and there is need for regulation. There is need to register suppliers to make them accountable,” Deputy Director of Aquaculture in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development Mrs Lilian Nyashanu said.\nFish4 ACP’s Project Coordinator Mr Paul Mwera said, “The bill seeks to create an enabling environment for fish farming. Currently, breeders’ license is issued by the National Parks while the issue of water is handled by ZINWA with EMA focusing on the management of affluent and selling fish which requires permits from public health department. The cost of compliance is high and this affects investments into the sector.”",
            "time": "08:41",
            "date": "26 Feb 2025"
        }
    ]
}