{
    "news": [
        {
            "title": "Zim to influence regional labour standards",
            "href": "https://www.zbcnews.co.zw/zim-to-influence-regional-labour-standards/",
            "content": "\nStory by Tichaona Kurewa\nTHE government has announced that it will leverage Zimbabwe’s position as the chairperson of the Southern African Development Community (SADC) to promote decent work and fair labour practices throughout the region.\nZimbabwe is set to host the Meeting of SADC Ministers of Employment and Labour, along with Social Partners, next month in Victoria Falls.\nDuring this meeting and other forums, Zimbabwe aims to advocate for the adoption of decent work and fair labor practices, not only within the country but also across the entire SADC region.\n“We are hosting the labour and employment forums and we shall be driving decent work and a better working standard agenda as we want that to cascade to all countries in the SADC region so that our chairmanship of SADC drives key narratives in terms of labour within the region,” Minister of Public Service, Labour and Social Welfare, Honourable Edgar Moyo said.\n“We know there is a lot of labour migration within the region and we want to consolidate that and make sure that we drive it. During our term as chairperson of SADC, we will ensure that these are some of the deliverables that we achieve.”",
            "time": "18:27",
            "date": "22 Feb 2025"
        },
        {
            "title": "Gwanda school under threat from local diverted river",
            "href": "https://www.zbcnews.co.zw/gwanda-school-under-threat-from-local-diverted-river/",
            "content": "Story by Providence Maraneli\nSEBOZA Primary School in Gwanda South is facing a serious threat from the Mkhaliphe River, which has redirected its flow towards the school.\nThe continuous rains in Matabeleland South province have made conditions unbearable for both staff and learners as they endured several hours of flooding at the school this Wednesday afternoon.\nDue to heavy siltation of the Seboza Dam downstream, the Mkhaliphe River has shifted its flow towards the school, endangering the lives of learners and teachers.\n“We are so scared to send our children to school because they might be swept away, yesterday after heavy rains teachers and children had to find shelter in unaffected classes,” a concerned villager said.\n“Water covered everything in the teacher’s quarters, so we are worried we might lose our teachers fearing for their lives,” another villager added.",
            "time": "18:27",
            "date": "22 Feb 2025"
        },
        {
            "title": "Stakeholders commit to the success of the heritage-based curriculum",
            "href": "https://www.zbcnews.co.zw/stakeholders-commit-to-the-success-of-the-heritage-based-curriculum/",
            "content": "Story by Tamuka Charakupa\nThe Better Schools Programme Zimbabwe held its Mashonaland West Provincial Awards in Kadoma, with government officials encouraging education stakeholders to support the newly introduced heritage-based curriculum.\nJameson High School in Kadoma hosted this year’s awards ceremony on Thursday.\nThe awards aims to enhance education standards in schools with Mr Tawonezvi Makoni, a representative of the award winners, emphasising that recognising students, as well as academic and non-academic staff within the educational sector, plays a crucial role in the successful implementation of the heritage-based curriculum.\n“Obviously an award is a natural push factor. It motivates everyone to continue to put more effort into their respective roles therefore contributing towards the attainment of the ministry’s goals and targets,” he said.\nThe government is upbeat that the introduction of the Education 5.0 model will unlock more economic benefits for the country.\n‘’As the Ministry of Primary and Secondary Education, our goal is to ensure that every learner is equipped with a life skill that she/he will be able to rely on as a means of survival,” Mashonaland West Provincial Education director, Mr Gabriel Mhuma said.\n“We have trained all teachers on the heritage-based curriculum and today’s event buttresses all our efforts to promote this new direction by recognizing those who are excelling in their various roles within the ministry.”\n‘’As the government, we are rolling out the devolution programme where we are constructing schools and providing essential services to our communities,” the Minister of State for Mashonaland West Provincial Affairs and Devolution director, Mr Douglas Chiwiro said.\n“The goal is to ensure that we create a conducive environment for them that stimulates economic growth.”",
            "time": "18:27",
            "date": "22 Feb 2025"
        },
        {
            "title": "Govt commissions science labs at Gokwe school",
            "href": "https://www.zbcnews.co.zw/govt-commissions-science-labs-at-gokwe-school/",
            "content": "Story by Tafara Chikumira, Midlands Bureau Chief\nTHE government has commissioned three Advanced Level science laboratories at St Pauls High School in, as the institution aims to take Science Technologies Engineering and Mathematics (STEM) subjects to another level.\nThe science block comprises biology, chemistry, and physics laboratories as well as a smart lecture room.\nThe facility constructed for US$237 million will enable the school to start conducting Advanced Level STEM-related subjects.\n“We have been having some bright students here, especially in the sciences who were being absorbed by other schools. However, with this development, we are now able to enrol the best in the areas of STEM. This will also act as a motivation to the lower grades so that they start having an interest in the STEM area,” St Pauls High School, head of the department of STEM subjects, Mr Devine Lameck said.\n“We now have proper practicals in the area of Biology. I can see that my dream of becoming a doctor is shaping up. I am now geared to give it my all,” a pupil at the school said.\n“We are very grateful for this achievement.  I can now start practising most experiments I used to do in theory.  I can now feel the real thing. It’s good that we are heading in the right direction,” another pupil added.\nThe government is impressed by the strides being made by schools in complying with the demands of heritage-based learning.\n“The construction of science laboratories is a pivotal component in advancing the Vision of His Excellency President Dr Emmerson Mnangagwa’s Vision 2030, as it directly supports the goals of enhancing education quality and fostering innovation,” Minister of Primary and Secondary Education, Honourable Torerai Moyo said.",
            "time": "18:27",
            "date": "22 Feb 2025"
        },
        {
            "title": "Govt moves to enhance access to identity documents",
            "href": "https://www.zbcnews.co.zw/govt-moves-to-enhance-access-to-identity-documents/",
            "content": "Story by Kenias Chivuzhe\nZIMBABWE continues to improve access to national identity documents for people throughout the country, in accordance with the recommendations of the National Inquiry on access to documentation.\nIn response to the widespread challenges individuals faced in obtaining identity documents, the Second Republic, through its Human Rights Commission, conducted a National Inquiry on Access to Documentation, culminating in a comprehensive report published in 2020.\nTo follow up on the recommendations from the national inquiry, the Zimbabwe Human Rights Commission recently organised a stakeholder engagement meeting, where various groups acknowledged the progress made in improving access to national identity documents.\n“In our district, there is a huge improvement because as it is now easy to get birth and death certificates. As traditional leaders, we have been empowered to assist orphans and other children to acquire identity documents,” chief Makumbe said.\n“The registry office is now more open in assisting the deaf to access identity documents. We have partnered with the registry office to remove communication barrier between the deaf and authorities. The partnership is also making it possible for persons with disabilities to access vital information on the importance of identity documents,” Deaf Centre’s director, Blessing Chaipa-Nzveve said.\n“Before independence and even after independence, it was a privilege to access identity documents. We are happy that it is now a right enshrined in our national constitution.\n“Zimbabwe has made tremendous strides in promoting the issue of human rights and administrative justice.  We are glad that our government has implemented various reforms to improve the legal framework protecting individual rights and freedoms.”\n“The Inquiry highlighted challenges being faced by border communities, disaster-affected communities, persons with disabilities, the elderly, and minority groups among others,” Zimbabwe Human Rights Commission chairperson, Jessie Majome, said.\n“The inquiry emphasises the need for urgent and targeted measures to improve access to documentation by affected groups. The report requires us to take stalk of progress and challenges that are now few due to developments which have taken place in the country.”\nManicaland Minister of State for Provincial Affairs and Devolution, Advocate Misheck Mugadza outlined some of the measures taken to improve access to identity documents in Manicaland province.",
            "time": "18:27",
            "date": "22 Feb 2025"
        }
    ]
}