{
    "news": [
        {
            "title": "Govt launches fumigation blitz to combat Mbare bed bug crisis",
            "href": "https://www.zbcnews.co.zw/govt-launches-fumigation-blitz-to-combat-mbare-bed-bug-crisis/",
            "content": "Story by John Nhandara\nTHE government has launched a fumigation blitz in Harare’s Mbare suburb to get rid of bed bugs which have been reported in the high-density area.\nThe fumigation blitz is in response to the escalating bed bugs infestation mostly in residential flats such as Matererini.\n“We appreciate the efforts by all stakeholders because we are having a torrid time here in Mbare,” a resident said.\n“We are relieved that government has intervened, we hope this will be a continuous process until we get rid of bedbugs,” another added.\n“This is a milestone to address the pressing issue of bedbugs. We have witnessed concerted efforts from all stakeholders to eliminate bedbugs and achieve the desired results within the shortest possible time possible,” Deputy Minister of Information, Publicity and Broadcasting Services, Dr Omphile Marupi stated.\nApart from the fumigation blitz, plans are underway for the construction of new blocks of flats in Mbare and refurbishment of the old ones.\n“We must work together. Please cooperate with those fumigating your houses. We have been sent with the President to fumigate all the places here in Mbare. Government is aware of this challenge. We have a programme to build new blocks of flats and also refurbish all the 53 old blocks of flats,” the Minister of Local Government and Public Works, Honourable Daniel Garwe said.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "Stage set for the national cookout competitions",
            "href": "https://www.zbcnews.co.zw/stage-set-for-the-national-cookout-competitions/",
            "content": "Story by Tamuka Charakupa\nMASHONALAND West Cookout Competition came alive at Chinhoyi University of Technology (CUT) with the initiative being commended for promoting the country’s cultural heritage.\nAround 50 contestants, including tertiary students, people with disabilities and male chefs from across Mashonaland West Province battled it out for top honours at the well-attended event this Wednesday.\nEight winners from the four categories set to represent the province at the national competitions to be held in Manicaland on May 25.\n“I am so happy to win in the community category. The beauty of this programme is that it is inclusive. I am a widow but today I have won which means I have a chance to become a national champion at the national competitions in Mutare,” Community Category Winner, Mrs Nyarai Matsika said.\n“I am a 24-year-old man who is passionate about cooking particularly traditional dishes. I am here participating in a competition which is ordinarily dominated by female cooks. The decision to participate here is to remind my fellow men that we can redefine gender roles and also contribute and showcase our skills while promoting our local traditional dishes,” participant, Tafara Tete said.\n“I was raised by my grandparents and grew up eating traditional dishes. Today, I am operating my own kitchen where I am serving traditional dishes,” contestant, Francis Mujiche said.\nFollowing the success of the initiative since its launch in 2019, the government intends to cascade the programme to the constituency level.\n“We want to thank the Mother of the Nation Dr Auxillia Mnangagwa for introducing this noble initiative. It has opened doors to many who were feeling undermined/ underappreciated by their local dishes. Going forward we want to cascade this programme down to constituency level so that everyone is afforded an opportunity to participate,” the Director in the Office of the Minister of State for Mashonaland West Provincial Affairs and Devolution, Dr Tirivangani Matare said.\nThe Deputy Minister of Tourism and Hospitality Industry, Honourable Tongai Mnangagwa is upbeat in promoting the culinary industry feeds into the country’s domestic tourism agenda.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "Chiredzi South communities temporarily rehabilitate Chilonga Causeway",
            "href": "https://www.zbcnews.co.zw/chiredzi-south-communities-temporarily-rehabilitate-chilonga-causeway/",
            "content": "Story by Gay Matambo\nCOMMUNITIES in Chiredzi South constituency have joined hands with the government in the temporary rehabilitation of the Chilonga causeway, which was destroyed by heavy rains during last summer’s cropping season.\nThe damage to the key crossing point has significantly disrupted travel for residents in Chikombedzi, Mabhalauta, and Malipati, who are now forced to detour via Rutenga or Mupapa to reach Chiredzi town, adding at least 125 kilometres to their journeys.\nIn a demonstration of unity and self-reliance, local residents have come together to provide labour, resources, and logistical support to restore the causeway.\n“We decided as a community to mobilise building materials, rocks and many for the rehabilitation of our causeway. Some are cooking for the people who are working here, others have come in with transport to transport the material and others are sending through funds from wherever they are so that this programme is a success,” a community member said.\n“We decided to take part in this programme because the causeway is important to us. We have government officials, schoolchildren and farmers who need to constantly travel to Chiredzi town and back, so, without this causeway, life would be difficult,” a concerned resident.\n“We value this bridge, it makes life easy for us hence, as a community we are working with the government in repairing this structure. We are being driven by President Emmerson Mnangagwa’s mantra, “Nyika inovakwa nevene vayo, Ilizwe lakhiwa ngabanikazi balo,” a community member said.\nThe Chilonga causeway rehabilitation works are expected to be completed in the shortest possible time.\n“We commenced works here on March 31. We hope that in two weeks the causeway will be accessible. We are trying our best so that when government assistance comes at a later stage resources and manpower will be there already and nothing can stop work here. That is why you see that the community has gone all out,” the Chairperson of the Chilonga Causeway Restoration Programme, Mr Tiyani Chilonga said.\nThe local leadership cited the need for the construction of a high-rise bridge that links the constituency to Chiredzi town as four possible sites for another standard bridge have already been identified by the government.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "Hwange communities appeal for action as elephant destroys homestead",
            "href": "https://www.zbcnews.co.zw/hwange-communities-appeal-for-action-as-elephant-destroys-homestead/",
            "content": "Story by Terrence Soda\nA case of human-wildlife conflict has once again shaken Hwange District, where an elderly woman narrowly escaped harm after an elephant destroyed her kitchen hut in the early hours of Monday.\nGogo Ndlovu of Chidobe Village woke up to a scene of devastation after a rogue elephant invaded her homestead overnight, tearing down her kitchen structure while the family slept.\nThe incident highlights the increasing conflict between humans and wildlife in the area.\nElephants have become a menace in areas surrounding Victoria Falls and Hwange, destroying property and posing danger to humans in communities.\n”I am shocked at what happened here, we did not hear anything when the elephant destroyed the hut as we were all asleep at night, we were woken up by our neighbour who came in the morning who came to tell us about the elephant’s movement at night which left a trail of distraction,” Gogo Ndlovu said.\nLocal leaders and residents in the area have appealed to relevant authorities for an intervention.\n”We are facing a big problem in our district, as I speak there was another accident last night of an elephant which was hit by a car which has left us in shock. What happened to Gogo’s hut has shaken us as well, we appeal to the relevant authorities and government to assist us in the control of stray elephants which have caused us harm and destruction in our community,” Traditional leader, Headman Skinner Ndlovu said.\n“Our community is not safe anymore for our residents, there has been increased elephant movement in our area which is hindering people from doing their day-to-day work, we call upon relevant authorities and the government to consider culling some elephants,” Ward 2 Chidobe Councillor, Bonginkosi Moyo said.\nThe number of cases of wild animals roaming around residential areas has been on the increase.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "ZDF holds funeral parade for Air Vice Marshal (Retired) Winnie Mandeya",
            "href": "https://www.zbcnews.co.zw/zdf-holds-funeral-parade-for-air-vice-marshal-retired-winnie-mandeya/",
            "content": "Story by Peter Chivhima\nA funeral parade for the late Air Vice Marshal (Retired) Winnie Mandeya has been held at Manyame Air Force Base in Harare this Tuesday.\nAir Vice Marshal (Retired) Mandeya was the first woman Base Adjutant, the first woman to attend a Command Staff Course outside Zimbabwe, the first woman appointed as Director of Civil Military Relations, the first woman Deputy Commandant at the Zimbabwe Staff College, the first female Air Commodore and later Air Vice Marshal in the Air Force of Zimbabwe.\nPaying tribute to Air Vice Marshal (Retired) Mandeya at a funeral parade held at Manyame Air Force Base this Tuesday, Zimbabwe Defence Forces (ZDF) Commander General Philip Valerio Sibanda said the nation has lost a loyal and dedicated air officer.\n“At the age of 15, she abandoned her studies and joined other cadres to fight for the liberation of Zimbabwe. What is striking about this decision that she made was that she had not even attained that age of majority at that time. Despite this, she felt compelled enough to sacrifice her life for Zimbabwe to attain independence.  In addition, this decision defied the gender stereotype that only males could fight for their country.”\nGeneral Sibanda challenged members of the Zimbabwe Defence Forces to jealously guard the gains of the hard-won independence.\n“The next challenge ahead is to consolidate the gains of our hard-won Independence by attaining high development standards and levels as envisaged by the President and Commander in Chief of the Zimbabwe Defence Forces, Comrade Dr ED Mnangagwa.  To this end, we all have a responsibility to ensure that Zimbabwe attains an upper-middle income status, which will translate into the improvement of welfare of citizens and ourselves as members of the ZDF.”\nTo the family and friends, Air Vice Marshal (Retired) Mandeya was a unifier.\n“We have lost a family unifier and the void she left will be difficult to fill,” brother, Dr Eric Mandeya said.\nBorn on July 14, 1960, in Rusape, Air Vice Marshal (Retired) Mandeya joined the liberation struggle in 1975 at the age of 15 and survived the Nyadzonya bombings.\nAfter receiving military training in Nachingweya in 1976 in Tanzania, Air Vice Marshal (Retired) Mandeya was deployed to Gaza Province, Mozambique, where she served in the medical corps.\nWhile at Nyadzonya after the attack, Air Vice Marshal (Retired) Mandeya participated in the construction of the Barracks along Nyadzonia River.\nAt ceasefire, the late AFZ senior officer remained with other Comrades in Mozambique and only came back to a new Zimbabwe in 1980, along with the last group of patients.\nCde Cabby Rujekorwehondo, as she was known during her post-independence military career, was distinguished by a series of firsts.",
            "time": "08:45",
            "date": "01 May 2025"
        }
    ]
}