{
    "news": [
        {
            "title": "Tertiary institutions step up efforts against GBV and drug abuse with new campaign",
            "href": "https://www.zbcnews.co.zw/tertiary-institutions-step-up-efforts-against-gbv-and-drug-abuse-with-new-campaign/",
            "content": "Story by Tamuka Charakupa\nTHE government and its development partners are implementing the Safer Campuses Campaign aimed at raising awareness on drug and substance abuse, and gender-based violence in tertiary institutions.\nA recent survey conducted by the United Nations Educational, Scientific and Cultural Organisation (UNESCO) revealed that at least one out of three females in tertiary institutions has encountered either physical and sexual or verbal abuse from their male counterparts.\nAgainst this background, a Safer Campuses Campaign has been launched in Mashonaland West, with the Chinhoyi University of Technology and the Mupfure Industrial Training College pioneering the initiative.\nMupfure students held an awareness march in Chegutu this Friday, with a clarion call to shun drug and substance abuse taking centre stage.\n“As students, we are vulnerable to abuse not only by our fellow students but by surrounding communities who sell and distribute drugs to students,” a student said.\n“Lack of resources is driving female students to get involved in toxic relationships resulting with some having unwanted pregnancies, getting involved in drugs and most commonly encountering sexual and physical abuse,” another student said.\n“We are marching to send a message to the community that all forms of abuse should stop. We are also trying to enlighten our fellow age mates that drugs are not good for them,” a student stated.\nMupfure Industrial Training College academics are convinced the awareness campaigns are influencing positive community attitudes.",
            "time": "18:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "SADC RPTC graduates poised to strengthen regional peacekeeping efforts",
            "href": "https://www.zbcnews.co.zw/sadc-rptc-graduates-poised-to-strengthen-regional-peacekeeping-efforts/",
            "content": "Story by Elroi Ngara\nTHE role of the SADC Regional Peacekeeping Training Centre (RPTC) in promoting regional peace and integration efforts, took centre stage during a graduation ceremony held at the facility in Harare this Friday.\nOfficiating at the graduation ceremony for the SADC Civilian Foundation Course in Peace Support Operations at the regional peacekeeping centre in Marlborough, Harare, Zambia’s Deputy Ambassador to Zimbabwe Ms Nabulanga Ntalasha highlighted the facility’s critical role in achieving peace and regional integration agenda.\n“The role the Center plays is critical in realising the SADC agenda for peace and indeed regional integration. We have also been instrumental in helping our brothers and sisters beyond the region to resolve their issues and not let their situations degenerate into instability,” she said.\n“The Civilian Foundation cause was aimed at building capacities for the civilian component with the view to prepare for peace support operations. Ladies and gentlemen, I applaud the expert facilitation team for excellent presentations and mentorship, facilitating active discussions, the positive and careful preparations of presentations made for effective learning and participation for all.\n“I can safely conclude that the purpose of the Civilian Foundation cause has been completely accomplished. Once again, congratulations. Well done. Put the knowledge you have gained to good use.”\nParticipants concurred that the course has capacitated them to contribute to regional peace.\n“As you know, right now, our security system is quite fragile. We can see there’s violence in DRC, and in Mozambique, so peace support operations are very crucial. This course is going to capacitate us with the knowledge that we get posted to various missions across Africa and across SADC. We will be able to deliver on our mandate,” Zimbabwe’s graduand at the ceremony, Elvis George Hove said.",
            "time": "18:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Young project leaders honoured for driving Zim’s development",
            "href": "https://www.zbcnews.co.zw/young-project-leaders-honoured-for-driving-zims-development/",
            "content": "Story by Justin Mahlahla\nPROJECT managers under the age of 40 were honoured last night for their contributions to various sectors in Zimbabwe, recognising their role in shaping the future of project management.\nThe awards ceremony, organised by the Chartered Institute of Project Management Zimbabwe, celebrated 40 young leaders implementing transformative projects across the country.\nThe event, themed “Shaping the Future of Project Management,” highlighted the importance of innovation and leadership in driving national development.\nGuest of Honour, Skills Audit and Development Minister, Professor Paul Mavima, commended the initiative, noting its alignment with Zimbabwe’s Vision 2030 agenda, which aims to achieve upper-middle-income status by 2030.\n“This vision is anchored on the tenets of inclusivity, innovation, and sustainable development, underpinned by a whole-of-government approach that ensures no one and no place is left behind,” Minister Mavima said.\n“This year’s awards ceremony, themed “Shaping the Future of Project Management,” resonates deeply with Zimbabwe’s Vision 2030 thrust, which seeks to transform our country into an upper-middle-income economy society by the year 2030. This vision is anchored on the tenets of inclusivity, innovation, and sustainable development, underpinned by a whole-of-government approach that ensures no one and no place is left behind.\n“As we celebrate these young leaders, we are reminded that the future begins today. What will the future look like? What will Zimbabwe look like? The answer lies in the work we are celebrating here. It will look exactly as we build it—brick by brick, project by project. These 40 under 40 Young Project Leaders represent a generation of innovators, risk-takers, and trailblazers who are already making significant contributions to Zimbabwe’s growth and prosperity.\n“Their work aligns with our national aspirations, driving economic development, job creation, and sustainable growth. The projects they manage today will shape our communities, industries, and the nation for years to come. Our President. Dr Emmerson Dambudzo Mnangagwa, in his wisdom, established the Ministry of Skills Audit and Development, which I proudly lead, to spearhead human capital development in the country through a national skills audit, sectoral skills audits as well as rolling out of programmes across all sectors that promote skills development. This is being done with a focus on creating a workforce that is ready for the future.”\nProfessor Mavima said his ministry is engaging training institutions, public and private, to ensure that training curricula is aligned with industry needs so that Zimbabwe’s socio-economic development is accelerated.\nThe Minister challenged the young project leaders to innovate and apply their skills towards building a futuristic and prosperous Zimbabwe.\n“When I look at the young people in this room, I see skills that are pivotal to the building of a Dubai-like Zimbabwe, a Singapore-like Zimbabwe, a Zimbabwe that stands tall among other developed nations of the world. It is possible, all we need is a collective drive to harness our capabilities and roll out projects that reflect the Zimbabwe we want,” Minister Mavima said.\n“This ceremony is not merely about recognising outstanding achievements, it is about acknowledging the immense potential these young leaders hold for Zimbabwe. It is about honouring their ambition, tenacity, and vision for a brighter tomorrow. Their efforts are a testament to the power of youth and the transformative impact of effective project management,” he said.The Minister stated that the future of project management in Zimbabwe is in safe hands with the young leaders at the helm.",
            "time": "18:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Inmates showcase culinary skills in cook out competition",
            "href": "https://www.zbcnews.co.zw/inmates-showcase-culinary-skills-in-cook-out-competition/",
            "content": "Story by Courage Bushe\nINMATES from across the Midlands Province had a rare opportunity to showcase their culinary skills and engage in a cultural exchange during a traditional cookout competition held at Kwekwe Prison this Friday.\nThe cookout competition was oversubscribed as people jostled to witness the event which has gained traction across the country.\nThe competition saw 12 male and eight female inmates showcasing their culinary skills, to encourage the adoption of healthy and affordable traditional foods in prisons.\n“This is a good platform for us to learn and exchange notes. We are grateful to the Mother of the Nation for giving us this learning platform,” a prisoner said.\n“We will apply this knowledge when we leave this place because we now know how they can help us. We know about traditional foods that our forefathers used to eat and we are now taking this knowledge and applying it in our lives,” another added.\nGovernment says taking Amai Mnangagwa’s cooking competition to prisons is a positive step towards rehabilitating inmates and preparing them for reintegration into society.\n“The competition shows how Amai is committed to making sure that inmates are remembered and integrated into society.  This demonstrates the mantra of leaving no one and no place behind.  We believe that after this competition, inmates will gain culinary skills that will help them in their lives after incarceration,” Midlands Minister of State for Provincial Affairs and Devolution Honourable Owen Ncube said.",
            "time": "18:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "JSC swears in 12 new magistrates in push for efficient justice delivery",
            "href": "https://www.zbcnews.co.zw/jsc-swears-in-12-new-magistrates-in-push-for-efficient-justice-delivery/",
            "content": "Story by Fairstars Mukungurutse\nTHE Judicial Service Commission (JSC) has sworn in 12 new magistrates at the Harare Magistrates Court this Friday, amid calls for transparency and accountability in the delivery of justice.\nBriefing the media after presiding over the ceremony, Chief Magistrate Vongai Guwuriro underscored the crucial role of the new magistrates towards efficient justice delivery.\n“The Judicial Service Commission is on a deliberate strategic push to ensure that we continue decentralising and making sure that we have courts in so many districts around Zimbabwe. So they are coming to add to the magistrates that we already have and assist in the elimination of the case backlog. As of today, with their addition, we now have 253 magistrates who can sit in our courts and preside over cases.”\nThe chief magistrate also cautioned the newly-recruited magistrates against engaging in corrupt practices.",
            "time": "18:39",
            "date": "22 Mar 2025"
        }
    ]
}