{
    "news": [
        {
            "title": "ZIFA elections: Former footballers speak out",
            "href": "https://www.zbcnews.co.zw/zifa-elections-former-footballers-speak-out/",
            "content": "Story by Mthokozisi Dube\nFORMER Zimbabwe Football Association (ZIFA) vice president and seasoned administrator, Peter Dube, has set his sights on completing the task he left prematurely ten years ago.\nDube is one of the candidates vying for the ZIFA Vice Presidency.\nDube believes he has what it takes to contribute to the development of local football.\n“I was at ZIFA 10 years back, and you know what happened. Now is the time for us to complete the task we left. We want to improve the football ecosystem where everyone feels part of the journey to transform Zimbabwean football,” Dube said.\n“We are happy the secretariat has been put in place. We are not inventing anything new. Football has its governing statutes. What we need is to follow those principles and guidelines.\n“We are confident with the available secretariat, we can bring back the lost glamour in our game.”\nMeanwhile, former footballers have added their voice on the impending ZIFA polls.\nSouth Africa-based former Highlanders Defender, Alexander Maseko who has been at the forefront of assisting Zimbabwean teams on assignment across the Limpopo, and CAPS United legend, Stanford ‘Stix’ Mutizwa said football should be the winner after the ZIFA elections.\n“I have a message for the guys nominated for the ZIFA elections, they",
            "time": "18:27",
            "date": "04 Jan 2025"
        },
        {
            "title": "Trump to be sentenced over hush money case but judge signals no jail time",
            "href": "https://www.zbcnews.co.zw/trump-to-be-sentenced-over-hush-money-case-but-judge-signals-no-jail-time/",
            "content": "\nA judge has ordered that US President elect, Donald Trump, will be sentenced on January 10 in his hush-money case in New York, less than two weeks before he is set to be sworn in as president.\nNew York Justice Juan Merchan signalled he would not sentence Trump to jail time, probation or a fine, but instead give him an “unconditional discharge”, and wrote in his order that the president-elect could appear in person or virtually for the hearing.\nThe president-elect has posted on social media dismissing the judge’s order as an “illegitimate political attack” and calling the case “nothing but a rigged charade.”\nTrump was convicted in May of 34 felony counts of falsifying business records related to a $130,000 (£105,000) payment to adult-film star Stormy Daniels.\nThe charges related to attempts to cover up reimbursements to his ex-lawyer, Michael Cohen, who in the final days of the 2016 election campaign paid off the adult-film star to remain silent about an alleged sexual encounter with Trump.\nThe president-elect has denied all wrongdoing and pleaded not guilty, arguing the case was an attempt to harm his 2024 presidential campaign.\nIn the post on his Truth Social platform on Saturday Trump said the judge’s sentencing order “goes against our Constitution and, if allowed to stand, would be the end of the Presidency as we know it”.\nTrump’s spokesperson Steven Cheung earlier called the order part of a “witch hunt”.\n“President Trump must be allowed to continue the presidential transition process and to execute the vital duties of the presidency, unobstructed by the remains of this or any remnants of the witch hunts,” Cheung said.\n“There should be no sentencing, and President Trump will continue fighting against these hoaxes until they are all dead.”\nIn his latest motion against the case, Trump had argued the case would hang over him during his presidency and impede his ability to govern.\nJustice Merchan said he had been advised of several measures he could employ that could assuage Trump’s concerns about being distracted by a criminal case while serving as president that fell short of the “extreme remedy” of overturning the jury’s verdict.\nHis options included delaying the sentencing until Trump, 78, leaves the White House in 2029, or guaranteeing a sentence that would not involve prison time.\nTrump had initially, and unsuccessfully, argued the case against him ran afoul of a Supreme Court ruling on presidential immunity.",
            "time": "18:28",
            "date": "04 Jan 2025"
        },
        {
            "title": "Government maintains ban on Lake Chivero fishing",
            "href": "https://www.zbcnews.co.zw/government-maintains-ban-on-lake-chivero-fishing/",
            "content": "Story by Tendai Munengwa\nGovernment says the ban on fishing activities at Lake Chivero remains in force until conclusive investigations by the Ministry of Health and Child Care.\nThe development comes after the water and environmental poisoning incident that claimed wildlife and aqua life around the lake.\nResponding to questions during a media briefing at Munhumutapa Building in Harare this Thursday, the Minister of Environment, Climate and Wildlife, Dr Sithembiso Nyoni described the situation at Lake Chivero as dire and called for a wholistic approach to deal with pollution and ecological disturbances in the water body.\n“Going forward, we will rope in the Ministry of Health to do the finding because we want to save lives. The ban cannot be lifted now and a whole of government and stakeholders’ approach is required to reverse the situation at Chivero,” said the Minister.",
            "time": "18:28",
            "date": "04 Jan 2025"
        },
        {
            "title": "Parents in early preparations for schools opening",
            "href": "https://www.zbcnews.co.zw/parents-in-early-preparations-for-schools-opening/",
            "content": "Story by Fairstars Mukungurutse\nThe back to school rush has started with parents already preparing for the first term which gets underway on the 14th of this month.\nIt was a hive of activity in Harare’s central business district this Thursday as parents were buying the necessary school materials for the new academic year.\n“As you know, back to school is upon us, we have come to buy stationery and new uniforms for the children,” said a parent.\n“We did not lose heart when others were busy merry making because we knew back to school was coming so we had to make a budget for this,” said another parent.\n“As parents we should make life easier for our children by making sure they have everything they need for the term others we will be preparing for failure,” another parent said.\n“We are happy because all the school materials are available and we are buying at a reasonable price,” added another.",
            "time": "18:28",
            "date": "04 Jan 2025"
        },
        {
            "title": "Mat North undergoes massive transformation through infrastructure development",
            "href": "https://www.zbcnews.co.zw/mat-north-undergoes-massive-transformation-through-infrastructure-development/",
            "content": "Story by Tichaona Kurewa\nMatabeleland North Province has made significant strides in infrastructure development, with a range of new projects shaping its future.\nOn the energy front, the 42-kilometre Deka Water Pipeline to Hwange Unit 7 & 8 power plant was commissioned after being constructed at a cost of US$48.1 million.\nPlans are also underway to develop a green belt along the aqueduct from the Zambezi River.\nThe 60-kilowatt Bemba solar project in Tsholotsho District was also commissioned, while the ground-breaking ceremony for the Titan New Energy 720MW thermal power plant in Hwange marked a momentous milestone.\nThe Kamativi Mining Company’s first-phase lithium processing plant was completed in Hwange District.\nBravura Lithium Mine is assembling a new plant in the area, with mining operations expected to commence this year.\nThe successful turnaround of the Hwange Colliery Company has revitalised the province’s mining sector, confirming huge developments in the mining sector in 2024.\nThe Bubi-Lupane and Bulawayo Kraal Irrigation Schemes are bolstering the province’s food security efforts.\nFurthermore, four chiefs from Binga District received fishing rigs under the Presidential Fisheries Programme, complementing agricultural initiatives to enhance food security in the region.\nOn the tourism front, to capitalise on the growing demand for tourism in Victoria Falls, investors have injected over US$60 million in upgrading and expanding accommodation facilities, further enhancing the region’s appeal.\nIn the health sector, construction of the Lupane Provincial Hospital continues with significant progress having been recorded.\nSeveral clinics, including Leona Clinic in Hwange District, were commissioned to improve primary healthcare service provision.",
            "time": "18:28",
            "date": "04 Jan 2025"
        }
    ]
}