{
    "news": [
        {
            "title": "Jersey barriers installed to tame traffic chaos at Trabablas Interchange",
            "href": "https://www.zbcnews.co.zw/jersey-barriers-installed-to-tame-traffic-chaos-at-trabablas-interchange/",
            "content": "Story by Peter Chivhima\nHARARE- THE Government has moved to mount jersey barriers to curb reckless behaviour by commuter omnibus crews who were violating regulations at the Trabablas Interchange.\nThis development follows a recent exposé by ZBC News highlighting disorderly conduct by commuter operators at the interchange, posing significant danger to motorists and undermining the Government’s infrastructure development efforts.\nJust three days after the report aired, the Government responded decisively. On Saturday, ZBC News observed contractors on-site erecting the barriers as part of efforts to restore order and protect the integrity of the newly commissioned road network.\nMotorists and transport operators welcomed the intervention, citing visible improvements in traffic discipline and safety at the busy junction.\n“This is a step in the right direction meant to curb reckless driving here. It was too much, and we were now experiencing traffic jams because of these drivers, so we are happy that the government is putting these barriers,” a motorist, Tawanda Muza, said.\n“I want to thank our President, Cde Emmerson Mnangagwa, for transforming our nation. So installing these jersey barriers will go a long way in bringing order to this place,” Luckson Tachi said.\n“It was now all chaos here because commuter omnibus crews are doing what they want, so doing this will reduce cases of accidents and bring normalcy,” another motorist added.\nTransport operators themselves also endorsed stricter enforcement, calling for accountability and greater discipline within their ranks.\n“As operators, we are saying anyone who commits an offence or damages public infrastructure must be arrested without fear or favour. We also urge all operators to become organised and adhere to the law,” Mr Edmore Gwengwe said.",
            "time": "20:44",
            "date": "13 Jul 2025"
        },
        {
            "title": "VP Chiwenga commissions Gweru Catholic Pastoral Centre as six priests are ordained",
            "href": "https://www.zbcnews.co.zw/vp-chiwenga-commissions-gweru-catholic-pastoral-centre-as-six-priests-are-ordained/",
            "content": "Story by Tafara Chikumira, Midlands Bureau Chief\nGWERU – VICE President General Retired Dr Constantino Chiwenga, a devout member of the Roman Catholic Church, this Saturday commissioned the newly constructed Gweru Diocese Pastoral Centre, a multi-purpose facility designed to serve as a hub for spiritual and administrative activities within the diocese.\nThe ceremony, held in Gweru, was marked by both solemnity and celebration as six deacons were ordained into the priesthood under the stewardship of Bishop Rudolf Nyandoro, head of the Gweru Diocese.\nThe newly commissioned centre, described as a landmark achievement, is expected to play a pivotal role in the growth and coordination of Catholic Church activities in the Midlands Province.\nIn his keynote address, Vice President Chiwenga commended the project as a testament to visionary leadership and unwavering faith within the Gweru Diocese.\n“The Pastoral centre we inaugurate today is not merely a structure of bricks and mortar, it is a testament to foresight, leadership, and unwavering faith. This transformative project is a reflection of the dreams and dedication of its architect, His Lordship, the Right Reverend Bishop Sekuru Rudolf Nyandoro,” he said.\nHe recalled that the vision for the centre was first publicly shared during Bishop Nyandoro’s Silver Jubilee celebrations in Gweru last year, a vision that has now become a reality.\nThe highlight of the event was the ordination of six priests, each of whom had completed several years of theological and pastoral formation. The newly ordained include:\nReverend Kudzai Mabhena (Kwekwe)\nReverend Gerald Dube (Mberengwa)\nReverend Brian Kanyai (Gweru)\nReverend Reynold Machirori (Kwekwe)\nReverend Carlos Masiya (Kwekwe)\nReverend Calvin Mbenene\nOffering words of encouragement, Vice President Chiwenga described the priesthood as a noble and sacrificial vocation.\n“To our newly ordained priests, I extend my warmest and most heartfelt congratulations. You have embraced a calling that demands sacrifice, faith, and unwavering devotion. It is not an easy path, but it is one of eternal purpose and profound impact. May your hands bring healing to the broken, your words offer hope to the lost, and your hearts remain open to the will of God. You are now stewards of the sacred, walk boldly, humbly, and faithfully in that holy charge,” he said.\nBishop Raymond Mupandasekwa, who leads the Masvingo Diocese, also addressed the congregation, urging the new priests to carry out their duties with integrity and compassion.",
            "time": "20:44",
            "date": "13 Jul 2025"
        },
        {
            "title": "Mabvuku youths complete skills programme to fight unemployment, drug abuse",
            "href": "https://www.zbcnews.co.zw/mabvuku-youths-complete-skills-programme-to-fight-unemployment-drug-abuse/",
            "content": "Story by Peter Chivhima\nMABVUKU- A youth empowerment initiative has benefitted over 200  youths who graduated with certificates in various disciplines at the Pedzisai Sakupwanya Skills Development Trust in Mabvuku this Friday.\nThe skills training programme, aligned with the Second Republic’s development mantra of leaving no one and no place behind, is spearheaded by ZANU PF Mabvuku-Tafara legislator, Cde Pedzisai Sakupwanya, in support of the broader government agenda for youth empowerment.\nThe newly graduated youths received training in a range of trades, including motor mechanics, cosmetology, solar installation, carpentry, plumbing, and nurse aide training, equipping them with practical skills to either join the formal workforce or launch their own enterprises.\nAmong the proud graduates was Melissa Chiyangwa, who expressed appreciation for the life-changing opportunity.\n“I am so excited that today I am part of the people who are graduating. With the skills I have learnt, it means I am now someone who can do her things,” she said.\nMr Munyaradzi Usavi, who trained in Diesel and Plant Fitting, highlighted how the programme has positively impacted his focus and discipline.\n“This means that I will now spend most of my time doing my work as compared to before, when I used to spend time roaming around. It also reduces cases of drug and substance abuse,” he said.\nMr Simon Jengwa, Head of the Ministry of Youth Empowerment, Development and Vocational Training in Harare Metropolitan Province, commended the initiative.\n“This means that we have empowered these youths, so we want to thank the Second Republic under President Emmerson Mnangagwa for empowering youths. So if they are empowered, it means they are now self-reliant, a development which will drive them away from committing crimes,” he said.",
            "time": "20:44",
            "date": "13 Jul 2025"
        },
        {
            "title": "Presidential Youth Empowerment Scheme delivers equipment to Mash West",
            "href": "https://www.zbcnews.co.zw/presidential-youth-empowerment-scheme-delivers-equipment-to-mash-west/",
            "content": "Story by Tamuka Charakupa\nZANU PF Youth League in Mashonaland West has received capital equipment sourced under the Presidential Youth Empowerment Scheme, earmarked to complement youth-led business ventures and projects this Friday.\nThe equipment, sourced under the US$2 million youth empowerment fund, is earmarked to enhance youth-led enterprises and community-driven development initiatives across the province.\nThe gesture comes in line with the Second Republic’s push to empower young people and integrate them meaningfully into the country’s socio-economic development agenda.\nReceiving the equipment, youthful members of the ZANU PF Youth League expressed both appreciation and optimism about their future.\nToday we are glad as Mashonaland West youth for what our President has done for us. These machines are evidence that his promises are being fulfilled, and our lives are set to improve significantly. Even the rate of drug abuse among young people will decline,” said Stembeni Madzima.Josam Chingeni also commended the move, highlighting its symbolic significance.\n“I am very happy, the President delivered on what he had promised. The President has given us these important pieces of equipment, which we will put to good use. When the land reform was done, we were too young, but at the moment, we believe we are going to be entitled to our own land as youths. This is a sign that His Excellency has the youths at heart,” he said.\nZANU PF Mashonaland West Youth League Chairperson, Cde Tapiwa Masenda, said the equipment will serve as the foundation for youth-led enterprises underpinned by President Mnangagwa’s broader empowerment vision.\n“The President launched the Munhumutapa Youth Housing and Land Schemes, and today we have officially received our fair share of the equipment. Going forward, we want to form a logistics company to put this equipment to good use, and the funds generated will support our other projects,” he said.\nOfficially handing over the equipment, ZANU PF Spokesperson Ambassador Chris Mutsvangwa underscored the ruling party’s unwavering commitment to youth development.\n“We are a party that prioritises young people, recognising that without practical initiatives, they cannot progress. These tools are the fishing rods, it is now upon the youth to take charge of their empowerment journey. This will also help reduce the scourge of drug and substance abuse,” he said.",
            "time": "20:44",
            "date": "13 Jul 2025"
        },
        {
            "title": "JSC takes electronic case system to Masvingo",
            "href": "https://www.zbcnews.co.zw/jsc-takes-electronic-case-system-to-masvingo/",
            "content": "\nStory by Mercy Matinha\nTHE Judicial Service Commission is currently engaging its stakeholders in Masvingo province as it continues to implement the fourth phase of the Integrated Electronic Case Management System (IECMS) within Magistrates’ Courts.\nFollowing the successful rollout of the system in Mashonaland Central and Matabeleland North, the JSC is now expanding the digitalisation programme to Masvingo and Matabeleland South Provinces as it accelerates efforts to modernise court operations.\nMasvingo stakeholders gathered this Friday for an awareness session, aimed at promoting understanding and acceptance of the IECMS within the legal and broader community.\nMasvingo Provincial Magistrate, Ms Caroline Nyoni, welcomed the digital transformation, noting its benefits for litigants and court staff.\n“The new system is quite efficient as it helps our litigants to file their court papers in the comfort of their homes or at any place where they can access the internet. It also helps in improving efficiency through the filing of cases online, tracking of cases and virtual hearings.”\nTraditional leaders in the province also expressed support for the initiative, highlighting its potential to improve access to justice in rural communities.\n“We are happy that our courts are now going to be digital, it shows that as a country we are also adopting new technologies, hence it is going to be easier for many who had to travel long distances for court hearings, Case filing and payments,” Chief Murinye said.\n“The programme is quite commendable and we encourage stakeholders to adopt it, however, we appeal for more awareness programmes so that communities, including those who are illiterate, will be able to access the digital court system for justice to be served,” Chief Musara added.\nJSC Secretary, Mr Walter Chikwana said the goal is to ensure improved efficiency in all the courts through the use of technology, hence the implementation of IECMS.\n“As you are aware, since May 2022, as the JSC we started rolling out the IECMS programme, and now we are focusing on digitising our Magistrates’ courts. We rolled out the programme in July and started with Mashonaland Central and Matabeleland North now, we are focusing on Masvingo and Matabeleland South.\n“This week we have been engaging our stakeholders in Gutu, Bikita, Zaka, Chiredzi, and now we are in Masvingo, conscientising our staff and other stakeholders that IECMS is coming, hence they have to embrace it and ensure it improves efficiency within our courts.\n“This programme will see our Magistrates’ Courts going paperless, hence adopting new technology in our courts. Here in Masvingo, we expect the programme to be rolled out by October in all the Magistrates’ Courts.",
            "time": "20:44",
            "date": "13 Jul 2025"
        }
    ]
}