{
    "news": [
        {
            "title": "Govt forges ahead with the implementation of people-centred development programmes",
            "href": "https://www.zbcnews.co.zw/govt-forges-ahead-with-the-implementation-of-people-centred-development-programmes/",
            "content": "Failed to fetch the page at https://www.zbcnews.co.zw/govt-forges-ahead-with-the-implementation-of-people-centred-development-programmes/. Status code: 403",
            "time": "09:27",
            "date": "01 Feb 2025"
        },
        {
            "title": "Tragedy strikes in Harare’s Adelaide Park as young boy (11) drowns in abandoned pit",
            "href": "https://www.zbcnews.co.zw/tragedy-strikes-in-harares-adelaide-park-as-young-boy-11-drowns-in-abandoned-pit/",
            "content": "Failed to fetch the page at https://www.zbcnews.co.zw/tragedy-strikes-in-harares-adelaide-park-as-young-boy-11-drowns-in-abandoned-pit/. Status code: 403",
            "time": "09:27",
            "date": "01 Feb 2025"
        },
        {
            "title": "Mutare farmer reaps huge from snail production",
            "href": "https://www.zbcnews.co.zw/mutare-farmer-reaps-huge-from-snail-production/",
            "content": "Failed to fetch the page at https://www.zbcnews.co.zw/mutare-farmer-reaps-huge-from-snail-production/. Status code: 403",
            "time": "09:27",
            "date": "01 Feb 2025"
        },
        {
            "title": "11-year-old Ugandan pan-Africanist’s adventure continues in Vic Falls",
            "href": "https://www.zbcnews.co.zw/11-year-old-ugandan-pan-africanists-adventure-continues-in-vic-falls/",
            "content": "Failed to fetch the page at https://www.zbcnews.co.zw/11-year-old-ugandan-pan-africanists-adventure-continues-in-vic-falls/. Status code: 403",
            "time": "09:27",
            "date": "01 Feb 2025"
        },
        {
            "title": "EU diplomats partner government in fighting GBV",
            "href": "https://www.zbcnews.co.zw/eu-diplomats-partner-government-in-fighting-gbv/",
            "content": "Story by Theophilus Chuma\nThe European Union has mobilised a US$300 million funding to boost current efforts to end gender-based violence (GBV) in Zimbabwe.\nA bold messages clearly denouncing a vice that is tearing through the social fabric became the common position for over 100 men and women who embarked on an awareness campaign against gender-based violence in Harare this Wednesday.\nThe HeforShe march, meant to champion gender equality and women rights, is one of the interventions being implemented by global partners to curb the menace of domestic violence.\nOn the sidelines of the solidarity march, the European Union stated it has mobilised funds to support government programmes to ending GBV.\n“We are working with the government to ensure that gender based violence issues are effectively addressed. This is why we have come up with a funding model to the tune of US$300 million which will be used to support GBV awareness programmes in Zimbabwe,” said European Union Ambassador, Jobst von Kirchmann.\nGovernment has implemented various strategies to ending gender-based violence, including stringent legislation such as the Marriage Act of 2022 which outlawed the exploitation of children through early marriages.\n“Ending gender-based violence is top priority for government. We continue to work in communities to raise awareness against domestic violence while also amplifying that cases are reported through one stop centres,” said the Minister of Women Affairs, Community, Small and Medium Enterprises Development, Senator Monica Mutsvangwa.",
            "time": "09:27",
            "date": "01 Feb 2025"
        }
    ]
}