{
    "news": [
        {
            "title": "Government and private players intensify fight against GBV",
            "href": "https://www.zbcnews.co.zw/government-and-private-players-intensify-fight-against-gbv/",
            "content": "Story by Courage Bushe\n\nThe private sector has been called upon to foster safer and more inclusive workplaces in bid to combat gender-based violence (GBV).\n\nAs gender-based violence continues to plague communities worldwide, survivors, activists, policy makers, and implementers in the Midlands Province have called for urgent and collaborative action to address the scourge.\n\n“We are happy that we got an opportunity to learn and give solutions to old ways that promote gbv in our communities. This is a good initiative, and we are happy with this initiative,” a community member said.\n\nAnother said, “Let’s not mock survivors. Let’s believe in them. If we believe in them, then we will adopt comprehensive and inclusive approaches that tackle root causes.”\n\nMidlands Minister of State for Provincial Affairs and Devolution, Honourable Owen Ncube highlighted steps being taken by the government to address the worrisome trajectory trend.\n"
        },
        {
            "title": "Binga Chiefs receive fishing rigs",
            "href": "https://www.zbcnews.co.zw/binga-chiefs-receive-fishing-rigs/",
            "content": "Story by Mhlomuli Ncube\n\nTraditional leaders in Binga have received fishing rigs under a Presidential scheme which has also benefitted women and youths in the district.\n\nEmpowering communities is a key priority in the Second Republic. In Binga, where the Zambezi River is a critical source of livelihoods, government has been supporting communities who survive on fishing by availing fishing rigs.\n\nBeneficiaries told the ZBC News, “We want to thank government for continuing to enable empowerment in Binga. This is an important initiative for us here who have always been fishing for a living. We recognise the importance attached by government and our President to empowering Binga people.”\n\nThe capacitation of communities is an important part of government’s drive towards an upper middle-income economy by 2030.\n\nMatabeleland North Minister of State for Provincial Affairs and Devolution, Hon Richard Moyo said, “This is a timely intervention by the 2nd Republic under the able leadership of His Excellency, the President E.D. Mnangagwa meant to improve household income levels and general livelihoods for economic benefit.”\n\n“We are seeing a critical drive to empower young people also. This is exactly how our President wants economic empowerment to be,” said the Minister of Youth Empowerment, Development and Vocational Training, Hon Tino Machakaire.\n"
        },
        {
            "title": "Gender Based Violence Response Fund launched",
            "href": "https://www.zbcnews.co.zw/gender-based-violence-response-fund-launched/",
            "content": "Story by Memory Chamisa\n\nAdequate funding has been noted as critical for an effective aid response to prevent and address the impact of violence and discrimination against women and girls.\n\nDevelopment Partners have played a pivotal role in ensuring the Gender Based Violence (GBV) Response Fund is able to provide much needed support for communities greatly affected while also serving as one of the largest donors and active partners in ensuring the protection of beneficiaries.\n\nThis emerged at the GBV roundtable meeting held in Harare aimed at addressing the urgent issue of gender base violence-response funding.\n\nFrench Ambassador to Zimbabwe, His Excellency Paul Bertrand-Barets said, “The committed resources will ensure that identified gaps are adequately addressed and ensuring the continued work of community-based organisations. Together, the GBVF Response Fund and Team EU aim to enhance prevention, protection, and support mechanisms for those affected by GBVF.”\n\nA UNFPA representative also noted, “The UNFPA together with its agencies are committed to combatting GBV and fostering safer, more resilient communities. By working together, we strive to create lasting change and empower survivors while addressing the root causes of GBV.”\n\nMinister of Women Affairs, Community, Small and Medium Enterprises Development, Senator Monica Mutsvangwa acknowledged the support of development partners as instrumental in enabling the fund to offer crucial assistance to communities impacted by GBV.\n\n“Sustainable funding solutions are therefore critical, equipping these institutions with the necessary resources to provide high-quality support to survivors. The needs of those institutions range from stationery, food provisions, hospital equipment and supplies, operational costs, allowances and salaries for GBV specialized services (counselling and legal aid) dedicated staff to provide administrative and security duties as well as continuous training of staff. There is also need for income-generating projects at the safe shelters and infrastructure maintenance and development where new institutions need to be set up. We cannot sit on our laps but rather dream big to consider even setting up more institutions to cover all provinces and districts of the country considering that the available institutions are not able to meet the growing demand while at the same time, they have to be within reach of those in need,” she said.\n"
        },
        {
            "title": "2025 SADC Live Your Dream Tour announced",
            "href": "https://www.zbcnews.co.zw/2025-sadc-live-your-dream-tour-announced/",
            "content": "Story by Memory Chamisa\n\nGovernment together with organisers has announced plans for the 2025 SADC Live Your Dream Road Tour.\n\nIn celebration of Zimbabwe’s SADC chairmanship, the initiative brings together art, culture, tourism and adventure across 16 SADC countries.\n\nAnnouncing the tour this Friday, the Permanent Secretary in the Ministry of Information, Publicity and Broadcasting Services, Mr Nick Mangwana highlighted its significance in marketing SADC state countries’ tourist sites.\n\n“This is an exciting time and opportunity for SADC countries and we look forward to having everyone interested on board. And this concept coming from Zimbabwe shows the zeal and tenacity of our citizens in marketing not only Zimbabwe but Africa as well,” he said.\n\nDirector in the Ministry of Tourism and hospitality Industry, Mrs Sherry Sibanda revealed the concept will not only benefit Zimbabwe, but SADC as a destination of choice.\n\n“As the Ministry of Tourism, we are excited to be part of this initiative and as you know this festive season we’re doing the meet and greet welcoming visitors and our kin back home as well as putting out there places they can enjoy and visit with their loved ones,” she said.\n\nThe organisers of the Tour gave an insight of the initiative.\n\nMr Munyaradzi Musonda, the chairperson SADC Live Your Dream said, “This is a celebration\nof Zimbabwe assuming the SADC chairmanship and we thought of why not highlight some of the tourist attractions that Zimbabwe and SADC countries have to offer.”\n"
        },
        {
            "title": "252 young women graduate Vumba Youth Service Training Centre",
            "href": "https://www.zbcnews.co.zw/252-young-women-graduate-vumba-youth-service-training-centre/",
            "content": "Story by Oliver Karuru\n\nGovernment has reaffirmed its commitment to empowering women with relevant skills to ensure they meaningfully participate in national development.\n\nA graduation ceremony held at the Vumba Youth Service Training Centre in Manicaland Province this Friday saw more than 250 young women graduate after completing a six-month rigorous training programme.\n\nThe group, which becomes the second to graduate and the first all-female intake, was challenged to make a difference in society while being reassured of government’s commitment to empower them.\n\nSenator Monica Mutsvangwa, Minister of Women Affairs, Community, Small to Medium Enterprises Development said, “As Minister of Women Affairs, Community, Small and Medium Enterprises Development, I’m delighted that this cohort of 252 female trainees has achieved this remarkable feat. The empowerment of women is critical to sustainable development, and this group will undoubtedly have been equipped with essential tools to successfully reintegrate into society as useful players in their various chosen fields of competence. My ministry pledges to support these ladies with further trainings and capacitation.”\n\nYouth Empowerment, Development and Vocational Training Minister Honourable Tino Machakaire spoke about employment opportunities available for graduates of the Youth Service Training, while Manicaland Minister of State for Provincial Affairs and Devolution Advocate Misheck Mugadza implored the graduates to be exemplary citizens.\n\nSaid Hon Machakaire, “We will engage government departments including the police, army and other civil service departments to offer priority to these young graduates. We also need to make sure we engage even the private sector. Starting from next year, we are going to open more youth service training centres in Mashonaland East, Mat South and other places.”\n"
        },
        {
            "title": "Wildlife, livestock die from water contamination at Lake Chivero park",
            "href": "https://www.zbcnews.co.zw/wildlife-livestock-die-from-water-contamination-at-lake-chivero-park/",
            "content": "Story by Memory Chamisa\n\nRhinos have succumbed to contamination from cyanobacteria in the water sources at Lake Chivero Recreational Park.\n\nThree zebras, four wildebeests, four fish eagles as well as goats and cattle from nearby farms died from the contamination.\n\nZimbabwe Parks and Wildlife Management Authority spokesperson, Mr Tinashe Farawo confirmed the loss of wildlife.\n\n“Four rhinos have died due to contamination from cyanobacteria in the water sources at Lake Chivero Recreational Park. Despite the interventions by veterinarians from the University of Zimbabwe and our Vet department, the contamination has also impacted other wildlife in the area resulting in the loss of three zebras, four wildebeests, four fish eagles, as well as goats and cattle from nearby farms. To mitigate the risk, we implemented measures to deter the animals from drinking from the affected dam by placing salt blocks and game nuts around the park, as well as distributing water drops. Regrettably, these efforts proved to not be enough, as the animals continued to drink from the lake,” he said.\n\nMr Farawo called for collective responsibility to protect and preserve wildlife by addressing threats to their populations and habitat loss.\n\n“Rhinos symbolise strength and resilience, but they face unprecedented threats that require immediate and sustained action. As a country, we are committed to sustainably manage the species. Zimbabwe boasts the fourth-largest black rhino population globally, after South Africa, Namibia and Kenya.”\n"
        },
        {
            "title": "Funeral parade held for Group Captain Jeke",
            "href": "https://www.zbcnews.co.zw/funeral-parade-held-for-group-captain-jeke/",
            "content": "Story by Peter Chivhima\n\nA funeral parade for Group Captain Patrick Jeke who died in Harare this Thursday has been held at Manyame Air Force Base.\n\nIt was a sombre atmosphere at Manyame Air Force Base as friends and family gathered at the Parade Square to bid farewell to one of their own, the late Group Captain Patrick Jeke who succumbed to long illness at a local hospital this Thursday.\n\nChief mourner, Air Force of Zimbabwe (AFZ) Chief of Staff Operations Air Vice Marshal Biltim Chingono said the AFZ and the entire ZDF has lost a dedicated officer.\n\nColleague and family spokesperson Group Captain Pius Ndou said Group Captain Jeke has left a void which will be difficult to fill.\n"
        },
        {
            "title": "Tropical Cyclone Chido: Government on high alert",
            "href": "https://www.zbcnews.co.zw/tropical-cyclone-chido-government-on-high-alert/",
            "content": "Story by Tendai Munengwa\n\nGovernment has activated national risk and disaster management systems after an advisory of Tropical Cyclone Chido which is expected to affect the country from the 17th of this month.\n\nAccording to The Meteorological Services Department, chances of the predicted tropical cyclone to reach Zimbabwe are projected at 80 percent, hence the need for all relevant authorities to be on high alert.\n\n“The Tropical Cyclone Chido will first land in Madagascar then expected to arrive in Mozambique before it finally affects Zimbabwe on the 17th of December. We are still on a watch mode and monitoring its magnitude on the SADC Humanitarian Disaster Centre. The likelihood that we might have 60-70 milliliters of rain if Cyclone Chido hits Zimbabwe, the chances of flush floods will be high,” said senior meteorologist, James Ngoma.\n"
        },
        {
            "title": "Thousands receive food aid in Chivi district",
            "href": "https://www.zbcnews.co.zw/thousands-receive-food-aid-in-chivi-district/",
            "content": "Story by Mercy Bofu-Matinha\n\nGovernment and its partners continue to ensure communities are food secure in the face of the elnino-induced drought, with the people of Chivi benefitting from the launch of the Lean Assistance Programme in the district.\n\n\nMore than 123 000 villagers started receiving food aid this Thursday through collaborative efforts between the government of Zimbabwe, World Food Programme and the government of Russia.\n\nVillagers say the programme, which will run for the next three months, will cushion them against the effects of current El-Nino-induced drought.\n\n“We are happy that our government and its partners continue to support us through food aid. This area is in Region 5 and many times we are food insecure, but this season was worse due to the El-Nino season experienced last year. The donation we received will cushion us and our children for the next months,” a villager.\n\nAnother said, “Today we received cereals, oils and pulses and these will go a long way in ensuring a balanced diet for us and our children. The government is doing its best in ensuring food security for us and our livestock and we appreciate the support including sinking boreholes for clean and safe water.”\n\nThe Russian government which donated oils and pulses worth US$2 million pledged to continue supporting Zimbabwe in ensuring food security.\n\nRussia Ambassador to Zimbabwe, Mr Nikolai Krasilnikov NOTED, “Today we are handing over to Zimbabwe another humanitarian supply coming from Russia. It consists of 559 tonnes of nutritious pulses and 164 tonnes of cooking oil enriched with Vitamins A and D. This donation by the Russian Federation amounts to 2 million USD. This is a part of my country’s contribution to the United Nations World Food Programme. Its purpose is to assist the most vulnerable communities affected by El Niño-induced drought – the worst in four decades that hit the sub-region of South East Africa. We are well aware of the successful efforts that the Government of Zimbabwe has been taking to build up resilience of agriculture the main sector of the country’s economy. At the same time, it is clear that the aftermath of a natural disaster of such a magnitude can be overcome only by urgent and collective actions at all levels – including the UN bodies, national governments and ordinary farmers.”\n\nBarbara Clemens, World Food Programme Country Director also spoke about the WFP’s programmes.\n\n“Between now and March 2025, WFP, aims to assist close to 1 million people across the country with food assistance. This demonstrates our shared commitment to addressing immediate needs while laying the groundwork for recovery and resilience. As we respond to this challenge, we must also look to the future. To protect people against future shocks we need to strengthen resilience at all levels. This includes investing in climate-smart agriculture, scaling up social protection systems and climate risk insurance, and empowering communities to build sustainable livelihoods.”\n\nThe government of Zimbabwe thanked its partners for the support, reiterating that no one will die of hunger.\n\nHonourable Ezra Chadzamira, Masvingo Minister of State for Provincial Affairs and Devolution said, “The Declaration of State of National Disaster for the 2023/24 agriculture season by President Emmerson Mnangagwa triggered the United Nations family, the donor community, private sector and individuals to complement Government efforts with diverse resources. I am glad that the Russian Federation heeded the call and responded by providing vegetable oil and pulses complementing Government which is providing cereals while WFP is providing associated costs for the twinning. This programme will go a long way in helping our populace which was negatively affected by drought.”\nThe gesture was hailed by the Deputy Minister of Local Government and Public Works, Engineer Benjamin Kabikira.\n\n“The Government of Zimbabwe is a shining example of how global solidarity can address some of the most pressing challenges of our time. Russia’s consistent support demonstrates a deep understanding of the importance of international cooperation in the face of global challenges. Their commitment to humanitarian aid is not only commendable but essential in our shared mission to alleviate hunger and malnutrition in Zimbabwe,” he said."
        },
        {
            "title": "ZBC receives vehicles, equipment towards recapitalisation",
            "href": "https://www.zbcnews.co.zw/zbc-receives-vehicles-equipment-towards-recapitalisation/",
            "content": "Story by Oleen Ndori\n\nAs part of the recapitalisation drive by Government, the Zimbabwe Broadcasting Corporation has received a consignment of vehicles and equipment sourced from the Ministry of Finance, Economic Development and Investment Promotion, Ministry of Information, Publicity and Broadcasting Services and a private partner to enhance operations at the national broadcaster.\n"
        }
    ]
}