{
    "news": [
        {
            "title": "Urban farmers hopeful of securing food surplus this season",
            "href": "https://www.zbcnews.co.zw/urban-farmers-hopeful-of-securing-food-surplus-this-season/",
            "content": "Story by Fairstars Mukungurutse\nUrban farmers in Harare are optimistic of recording a good harvest following the heavy rains currently being received across the country.\nSlowly evolving into a vibrant urban agriculture ecosystem, nearly every household in Harare has its own small plot or back yard garden where a variety of crops are grown for consumption and profit.\nWhile most crops had suffered severe moisture stress following a prolonged dry spell characterized by high temperatures, the rainfall currently being received across the country has brought some relief to farmers as most crops have been rejuvenated.“We are happy the rains are back, we had lost hope of getting something because the heat wave was too much. Now we are expecting a bumper harvest,” said a farmer who spoke to the ZBC News.",
            "time": "06:36",
            "date": "19 Jan 2025"
        },
        {
            "title": "ZPCS in climate change mitigation measures",
            "href": "https://www.zbcnews.co.zw/zpcs-in-climate-change-mitigation-measures/",
            "content": "Story by Tafara Chikumira\nThe Zimbabwe Prisons and Correctional Service (ZPCS) in the Midlands province has come up with a cocktail of measures earmarked to mitigate the devastating effects of climate change.\nThe new measures have seen prison officers and inmates engaging stakeholders to make a number of activities aimed at preserving the environment.\nPart of the activities include continuous plantation of trees and finding alternative sources of energy.Speaking to the ZBC News, ZPCS Officer Commanding Midlands Province, Commissioner Somemore Gate said, “We have made deliberate efforts to ensure that all the students we enroll at our Whawha Primary School to plant trees so that when they reach Grade 7 they will see their trees grow. At the moment, we are seized with the issue of establishing biogas plants at our prisons to ensure that our prisoners get clean energy in their cooking activities.”",
            "time": "06:36",
            "date": "19 Jan 2025"
        },
        {
            "title": "Mash West benefits from agric digitisation programme",
            "href": "https://www.zbcnews.co.zw/mash-west-benefits-from-agric-digitisation-programme/",
            "content": "Story by Tamuka Charakupa\nGovernment has distributed over 700 mobile digital gadgets to agriculture extension officers from across Mashonaland West Province this Friday, cementing the centrality of digitisation to all economic activities.\nThe move is expected to enhance data collection, storage and communication systems.\n“Our daily duties involve data collection and processing so the coming on board of mobile gadgets will enhance our operations,” said an Agritex officer.“Manual data entry is tiresome and is associated with many risks especially now during the rainy season. Sometimes papers get lost, burnt or get soaked with rain so this is a welcome development,” said another Agritex officer.\n“We needed to communicate in real time with our colleagues and supervisors so that we will be able to advise farmers accordingly. We are delighted that this programme is leaving no one and no place behind,” another added.\nThe Deputy Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Honourable Vangelis Haritatos presided over the ceremony where he spelt out the advantages of using the gadgets.“Over 6 thousand gadgets are set to be distributed countrywide. So far we have distributed to other province except for the Midlands Province. As government we remain committed towards transforming the agricultural sector and we believe the capacitation of extension workers will go a long way in ensuring that farmers benefit from timely, well researched information informed by enhanced communication channels between the ministry and its ground forces,” said Minister Haritatos.",
            "time": "06:36",
            "date": "19 Jan 2025"
        },
        {
            "title": "Rains revive farmers’ hopes in Hwange",
            "href": "https://www.zbcnews.co.zw/rains-revive-farmers-hopes-in-hwange/",
            "content": "Story by Mhlomuli Ncube\nThe recent wet spell experienced across the country has brought hope of food security to communal farmers in Hwange District, most of whom are into cropping, livestock and fish farming.\nAt a time when major water bodies like Kalope dam and others had completely dried up, the now overflowing dams have become a lifeline to the communal agriculture economy.\nThe farmers are excited as they project a positive outlook.\n“Since the 28th of December, we have had rains that have completely changed the state of our crops,” said a farmer.\n“I planted maize and I am happy that it is doing well. This is good for our projects” another farmer added.\n“We got a lot of water even for Irrigation with our dam now full. We have no doubt that we are going to have a good harvest,” noted another farmer.",
            "time": "06:36",
            "date": "19 Jan 2025"
        },
        {
            "title": "Justice delivery expected to improve as 15 magistrates are sworn in",
            "href": "https://www.zbcnews.co.zw/justice-delivery-expected-to-improve-as-15-magistrates-are-sworn-in/",
            "content": "Story by Fungai Jachi\nFifteen magistrates have been sworn in at the Harare Magistrates Court, in a move expected to improve the justice delivery system.\nPresiding over the swearing-in ceremony, Chief Magistrate Mrs Vongai Guwuriro said the development will ease the workload at a time when the Judicial Service Commission (JSC) is expanding its operations countrywide.\n“A number of new courts have been constructed around the country and we have to have more magistrates so that cases are not delayed. The more we have means that justice will be delivered timeously,” said Mrs Guwuriro.\nShe also indicated that the introduction of Fast Track Courts will reduce witness fatigue.\n“Fast track courts that will be introduced at all court houses are going to be a game-changer because cases won’t take long to be heard. If all the parties are there, the cases will be heard instantly and this will reduce backlogs,” she said.",
            "time": "06:36",
            "date": "19 Jan 2025"
        }
    ]
}