{
    "news": [
        {
            "title": "Major General (Retired) Solomon Siziba dies",
            "href": "https://www.zbcnews.co.zw/major-general-retired-solomon-siziba-dies/",
            "content": "\nStory by ZBC Reporter\nZimbabwe National Army Major General (Retired) Solomon Siziba died this morning at Josiah Magama Tongogara Barracks Camp Hospital in Harare, the Army Public Relations department has announced.\nHe was 67.\nIn a statement, the Deputy Director Army Public Relations, Tichafa Mungofa said Major General (Retired) Siziba died after a long battle with cancer.",
            "time": "20:37",
            "date": "15 Jan 2025"
        },
        {
            "title": "Shurugwi shopping complex almost complete",
            "href": "https://www.zbcnews.co.zw/shurugwi-shopping-complex-almost-complete/",
            "content": "Story by Tafara Chikumira, Midlands Bureau Chief\nSHURUGWI’s biggest shopping mall is almost complete and contractors are confident the complex will open its doors to the public before the end of the first quarter of the year.\nThe shopping mall, which is being constructed at a cost of US$8 million, is in line with the Second Republic’s urban renewal and smart city concept.\nThe Shurugwi Town Council says the shopping mall is in line with the town’s expansion drive as the country gravitates towards Vision 2030.\n“As a council, our target is to reach a municipality status by 2030. We see the partnership with MIPF being a step in the right direction as we intend to attain our target.\n“Some of the major aspects to be considered for a full municipality status are issues to do with infrastructure and we intend to have more of such facilities. The issue of revenue collection is set to increase with business at this centre,” councillor Fanuel Machiya said.\nThe Shurugwi community is equally excited about the prospects that lie ahead.\nThe government commended development projects in the mining town of Shurugwi saying they dovetail with the government’s industrialisation and re-industrialisation efforts.",
            "time": "20:37",
            "date": "15 Jan 2025"
        },
        {
            "title": "Construction of Vic Falls multi-purpose cricket stadium on course",
            "href": "https://www.zbcnews.co.zw/construction-of-vic-falls-multi-purpose-cricket-stadium-on-course/",
            "content": "Story by Tichaona Kurewa\nConstruction of the multi-purpose Mosi-oa-Tunya International Cricket Stadium in Victoria Falls is progressing well, with significant ground having been covered in terms of earthworks and pitch development.\nThe facility is a cornerstone of Zimbabwe Cricket (ZC)’s ambitious infrastructure development plan.\nThis comes at a time when Zimbabwe is preparing to co-host the 2026 under-19 Cricket World Cup alongside Namibia and the 2027 men’s Cricket World Cup with South Africa and Namibia.\nThe project is on track, with 50% of the main pitch having been constructed.\n“We have made significant progress in the earthworks. We’ve levelled Pitch A, the main pitch, and the practice pitch. Planting has commenced on the main square, including the wicket and the 30-yard area. The good news is this planting coincides with the rains. I’m told there’s been good rainfall in Victoria Falls, which is very encouraging. While the rains have temporarily slowed work on the practice pitch due to water logging, overall progress is substantial,” said managing director of Zimbabwe Cricket, Givemore Makoni.\nConstruction of other facilities is expected to begin soon.\n“Construction work on the media centres, players’ changing rooms, and grandstands is scheduled to begin in March this year. We are on course in terms of the field work and adhering to our phased plan. We are confident in meeting all our deadlines,” said Mr Makoni.",
            "time": "20:37",
            "date": "15 Jan 2025"
        },
        {
            "title": "Zim delegation in Russia for a technical exchange programme",
            "href": "https://www.zbcnews.co.zw/zim-delegation-in-russia-for-a-technical-exchange-programme/",
            "content": "Story by ZBC Reporter\nA high-powered Zimbabwean delegation is currently in Kazan, Russia, for a technical exchange programme that will inform the re-designing of the Mbare Musika Traders market into a modern facility.",
            "time": "20:37",
            "date": "15 Jan 2025"
        },
        {
            "title": "Zim sees surge in international tourists",
            "href": "https://www.zbcnews.co.zw/zim-sees-surge-in-international-tourists/",
            "content": "\nStory by Tichaona Kurewa\nZIMBABWE’s tourism sector experienced a surge in tourist arrivals at Victoria Falls, Zambezi National Park, and Hwange National Park during the 2024 festive season.\nStatistics from the Zimbabwe Parks and Wildlife Management Authority reveal a significant increase in tourist numbers during the recent festive season, with over 30 000 visitors exploring Hwange and Victoria Falls/Zambezi National Parks.\nA notable highlight is the surge in international visitors to the Victoria Falls rainforest, reaching 5 000 compared to 4 000 in 2023.\nDomestic tourism to the rainforest however saw a slight decrease from 7 000 to 6 000.\n“But I think we are happy about the number of people that visited our tourist destinations, especially the campaign that has been led by various stakeholders, including the Ministry of Tourism, to ensure that we visit the tourist destinations that we have.",
            "time": "20:37",
            "date": "15 Jan 2025"
        }
    ]
}