{
    "news": [
        {
            "title": "Full Fourth Post-Cabinet Briefing, 4 March 2025",
            "href": "https://www.zbcnews.co.zw/full-fourth-post-cabinet-briefing-4-march-2025/",
            "content": "2025 1.0 EARLY CHILDHOOD DEVELOPMENT COORDINATION\nCabinet considered and approved the Early Childhood Development Coordination (ECD) Framework, which was presented by the Honourable Vice President Col. (Rtd.) K.C.D. Mohadi, as the Chairperson of the Cabinet Committee on Social Service and Poverty Eradication. The Early Childhood Development Coordination Framework is a strategy that seeks to harmonise the existing policies, strategies and initiatives; and strengthen the capacity of the existing systems and structure to holistically provide quality and affordable service to the children up to seven years.\nThe specific objectives of the Framework are as follows: harmonising existing ECD policy-related goals, strategies and initiatives within and across all sectors; setting, improving and aligning standards to ensure equitable access to well-coordinated, quality, inclusive and affordable ECD services; as well as harmonising and strengthening the capacity of existing systems and structures to deliver integrated quality and inclusive ECD programmes.\nThe Constitution of Zimbabwe and the Zimbabwe National Development Strategy 1 (NDS 1): 2021-2025 underscore the importance of investing in early childhood development as a tool for poverty reduction and a vehicle for producing skilled and capable human capital for socio-economic transformation.\nZimbabwe is also a signatory of several global and regional protocols that call on Governments to ensure that all children access quality early childhood development. The Framework therefore aligns the country’s aspirations, policy and legislative environment, as well as international obligations.\n2.0 PREPARATIONS TO HOST THE 45TH INDEPENDENCE DAY CELEBRATIONS AND THE CHILDREN’S PARTY\nCabinet received an update on Preparations for the 2025 Independence Day Celebrations and Children’s Party, as presented by the Minister of Local Government and Public Works, in his capacity as Acting Chairman of the Cabinet Committee on State Occasions and National Monuments Honourable Daniel Garwe.\nIn line with the thrust of the Second Republic to hold national events rotationally across the Country’s Provinces, the 45th Independence Anniversary Celebrations will be held on 18th April 2025 at the Nembudziya Growth Point Open Ground Venue in Gokwe North. As per tradition, the Children’s Party will precede the main celebrations on 17th April at Nyamuroro High School, while the Independence Gala will be hosted at Nembudziya Government High School on the eve of 18th April 2025. Running under the theme, “Zim@ 45: Devolve and Develop Together towards Vision 2030,” the celebrations are poised to attract 60 000 people drawn from all the ten Provinces of Zimbabwe.\nPreparatory works are all at an advanced stage and progressing well, with the construction of legacy projects in full swing at the Main Arena at Gokwe North Open Grounds; the Gala site at Nembudziya Government High School; and the venue of the Children’s Party at Nyamuroro High School. Government has taken steps to guarantee the supply of clean, safe and adequate drinking water through the drilling of 110 boreholes in Gokwe North and South districts, with three boreholes drilled at the venue sites.\nConcerning the actual transportation of delegates to the venue sites, Government has mobilized more than 369 buses for equitable distribution throughout the country’s provinces. A total of 3 050 child delegates will be hosted by the First Family at Nyamuroro High School on 17th April 2025. The child delegates will start arriving at Nyamuroro High School on 15 April 2025 and will depart on 19th April 2025.\nThe highlights of the events leading to the celebrations include the customary Torch Relay and the lighting of the Independence Flame en-route to the main venue. A multi-talented cast of artists and Dance Groups from Kwekwe, Gokwe and other districts will showcase their talents during the Celebrations.\nSimba Bhora and FC Platinum Football clubs which emerged as the first and second-positioned teams in the Premier League will entertain the crowds during the main Independence Day Anniversary celebrations, while Herentals Queens and Black Rhinos Football Clubs will play during the 2025 Children’s Party celebrations.\n3.0 REPORT ON PREPARATIONS FOR HOSTING THE 2025 SANGANAYI/HLANGANANI BUSINESS EXPO AND ITS PROPOSED DECENTRALISATION\nCabinet received the Report on Preparations for Hosting the 2025 Sangnayi/Hlanganani Business Expo and approved its Proposed Decentralisation, as presented by the Minister of Tourism and Hospitality Industry, Honourable Barbra Rwodzi. The Sanganayi/Hlanganani Expo 2025 will be held from 10 to 12 September 2025, in Mutare, Manicaland Province in line with the devolution principle and the development philosophy of “leaving no one and no place behind”.\nGoing forward, the Sanganayi/Hlanganani Tourism Expo will be held on a rotational basis across the 10 provinces. This will enhance the profiling and rebranding of the respective provinces for tourism, trade and investment promotion.\n4.0 UPDATE ON PREPARATIONS FOR EXPO 2025: 13 April to 13 OCTOBER 2025\nCabinet considered and approved the Preparations for the Expo 2025 Osaka Report, as presented by the Minister of Foreign Affairs and International Trade, Honourable Professor dr Amon Murwira.\nThe Expo 2025 will be held in Osaka, Japan from 13th April to 13th October 2025. A 12-member delegation led by a Commissioner-General will represent Zimbabwe at the high-profile international event. Plans are already at an advanced stage to establish the Zimbabwe Pavilion and the identification of public and private institutions, especially the business community representatives that will showcase content in the following key sectors of the economy: tourism; mining; education; innovation; and agriculture. Content creation is already at an advanced stage, while construction of the Pavilion, Commercial space and development of websites is already underway.\nThe highlights of the 6-month long Expo 2025 programme will include the Zimbabwe National Day to be graced by His Excellency President Cde Dr. E.D. Mnangagwa on the 16th July 2025. The event will provide a platform to harness investment dividends and other collaborative opportunities, as the President will be engaging both international investors and the Diaspora community in Japan.\n5.0 REPORT ON HIS EXCELLENCY THE PRESIDENT’S ATTENDANCE AT THE FUNERAL OF HIS EXCELLENCY DR. SAM SHAFIISHUNA NUJOMA, THE LATE FORMER PRESIDENT OF THE REPUBLIC OF NAMIBIA ON 28 FEBRUARY, 2025",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Govt expedites Bulawayo-Nkayi road rehabilitation",
            "href": "https://www.zbcnews.co.zw/govt-expedites-bulawayo-nkayi-road-rehabilitation/",
            "content": "\nStory by John Nhandara\nTHE Bulawayo-Nkayi road rehabilitation is gaining momentum with some sections of the road currently being worked on.\nOne of the contractors assigned to work on the Bulawayo-Nkayi road has made progress in the rehabilitation of a 10 kilometre section just after Ingwingwizi Bridge in Bubi district towards Nkayi.\nThe road has been in disrepair for years, causing significant inconveniences for motorists and impacting the local economy.\n“It is an important road because heavy vehicles, buses, small cars connect Bulawayo and Matabeleland North using this road,” said a member of the community.\n“The road has been idle for some time and we are happy we are witnessing huge progress,” said a beneficiary,” said another community member.\n“Public transporters were now inflating fares because the road is in bad shape so we are grateful for the gesture).\nThe contractor is optimistic of meeting timelines, having mobilised all necessary machinery and equipment for the project.\n“We have covered two and half kilometres and it is ready for surfacing. We are widening the narrow mate to a 10 meter full width tarred road and we are going to surface the road using asphalt overlay which is a bit durable in terms of strength,” said Engineer Vincent Gumbo (Site Agent – Difflock Construction).",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Broadcasting Services Amendment Bill sailes through National Assembly",
            "href": "https://www.zbcnews.co.zw/broadcasting-services-amendment-bill-sailes-through-national-assembly/",
            "content": "Story by Peter Chivhima\nTHE Broadcasting Services Amendment Bill has sailed through the National Assembly after the last round of debates this Tuesday.\nAfter an intense debate on the Broadcasting Services Amendment Bill, the proposed legislation stood the test of parliamentary scrutiny after it was passed by the National Assembly this Tuesday.\nIn passing the bill, parliamentarians unanimously supported Clause 15 of the Broadcasting Services Amendment Bill which prohibits the sale of motor insurance cover and vehicle license discs to individuals who do not hold valid ZBC radio licenses.\n“For me, the two entities should be regulated, and I think there is nothing wrong with this proposal. I believe the majority of people in Zimbabwe listen to ZBC, and I want to thank the Minister for proposing this,” a Member of Parliament said.\nDuring the debate, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere and the Leader of Government Business in the National Assembly, Honourable Ziyambi Ziyambi clarified some clauses in the bill.\n“The collaboration between ZBC and ZINARA is in full compliance with the Constitution. I want to emphasise the distinction between a radio license and a radio receiver, as the latter is capable of receiving broadcasts,” Dr Muswere said.\n“The Second Republic has prioritised alignment with constitutional requirements and good governance practices,” Honourable Ziyambi stated.",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Heavy rains render Bindura’s Kamonde Bridge impassable",
            "href": "https://www.zbcnews.co.zw/heavy-rains-render-binduras-kamonde-bridge-impassable/",
            "content": "Story by Tapiwa Machemedze\nA cross-section of farmers in Bindura’s Matepatepa area are unable to deliver critical supplies to their farms following extensive damage to Kamonde Bridge by heavy rains on Thursday night.\nWhile residents are passing through on foot, the bridge is impassable by vehicles, setting back farming efforts as some farmers need to ferry fertilisers and other critical supplies to the Matepatepa farming area.\n“There were heavy rains on Thursday going into Friday. The water was powerful from Kamonde River and surrounding higher ground. It converged and failed to dislodge the soil and started eroding the bridge which eventually gave in. Now all the produce from these farms cannot pass through,” a farmer said.\nAnother added, “The biggest problem is the movement of produce, school children. As farmers, we go to town and buy produce daily. Today, we are likely to receive more rains, so we hope the local authority will urgently intervene before the whole bridge is washed away.”",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "ZBC & ZINARA showcase capacity for integrated vehicle licensing system to Parliamentary Portfolio Committees",
            "href": "https://www.zbcnews.co.zw/zbc-zinara-showcase-capacity-for-integrated-vehicle-licensing-system-to-parliamentary-portfolio-committees/",
            "content": "Story Peter Chivhima\nTHE Zimbabwe Broadcasting Corporation (ZBC) and the Zimbabwe National Roads Administration (ZINARA) have demonstrated their capacity to implement an integrated disc for vehicle licencing, in line with the provisions of the Constitution.\nA high-level presentation to the Joint Parliamentary Portfolio Committees on Media, Information and Broadcasting Services, and Transport and Infrastructural Development at the New Parliament Building in Mt Hampden this Monday saw ZBC and ZINARA proving their technical capacity to deliver solutions that enhance efficiency.\nTen Ten Technologies’ CEO Mr Charles Wekete said, “Indeed, as we demonstrated in our presentation, we confirmed that it’s technically feasible. The question we were asked to address was whether it’s possible to have a single licensed disc that covers vehicle licensing, insurance, and radio licensing. Our answer was unequivocally yes; it’s entirely possible from a technical standpoint.\n“We also discussed the importance of security features. Regarding the concern about individuals printing licensed discs at home, we clarified that the display of licensed discs on vehicle windshields is regulated by existing laws. As technical partners, it’s not our role to advocate for changes to these regulations. Instead, it’s up to the relevant authorities, including government agencies, to determine whether they wish to revise or repeal these laws and permit individuals to print their licensed discs at home.”\n“When we come together and integrate our systems, it will also be less costly in terms of the administration of things, because we will be having a lot of automation taking place in the background, saving us from printing a lot of discs and all the other expenses associated with the operations in silos.  So we are breaking the silo mentality and cooperating, which is something that we have shown through the meeting that it’s possible to work together,” ZBC’s Acting CEO Engineer Tapiwa Mudzamba said.\nZBC Head of Licensing Mr Wisdom Samanyai and Chairpersons of both Parliamentary Portfolio Committees threw their full support behind the vision, emphasising the importance of enhancing efficiency for motorists.\n“We are pleased that all three parties, including our vendor, are on the same page. We have even outlined the timelines involved. The question was if this proposal is approved tomorrow, when can we expect implementation to begin? We were able to provide a detailed explanation of the technical arrangements and other behind-the-scenes efforts already underway to ensure a smooth rollout,” Mr Samanyai said.",
            "time": "06:29",
            "date": "05 Mar 2025"
        }
    ]
}