{
    "news": [
        {
            "title": "Masvingo City wows global audience at the Colours of the World Expo",
            "href": "https://www.zbcnews.co.zw/masvingo-city-wows-global-audience-at-the-colours-of-the-world-expo/",
            "content": "Story by Mercy Bofu-Matinha\nMASVINGO City recently made a strong debut at the Colours of the World Tourism Expo in Turkey, proudly showcasing Zimbabwe’s rich cultural heritage and securing potential business and cultural exchange opportunities. The city’s impressive presentation further cemented Zimbabwe’s reputation on the global tourism stage.\nRepresenting the home of the legendary Great Zimbabwe, the Masvingo delegation participated in the just-ended Colours of the World International Culture, Tourism, and Destination Expo held in Istanbul.\nThe delegation featured experts from tourism, gastronomy, and traditional music, leaving an indelible impression on an international audience.\n“We had an awesome and eye-opening experience. We managed to sell our culture as Zimbabweans specifically from Masvingo province and we were well received. They even asked us for more and we had to go back on stage on many occasions. They appreciated our culture as a people,” musician Blessing Maramba said.\n“As a Chef, I am excited to participate at this important platform.  I have been exposed to an international platform, meeting chefs from different countries hence I learned a lot. Again I was excited that people here were attracted by our food, they were even asking for more hence I am so excited,” a participant at the Expo, Rejoice Gundura said.\nMasvingo City exhibition stand was a hub of cultural exchange, captivating visitors with an authentic taste of Zimbabwe delicacies such as Mopani worms, dried vegetables and exotic fruits like “Nyii” or “Umnyi” Bird Plum attracting international guests.\n“The experience was quite exciting, we believe we achieved the objectives we set for our participation. We wanted to provide exposure.  To our business people, our chefs and artists to international events so that they find collaborations and we also speak about our culture to the world. Our performances were well received and we participated in the panel discussions,” Masvingo City Council Finance Director, Mr Danster Jori said.\nNot to be outdone, were Masvingo’s traditional dancers from Charles Theatre Club, showcasing the vibrancy of Zimbabwean culture.",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "National hero Brigadier General Rtd Rungani described as a unifier",
            "href": "https://www.zbcnews.co.zw/national-hero-brigadier-general-rtd-rungani-described-as-a-unifier/",
            "content": "Story by Jerold Sasa\nTHE late national hero Brigadier General Retired Victor Rungani has been described as a family man and unifier.\nMembers of the Rungani family said the late decorated soldier was a family man who loved all and instilled discipline in his children.\n“Our father loved us so much and he also valued education such that all of us managed to reach the levels we all wanted because of his love,” his son, Daniel Rungani said.\n“He was a unifier who managed to unite all members of our extended family together,” uncle, Mr Enias Magate added.\n“He started this journey when he was still very young as he was against white oppression, especially in rural areas where he had grown up,” his aunt, Ms Christine Rungani added.\nThe daughter of the late hero, Professor Ellen Rungani explained how her father ended up having so many names as he was a man of the people.",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Govt’s decentralisation drive makes documents accessible to all",
            "href": "https://www.zbcnews.co.zw/govts-decentralisation-drive-makes-documents-accessible-to-all/",
            "content": "Story by Tichaona Kurewa\nFOR many years, accessing essential identity documents in Zimbabwe meant long, often difficult journeys to centralised offices, especially to the capital city, Harare.\nThe Second Republic has, however, embarked on a spirited drive to decentralise the issuance of national documents, much to the delight of the citizenry.\nThis drive is anchored in the national devolution agenda and the mantra: “Leaving no one and no place behind.”\nThe process has been gradual but consistent.\nInitial efforts included opening provincial registry offices like Lupane, and easing pressure on the central registry in Bulawayo and other major centres.\n“The process of acquiring a passport is now cheap for us even the process of obtaining a passport is now smooth,” a Lupane resident said.\n“We thank the government for opening passports offices in Hwange, everyone who needs these documents can access them easily,” a Hwange resident added.\nOver time, this expanded to include district-level offices in places like Hwange, and even smaller urban centres such as Victoria Falls.\n“We thank the government for the effort it has made over the years to make vital documents accessible to all people. We used to travel as far as Bulawayo for passports. Then came Lupane, and now we have Hwange, which is commendable. Mobile teams are also visiting schools to register those without documents. Most recently, chiefs have been empowered to issue birth records for deaths occurring within their jurisdictions,” Chief Hwange Mr Amos Chipaya said.\n“The government has come up with decentralisation, which has made people lessen the burden of the cost that is involved because you also have to pay for the passport. It’s now catering for people from Binga, Kamativi, Victoria Falls and especially the people from the safaris,” Hwange District Registrar, Mr Alfred Jija noted.",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Retired CIO boss, Cde Walter Basopo declared national hero",
            "href": "https://www.zbcnews.co.zw/retired-cio-boss-cde-walter-basopo-declared-national-hero/",
            "content": "Story by John Nhandara\nRETIRED Central Intelligence Organisation Director, Cde Walter Basopo, who passed away in South Africa on Tuesday, has been declared a national hero.\nDelivering the message of his national hero status to the family in Goodhope, Harare, this Friday, Minister of State for National Security, Senator Lovemore Matuke, stated that the Government and the ruling ZANU PF party had recognised the significant role played by Cde Basopo both before and after Zimbabwe’s independence.\n“I have been sent by President Mnangagwa to relay an important message. He worked in government for a long time. He was working with the government, defending the country. His contribution has been important since the liberation struggle. The President has seen it fit to accord national hero status to Cde Basopo,” he said.\nThe family expressed gratitude to the government for bestowing national hero status on Cde Basopo, describing him as a fatherly figure and unifier.\n“We are grateful for the hero status that has been accorded to our father. He was a unifier. He worked hard for the country and even at home, he was a fatherly figure,” family spokesperson, Kudakwashe Musungwa Zvinavashe said.\nCde Basopo joined the liberation struggle in June 1976 under ZANLA, after crossing into Mozambique.\nHe then received political training at Chibawabawa Transit Camp until 1978.\nCde Basopo later received military training at Tembwe Camp, before being deployed to ZANLA’s security department in Manica Province.",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Military spectacle light up 2025 ZITF opening",
            "href": "https://www.zbcnews.co.zw/military-spectacle-light-up-2025-zitf-opening/",
            "content": "Story by Wellington Makonese\nTHE Zimbabwe uniformed forces painted streaks across the heavens and grounds with majestic mass displays heralding the official opening of the 2025 Zimbabwe International Trade Fair (ZITF).\nThe roar of the jets reverberated across the ZITF showgrounds, a thunderous fanfare announcing the commencement of this annual premier event in the City of Kings and Queens.\nOn the ground, the Zimbabwe Defence Forces executed a flawless march-past with unwavering precision and pride.\nTheir disciplined ranks moved in unison, a powerful tribute presented first to the esteemed Guest of Honour, President Daniel Chapo.\nThe synchronised steps and action from the ZRP display team captivated the enthusiastic crowd to stay on.",
            "time": "20:34",
            "date": "27 Apr 2025"
        }
    ]
}