{
    "news": [
        {
            "title": "Zimbabweans enjoy the hive of activities beyond the business linkages at ZITF",
            "href": "https://www.zbcnews.co.zw/zimbabweans-enjoy-the-hive-of-activities-beyond-the-business-linkages-at-zitf/",
            "content": "Story by Peter Chivhima\nTHE 65th edition of the Zimbabwe International Trade Fair (ZITF) continues to generate excitement, showcasing innovation, collaboration, and opportunities for growth.\nBeyond the business linkages, the fair has turned into a vibrant and enjoyable event, drawing large numbers of people, including children and curious visitors, who are keen to experience the many attractions.\n“We are excited to be here and we are having a lot of fun here including games.\n“It is my first time to be here at the ZITF and I am also happy to experience a lot of entertainment,” a first-time visitor said.\nExhibitors expressed gratitude for the opportunities availed to them to showcase their products.\n“I want to applaud the government especially the Ministry of Women Affairs for giving us the opportunity to be here and we expect by the end of this show we will be having a lot of connections,” an exhibitor said.",
            "time": "20:28",
            "date": "25 Apr 2025"
        },
        {
            "title": "Students engage industry leaders at ZITF Scholastica",
            "href": "https://www.zbcnews.co.zw/students-engage-industry-leaders-at-zitf-scholastica/",
            "content": "Story by Wellington Makonese\nTHE 65th edition of the Zimbabwe International Trade Fair (ZITF) Scholastica proved to be a dynamic and inspiring platform, with primary and secondary school learners engaging directly with local and international industry stakeholders.\nThe discussions focused on integrating artificial intelligence (AI) into Zimbabwe’s heritage-based Education 5.0 model.\nThis year’s theme, “Heritage-Based Education 5.0 as a Catalyst for Industrialisation”, set the tone for thought-provoking interactions between students, educators, and professionals.\n“As much as we talk of industrialisation young people are the capital and this platform is helping them understand what the future is,” a teacher said.\n“This year was quite interesting in that winning in AI-related competitions marks a big improvement,” a student said.\n“It was something of an eye opener, in catering for our different strengths and guiding us to have more opportunities,” a participant said.\nThis year’s edition was punctuated by the presence of local and regional partners.\n“People are the capital and this platform is helping them understand what the future is,” a representative of the Non-State Actors, Rumbidzai Takawira said.\n“We want to widen the breadth and scope of discussions, the idea is to marry the idea of heritage and development in the model first world countries have,” the Permanent Secretary Ministry of Higher and Tertiary Education Innovation Science and Technology Development, Professor Fanuel Tagwira said.",
            "time": "20:28",
            "date": "25 Apr 2025"
        },
        {
            "title": "Brigadier General (Rtd) Victor Rungani declared National Hero",
            "href": "https://www.zbcnews.co.zw/brigadier-general-rtd-victor-rungani-declared-national-hero/",
            "content": "Story by Jerold Sasa\nBRIGADIER General Retired Victor Rungani, who passed away on Tuesday in Harare after a short illness, has been declared a national hero.\nThe announcement was officially delivered to the Rungani family this Friday by the Minister of State for National Security in the President’s Office, Senator Lovemore Matuke.",
            "time": "20:28",
            "date": "25 Apr 2025"
        },
        {
            "title": "Murambinda-Birchenough Road rehabilitation takes shape",
            "href": "https://www.zbcnews.co.zw/murambinda-birchenough-road-rehabilitation-takes-shape/",
            "content": "Story by Kenias Chivuzhe\nTHE Second Republic’s drive to improve the national road network is recording huge progress, with Buhera residents praising the ongoing tarring of the Murambinda-Birchenough Road.\nFollowing the commissioning of the Sabi Star Lithium Mine, President Emmerson Mnangagwa assured the people of Buhera that the Murambinda-Birchenough Road would be rehabilitated as part of the broader effort to upgrade the country’s road network.\nTrue to his word, road construction and tarring works from the Birchenough side have reached five kilometres, with villagers appreciative of the landmark development in their area.\n“We were facing transport challenges and it was expensive to go to Birchenough Bridge before the surfacing of this road. We therefore appeal to road authorities for road surfacing works to continue,” a resident stated.\nWork is also underway from the Murambinda side as the surfacing is being conducted from both sides of the 120-kilometre road stretch.\n“Many people in Murambinda were employed following the commencement of this project. We thank the government for rehabilitating our road and we are looking forward for this section to be completed before August,” a Buhera resident said.\nManicaland Provincial Construction Engineer Patrick Muropa spoke on the progress recorded so far.",
            "time": "20:28",
            "date": "25 Apr 2025"
        },
        {
            "title": "Prominent Gweru businessman Lazarus Chikadaya dies",
            "href": "https://www.zbcnews.co.zw/prominent-gweru-businessman-lazarus-chikadaya-dies/",
            "content": "Story by Tafara Chikumira\nTHE Midlands province has been plunged into mourning after the death of prominent Gweru businessman and philanthropist Mr Lazarus Chikadaya this Wednesday.\nThe Drawlink founding Director, Mr Chikadaya died in Harare this Wednesday after a short illness.\nFamily spokesperson Ms Conceptor Mpofu told ZBC News they have been robbed of a key figure in the family.\n“He was everything in this family. He would take everyone on board without segregation. The void he has left will be difficult to fill. We have just been robbed, and it took us by a huge surprise.”\nThe construction industry has been left poorer as Mr Chikadaya was among those who are pushing the country’s industrialisation agenda.\n“I must say it is not only the Southern Region that has lost, but the whole country at large. Mr Chikadaya was instrumental in road construction currently being spearheaded by the Second Republic. In Gweru, he is in the top two of those in the construction industry in terms of capacity. He changed the lives of many,” Businessman, Dr Josiya Tayi said.\n“He inspired me to return to the construction industry after I had stopped. He has contributed immensely to the country’s development. One thing I liked about the way he was doing business was his ability to romp in his family. This will ensure continuity, so I am generally not worried about the company going forward.”\nWorkers from his establishments added their voices saying although they have lost the head of the ship, they will work hard to ensure Mr Chikadaya’s dream remains alive.\n“He was not only my boss, but rather a mentor. He taught me some serious life lessons that have changed my life in general. I am who I am today because of Mr Chikadaya,” an employee said.\n“To me, Mr Chikadaya was more than my boss. He took me from the streets and offered me a life. He was more like a father figure to me,” another said.",
            "time": "20:28",
            "date": "25 Apr 2025"
        }
    ]
}