{
    "news": [
        {
            "title": "Senkwasi community benefits from govt-led rural industrialisation drive",
            "href": "https://www.zbcnews.co.zw/senkwasi-community-benefits-from-govt-led-rural-industrialisation-drive/",
            "content": "Story by Tafara Chikumira\nZHOMBE — The Government has commissioned the Senkwasi Village Business Unit (VBU) and a solar-powered dip tank under the Constituency Development Fund (CDF), marking a major milestone in the Second Republic’s ongoing rural industrialisation efforts in Senkwasi, Zhombe.\nThe VBU, which is expected to open up income-generating opportunities for the local population was officially commissioned alongside a solarised dip tank aimed at combating the deadly January disease which has devastated livestock in the area.\nZhombe legislator, Honourable Edmore Samambwa, commended the community for its proactive approach and underscored the critical role played by the new infrastructure in improving livelihoods.\n“It is a new era for the people of this community. This dip tank, initiated by the villagers, is a huge step. I must point out that one of our villagers recently succumbed to high blood pressure after losing 37 cattle to January disease. This intervention comes not a moment too soon,” he said.\nSenator, Engineer Daniel Mackenzie Ncube, also present at the eventlauded the community for embodying the national development vision.\n“I am very proud of you, the people of Zhombe. You have fulfilled the President’s mantra that ‘Nyika inovakwa nevene vayo’. It is through your commitment and unity that we are celebrating these achievements today,” he said.\nTraditional leaders and villagers echoed similar sentiments, expressing deep appreciation for the life-changing infrastructure developments.\n“Things were not well in this area. We used to travel long distances to access dipping services. Now we have this dip tank here, and the difference it makes is beyond words,” Headman Sikhanya said.\n“This place is dry. We used to struggle for water, but now we can simply open the tap and collect clean water. Life has truly changed.” a villager, Gogo Shumba said.\nMrs Melita Ncube, a young mother and beneficiary of the Village Business Unit’s nutritional garden, also spoke with hope.\n“I am very grateful. Through this initiative, we are growing cash crops and can now support our children’s education,” she said.\nPresiding over the commissioning ceremony, Midlands Minister of State for Provincial Affairs and Devolution, Honourable Owen Ncube, reaffirmed the Government’s commitment to inclusive development.",
            "time": "06:47",
            "date": "24 Jun 2025"
        },
        {
            "title": "Chiefs in Mash Central mobilise to end child sexual exploitation",
            "href": "https://www.zbcnews.co.zw/chiefs-in-mash-central-mobilise-to-end-child-sexual-exploitation/",
            "content": "Story by Tapiwa Machemedze\nMOUNT DARWIN – EFFORTS to eliminate child sexual exploitation in Mashonaland Central Province have reached a critical stage with traditional leaders now spearheading community engagement activities under the ‘Not in My Village’ campaign launched in August last year by President Emmerson Mnangagwa.\nThe campaign, which aims to tackle child sexual abuse, early marriages, and gender-based violence has entered its grassroots implementation phase, with 28 chiefs across the province actively engaging local communities.\nEducational outreach efforts are being undertaken through village meetings, school visits, health centres, and community gatherings.\nMiss Agnes Kamudyariwa, the provincial facilitator of the Young People’s Network on Health and Wellbeing, welcomed the involvement of traditional leaders in addressing a challenge that has long affected girls in the region.\n“As a girl child, it pained me greatly to see my peers’ rights being violated through early marriages. Many of them had to abandon their education, losing the chance to fulfill their dreams. There are also serious health risks so I am happy that this campaign has been embraced by the Chiefs. They have promised to educate their communities on the dangers of marrying off young girls,” she said.\nMeanwhile, Chiefs are taking a firm stance against communities that facilitate or celebrate child marriages, with some warning that attendees at such events may also be held accountable.\nSpeaking during a community sensitisation session, Chief Negomo emphasised the urgent need for a coordinated and comprehensive approach to end child sexual exploitation.\n“We are ready to go to our headman and all those we meet, teachers, in schools’, hospitals, where ever people are gathered, we are ready to make a holistic approach and end this problem of child sexual exploitation. Here in Mashonaland Central, especially Mount Darwin, Shamva, and here in Mazowe is where the greatest problems are because of mining activities. Now on the issue of child marriages, As Chiefs we have seen that those who will gather and celebrate marriage of children will be culpable of crime because you cannot take part in such gatherings, so we have taken it upon ourselves to go to all areas and homes to end this scourge,” he said.\nChairman of Mashonaland Central Provincial Chiefs Council, Senator Chief Matsiwo, raised concerns about cross-border challenges along the Mozambique frontier.\n“This programme is enriching us as traditional leaders. It aligns with our cultural values which discourage child marriages. However, in some areas near the border, young girls are being married by individuals from Mozambique. Our powers are limited beyond the border. It is our hope that other SADC countries adopt similar laws to protect children across the region,” he said.\nMr Edgar Muzulu, Provincial Manager of the National Aids Council (NAC), said the campaign would rely on data gathering and documentation to monitor progress and identify hotspots of gender-based violence.",
            "time": "06:47",
            "date": "24 Jun 2025"
        },
        {
            "title": "Speaker Mudenda meets Pope Leo XIV at Vatican as IPU dialogue concludes",
            "href": "https://www.zbcnews.co.zw/speaker-mudenda-meets-pope-leo-xiv-at-vatican-as-ipu-dialogue-concludes/",
            "content": "Story by ZBC Reporter\nTHE Speaker of Parliament, Advocate Jacob Mudenda, attended a landmark audience with His Holiness Pope Leo XIV at the Vatican, marking the conclusion of the Inter-Parliamentary Union (IPU) Interfaith Dialogue held in Rome.\nThe meeting, held in the Hall of Benedictions on Saturday, brought together parliamentary and religious leaders from 68 nations.\nIn his address, Pope Leo XIV described politics as “the highest form of charity,” urging political leaders to serve the common good through compassion, inclusivity, and ethical leadership. He called upon lawmakers to uphold human dignity, promote equity, and ensure peace through sincere interfaith engagement.\nThe Pontiff also emphasised the ethical governance of emerging technologies, especially Artificial Intelligence. While acknowledging AI’s potential to enhance communication and understanding, he cautioned against its misuse, asserting that technology must always serve humanity rather than override human dignity and freedom.",
            "time": "06:48",
            "date": "24 Jun 2025"
        },
        {
            "title": "Uniformed officers graduate at joint pass-out parade in Chegutu",
            "href": "https://www.zbcnews.co.zw/uniformed-officers-graduate-at-joint-pass-out-parade-in-chegutu/",
            "content": "Story by Tino Zirongwe\nCHEGUTU – A total of 110 instructors from the Zimbabwe National Army and Airforce of Zimbabwe have graduated at a joint pass-out parade held at Jason Ziyaphapha Moyo Airforce Base in Chegutu.\nThe graduates qualified as instructors in ceremonial, weapons and squad drills instruction.\nPresiding over the event, Airforce of Zimbabwe Chief of Staff, Air Vice Marshal Biltim Chingono, who was the reviewing officer spoke on the importance of the courses in moulding principled leaders within the uniformed forces.\n“The ceremonial drill instructors’ courses are a cornerstone for the maintenance of discipline in the organisation. The main thrust of the courses was to mould junior and senior non-commissioned members to be efficient members in the discharge of their respective duties. The Air Force of Zimbabwe remains dedicated to the protection of the Zimbabwean air space and territorial integrity as well as its sovereignty.”\nAmong the graduates was Earnmore Raurai, a surgeon from 1 Commando Regiment, who reflected on the demanding nature of the training.\n“The course was challenging and demanding, especially in terms of discipline and hygiene. But I have acquired skills that I am proud to pass on to others.”\nMaster Surgeon Jacqueline Moyo, one of the women in the cohort, encouraged fellow female officers to embrace leadership roles within the forces.\n“It is important to put your heart into everything you do. As women, we must prove our capability and rise through the ranks. I hope fellow women will follow suit.”",
            "time": "06:48",
            "date": "24 Jun 2025"
        },
        {
            "title": "Fire ravages Harare grocery outlets, owners plead for govt assistance",
            "href": "https://www.zbcnews.co.zw/fire-ravages-harare-grocery-outlets-owners-plead-for-govt-assistance/",
            "content": "Story by Fungai Jachi\nHARARE – SMALL business owners operating in Harare’s downtown area who had their grocery shops gutted by fire have called on the government to intervene and assist them in resuscitating their businesses.\nThe inferno, which broke out in the early hours, left behind charred remnants of once-thriving enterprises. The area, typically teeming with traders and customers, resembled a state of mourning when ZBC News visited the scene on Sunday.\nMany shop owners were too emotional to speak, overwhelmed by the scale of the destruction. Those who managed to voice their plight pleaded for intervention.\n“It is a great loss that we have suffered. We need assistance now because this is too much for us,” a business owner said.\n“The fire has left us in a difficult place, where do we start from? Everything was destroyed in the fire,” another added.\nSome nearby businesses, however, narrowly escaped the inferno.",
            "time": "06:48",
            "date": "24 Jun 2025"
        }
    ]
}