{
    "news": [
        {
            "title": "Artists applaud devolution agenda for empowering grassroots talent",
            "href": "https://www.zbcnews.co.zw/artists-applaud-devolution-agenda-for-empowering-grassroots-talent/",
            "content": "Story by ZBC Reporter\nARTISTS have hailed the Second Republic’s devolution agenda, citing it as a transformative force that has opened up new avenues for creative expression and community engagement.\nSpeaking at the District Independence Day celebrations held at Darwin High School in Mt Darwin, Precious Makomo, the leader of the musical group Precious Makomo and the God’s Saints, said the commemorations gave local performers a rare opportunity to showcase their talent.\n“Whenever we get these platforms, we use them to preach against social ills affecting the youth, like drug and substance abuse,” Makomo said.",
            "time": "06:42",
            "date": "22 Apr 2025"
        },
        {
            "title": "Public Service Commission denounces stay-away calls",
            "href": "https://www.zbcnews.co.zw/public-service-commission-denounces-stay-away-calls/",
            "content": "Story by ZBC Reporter\nTHE Public Service Commission (PSC) has issued a statement condemning recent calls circulating on various platforms encouraging public servants and citizens to abstain from work or regular activities on Tuesday, April 22 and Wednesday, April 23.\nIn a statement, the Commission expressed deep concern over what it described as ‘reckless and disruptive incitements,’ warning that such actions pose a threat to national unity, service delivery, and Zimbabwe’s developmental progress.\n“The Commission is confident that Public Servants, who are committed, disciplined, and fully aware of their responsibilities, will not be misled by such incitements. Public Servants are reminded that their core mandate is to serve the people of Zimbabwe faithfully, diligently, and without interruption,” the statement read.\nHighlighting the crucial role of the Public Service in the delivery of essential services and the realisation of Vision 2030, the PSC emphasised that any participation in the planned stay-away would be considered a dereliction of duty and an act of insubordination.\n“Such actions are unpatriotic, undermine national unity, damage the economy, and hinder the collective progress of the nation,” the Commission stated.\nThe PSC clarified that both 22 and 23 April are normal working days.",
            "time": "06:42",
            "date": "22 Apr 2025"
        },
        {
            "title": "Remembering Dr Malinga: a voice for Inclusion of the disabled in independent Zim",
            "href": "https://www.zbcnews.co.zw/remembering-dr-malinga-a-voice-for-inclusion-of-the-disabled-in-independent-zim/",
            "content": "Story by Anashe Murombedzi\nAFRICA is home to numerous icons who have excelled in various fields. Among them was Zimbabwe’s late national hero, Dr Joshua Malinga, a relentless advocate for the recognition and inclusion of people with disabilities in the nation’s development.\nDr Malinga did not only champion the rights of persons with disabilities but also fought for their full participation in the fruits of independence—laying a foundation for a more inclusive Zimbabwe.\nWith a life marked by both hardship and triumph, Dr Malinga’s unwavering determination and passion for justice inspired generations of Zimbabweans and echoed across borders.\nBorn on 20 April 1944, in rural Filabusi, Matabeleland South Province, his life changed dramatically at the age of two when he contracted polio, resulting in a permanent physical disability.\nYet, rather than allow this to define or limit him, he used it as a platform to drive advocacy for the rights of the disabled.\nAs a young man, Dr Malinga attended school and learned a craft as a cobbler at Jairos Jiri Centre in Bulawayo.\nThis foundation would serve him well in his future endeavours, as he became a vocal advocate for the rights and interests of people with disabilities in Zimbabwe and beyond.\nDr Malinga’s entry into politics was sparked by the injustices and oppression faced by black people under the colonial regime.\nHe joined the nationalist movement, becoming an activist for the liberation struggle, and after independence he rose through the ranks of ZANU PF to become a Central Committee and Politburo member.\nThroughout his illustrious career, Dr Malinga was a champion of disability rights, becoming the founding member of the National Council of Disabled Persons of Zimbabwe (NCDPZ) in 1975 and serving as the World President of Disabled Peoples’ International (DPI).\nHe played a pivotal role in shaping government policies and programmes that addressed the needs and challenges of people with disabilities, and his legacy continues to inspire and empower individuals with disabilities to this day.\nHaving served as the chairperson of the National Disability Board, Dr Malinga also worked tirelessly during the constitution making process by mobilising disability organisations which went around the country collecting views from the disability constituency and other stakeholders.\nThe views from the disability sector led to a constitutional provision for the reservation of two senatorial positions for people with disabilities.\nHis efforts did not go unnoticed after President Emmerson Mnangagwa appointed him Advisor on Disability Issues in the Office of the President and Cabinet.",
            "time": "06:42",
            "date": "22 Apr 2025"
        },
        {
            "title": "Zim to establish Institute of Civil Protection and Disaster Management",
            "href": "https://www.zbcnews.co.zw/zim-to-establish-institute-of-civil-protection-and-disaster-management/",
            "content": "Story by Kenias Chivuzhe\nPLANS are underway for the establishment of the country’s first Institute of Civil Protection and Disaster Management as a resilience measure against climate-induced disasters.\nThe establishment of the Institute of Civil Protection and Disaster Management is described as a milestone development in the country’s quest to promote excellence in civil protection and emergency management in the face of recurrent disasters affecting the country and the region.\nManicaland State University of Applied Sciences Vice Chancellor Professor Albert Chahwanda whose institution signed an MOU with the city of Mutare spoke on the scope and timeframes in implementing the new initiative.\n“This MOU is between the state university and the city of Mutare to establish an institute of civil protection and disaster management. This is the first of its kind in Zimbabwe and in the Southern Africa region. The training will benefit all councils, private companies, timber companies and fuel companies among others.\n“The training will be conducted in partnership with the Belarus Civil Protection and Disaster Management University. In the short term, we are going to start with a certificate in disaster and firefighting engineering. It will take us about 10 years to establish the institute as the first five years will see the personnel being sent to Belarus for training,” Professor Chahwanda said.\nMutare City town Clerk Mr Blessing Chafesuka spoke on the focus of the new initiative.\n“We are looking forward to training firefighters who are able to do sea diving and who are able to respond to any type of disaster. We hope this will be a solution for the whole country. The government recently procured firefighting equipment and distributed it to all local authorities. There is now a gap in terms of personnel hence this partnership. As a city for the next 10 years, we are ok in terms of equipment. The challenge has been a mass exodus of personnel overseas and the training of more personnel will create a big buffer,” Mr Chafesuka said.\nGovernment believe the establishment of the civil protection institute in the country was long overdue due to a number of disasters affecting the country.\n“The signing of a memorandum of understanding will give birth to the Institute of Civil Protection. The development resonates with the Second Republic’s thrust to strengthen disaster preparedness and improve community-based recovery mechanisms. Manicaland has been greatly affected by cyclones that include Eline and Idai and these experiences taught us valuable lessons therefore we are heartened by this initiative and we will give you our maximum support. Last year we had a serious fire incident which we could not control in Nyanga,” the Director in the Office of Minister of State for Provincial Affairs and Devolution- Manicaland, Mr Munyaradzi Rubaya said",
            "time": "06:42",
            "date": "22 Apr 2025"
        },
        {
            "title": "Churches emphasise unity, peace, and hope during Easter",
            "href": "https://www.zbcnews.co.zw/churches-emphasise-unity-peace-and-hope-during-easter/",
            "content": "Story by Peter Chivhima\nCHRISTIAN denominations across Zimbabwe gathered over the Easter weekend to commemorate the death and resurrection of Jesus Christ, using the sacred occasion to promote messages of peace, national unity, and spiritual renewal.\nIn a vibrant and spirit-filled atmosphere, congregants from various churches convened at multiple venues to mark this pivotal moment in the Christian calendar.\n“We are so happy to be here, celebrating the death and resurrection of Jesus. As you can see, we are the youth, and we are full of excitement. We are also taking this opportunity to raise awareness about the dangers of drug and substance abuse,” a youth said.\n“During Easter, we celebrate, the death, the burial and the resurrection of Jesus Christ, so we host our youth conference. The youth do everything. The time we are living in now is very dangerous because the enemy is attacking us. So during Easter, we come together and do our projects. So we have different speakers who give us words that are specifically for us and protect us during our youth. It keeps us safe, it keeps us strong, and it keeps us celebrating in the Lord,” a youth participant said.\n“We are here celebrating Easter and we are happy that this was organised by our youths. We are taking this opportunity to educate our youths about the dangers of drug and substance abuse,” Pastor Dorcas Jaricha said.\nFor many, Easter is not only a moment of deep reflection and gratitude, but also a season of renewal, unity, and spiritual awakening.",
            "time": "06:42",
            "date": "22 Apr 2025"
        }
    ]
}