{
    "news": [
        {
            "title": "Goromonzi ‘Dam of death’ claims 7 in drowning deaths",
            "href": "https://www.zbcnews.co.zw/goromonzi-dam-of-death-claims-7-in-drowning-deaths/",
            "content": "Story by Fairstars Mukungurutse\nResidents of Green Valley suburb in Goromonzi have expressed concern over the number of children who are drowning at a nearby dam.\nThis comes after seven children drowned in the dam between November last year and January this year.\nAs the water flows swiftly over the dam wall from a height of more than five metres, the decorative artificial waterfall appears harmless, attracting the young and energetic for a quick swim behind the wall’s deep waters.Located in Green Valley suburb of Goromonzi district, East of Harare, the dam has become a death trap with seven children having drowned between November last year and January this year.",
            "time": "20:38",
            "date": "16 Jan 2025"
        },
        {
            "title": "Zimbabwe receives artefacts from Cuba",
            "href": "https://www.zbcnews.co.zw/zimbabwe-receives-artefacts-from-cuba/",
            "content": "Story by John Nhandara\nThe Museum of African Liberation has taken delivery of artefacts and paraphernalia donated to Zimbabwe by the Government of Cuba.\nThe artefacts were received by President Emmerson Mnangagwa’s special envoy for the Museum of African Liberation, Ambassador Simbarashe Mumbengegwi in Havana, Cuba.",
            "time": "20:38",
            "date": "16 Jan 2025"
        },
        {
            "title": "Zim nationals trapped in SA gold mine",
            "href": "https://www.zbcnews.co.zw/zim-nationals-trapped-in-sa-gold-mine/",
            "content": "Story by Oleen Ndori, Foreign Desk Editor\nThe Zimbabwean Embassy in Johannesburg is working with the South African government to identify the identities of Zimbabwean nationals that were trapped in the abandoned Stilfontein gold mine in the North West Province.\nMore than 80 miners have been confirmed dead at the abandoned Stilfontein gold mine in the Northwest Province of South Africa.\nIn a statement, Zimbabwe’s Envoy to South Africa, Ambassador David Hamadziripi said the embassy is seeking to establish if there are any Zimbabweans among the 87 deceased individuals retrieved at the mine shaft, adding that there are plans to use DNA testing of relatives.\nAmbassador Hamadziripi also disclosed that there are 465 alleged undocumented Zimbabwean nationals who are undergoing a screening process in the South African Police Service custody.\nThe situation at disused mine shafts in Stilfontein has been developing since August last year, when small groups of illegal miners emerged from the shafts.\nIn November 2024; the Pretoria High Court ordered police to end a standoff with illegal miners and allow emergency workers to gain access to a shaft where hundreds were believed to be holed up.“I have hope that our people are going to come out. Our brothers, our friends and us in the first group. We know a lot of guys here. They are our brothers. They are our friends. They have kids. So, we are trying the best we can to help them out, because it will hurt when I see my friend’s kid tomorrow running around the streets, and daddy is not around,” said Tieho Moabi, one of the miners.\n“I don’t want to be a criminal. I don’t want to steal some people’s property or to rob people. I took a decision to take my own risk, to risk my life and go to the abandoned shafts to get some gold to earn a living. Our government doesn’t provide us with jobs. So we saw a job opportunity for us,” said Moeketsi Khati, an illegal miner.",
            "time": "20:38",
            "date": "16 Jan 2025"
        },
        {
            "title": "ZPCS transforms gallows into museum",
            "href": "https://www.zbcnews.co.zw/zpcs-transforms-gallows-into-museum/",
            "content": "Story by Peter Chivhima\nThe Zimbabwe Prisons and Correctional Service (ZPCS) is complying with the abolition of the death penalty and has started the process of converting hanging gallows into a museum and radio broadcasting studios.\nThe gallows at Chikurubi Maximum Security Prison were initially used to execute offenders in the 1970s.\nThe last execution at Chikurubi was carried out in 1979 before the gallows were moved to Harare Central Prison, where the hangman’s noose was last used in 2005.\nIn line with the recent abolition of the death penalty, the ZPCS is transforming the former hangman structures, commonly known as gallows, into a museum and radio broadcasting studios.\n“We want to applaud the government and the Zimbabwe Prison and Correctional Service for converting these facilities into museum and radio broadcasting station. This means that they are walking the talk in terms of respecting the United Nations practices. We also want to thank President Emerson Mnangagwa for working hard and approving the bill into an act,” said director of Corporate Chaplaincy Services of Bridging the Gap Goundation, Brian Moyo.\n“After our assessment we have seen that this place is ideal for setting up a radio station. All the facilities are good and ideal,” technical director of Broadcasting Authority of Zimbabwe, Matthias Chakanyuka said.\nChikurubi Maximum Security Prison Officer in Charge, Chief Superintendent Alfred Machingauta and ZPCS Commissioner General Moses Chihobvu, concur the initiative aligns with the abolition of the death penalty.",
            "time": "20:38",
            "date": "16 Jan 2025"
        },
        {
            "title": "Major General (Retired) Solomon Siziba dies",
            "href": "https://www.zbcnews.co.zw/major-general-retired-solomon-siziba-dies/",
            "content": "\nStory by ZBC Reporter\nZimbabwe National Army Major General (Retired) Solomon Siziba died this morning at Josiah Magama Tongogara Barracks Camp Hospital in Harare, the Army Public Relations department has announced.\nHe was 67.\nIn a statement, the Deputy Director Army Public Relations, Tichafa Mungofa said Major General (Retired) Siziba died after a long battle with cancer.",
            "time": "20:38",
            "date": "16 Jan 2025"
        }
    ]
}