{
    "news": [
        {
            "title": "Govt steps up rural school infrastructure in Shurugwi",
            "href": "https://www.zbcnews.co.zw/govt-steps-up-rural-school-infrastructure-in-shurugwi/",
            "content": "Story by Courage Bushe\nTHE Government and its development partners are working on the construction of two learning blocks at Tangle Range Primary School in Shurugwi District, a development set to enhance access to quality education.\nLocated deep in remote areas of Shurugwi District, the school is now set for transformation after the government and private partners pledged to upgrade the institution, starting with the construction of two new learning blocks.\nBuilding materials have already been delivered at the school.\n“I want to thank the government through our honourable MP for coming on board and helping our community with this noble initiative. This is commendable and we are really delighted as this will improve our children’s learning standards,” a community member said.\n“We are happy that the Second Republic is walking the talk, and it’s leaving no one and no place behind in its developmental programmes.  This is one of its promises, and we are really grateful for this,” noted another.",
            "time": "20:44",
            "date": "28 Jun 2025"
        },
        {
            "title": "Sally Mugabe Hospital storeroom gutted by fire",
            "href": "https://www.zbcnews.co.zw/sally-mugabe-hospital-storeroom-gutted-by-fire/",
            "content": "Story by Peter Chivhima\nA storeroom at Sally Mugabe Hospital in Harare was gutted by fire this Saturday afternoon, with some records being destroyed in the blaze.\nWhen the ZBC News crew arrived at the scene, the storeroom, which is housed atop the hospital’s Intensive Care Unit, was still on fire, with the Harare City Council Fire Brigade battling to extinguish the flames.\nActing Assistant Chief Fire Officer for Harare City Council, Mr Moses Bvumavaranda, confirmed the swift response by his team.\n“We received a fire report this morning and reacted swiftly. Within seven minutes, our team was already on the ground. That’s when we discovered the fire was quite serious, but we managed to extinguish it before it could spread further.”\nEyewitnesses recounted how they saw the fire and attempted to assist.\n“I was washing in the laundry room when we saw the smoke coming, and we started shouting ‘fire, fire.’ But we are happy the fire brigade arrived on time.\n“I also tried to help in extinguishing the inferno when I saw that this section was burning,” eyewitnesses said.\nHospital staff and officials, visibly shaken by the incident, deferred to Harare Mayor His Worship Councillor Jacob Mafume to address the media.\n“We are currently at one of the buildings within the hospital, specifically on the rooftop. This location has been used as a storage area for institutional records, of which, according to law, all public institutions must keep permanently. These records were placed near or under solar panels about ten panels in total. Some of the records were also stored in the lab,” he said.\nCivil Protection Department Chief Director, Mr Nathan Nkomo, said the government is committed to assist.",
            "time": "20:44",
            "date": "28 Jun 2025"
        },
        {
            "title": "Hundreds benefit as Chief Negomo leads food aid drive",
            "href": "https://www.zbcnews.co.zw/hundreds-benefit-as-chief-negomo-leads-food-aid-drive/",
            "content": "Story by Tapiwa Machemedze\nA total of 800 people in Mbire district have benefited from Chief Negomo’s food distribution programme, which saw beneficiaries in four areas receiving food hampers on Friday.\nThe food distribution programme is targeting people in remote areas, starting with Rushinga a week ago, entered its second leg in Mbire this Friday as Chief Negomo visited Kanyemba, Angwa, Mushumbi and Mahuwe areas to distribute hampers in a development welcomed by the elderly.\n“I am so grateful for this programme. Kanyemba is a dry area and there was no food in my storehouse so we are going to eat this food with my grandchildren,” said a beneficiary.\n“I am elderly and cannot fend for myself or my family. I have a household of four people so I am happy with what Chief Negomo has done. This is much appreciated,” noted another.\n“May God continue to richly bless Chief Negomo who has come here to Mushumbi together with his colleague Chief Chitsungo to give us these food hampers. Here in Mbire there is low rainfall and this food will help us,” said yet another beneficiary.\nFour traditional leaders from Mbire district also received food hampers.\nIn his remarks at Mushumbi Primary School, Chief Negomo, who is also Mashonaland Central Provincial Chiefs’ Council Vice Chairperson revealed that despite being from Chiweshe, he was inspired to reach out to other communities by President Emmerson Mnangagwa who is leaving no one and no place behind in his inclusive development agenda.\n“My main reason for being here is to see my fellow Chiefs. I am always talking to Chief Chitsungo on the phone so I decided to visit, but I could not come empty handed, I had to bring something. I want to thank the President for Vision 2030. Wherever we travel we see his works. Right now, we are following his footsteps of leaving no one and no place behind,” he said.",
            "time": "20:44",
            "date": "28 Jun 2025"
        },
        {
            "title": "Sacred Heart Cathedral celebrates 100 years of faith",
            "href": "https://www.zbcnews.co.zw/faith-unity-and-celebration-cathedral-of-the-sacred-heart-turns-100/",
            "content": "Story by Abigirl Tembo\nTHE Catholic community in Zimbabwe gathered in a spirit of reverence and celebration this Saturday as the Cathedral of the Sacred Heart in Harare celebrated its 100th anniversary, a historic milestone for both the Church and the nation.\nThe centenary celebrations, held under the theme “100 years of faith, a legacy of love, a future of hope”, drew hundreds of congregants, clergy, government representatives, ecumenical partners, and diplomatic dignitaries.\nThe commemorative mass was presided over by His Grace, Archbishop Robert Christopher Ndlovu.\nIn his homily, Archbishop Ndlovu paid tribute to the generations of missionaries, local clergy, and laity who have built and sustained the Cathedral over the past century.\n“This sacred place is more than bricks and stained glass. It is a symbol of resilience, unity, and God’s enduring love for His people, and we feel honoured to be part of these milestone celebrations,” he said.\nBuilt in 1924 and formally consecrated in 1925, the Cathedral of the Sacred Heart is not only the mother church of the Archdiocese of Harare but also a hub of community support and a centre for spiritual formation for both local and visiting Catholic faithful.\n“As the Cathedral Parish, we are all very privileged to be able to witness such a historic event. We know we will not be around for the next 100 years, some wanted to be part of these celebrations but they probably died a week before, some a year before, a month before, but we are highly favoured.\n“I have always said even in church, we have been the chosen ones to witness this historic event, and I feel challenged to do something for my church so that future generations can also benefit from it and say, ‘Ah, this is what those who came before us did for our parish.’ I have been so uplifted spiritually.\n“I have learnt to work with a lot of people, being part of the organising committee and doing a lot of the running around and the responsibility of doing marketing, public relations, and resource mobilisation. It has truly been fulfilling and a challenge that I embraced and said, ‘Okay, I think if I use my talent for the benefit of the Church, I don’t think anything could be better.’ It has been more, more fulfilling for any individual than to be able to use your talent for the one who gave you that talent.\n“This church holds a lot of memories for me. I was baptised in this church and 50 years ago I had my wedding in this same church, I continue to serve the Lord in this church,” congregants said.\nSpeaking at the celebrations, guest of honour, Vice President General (Rtd) Dr Constantino Chiwenga, a devout Catholic himself, commended the Catholic Church for its contributions to education, health, and nation-building since the early days of colonial rule.\n“As a proud Catholic and a servant of the republic, I wish to underscore the significant role the Church has played in Zimbabwe’s development, particularly in education, health, and community upliftment,” he said.\n“A few examples of early schools include parishes and missions that sprouted across the country, from Makumbi and Musami to Gokomere, Kutama, and beyond, laying the foundation for a truly national episcopal presence. These contributions are aligned with our national vision of building an inclusive, empowered, and morally grounded society.",
            "time": "20:44",
            "date": "28 Jun 2025"
        },
        {
            "title": "Transmedia targets wider broadcast coverage with new transmitters",
            "href": "https://www.zbcnews.co.zw/transmedia-targets-wider-broadcast-coverage-with-new-transmitters/",
            "content": "Story by Peter Chivhima\nHARARE – Transmedia Corporation Private Limited says it is targeting to complete the installation of 10 transmitters as part of efforts to enhance broadcast coverage and improve signal availability, particularly in underserved areas.\nThis was announced by the company’s Chief Executive Officer, Engineer Adonia Mushosho during the 17th Annual General Meeting held in Harare this Friday.\n“FM radio coverage being the most widely used medium in rural communities remains a key focus. The objective is to ensure that all previously uncovered or underserved areas gain access to broadcasting, whether through national or community radio stations. We are also targeting the completion of ten transmitter installations across the country,” he said.\nPresent was the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, who noted the need for the nation to develop a comprehensive blueprint that ensures total broadcasting coverage across the country, reinforcing national sovereignty and access to information for all citizens.\n“Transmedia Corporation is responsible for our broadcasting signals. Therefore, there is a need for us as a nation to develop a comprehensive blueprint that ensures signal coverage reaches all corners of the country. It is also crucial to accelerate the migration from analogue to digital broadcasting,” the Minister said.",
            "time": "20:44",
            "date": "28 Jun 2025"
        }
    ]
}