{
    "news": [
        {
            "title": "ZANU PF Hails public and security services for maintaining order",
            "href": "https://www.zbcnews.co.zw/zanu-pf-hails-public-and-security-services-for-maintaining-order/",
            "content": "Story by Fairstars Mukungurutse\nTHE ruling ZANU PF party has commended the nation for heeding the call to disregard the March 31 planned protests.\nAddressing journalists in Harare this Tuesday, ZANU PF Secretary for Information and Publicity, Ambassador Christopher Mutsvangwa, applauded the peace-loving people of Zimbabwe for refusing to participate in Monday’s illegal demonstrations.\n“I want to congratulate the people of Zimbabwe for maintaining peace and order and for maintaining faith in the leadership of President Mnangagwa, but most importantly, for keeping the gospel of the revolution on the straight and the narrow,” he said.\n“Our people have fought a war. They are very wary of the trouble of mayhem because they know what it does, so they were cautious, it is called vigilance on their part. They wanted to see the depth, scale and scope of what the detractors were up to. So they were assessing the situation, that is what happened yesterday. They did not want to fall into the trap of those in Mozambique, in Maputo and then have unnecessary loss of life.\nAmbassador Mutsvangwa also paid tribute to the security services for ensuring peace across the country.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Matoranjera High School upgraded to boarding facility in Makonde",
            "href": "https://www.zbcnews.co.zw/matoranjera-high-school-upgraded-to-boarding-facility-in-makonde/",
            "content": "Story by Tamuka Charakupa\nA new boarding facility has been established in Makonde, Mashonaland West Province, amid expectations of enhanced learning outcomes in the community.\nMatoranjera High School has been upgraded to become the first boarding institution for Makonde Rural District Council.\nThe commissioning of the facility this Tuesday has been welcomed by the local community.\n“We are excited to be the pioneers of this initiative. What we liked most is the issue of discipline and commitment to quality learning,” a teacher said.\n“We are faced with a shortage of computers, but we are grateful that the government, through our minister for Mashonaland West Provincial Affairs and Devolution, Honourable Marian Chombo, has promised to deliver computers to this school,” another teacher said.\n“Our school was on the verge of closing because of a drop in enrolment and standards. We welcome this new development because it means that our infrastructure outlook will improve,” a teacher added.\nThe local leadership is convinced that the facility will promote the quality of education.\n“We are faced with a shortage of boarding schools in this district and, as a result, we are losing students to other provinces. We want to ensure that we keep our talented learners in the district so that we increase our pass rates. As a government, we are in partnership with our local authority to provide all the necessary support, including the provision of computers and digital wireless,” Makonde District Schools Inspector, Mr Solomon Katoma said.\n“Our plans going forward are to construct two more hostels so that we expand our enrolment,” Makonde Rural District Council Chief Executive Officer, Dr Paradzai Munyede said.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Insiza North Legislator, Cde Farai Taruvinga dies",
            "href": "https://www.zbcnews.co.zw/insiza-north-legislator-cde-farai-taruvinga-dies/",
            "content": "Story by Providence Maraneli\nINSIZA North Legislator, Cde Farai Taruvinga, has died at the age of 54.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "Isango community knowledge hub launched to boost conservation efforts",
            "href": "https://www.zbcnews.co.zw/isango-community-knowledge-hub-launched-to-boost-conservation-efforts/",
            "content": "By Mhlomuli Ncube\nA €600,000 Isango Community Knowledge Hub has been commissioned in a joint initiative between Zimbabwe and France, aimed at supporting conservation programmes.\nLocated in the heart of Hwange National Park, the hub will serve as a centre for knowledge-driven conservation efforts, bringing together local communities, academics, civil society, and government agencies.\nOfficially opened to the public on Monday, the facility will facilitate research, training, and collaboration in wildlife conservation, benefiting both scholars and conservationists.\n“This Hub will be important for all school children. We are now doing heritage-based education and it will provide an important platform to research and complete our school projects,” Hwange Junior Member of Parliament, Honourable Andile Thabo Chitungwa said.\nTo the French and Zimbabwean governments representatives, the initiative is testimony to the power of working together to drive development.\n“I am reliably informed that local schools summing up to 15 primary and eight secondary schools with a target of 8 000 pupils will benefit from the project’s capacity-building initiatives. For our beloved Zimbabwe to industrialise, to benefit from our mineral and agricultural resources, and to grow our economy, education, technology and development is the foundation.\n“Through strong and robust education, we can mould the thinkers, problem solvers and innovators who will steer the nation in developing new ideas, creating and using technology, and applying their knowledge to build our nation,” French Ambassador to Zimbabwe, Mr Paul Betrand Baretes said.",
            "time": "20:43",
            "date": "01 Apr 2025"
        },
        {
            "title": "ZRP dismisses claims of authorising illegal demonstrations",
            "href": "https://www.zbcnews.co.zw/zrp-dismisses-claims-of-authorising-illegal-demonstrations/",
            "content": "Story by ZBC Reporter\nTHE Zimbabwe Republic Police(ZRP) has dismissed as false information, social media claims that they have authorised illegal demonstrations planned by the country’s detractors.",
            "time": "20:43",
            "date": "01 Apr 2025"
        }
    ]
}