{
    "news": [
        {
            "title": "Govt extends deadline for November ZIMSEC exam fees payment",
            "href": "https://www.zbcnews.co.zw/govt-extends-deadline-for-november-zimsec-exam-fees-payment/",
            "content": "Story by Peter Chivhima\nTHE government has extended the deadline for the payment of the ZIMSEC November 2025 examination fees to May 16.\nThis was announced by the Minister of Primary and Secondary Education, Honourable Torerayi Moyo, on the sidelines of the Senate question and session at the New Parliament Building in Mt Hampden this Thursday.\n“The public examination fees were scheduled to be paid on or before March 28, but we received a request from Parliamentarians this afternoon that the date be extended. In consultation with the stakeholders, we have agreed that the date be extended to May 16,” the Minister said.",
            "time": "06:39",
            "date": "21 Mar 2025"
        },
        {
            "title": "Calls for stiffer penalties grow after Harare accident kills eight",
            "href": "https://www.zbcnews.co.zw/calls-for-stiffer-penalties-grow-after-harare-accident-kills-eight/",
            "content": "Story by Fairstars Mukungurutse\nHARARE residents have raised concerns over the increasing number of fatal accidents involving unlicensed commuter omnibus operators.\nThe latest tragedy occurred on Wednesday morning along Bulawayo Road, claiming eight lives, including Dzivarasekwa couple, Enock Chanengeta and Sophia Machema, who leave behind three children.\nWhen the ZBC News Crew visited their family home on Thursday, a sombre atmosphere prevailed as loved ones struggled to come to terms with the devastating loss.\nThe accident involved a commuter omnibus driven by an unlicenced driver, a haulage truck, and a Nissan UD truck.\n“As a family, we are devastated because they left three school-going children and we do not even have a clue how we are going to manage. The painful thing is that the driver did not have a license, now look at how it ended,” family spokesperson, Mrs Ronia Chanengeta said.\nResidents have voiced frustration over the gross negligence by commuter omnibus drivers, amid confirmation by the Zimbabwe Republic Police that the driver of the omnibus was unlicensed.\n“The problem with kombi drivers is that they leave the vehicle in the hands of unlicensed conductors and touts while they go about their business and this costs lives,” a resident said.\n“We appeal to the responsible authorities to bring to book all those who drive without licenses otherwise we are all going to perish,” another added.\nRepresentatives of transporters associations highlighted the urgent need to bring sanity to the public transportation business.\n“We are saying unlicensed individuals, touts, conductors and drivers must desist from driving at all costs. We also encourage kombi operators to join transporters associations so that their operations will be easily supervised and regulated and ensure the drivers receive proper training,” Harare Youth Transporters Association’s Chairperson, Mr Edmore Gwengwe said.\n“We encourage the government to enact a law that enables transport associations to regulate themselves so that every operator is closely monitored. We also appeal for stiffer penalties to those who are defying traffic regulations,” the National Coordinator for the Passengers Association of Zimbabwe, Mr Tafadzwa Goriati stated.\nRoad traffic accidents involving unlicensed drivers are on the increase with calls for stiffer penalties on reckless motorists fuelling road carnage.",
            "time": "06:39",
            "date": "21 Mar 2025"
        },
        {
            "title": "Govt pushes for new Occupational Safety and Health law",
            "href": "https://www.zbcnews.co.zw/govt-pushes-for-new-occupational-safety-and-health-law/",
            "content": "Story by Mercy Bofu-Matinha\nGOVERNMENT says it is pushing for the enactment of a new Occupational Safety and Health law expected to holistically address issues of safety at workplaces.\nThe Engineers’ Occupational Safety and Health (OSH) Workshop is currently underway in Masvingo, with the Minister of Public Service, Labour and Social Welfare Honourable Edgar Moyo having highlighted government’s concerns over occupational injuries and deaths.\n“The injury statistics over the past three-year period show a declining trend but, certainly remain highly elevated because of the loss of lives which is a major concern to the government. In this regard, the government will do everything possible to push for a new OSH law (The OSH Act) that should help us all as a nation to arrest this needless loss of lives at work as well as stop the horrendous experiences suffered by injured workers and their Families,” Honourable Moyo said.\nEngineers were also challenged to lead innovation and adopt technologies that revolutionise their approach to Occupational Health and Safety.\n“We are aware of the importance of OSH in fostering sustainable development. As a Province, we face unique challenges related to the safety of workers, particularly in industries such as mining, agriculture, and manufacturing. It is in this regard that the work you do as engineers and OSH professionals is invaluable,” Masvingo Minister of State for Provincial Affairs and Devolution, Honorable Ezra Chadzamira said.\n“Your expertise and commitment to safeguarding the health and safety of workers are central to creating a productive and secure working environment for all. The theme, “Occupational Safety and Health: Technology and the Future of Work,” is relevant in today’s ever-evolving industrial landscape. As technology continues to shape the future of work, it is crucial that we embrace these advancements to create safer and more efficient workplaces.”\nThe National Social Security Authority (NSSA) revealed that injury figures have been dropping for the past years and as an institution, they expect the OSH bill to harmonise all the OSH related laws.\n“The number one deliverable of the OSH bill is to harmonise all the small segments of legislations which currently exist in different sectors in our industry so that we have a single thrust which we can use and lay upon to leverage and make sure that we can supervise all the systems in terms of Occupational Safety and Health,” NSSA Board Chairman, Dr Emmanuel Fundira said.",
            "time": "06:39",
            "date": "21 Mar 2025"
        },
        {
            "title": "President Mnangagwa declares Harare road accident a national disaster, offers state-assisted funerals to victims",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-declares-harare-road-accident-a-national-disaster-offers-state-assisted-funerals-to-victims/",
            "content": "Story by ZBC News Reporter\nPRESIDENT Emmerson Mnangagwa has declared the road traffic accident which occurred in Harare Wednesday morning a national disaster.\nIn a statement, President Mnangagwa said the eight people who died in the accident will be accorded state-assisted funerals.\nThe President also consoled families of the deceased and wished the 11 injured victims a speedy recovery.\n“I express my heartfelt sympathy and condolences to families and relatives who have lost their loved ones as well as prayerfully wish all those injured and hospitalised a speedy recovery.”\nThe President also called on motorists to always be alert and adhere to traffic rules, some of which have changed following the harmonisation of rules and policies under the SADC Protocol on Transport, Communications and Meteorology.\n“I call upon the commuting public and transport operators to avoid using intersections and other dangerous spots along the roads as pick-up and drop-off points. I also appeal to all motorists to avoid reckless driving and to exercise extreme caution for the safety of all road users,” the President said.",
            "time": "06:39",
            "date": "21 Mar 2025"
        },
        {
            "title": "Several feared dead in early morning collision at Dzivarasekwa turn-off",
            "href": "https://www.zbcnews.co.zw/several-feared-dead-in-early-morning-collision-at-dzivarasekwa-turn-off/",
            "content": "Story by Fairstars Mukungurutse\nSEVERAL people are feared dead and others seriously injured following a tragic accident early Wednesday morning at the Dzivarasekwa turn-off along Bulawayo Road. The collision involved a commuter omnibus, a haulage truck, and a UD truck.\nThe Dzivarasekwa turn-off area has become notorious for frequent fatal accidents.",
            "time": "06:40",
            "date": "21 Mar 2025"
        }
    ]
}