{
    "news": [
        {
            "title": "Ministers visit injured tourists after Rovos train accident",
            "href": "https://www.zbcnews.co.zw/ministers-visit-injured-tourists-after-rovos-train-accident/",
            "content": "Story by Lisa Masuku-Kurira\nTHE Minister of Tourism and Hospitality Industry, Honourable Barbara Rwodzi, together with the Minister of State for Provincial Affairs and Devolution for Bulawayo, Honourable Judith Ncube, visited injured crew members from the Rovos Rail train accident who are currently admitted at Mater Dei Hospital in Bulawayo and Gwanda Hospital.\nDuring the hospital visits, the ministers interacted with the accident victims, who were all reported to be in stable condition.\nMany of the tourists expressed deep appreciation for the warmth and care they received from Zimbabwe’s medical professionals and citizens.\nOne of the accident survivors, Cherilo Fagan, a tourist from California, USA, remained in high spirits despite her unexpected detour to a hospital bed.\n“You guys are lovely, I must say. The love and warmth have been really amazing,” Fagan said.\nWith her goal being of touring all the continents, the American national is eager to explore the country’s magnificent falls,\n“We started off in Capetown. The goal was to get to Victoria Falls. Then things happened. I have a goal to visit all the continents. I grew up travelling, so I saved up my money to make sure I get to realise my dream of travelling all the continents,” Fagan said.\nOf the 47 international tourists who were involved in a train accident, four of them were doctors, and these helped calm the situation before those who were injured were ferried to the hospital.\n“Among all of us, we discovered that there were four doctors on the train. This helped a lot. Above all, the Zimbabwean Police and medical experts acted swiftly. This is one of the main factors that contributed to ensuring there were no fatalities,” another tourist, Peter Anderson said.\nHearing all the positive reviews from interacting with the train accident victims, the government said Zimbabwe’s policy of being a friend to all and an enemy to none is bearing fruit.",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "National Prosecuting Authority enhances prosecutor efficiency in Mashonaland Central",
            "href": "https://www.zbcnews.co.zw/national-prosecuting-authority-enhances-prosecutor-efficiency-in-mashonaland-central/",
            "content": "Story by Tapiwa Machemedze\nTHE National Prosecuting Authority (NPA) is ramping up efforts to strengthen its workforce and enhance service delivery, with prosecutors in Mashonaland Central Province already reaping the benefits of these initiatives.\nAs part of its latest efforts to improve employee welfare, the NPA has provided a new staff bus to the Bindura Magistrates Court to address longstanding transport challenges faced by prosecutors.",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "Fake job adverts lure desperate job seekers into scam",
            "href": "https://www.zbcnews.co.zw/fake-job-adverts-lure-desperate-job-seekers-into-scam/",
            "content": "Story by Theophilus Chuma, Investigative Editor\nA syndicate of recruiting agents is prowling on desperate job seekers, fleecing them of their hard-earned cash through non-existing job promises.\nThe adverts are printed in bold black and white, listing what appear to be attractive packages for job seekers that include accommodation and a starting salary of between US$200 and US$300 for a post as a security guard or shop merchandiser.\nAdverts are strategically placed across residential suburbs, waiting for the next catch on innocent victims who are made to pay an agent consultation fee of US$40 before they can be linked to the job.\n23-year-old Hazvinei Foroma (not her real name) is among many lured into this web of fake promises.\n“I got the number of the agent from a WhatsApp group and contacted them over a job that was said to be in a supermarket. He asked for US$40 but I told him I had US$20, which I paid on the agreement I was going to pay the balance after I got my first salary,” she said.\nBut there is no guarantee that after paying this fee, the job will be available.\n“I was told to go and start work on a Monday, but when I got to the place, I was told a different story,” another victim said.\nAfter hearing this story, the ZBC News placed a call to the agent.\nThe conversation with the agent seals the fears from a previous engagement with another recruiting agent.\nHe had demanded cash payment before he could provide details of the job.\nThe job adverts were not clear on the number of candidates needed for the vacancy, leaving the possibility of the agent collecting more money for a non-existing placement.",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "ZITF 2025 to spotlight Second Republic’s rural industrialisation vision",
            "href": "https://www.zbcnews.co.zw/zitf-2025-to-spotlight-second-republics-rural-industrialisation-vision/",
            "content": "Story by Lisa Masuku\nTHE 65th edition of the Zimbabwe International Trade Fair slated for April 21 to April 26 in Bulawayo is set to amplify the Second Republic’s rural industrialisation agenda through the first-ever rural industrialisation conference.\nDubbed the “Blue Sapphire” edition, the country’s biggest trade showcase is set to host an inaugural rural industrialisation conference on April 22.\nThe first-ever rural industrialisation conference is spearheaded by the Ministry of Industry and Commerce as part of efforts to promote inclusivity, ensuring no one and no place is left behind.\n“On April 22 we have the rural industrialisation conference. It’s an inaugural one, spearheaded by the parent ministry, the Ministry of Industry and Commerce,” ZITF CEO, Dr Nicholas Ndebele said.",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "Chiredzi fire incident claims one life, leaves trail of destruction",
            "href": "https://www.zbcnews.co.zw/chiredzi-fire-incident-claims-one-life-leaves-trail-of-destruction/",
            "content": "Story by Gay Matambo\nA fire tore through a home in the Lyonnaise area of Chiredzi on Sunday evening, claiming the life of one unidentified individual and destroying property worth an undetermined amount.\nAccording to eyewitnesses, the blaze broke out around 1830 hours and quickly engulfed the entire house.\nOne person, whose identity is not yet confirmed, was reportedly trapped inside and died after being burnt beyond recognition.\n“We were sitting outside when we suddenly saw the front window shatter and flames erupt from inside. The fire spread so fast, in just a few minutes, the entire house was gone. There was nothing we could do,” one witness said.\nAnother resident, who was a tenant in the house, recounted their narrow escape.\n“I only managed to grab a bag with my child’s clothes. Everything else was lost in the fire.”",
            "time": "18:35",
            "date": "19 Apr 2025"
        }
    ]
}