{
    "news": [
        {
            "title": "Mat North undergoes massive transformation through infrastructure development",
            "href": "https://www.zbcnews.co.zw/mat-north-undergoes-massive-transformation-through-infrastructure-development/",
            "content": "Story by Tichaona Kurewa\nMatabeleland North Province has made significant strides in infrastructure development, with a range of new projects shaping its future.\nOn the energy front, the 42-kilometre Deka Water Pipeline to Hwange Unit 7 & 8 power plant was commissioned after being constructed at a cost of US$48.1 million.\nPlans are also underway to develop a green belt along the aqueduct from the Zambezi River.\nThe 60-kilowatt Bemba solar project in Tsholotsho District was also commissioned, while the ground-breaking ceremony for the Titan New Energy 720MW thermal power plant in Hwange marked a momentous milestone.\nThe Kamativi Mining Company’s first-phase lithium processing plant was completed in Hwange District.\nBravura Lithium Mine is assembling a new plant in the area, with mining operations expected to commence this year.\nThe successful turnaround of the Hwange Colliery Company has revitalised the province’s mining sector, confirming huge developments in the mining sector in 2024.\nThe Bubi-Lupane and Bulawayo Kraal Irrigation Schemes are bolstering the province’s food security efforts.\nFurthermore, four chiefs from Binga District received fishing rigs under the Presidential Fisheries Programme, complementing agricultural initiatives to enhance food security in the region.\nOn the tourism front, to capitalise on the growing demand for tourism in Victoria Falls, investors have injected over US$60 million in upgrading and expanding accommodation facilities, further enhancing the region’s appeal.\nIn the health sector, construction of the Lupane Provincial Hospital continues with significant progress having been recorded.\nSeveral clinics, including Leona Clinic in Hwange District, were commissioned to improve primary healthcare service provision.",
            "time": "18:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Five years after Cyclone Idai: Stories of resilience and recovery",
            "href": "https://www.zbcnews.co.zw/five-years-after-cyclone-idai-stories-of-resilience-and-recovery/",
            "content": "Story by Theophilus Chuma\nFive years after the devastating Cyclone Idai, victims of the natural disaster reflect on the critical interventions by government and development partners that have been pivotal in restoring normalcy.\nGogo Chikuni struggles to walk, taking small steps at a time, as she moves to her kitchen hut.\nLife has dealt her a heavy blow after she suffered a stroke right after the devastating Cyclone Idai floods that swept away her homestead in 2019.\nAs she reflects on the day of the disaster, she is also grateful for the support she has received to repair the damage.\n“It was the most difficult moment of my life, but I want to thank government and MeDRA for the support they gave me. Yes, the disaster happened but the house that I have now is much better than the one I had before,” she said.\nThis is a story shared by many in Buhera District’s Ward 15, whose livelihoods were severely impacted by the flooding.\nGogo Caroline Mukushwa tells how the rehabilitation programme implemented by government through the Methodist Relief and Development Agency (MeDRA) has been important in restoring livelihoods.\nShe said, “I had lost hope but now I am very confident about the future. My life is now back on track. I am very grateful.”\nStep by step, livelihoods are being restored as many are now able to start income-generating projects.\nThe focus is now on ensuring the community is empowered through resilience programmes.",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Infrastructure development changes face of Harare",
            "href": "https://www.zbcnews.co.zw/infrastructure-development-changes-harares-face/",
            "content": "Story by Bruce Chahwanda\nHARARE province has witnessed massive infrastructure development in 2024 with roads and houses being constructed alongside an industrial boom which has changed the face of the capital city.\nEntrenching the Second Republic’s thrust of Nyika inovakwa nevene vayo/Ilizwe lakhiwa ngabanikazi balo, Harare metropolitan province has been one of the major beneficiaries of infrastructure development in 2024.\nThe rolling out of housing projects through public private partnerships saw housing targets being met on time while road infrastructure refurbishment and construction ahead of the 44th SADC Summit has been one of the major success stories.\nThe completion of Robert Mugabe International Airport VVIP pavilion, pharmaceutical warehouse, Varun Beverages expansion programme and the Champion Foods Milling Plant were among the signature projects in the province.\nThe ongoing construction of the colossal Trabablas Traffic Interchange is also progressing well as the humongous project nears completion.\nUpon completion in the next few months, the structure which is the biggest outside South Africa, will change the face of the city with other roads already open to traffic as the focus shifts to the final touches.",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Government set to unveil new child online protection policy",
            "href": "https://www.zbcnews.co.zw/government-set-to-unveil-new-child-online-protection-policy/",
            "content": "Story by Tichaona Kurewa\nThe government is developing a comprehensive Child Online Safety Policy, expected to be finalised by the first quarter of the new year.\nThe policy is meant to create a safe online environment for children and adolescents, addressing concerns around cyber-bullying, online grooming, exposure to harmful content, and data privacy violations.\nThe Permanent Secretary in the Ministry of Information Communication Technology, Postal and Courier Services, Dr Beaullah Chirume indicated that a public consultation process has since been instituted to gather information from various stakeholders on the proposed policy.",
            "time": "18:29",
            "date": "01 Jan 2025"
        },
        {
            "title": "Transport operators urged to shun unreasonable daily targets",
            "href": "https://www.zbcnews.co.zw/transport-operators-urged-to-shun-unreasonable-daily-targets/",
            "content": "Story by Fairstars Mukungurutse\nTRANSPORT operators have been urged to desist from setting unreasonable targets which are exerting unnecessary pressure on drivers, leading to an increase in road traffic accidents.\nWith statistics indicating that 94 percent of road accidents are due to human error, the Traffic Safety Council of Zimbabwe (TSCZ) has implored transport operators to shun unreasonable daily targets for drivers as they end up defying road rules and regulations.\n“We urge transport operators to avoid giving hard targets. When you do an analysis of the accidents, particularly during this festive season, they are a result of speeding, and we believe they are a result of targets given to drivers that forces the driver to go beyond their limits. Our appeal to operators is to avoid giving those targets, they are not helpful, they endanger passengers,” said TSCZ’s managing director, Mr Munesu Munodawafa.\nAcknowledging the risk associated with high daily targets, local transport operators highlighted measures put in place to curb road carnage during the crossover into the New Year.\n“We have a team which engages even the passengers on board because they spend more time with the drivers than us. We urge them to report to us whenever they feel like their lives are in danger and we take action,” said transport operator, Dr Afra Nhanhanga.",
            "time": "18:29",
            "date": "01 Jan 2025"
        }
    ]
}