{
    "news": [
        {
            "title": "Govt assures citizens of peace and safety",
            "href": "https://www.zbcnews.co.zw/govt-assures-citizens-of-peace-and-safety/",
            "content": "Story by Farai Gwaze\nGOVERNMENT has assured the public of peace and safety across the country, warning that those bent on causing chaos will be dealt with accordingly.",
            "time": "08:40",
            "date": "30 Mar 2025"
        },
        {
            "title": "Masvingo province denounces calls for illegal demonstrations",
            "href": "https://www.zbcnews.co.zw/masvingo-province-denounces-calls-for-illegal-demonstrations/",
            "content": "Story by Mercy Bofu-Matinha\nMASVINGO province has denounced individuals and groups that are inciting citizens to participate in illegal demonstrations and unlawful activities.\nSpeaking at a press briefing in Masvingo, the Minister of State for Provincial Affairs and Devolution, Honorable Ezra Chadzamira said the illegal demonstrations being planned undermine the prevailing security, peace, and stability in the province and the country at large.",
            "time": "08:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "ZBC scoops five awards for excellence in road safety reporting",
            "href": "https://www.zbcnews.co.zw/zbc-scoops-five-awards-for-excellence-in-road-safety-reporting/",
            "content": "Story by Fungai Jachi\nTHE Zimbabwe Broadcasting Corporation (ZBC) glitters at the 9th edition of the Road Safety Journalistic Awards ceremony, scooping five awards in recognition for the outstanding work as far as road safety is concerned.\nIt was a night of celebration and pride for the Zimbabwe Broadcasting Corporation (ZBC) as they were.\nThe national broadcaster scooped five awards including the Best Electronic Media Reporter of the year awarded to News reporter Peter Chivhima and John Nhandara was the first runner-up in the same category.\n“It is an honour to receive this award. It is for the entire ZBC News crew because the news gathering process is teamwork. We shall continue doing our job and road users should always be mindful of each other on the road,” Chivhima said.\nZBC was the First Runner Up in the Best Media House of the Year in the Broadcast category while ZBC Montrose Studios received the Chairman’s Honorary award.\nStakeholders acknowledged the role of the media in road safety.\n“We acknowledge the work that the media does and we hope that they will continue to raise awareness as well as proffer solutions to the challenges that are faced on our roads,” Traffic Safety Council of Zimbabwe’s Board Chairperson, Mr Bishop Kura Sibanda said.",
            "time": "08:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "Govt reaffirms commitment to law and order",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-law-and-order/",
            "content": "Story by Tafara Chikumira\nTHE government has dismissed social media characters who are pushing for nationwide demonstrations on March 31, saying law enforcement agents are ready to thwart such rogue elements.\nGovernment spokesperson, who is also the Minister of Information Publicity and Broadcasting Services, Dr Jenfan Muswere says Zimbabweans should ignore utterances by Blessed Geza who was recently expelled from the ruling ZANU PF party for his unbecoming behaviour.\n“We have witnessed some hallucinations by some members of the public and in particular one Zimbabwean going by the name Geza,” Dr Muswere said.\n“Let it be put on record that this country is a safe haven. I am speaking to you now as the official government spokesperson that, come Monday, it shall be business as usual.\n“All schools shall be open, and all businesses shall be open. We can not be held at ransom by some cybersecurity bullies. We are in the process of crafting legal instruments to deal with cyberbullying. This shall come to an end as we seek to put an end to stupid acts by such kind of individuals.”\nDr Muswere says law enforcement agencies will be on the lookout to deal with any rogue elements who might seek to disturb the peace and tranquility prevailing in the country.",
            "time": "08:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "ZRP assures public of safety and peace",
            "href": "https://www.zbcnews.co.zw/zrp-assures-public-of-safety-and-peace/",
            "content": "Story by ZBC Reporter\nTHE Zimbabwe Republic Police (ZRP) has today confirmed that the security situation across the country remains peaceful and conducive for citizens to continue with their daily activities.\nIn a statement, the ZRP assured the public that there is no threat to public safety and security, stressing that individuals can freely travel to their workplaces, schools, and places of worship.\nThe Police also called on the public to disregard misleading and false messages circulating on social media that attempt to create panic or misrepresent the state of law and order in the country.\nThe ZRP emphasised that there will be no disruptions in the movement of citizens, including entry into Central Business Districts (CBDs), with the public assured of their safety while conducting their daily activities.\nThe statement made it clear that no individual or group will hinder citizens from going to work, attending school, or engaging in other lawful activities under the guise of demonstrations or strikes.",
            "time": "08:41",
            "date": "30 Mar 2025"
        }
    ]
}