{
    "news": [
        {
            "title": "Zim celebrates progress in promoting gender equality and women’s empowerment",
            "href": "https://www.zbcnews.co.zw/zim-celebrates-progress-in-promoting-gender-equality-and-womens-empowerment/",
            "content": "Story by Kenias Chivuzhe\nTHE International Women’s Day commemorations, held this Friday in Marange, Manicaland Province, provided an opportunity to reflect on the progress made in advancing gender equality and empowering women.\nThousands of individuals gathered at Munyarari Primary School in Marange, Mutare Rural, where women expressed their gratitude for the support received from both the government and development partners in furthering their empowerment.\n“We are appreciative of the support for us women with disabilities to start business ventures. We are being supported to start agricultural projects. The inclusive development thrust by President Emmerson Mnangagwa is transforming our lives,” a community member said.\n“The empowerment drive has capacitated us not to over-rely on men for survival. The empowerment programmes are improving our worth in society. We also want to thank the Women’s Bank for giving us money to start businesses. The support has transformed my life,” another added.\nDevelopment partners reflected on the strides made in the promotion of gender equality and women empowerment in Zimbabwe.\n“Zimbabwe has shown promising progress in advancing women’s equality. We will continue to support gender equality in our collaborative efforts. We want to guarantee access to technology and support the fight to end all forms of violence against women. Let us commit ourselves to promote gender equality and empowerment,” United Nations Resident Coordinator His Excellency Edward Kallon said.\n“Through the Team Europe initiative on gender equality, we are supporting this cause with over €280 million from 2021 to 2027. We also recently committed an additional €7 million to further strengthen these efforts.\n“Additionally, the European Investment Bank and STANBIC Bank have launched a €20 million gender facility to provide loans to women-owned businesses. This is because we believe that by investing in women, we are investing in Zimbabwe’s future,” Swedish Ambassador to Zimbabwe Mr Per Lindgarde stated.\nThe government says while empowerment initiatives are bearing fruit, priority should also be on fighting vices such as discrimination, child sexual exploitation and gender-based violence.\n“As Manicaland province, we are enjoying investments aiming to uplift the lives of women. Jopa Safe Market, Hauna Processing Plant, Cynara Diary and Chikanga mushroom project are some of the flagship investments brought to the province to uplift women. We are proud that impactful change is noticeable among these and many women in Manicaland.",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Govt commits to closing gender gap in technology sector",
            "href": "https://www.zbcnews.co.zw/govt-commits-to-closing-gender-gap-in-technology-sector/",
            "content": "Story by Fungai Jachi\nTHE government has reiterated its commitment to implementing inclusive policies aimed at closing the gender gap and ensuring greater female participation in the technology sector.\nSpeaking during an interview on the sidelines of the Women in ICT Conference held in Harare this Friday, the Minister of Information Communication Technology, Postal and Courier Services, Honourable Tatenda Mavetera, emphasised that promoting the involvement of girls and women in ICT remains a key priority for the government.\n“As the government, we are committed to ensure that we promote the uptake of ICTs. Women are doing the most, whether through ground breaking Artificial Intelligence research, inclusive digital policies, or grassroots technological education,” she said.\n“Women are proving that technology thrives when diverse voices lead. Gender gaps in STEM education exist but I reaffirm our commitment to dismantling these barriers through a lot of programmes including the She Tech Initiative.\n“We are expanding access to ICT scholarships, scaling mentorship programmes for young women and funding initiatives that empower female-led tech startups. Together, we will build a sector where talent not gender defines opportunity,” she said.\nWomen in the ICT sector are grateful for opportunities being created by the Second Republic in the digital space.\n“We have a lot of talented girls and women in the country and being given space to showcase what one can do is commendable,” a participant said.",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Professor Khumbulani Mpofu installed as Solusi University’s 4th Vice Chancellor",
            "href": "https://www.zbcnews.co.zw/professor-khumbulani-mpofu-installed-as-solusi-universitys-4th-vice-chancellor/",
            "content": "Story by Aifheli Mudau\nProfessor Khumbulani Mpofu has been installed as the 4th Vice Chancellor of Solusi University.\nAccepting his post, Professor Khumbulani Mpofu said he is glad to be part of government’s new transformation and development thrust, which acknowledges institutions of higher learning’s contribution to national development.\n“As a university, we should be able to proffer solutions to the problems affecting communities around us and at the same time evangelism should move together with education, especially innovation as we work together with government,” he said.\nThe Minister of Higher and Tertiary Education, Innovation, Science and Technology Development, Ambassador Fredrick Shava urged universities to be innovative and embrace the 5.0 model as a revolutionary approach to the socio-economic transformation.\n“2025 was declared a year of commercialisation and as such, I urge you to be innovative and equip all students with the necessary knowledge that meets the requirements of 5.0 model,” he said.",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Police launch manhunt for Mutimurefu Prison escapees",
            "href": "https://www.zbcnews.co.zw/police-launch-manhunt-for-mutimurefu-prison-escapees/",
            "content": "Story by Peter Chivhima\nA manhunt has been launched for two inmates who escaped from Mutimurefu Prison in Masvingo this Wednesday.\nThe escapees have been identified as Feliciano Simango, also known as Fidelis Jorum Mauyangwe, and Never Matoma.\nZimbabwe Prison and Correctional Service(ZPCS) National Spokesperson, Assistant Commissioner Meya Khanyezi confirmed the incident, stating that the escape occurred during a supervised work assignment outside the prison facility.\nThe inmates reportedly took advantage of the situation to unlawfully gain access to a ZPCS vehicle, which they used to flee.",
            "time": "06:27",
            "date": "08 Mar 2025"
        },
        {
            "title": "Cde Luka Phiri described as a development champion",
            "href": "https://www.zbcnews.co.zw/cde-luka-phiri-described-as-a-development-champion/",
            "content": "Story by Tamuka Charakupa\nLIBERATION war hero, Cde Luka Phiri, who died at the age of 72 was declared Mashonaland West Provincial Hero and was buried in Kadoma this Thursday.\nFamily and friends described the late cadre as a family man and development champion for his community.\n“As a family, we are thankful to President Emmerson Mnangagwa for awarding us this honour. We did not know that his works were being noticed and now we intend to carry on with his legacy, a legacy of uniting communities and driving development,” his wife, Gogo Magret Phiri said.\n“We worked closely with the late comrade. He was an active member of the ruling party, ZANU PF. We have lost someone who was passionate about development,” ZANU PF, Central Committee member, Cde Absolom Zvidzai said.\nWar veteran, Cde Zachariah Ziyambi, who worked closely with the late liberation war hero during the struggle for independence thanked the Second Republic for implementing an inclusive development agenda.\nThe Minister of State for Mashonaland West Provincial Affairs and Devolution, Honourable Marian Chombo said the province has been robbed of a development-oriented leader.\n“On behalf of Mashonaland West Province, I would want to thank our President for affording us this honour. This testifies to the works done by the late cadre dating back to the war of liberation to the present day. Cde Phiri was a developmental-oriented leader who was passionate about the development of his community. His notable works include the establishment of Ingezi Housing Schemes which has since grown,” she said.",
            "time": "06:27",
            "date": "08 Mar 2025"
        }
    ]
}