{
    "news": [
        {
            "title": "Women’s League endorses President Mnangagwa’s leadership",
            "href": "https://www.zbcnews.co.zw/womens-league-endorses-president-mnangagwas-leadership/",
            "content": "Story by Tendai Munengwa\nTHE ZANU PF Women’s League and the female Ministers unanimously endorsed the 2030 resolution to allow President Emmerson Mnangagwa to remain in office and see through his Vision of achieving an upper-middle-income society.",
            "time": "18:36",
            "date": "07 Feb 2025"
        },
        {
            "title": "AFZ pilot dies in aircraft crash",
            "href": "https://www.zbcnews.co.zw/afz-pilot-dies-in-aircraft-crash/",
            "content": "Story by Peter Chivhima\nAN Air Force of Zimbabwe K-8 trainer aircraft has crashed in Guinea Fowl, Gweru, killing a trainee pilot.\nIn a statement released by the Zimbabwe Defence Forces this Thursday, Commander Zimbabwe Defence Forces General Philip Valerio Sibanda said the ZDF is saddened by the death of Air Lieutenant Nesbert Tambudza.\nGeneral Sibanda added that the entire ZDF is mourning the sad loss of a talented pilot who was on a solo consolidation general handling navigation training.\nThe late Air Lieutenant was selected to undergo a jet flying conversion training course at Number 2 Squadron, Josiah Tungamirai Air Force Base in Gweru, and was in the final phase of training on the K-8 jet.\nThere were no civilian casualties or damage to property on the ground.\nThe AFZ has constituted a Board of Inquiry to investigate the cause of the accident.\nMeanwhile, Commander Air Force of Zimbabwe Air Marshal John Jacob Nzvede, presided over a handover and takeover ceremony at Manyame Air Base this Thursday.\nThe event saw Air Commodore Elisha Masakadza officially handing over the command to Air Commodore Ernest Matsambira.\n“I want to thank the Manyame Airbase community for supporting me during my tenure as the Base Commander,” Air Commodore Masakadza said.\n“I therefore promise to continue driving the base to another level of proficiency. I am fully aware of the limited resources versus the base tasks, but through teamwork, coordination, and communication, we can overcome these challenges. I urge members to remain professional and disciplined, and to work together for the success of the base,” Air Commodore Matsambira added.\nAir Marshal Nzvede emphasised the critical role of teamwork and unity within the AFZ.\n“I have emphasised the need for teamwork and leadership in view of the pending tasks that need to be attained by the Base. This change of command has come at a time when the modernisation of the Air Force of Zimbabwe has gathered momentum,” said Air Marshal Nzvede.",
            "time": "18:36",
            "date": "07 Feb 2025"
        },
        {
            "title": "Wetlands management key in achieving Vision 2030 – Govt",
            "href": "https://www.zbcnews.co.zw/wetlands-management-key-in-achieving-vision-2030-govt/",
            "content": "Story by Tichaona Kurewa\nTHE Government has underscored the centrality of sustainable wetlands management in achieving Vision 2030, noting the need for a holistic approach to protecting the ecosystem.\nThis came out during the 2025 National Wetlands Day commemorations held in Hwange District this Thursday.\nThis year’s commemorations also come at a time when the City of Victoria Falls has been designated a Wetland City by the Ramsar Convention on Wetlands.\nDefence Minister, Honourable Oppah Muchinguri Kashiri, who was representing President Emmerson Mnangagwa at the Wetlands Day celebrations in Kasibo Village, indicated the centrality of sustainable wetlands management in achieving Vision 2030.\n“Through the involvement of the youths, we can foster a new generation of environmental stewards committed to preserving this critical ecosystem and creating the future we all want.”\nZimbabwe is committed to meeting all its obligations under the Wetlands Convention.\n“Zimbabwe is one of the 173 member states to the Treaty on Wetlands, having ratified the treaty in 2014. We are fully committed to meeting its obligations of ensuring sustainable wetlands management through preserving their regenerative capacities and maintaining their pristine state. As such, conservation and wise use of wetlands is a vital pillar of our National Development Strategy,” Honourable Muchinguri Kashiri said.\nThe Ramsar Convention commended Zimbabwe for preserving marshlands as witnessed at Kasibo Wetland under Chief Hwange.\n“I am impressed with what I saw, it shows the country’s commitment to the preservation of wetlands. In most cases when there is a drought like what we witnessed last year, normally wetlands dry, but here, the wetland has not dried up. I would love the world to come and see for themselves what I saw,” the Secretary General for the Ramsar Convention on Wetlands, Dr Musonda Mumba said.\nThe importance of wetlands in people’s livelihoods was also brought to the fore.\n“Wetlands are a source of livelihood as people can get water for Irrigation and other uses. From wetlands people also get fish and other plants hence communities need to preserve wetlands. Since 1990, the world has lost 64 percent of wetlands and deliberate effort must be made to preserve the remaining wetlands and work towards reviving those that dried up,”  the Minister of Environment, Climate and Wildlife, Honourable Sithembiso Nyoni said.\n“We are deeply committed to the preservation of wetlands as traditional chiefs. We are custodians of the wetlands and it is our responsibility to teach our communities the importance of wetlands,” Chief’s Council president, Chief Mtshane Khumalo added.",
            "time": "18:36",
            "date": "07 Feb 2025"
        },
        {
            "title": "School feeding programme improves turnout at schools",
            "href": "https://www.zbcnews.co.zw/school-feeding-programme-improves-turnout-at-schools/",
            "content": "Story by Providence Maraneli\nRURAL schools in Matabeleland South province have benefited from the government’s school feeding programme, which has reduced dropouts, and absenteeism and bolstered the fight against stunting in once marginalised communities.\nThe clock strikes 1324 hrs at Ntalale High School in Gwanda South of Matabeleland South province and a young student, Forget Nyathi is anxiously waiting for something that has become a crucial part of the day at the school.\nAs each minute goes by, the concentration levels drop.\nWith his eyes fixated to the digital clock on the wall, this boy’s face suddenly changes with a ball of nerves filled with excitement listening to the school bell.\nHe quickly gets up and joins a long queue that is already forming just outside his classroom.\nIn no time, his peers are eating what is on the day’s menu and each gulp matters to him as parents are still recovering from the last drought.This is the mandatory school feeding programme that has been introduced by the government to counter the effects of drought in schools.\n“I am so happy that we eat at school, and I want to come every day,” he says.“I walk from Mawaza and if I don’t eat at school I get home tired and hungry but thanks to the government we eat here. Some learners would want to take medication at school now they can because we eat here.”\nBeyond the nourishment, the school feeding programme has recorded major inroads in curbing absenteeism and school dropouts with many schools in the province recording an average of 96 percent attendance.\n“Absenteeism is now a thing of the past, everyone now is coming and confident because they would have eaten,” Gwanda Junior councilor Ruth Mpofu says.\n“The attendance has tremendously improved compared to the preschool feeding programme, we are assured that we teach all our concepts from Monday to Friday, with everyone in attendance,” Zhampale Primary School Head, Mr Vusumuzi Makheto said.\nThe mandatory school programme has uplifted the burdens on the shoulders of parents who were battling last year’s ravaging elnino-induced drought.“Some children travel long distances and you would be assured that children can walk because there is food at school, we are so grateful to the government,” said one parent.\nThe programme has also aided in the fight against anemia in young girls.\n“The feeding programme is playing a major role in the fight against anemia especially in adolescent girls of school going age, this is a condition that is usually caused by poor diet and with it girls might fail to concentrate at school. So there is a relationship between nutrition and academic performance,” Matabeleland South Provincial Education Director, Mrs Beatrice Manjere noted.\nGovernment introduced the mandatory school feeding programme to improve the nutrition and welfare of children.",
            "time": "18:36",
            "date": "07 Feb 2025"
        },
        {
            "title": "NDS1 pushing for enhanced economic trade under foreign policy",
            "href": "https://www.zbcnews.co.zw/nds1-pushing-for-enhanced-economic-trade-under-foreign-policy/",
            "content": "Story by Oleen Ndori\nTHE Government says the country’s foreign policy aligned with the National Development Strategy One is meant to guarantee Zimbabwe’s sovereignty while pushing for the exchange of ideas, trade, and culture.\nThis was revealed by Foreign Affairs and International Trade Minister, Professor Amon Murwira when he presented a lecture at the Zimbabwe Staff College this Thursday.\nPresenting the lecture, Professor Murwira said the country’s foreign policy is built on six major reference points that include the ‘Friend to All and Enemy to None, Leaving No One and No Place Behind as well as the Zimbabwe is Open for Business mantra.\n“We have codified our foreign relations and international cooperation doctrine that provides general guidelines for Zimbabwe’s Foreign Policy based on His Excellency, the President’s decisions on our international relations in compliance with the constitution of Zimbabwe, the doctrine is founded on parameters or points of reference that serve to guide foreign policy development and application.\n“These are: (i) Zimbabwe is a friend to all and enemy to none; (ii) Leaving no one and no place behind; (iii) Nyika inovakwa nevene vayo/iLizwe lakhiwa ngabanikazi balo; (iv) Zimbabwe is open for business; (v) Chimurenga chepfungwa/Umvukela Wengqondo and (vi) Zimbabwe will forever be a sovereign and independent state,” Professor Murwira said.",
            "time": "18:36",
            "date": "07 Feb 2025"
        }
    ]
}