{
    "news": [
        {
            "title": "NDS1 interface in Mash West highlights gains and gaps in implementation",
            "href": "https://www.zbcnews.co.zw/nds1-interface-in-mash-west-highlights-gains-and-gaps-in-implementation/",
            "content": "Story by Tamuka Charakupa\nCHINHOYI-PROVINCIAL heads in Mashonaland West met this week to assess progress under the National Development Strategy One (NDS1), with the engagement highlighting key achievements and the continued need for collaboration under the whole-of-government approach.\nThe interface, held in Chinhoyi, provided a comprehensive review of sectoral performance as Zimbabwe accelerates its march towards Vision 2030.\nOne of the key milestones presented was in the agriculture sector, with winter wheat production exceeding expectations.\n“On wheat production, the province has surpassed the target of 34 500 hectares by 3 % to 35 525. Our concern, however, is on the late disbursement of PIP inputs. If these were given on time, we could easily surpass our average target yield on 5.5 tonnes per hectare; however, a 5.2 tonnes per hectare target is possible,” Mashonaland West Provincial Agritex Officer, Mrs Evelyn Ndoro said.\nOn the tobacco front, the province is poised to benefit from the ongoing marketing season, with several contractors already operating.\n“Harvesting of summer crops is tailing off, with most farmers now threshing and marketing. Tobacco marketing is ongoing, with 19 contractors buying tobacco in the past week. As a province, our mass is 97 million kilograms with a value to date of 314,357 USD. However, 23 percent of the planted area still has stalks standing. Four teams comprising TIMB, Plant Quarantine, and Agritex are on the ground in Makonde, Zvimba, and Hurungwe districts, following up with errant farmers,” Mrs Ndoro added.\nHowever, concerns were raised in the health sector, with malaria remaining a persistent challenge. Since January, the province has recorded over 23 000 cumulative cases and 75 deaths.\n“We continue to emphasise preventive care and community health outreach to reduce avoidable deaths. Makonde leads with 28 deaths, followed by Hurungwe with 22. Risk communication and community engagement activities are ongoing, including health education, distribution of IEC materials at clinics and in communities, weekly radio campaigns on Platinum FM, and mobile outreach across all districts,” said Provincial Medical Director, Dr Celestino Dhege.",
            "time": "18:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Harare roads under siege as pirate taxis defy enforcement",
            "href": "https://www.zbcnews.co.zw/harare-roads-under-siege-as-pirate-taxis-defy-enforcement/",
            "content": "Story by Peter Chivhima\nPIRATE taxis continue to wreak havoc and endanger lives on the country’s roads, despite repeated warnings and enforcement offensives by law enforcement agents.\nTheir reckless conduct is not only causing chaos and traffic jams but also putting innocent lives at risk each day.\nFrom speeding to dangerous overtaking and blatant disregard for traffic signals, these Mushikashika operators have turned the country’s roads into death traps.\n“This is not good, I think the police must work together with commuter omnibus operators so that there is order in town. Look at what is happening here, they are loading and offloading passengers in the middle of the road. This is bad,” a commuter, Mr Barnabas Mapisa said.\n“We are no longer comfortable coming and doing business here because of mushikashika,” another commuter, Vimbai Maredza added.\nZBC News revisited several well-known hotspots in Harare this Monday, where it seems the situation is getting worse when compared to the past years, as commuter omnibus crews continue to flout road rules.\nPublic outrage is even louder than ever, and their cry is for guaranteed safety.\n“We are no longer safe to travel in town because these kombie crews behave as if they are the owners of the road. It is so sad. The police should do something,” a Harare resident, Ms Kundai Kuyeri noted.\n“I think the police must also arrest both the owners of the commuter omnibuses for flouting road regulations, and by doing that, this will deter them from giving bad drivers their vehicles,” Harare resident Mr Thomas Kachiti said.\nAnother Harare Resident, Mr Morgan Chakaipa, said, Harare is no longer safe with these mushikashika operators because they do not even care for our safety.",
            "time": "18:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Emmerson Dambudzo Mnangagwa Law School construction works almost complete",
            "href": "https://www.zbcnews.co.zw/emmerson-dambudzo-mnangagwa-law-school-construction-works-almost-complete/",
            "content": "Story by Tafara Chikumira\nCONTRACTORS at the Emmerson Dambudzo Mnangagwa Law School, a branch of the Midlands State University (MSU) in Kwekwe, have introduced night shifts as they target to beat the August deadline to finish the first phase of the project.\nIt is all hands on deck as contractors at the law school target to ensure the main structure at the facility is completed before this year’s graduation ceremony scheduled for September at the site.\nAuthorities are grateful to the government for availing the necessary funding towards the infrastructure, which is part of the Second Republic’s priority projects.\n“Every material is now on site, we are only left with fitting the windows and roofing, which we hope will be done in the next two weeks. We angle to fix the road infrastructure as well as do the necessary plumbing for the facility to be usable,” the institution’s acting vice chancellor, Professor Grace Mugumbate, said.\nThe government is equally impressed by the progress at the facility, which feeds into the National Development Strategy One.",
            "time": "18:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Women in Chirumanzu empowered through the Presidential Goat Scheme",
            "href": "https://www.zbcnews.co.zw/women-in-chirumanzu-empowered-through-the-presidential-goat-scheme/",
            "content": "\nStory by Courage Bushe\nTHE Presidential Goat Pass-on Scheme, which is being implemented by the Young Women for Economic Development, is transforming lives in rural areas, benefitting over 150 women from Chirumhanzi villages.\nGuided by its vision to empower and equip young women to become self-reliant, the Young Women for Economic Development movement is leaving no stone unturned in complementing the government’s rural industrialisation agenda by spearheading income-generating initiatives, among them the Presidential Goat Pass-on Scheme.\n“I want to thank our President, Cde Emmerson Mnangagwa, and our mother, Dr Auxillia Mnangagwa, for giving us goats. As young women, we can be self-reliant, and we can be able to pass on to the next person and all be empowered. We witnessed these projects being done in other provinces, and today, we are happy to be given goats to start a goat project. I am going to grow this project and earn a living from it,” one of the beneficiaries said.\nThe ongoing programme seeks to promote the empowerment of the girl child and, at the same time, fulfilling the rural industrialisation drive.",
            "time": "18:10",
            "date": "17 Jul 2025"
        },
        {
            "title": "Mbare’s Siyaso Market powers grassroots industrial growth",
            "href": "https://www.zbcnews.co.zw/mbares-siyaso-market-powers-grassroots-industrial-growth/",
            "content": "\nStory by Memory Chamisa\nTHE Siyaso industrial hub in Mbare is known to sell almost everything,  and indeed it has lived up to this expectation.\nWhile this reality is bare for all to see, there are stories of men and women who hardly sleep to ensure that the good reputation of the Industrial hub is maintained.\nThe clang of metals, the humming sound of grinders, and a spark or two from the welding machines make up the ever-busy Siyaso Market.\nMbare’s Siyaso trading marketplace, whose contribution toward economic development has been recognised in pursuit of Zimbabwe’s National Development Strategy, holds vast skills whose impact on the country’s economy cannot be overlooked.\nFrom this perennially busy industrial site, one can buy almost anything, be it building materials, farming equipment, or cooking ware, among other things.\n“This is an industry that runs the economy here in Harare. We run conjointly with Mbare Musika as farmers come here after selling their produce by agriculture equipment which major companies sell but are expensive, you can get them for half the price as we work on targets if we are given an order we make sure that we deliver as early as possible,” one of the Artisans said.\nAnother Artisan noted that Siyaso is an industrial Hub that makes everything, and this has resulted in many innovations and products being made.\n“As the men and women here are skilled. Everyone here is capable of making something, and even our children who have finished school are coming here to learn how to make something of the products, and this also ensures continuity in the event of our demise,” the artisan noted.\n“As a woman, this place has changed my life financially, and I have also managed to create employment as my business records significant growth. The just-ended tobacco selling season brought brisk business as farmers came to retool and we sold most of the equipment they need in their fields to them,” another Artisan added.\nChairperson of the Mukuvisi Manufacturing Cooperative, which houses Siyaso traders, Mr Simeon Nikisi, applauded the Government for creating an enabling environment that has seen the site being recognised as an economic driver.",
            "time": "18:10",
            "date": "17 Jul 2025"
        }
    ]
}