{
    "news": [
        {
            "title": "Middle East tourism market grows as Israeli tourists flock to Victoria Falls",
            "href": "https://www.zbcnews.co.zw/middle-east-tourism-market-grows-as-israeli-tourists-flock-to-victoria-falls/",
            "content": "\nStory by Tichaona Kurewa\nZIMBABWE’s strategy to boost global tourism through the deployment of attachés is yielding results, with 120 Israeli tourists currently on a seven-day visit to Victoria Falls, the largest group from Israel since the attaché’s deployment.\nThe government deployed tourism attachés to international markets such as the UAE, India, and South Africa in 2023 to promote Zimbabwe as a top destination.\nThe tourists, who arrived on Sunday, are eager to explore the country’s natural beauty and warm hospitality.\n“It’s my first time in Zimbabwe and in Africa. I’m looking forward to a lot of fun,” said one visitor.\n“I’m happy to be in Victoria Falls. I’m also interested in tasting local cuisines,” added another.\nTrip organiser Mr Shlomo Carmel, expressed satisfaction with the warm reception and pledged to bring even more tourists from the Middle East in the future.\n“Zimbabwe is one of the best in terms of tourism offerings. We plan to bring even more tourists in October. Zimbabwe is truly beautiful,” he said.",
            "time": "21:46",
            "date": "13 Apr 2025"
        },
        {
            "title": "Vandalism brings broadcasting services to a standstill in Mutorashanga",
            "href": "https://www.zbcnews.co.zw/vandalism-brings-broadcasting-services-to-a-standstill-in-mutorashanga/",
            "content": "By Abigirl Tembo\nBROADCASTING services in Mutorashanga and surrounding areas have been disrupted after thieves vandalised the transmission site on April 11.\nThe vandals stripped a ZESA transformer, uprooted power cables, damaged the power distribution system, and stole backup batteries. Cables were also cut, causing extensive damage.",
            "time": "21:46",
            "date": "13 Apr 2025"
        },
        {
            "title": "Somgolo Bridge commissioned in Lupane East",
            "href": "https://www.zbcnews.co.zw/somgolo-bridge-commissioned-in-lupane-east/",
            "content": "Story by Mhlomuli Ncube\nA US$950 000 bridge has been commissioned in Somgolo, a development that will boost socio-economic activities in Lupane East.\nThe bridge has significantly enhanced connectivity, benefiting local businesses such as forestry and safaris.\nThis improvement has also had a profound social impact, enabling many locals to access the Lupane Centre with ease.\nMoreover, school children in the area are now safer, having been rescued from the daily fear of crossing flooded rivers, which previously posed a significant risk to their safety.\n“This is a story of success and changed lives by a government that cares about us. We are now able to travel without fear of any inconvenience such as floods,” Lupane East legislator, Honourable Siphathisiwe Machangu said.\nThe story of the Somgolo Bridge began many years ago.\n“The bridge was started in 2005. We got funding in 2018 when the Second Republic came in and managed to complete construction in 2024,” RIDA Matabeleland North Province coordinator, Mr Lawrence Ndebele noted.\nThe government says it is placing emphasis on ensuring that development benefits all citizens across the country.",
            "time": "21:46",
            "date": "13 Apr 2025"
        },
        {
            "title": "Lt General Emmanuel Matatu takes over ZNA command",
            "href": "https://www.zbcnews.co.zw/lt-general-emmanuel-matatu-takes-over-zna-command/",
            "content": "Story by Peter Chivhima\nTHE new Commander of the Zimbabwe National Army, Lieutenant General Emmanuel Matatu, has officially assumed his duties, urging the ZNA family not to be misled by social media.\nA handover-takeover parade for the Zimbabwe National Army command was held at Charles Gumbo Barracks this Friday, where outgoing Zimbabwe National Army (ZNA) Commander, Lieutenant General (Retired) Anselem Sanyatwe implored the incoming Commander and ZNA officers to continue lifting the country’s flag high, while the new commander, Lieutenant General Matatu pledged loyalty guided by the country’s constitution.\n“While my time as the ZNA Commander has come to an end, the mission will certainly continue. The responsibility to protect and serve Zimbabwe does not end with a change in leadership or a change in command.  Accordingly, I implore you to carry the torch forward and I have no doubt that the next chapter,  which now begins with the incoming of my brother, Lieutenant General Emmanuel Matatu, will be filled with even greater accomplishments, continue to raise our flag, national flag, very high to even greater heights,” Lieutenant General (Retired) Sanyatwe said.\n“My leadership will be guided by the values that we all share, and these are loyalty, dedication to duty and respect. In everything that we do, let us be guided by our mandate, as prescribed in the Constitution of Zimbabwe, Section 212, and the provisions in the Defence Act Chapter 1102,” Lieutenant General Matatu stated.\n“As we embark on this new chapter together, I want you all to know that communication channels, to me, will always be open. I will encourage you to share your thoughts, ideas and concerns using formal channels. Let us avoid using unofficial channels in other media, as this often mislead us.”\nChief witnessing officer and Commander Zimbabwe Defence Forces General Phillip Valerio Sibanda highlighted the importance of interactions between the ZDF and communities.\n“I therefore call upon you, the incoming commander of the Zimbabwe National Army, to pay particular attention to principal leadership that is responsive to the dictates of the current operating environment and to be highly vigilant and professional. I implore you to provide quality leadership to the communities that you will be interacting with during your tenure of office. I refer you to the critical role you play as the security focal point throughout our country,” he said.",
            "time": "21:46",
            "date": "13 Apr 2025"
        },
        {
            "title": "Mr Heritage Zim revives ‘Padare’ tradition to empower the boy child",
            "href": "https://www.zbcnews.co.zw/mr-heritage-zim-revives-padare-tradition-to-empower-the-boy-child/",
            "content": "Story by Farai Gwaze\nLOCAL advocacy for the boy child is gaining traction through initiatives like Mr Heritage Zimbabwe, a male pageant platform that tackles the societal challenges faced by boys.\nCurrent Mr Heritage Zimbabwe, Munashe Siyanata, who claimed the title in December 2024, is on a mission to revive the traditional ‘Padare’ culture, where older men mentor young boys in navigating life’s challenges and community engagement.\n“As Mr Heritage Zimbabwe, my role is to share the culture that we have as a country and also as a mental health advocate. We are also working on bringing back the ‘Padare’ culture where we have older men, teaching young boys how to navigate their way through life and how to work hand in hand with others in the community.”",
            "time": "21:46",
            "date": "13 Apr 2025"
        }
    ]
}