{
    "news": [
        {
            "title": "Five candidates submit nominations for Glenview South by-election",
            "href": "https://www.zbcnews.co.zw/five-candidates-submit-nominations-for-glenview-south-by-election/",
            "content": "Story by John Nhandara\nFIVE candidates have filed their nomination papers as they seek to contest in the Glenview South constituency by-election slated for the April 12.\nThe Nomination Court sat this Thursday to receive papers from aspiring candidates for next month’s by-election in Harare’s Glenview South constituency.\nNomination Court Officer, Ms Fiona Kurima confirmed that the five candidates who filed their papers are from the ZANU PF party, NCA party, and three independent candidates.",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Analysts commend RBZ stance on liberalising the exchange rate",
            "href": "https://www.zbcnews.co.zw/analysts-commend-rbz-stance-on-liberalising-the-exchange-rate/",
            "content": "Story by Owen Mandovha\nTHE Reserve Bank of Zimbabwe’s (RBZ) willing buyer willing seller exchange rate system is bearing fruit, with the central bank leaving the market to determine the exchange rate.\nIn a statement released this Wednesday, the Reserve Bank of Zimbabwe (RBZ) clarified that it has no control over the referral exchange rate being used by economic agents, saying the rate is derived from the interbank market through the willing buyer willing seller system announced in the 2024 Monetary Policy Statement.\nAnalysts have weighed on the subject given that over the past six months, the exchange rate has remained relatively stable, and premiums have been gradually declining, pointing towards convergence between the interbank and parallel foreign exchange rates.\n“The interbank market has been used to determine the exchange rate by the central bank and what it means is that holders of foreign currency can set the price of foreign currency they have to the buyer using banks. There is no fixed exchange rate that is being done by the RBZ. It is essentially the market forces of supply and demand that is determining this rate,” economist, Mr Malone Gwadu said.",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Ran Mine resumes operations after environmental cleanup and safety upgrades",
            "href": "https://www.zbcnews.co.zw/ran-mine-resumes-operations-after-environmental-cleanup-and-safety-upgrades/",
            "content": "Story by Tapiwa Machemedze\nRAN Mine has resumed operations in Bindura after the completion of the environmental decontamination process and enactment of safety measures ordered by the Environmental Management Agency (EMA) Wednesday night.\nThis was a result of the slimes dam breach at the mine last month.\nEMA Mashonaland Central Environment and Publicity Officer, Mr Maxwell Mupotsa, said the civil protection unit met on Wednesday afternoon and assessed public safety measures put in place by the mine.\n“After continuous works done by Ran Mine to ensure such a calamity would not happen again, we have seen the directive ordering them to halt operations being removed after they met conditions of the order, comprising pollution abatement measures, safety ponds, and the need to change the slime dam using the old one which is away from the public so we are satisfied as an agency with the works done by Ran Mine,” Mr Mupotsa said.",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Zim intensifies project monitoring to ensure effective implementation and accountability",
            "href": "https://www.zbcnews.co.zw/zim-intensifies-project-monitoring-to-ensure-effective-implementation-and-accountability/",
            "content": "Story by Fungai Jachi\nTHE government says it prioritises monitoring and evaluating the implementation of development projects to strengthen accountability and ensure effective execution.\nIt is also reigniting the momentum with which it is implementing its programmes and projects across the country to accelerate the attainment of an upper-middle income society by 2030, with an evaluation of progress cited as key to ensure efficiency and effectiveness.\nIn an interview with ZBC News on the sidelines of a monitoring and evaluation workshop held in Harare this Thursday, Secretary for National Monitoring Evaluation and Learning in the Office of the President and Cabinet, Mrs Fananai Madambi who represented the Special Advisor to the President on Monitoring Implementation of Government Programmes and Projects, Dr Joram Gumbo, noted that their main focus is on the evaluation of projects.\n“We want to ensure that we just do not monitor these projects, but evaluate them as well to ensure that we track progress and learn what can be done better. The coming in of the Second Republic has seen the introduction of 100-day cycles and this has fast-tracked the implementation of priority projects, which shows that the evaluation system is bearing fruit,” Mrs Madambi said.\nThe United Nations(UN) says it supports Zimbabwe’s quest to harness modern ways of monitoring and evaluating projects.",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Mash Central battles recurring Cholera outbreak",
            "href": "https://www.zbcnews.co.zw/mash-central-battles-recurring-cholera-outbreak/",
            "content": "Story by Abigirl Tembo, Health Editor\nA cholera outbreak has once again struck Mashonaland Central Province with 340 cases reported in six out of eight districts.\nThe recurrence of the outbreak has raised concerns about the ongoing presence of illegal miners along the Mazowe River who contaminating the water source and putting thousands of people at risk.",
            "time": "18:41",
            "date": "14 Mar 2025"
        }
    ]
}