{
    "news": [
        {
            "title": "Uniformed officers graduate at joint pass-out parade in Chegutu",
            "href": "https://www.zbcnews.co.zw/uniformed-officers-graduate-at-joint-pass-out-parade-in-chegutu/",
            "content": "Story by Tino Zirongwe\nCHEGUTU – A total of 110 instructors from the Zimbabwe National Army and Airforce of Zimbabwe have graduated at a joint pass-out parade held at Jason Ziyaphapha Moyo Airforce Base in Chegutu.\nThe graduates qualified as instructors in ceremonial, weapons and squad drills instruction.\nPresiding over the event, Airforce of Zimbabwe Chief of Staff, Air Vice Marshal Biltim Chingono, who was the reviewing officer spoke on the importance of the courses in moulding principled leaders within the uniformed forces.\n“The ceremonial drill instructors’ courses are a cornerstone for the maintenance of discipline in the organisation. The main thrust of the courses was to mould junior and senior non-commissioned members to be efficient members in the discharge of their respective duties. The Air Force of Zimbabwe remains dedicated to the protection of the Zimbabwean air space and territorial integrity as well as its sovereignty.”\nAmong the graduates was Earnmore Raurai, a surgeon from 1 Commando Regiment, who reflected on the demanding nature of the training.\n“The course was challenging and demanding, especially in terms of discipline and hygiene. But I have acquired skills that I am proud to pass on to others.”\nMaster Surgeon Jacqueline Moyo, one of the women in the cohort, encouraged fellow female officers to embrace leadership roles within the forces.\n“It is important to put your heart into everything you do. As women, we must prove our capability and rise through the ranks. I hope fellow women will follow suit.”",
            "time": "09:36",
            "date": "23 Jun 2025"
        },
        {
            "title": "Fire ravages Harare grocery outlets, owners plead for govt assistance",
            "href": "https://www.zbcnews.co.zw/fire-ravages-harare-grocery-outlets-owners-plead-for-govt-assistance/",
            "content": "Story by Fungai Jachi\nHARARE – SMALL business owners operating in Harare’s downtown area who had their grocery shops gutted by fire have called on the government to intervene and assist them in resuscitating their businesses.\nThe inferno, which broke out in the early hours, left behind charred remnants of once-thriving enterprises. The area, typically teeming with traders and customers, resembled a state of mourning when ZBC News visited the scene on Sunday.\nMany shop owners were too emotional to speak, overwhelmed by the scale of the destruction. Those who managed to voice their plight pleaded for intervention.\n“It is a great loss that we have suffered. We need assistance now because this is too much for us,” a business owner said.\n“The fire has left us in a difficult place, where do we start from? Everything was destroyed in the fire,” another added.\nSome nearby businesses, however, narrowly escaped the inferno.",
            "time": "09:36",
            "date": "23 Jun 2025"
        },
        {
            "title": "Education stakeholders back govt’s School Financing Policy",
            "href": "https://www.zbcnews.co.zw/education-stakeholders-back-govts-school-financing-policy/",
            "content": "Story by Fungai Jachi\nTHE government’s intention to introduce a School Financing Policy has been welcomed by stakeholders who believe it will help to address challenges in the education sector.\nThis comes as the Ministry of Primary and Secondary Education is conducting public consultations to allow stakeholders in the education sector to contribute towards the formulation of the policy.\nThe Schools Financing Policy is a legislative framework that aims to establish a more equitable and sustainable framework for financing education, ensuring resources are distributed fairly and minimising the impact of financial constraints on the quality of education.\nThe policy which is expected to be finalised this year will emphasise the crucial role of parents and communities in supporting education.\nStakeholders believe the policy should include how development partners as well as communities and businesses can assist to ensure basic education is not compromised.\nThe Chairperson of Zimbabwe Independent Colleges Association, Dr Tapera Chikandiwa said, parents should support the government in ensuring that every child has access to education by 2030.\n“Yes it is a government responsibility to finance education but with the 16.9 million people that we have, the government cannot finance each child.”\n“We know that we need to engage every child in line with our mantra no child left behind no school left behind. So our marginalised communities must be addressed and be funded and benefit from these consultations,” the University of Zimbabwe lecturer,  Dr Vongai Chakanyuka added.\nThe School Development Committees’ national representative, Mr Tarirai Samambwa said the introduction of the Heritage-based curriculum coupled with this introduction of the financing policy is working together to improve the education sector.\n‘If there are viable ways of financing education, then every child will have the same opportunity to learn,” he said.",
            "time": "09:36",
            "date": "23 Jun 2025"
        },
        {
            "title": "Govt reaffirms commitment to completion of Gwayi-Shangani Lake",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-completion-of-gwayi-shangani-lake/",
            "content": "Story by Mhlomuli Ncube\nTHE government says it is committed to the completion of the Gwayi-Shangani Lake after cabinet resolved to avail US$5 million every month towards the project.\nThe Second Republic says the project is important to the nation, coming at a time when the need for reliable water has occupied discussions in government circles.\nThe Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Dr Anxious Masuka said the government views the Gwayi-Shangani Lake as a national priority project and an urgent developmental programme that will immensely benefit the society.\n“Cabinet directed that US$5 million be set aside every month for the Gwayi-Shangani. The needs include dealing with the construction and also attending to issues of how affected families will be assisted. This is a priority project which the President wants to be addressed. Significant progress has been made on the hydro power station and the construction of the pump stations.”",
            "time": "09:36",
            "date": "23 Jun 2025"
        },
        {
            "title": "Marondera man(74) stung to death by bees",
            "href": "https://www.zbcnews.co.zw/marondera-man74-stung-to-death-by-bees/",
            "content": "Story by Jerold Sasa\nMARONDERA – A 74-year-old Marondera resident tragically died after being stung by a swarm of bees in the town’s central business district this Saturday.\nThe incident occurred as the man was walking past a bee hive which is on a streetlight pole opposite the Marondera Government Complex.\nWitnesses reported that the bees, which had been attacking passersby, overwhelmed the man as he attempted to fend them off. The man fell to the ground, calling for help, but those who tried to assist were also attacked and forced to flee for their own safety.\nThe Zimbabwe Republic Police and Marondera Municipality came in to assist and took the man to Marondera Hospital where he was pronounced dead on arrival.",
            "time": "09:36",
            "date": "23 Jun 2025"
        }
    ]
}