{
    "news": [
        {
            "title": "Govt commissions science labs at Gokwe school",
            "href": "https://www.zbcnews.co.zw/govt-commissions-science-labs-at-gokwe-school/",
            "content": "Story by Tafara Chikumira, Midlands Bureau Chief\nTHE government has commissioned three Advanced Level science laboratories at St Pauls High School in, as the institution aims to take Science Technologies Engineering and Mathematics (STEM) subjects to another level.\nThe science block comprises biology, chemistry, and physics laboratories as well as a smart lecture room.\nThe facility constructed for US$237 million will enable the school to start conducting Advanced Level STEM-related subjects.\n“We have been having some bright students here, especially in the sciences who were being absorbed by other schools. However, with this development, we are now able to enrol the best in the areas of STEM. This will also act as a motivation to the lower grades so that they start having an interest in the STEM area,” St Pauls High School, head of the department of STEM subjects, Mr Devine Lameck said.\n“We now have proper practicals in the area of Biology. I can see that my dream of becoming a doctor is shaping up. I am now geared to give it my all,” a pupil at the school said.\n“We are very grateful for this achievement.  I can now start practising most experiments I used to do in theory.  I can now feel the real thing. It’s good that we are heading in the right direction,” another pupil added.\nThe government is impressed by the strides being made by schools in complying with the demands of heritage-based learning.\n“The construction of science laboratories is a pivotal component in advancing the Vision of His Excellency President Dr Emmerson Mnangagwa’s Vision 2030, as it directly supports the goals of enhancing education quality and fostering innovation,” Minister of Primary and Secondary Education, Honourable Torerai Moyo said.",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Govt moves to enhance access to identity documents",
            "href": "https://www.zbcnews.co.zw/govt-moves-to-enhance-access-to-identity-documents/",
            "content": "Story by Kenias Chivuzhe\nZIMBABWE continues to improve access to national identity documents for people throughout the country, in accordance with the recommendations of the National Inquiry on access to documentation.\nIn response to the widespread challenges individuals faced in obtaining identity documents, the Second Republic, through its Human Rights Commission, conducted a National Inquiry on Access to Documentation, culminating in a comprehensive report published in 2020.\nTo follow up on the recommendations from the national inquiry, the Zimbabwe Human Rights Commission recently organised a stakeholder engagement meeting, where various groups acknowledged the progress made in improving access to national identity documents.\n“In our district, there is a huge improvement because as it is now easy to get birth and death certificates. As traditional leaders, we have been empowered to assist orphans and other children to acquire identity documents,” chief Makumbe said.\n“The registry office is now more open in assisting the deaf to access identity documents. We have partnered with the registry office to remove communication barrier between the deaf and authorities. The partnership is also making it possible for persons with disabilities to access vital information on the importance of identity documents,” Deaf Centre’s director, Blessing Chaipa-Nzveve said.\n“Before independence and even after independence, it was a privilege to access identity documents. We are happy that it is now a right enshrined in our national constitution.\n“Zimbabwe has made tremendous strides in promoting the issue of human rights and administrative justice.  We are glad that our government has implemented various reforms to improve the legal framework protecting individual rights and freedoms.”\n“The Inquiry highlighted challenges being faced by border communities, disaster-affected communities, persons with disabilities, the elderly, and minority groups among others,” Zimbabwe Human Rights Commission chairperson, Jessie Majome, said.\n“The inquiry emphasises the need for urgent and targeted measures to improve access to documentation by affected groups. The report requires us to take stalk of progress and challenges that are now few due to developments which have taken place in the country.”\nManicaland Minister of State for Provincial Affairs and Devolution, Advocate Misheck Mugadza outlined some of the measures taken to improve access to identity documents in Manicaland province.",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Broadcasting Amendment Bill to produce high quality content and programming-Govt",
            "href": "https://www.zbcnews.co.zw/broadcasting-amendment-bill-to-produce-high-quality-content-and-programming-govt/",
            "content": "Story by Bruce Chahwanda, Political Editor\nTHE government maintains that the Zimbabwe Broadcasting Corporation (ZBC) will produce high-quality content and programming that addresses community needs once the amendments to the Broadcasting Services Act are approved.\nThe Broadcasting Services Amendment Bill is set for the second reading in Parliament next week on Tuesday.\nAs part of its mandate to oversee operations of parastatals under its purview, the Ministry of Information, Publicity and Broadcasting Services led by Deputy Minister Dr Ompile Marupi toured the Zimbabwe Media Commission (ZMC) and ZBC this Thursday, accompanied by the Parliamentary Portfolio Committee on Media, Information and Broadcasting Services.\nThe Government believes the passing of the bill must bring good tidings for ZBC and the nation at large.\n“We are here to make sure that things move fast in bringing the envisaged changes to content creation which we hear most people talk about out there. To also ensure we look at the welfare of employees, the amendment bill will also bring good times for the organisation and the country at large as there will be funds for other projects and high-quality content,” Dr Marupi said.\nZBC Board Chairperson Ms Helliate Rushwaya said the Broadcasting Services Amendment Bill is critical to the organisation as it will enhance the quality of production and expand revenue streams.\n“It matters to us in terms of expanding revenue base, we will be able to deliver a reliable service and enhance access to information. On the revenue, it will ensure content creators benefit immensely as well as local languages,” she said.\nThe Parliamentary Portfolio Committee on Media, Information and Broadcasting Services Chairperson Honourable Caston Matewu said, the Broadcasting Services Amendment Bill should see the national broadcaster improving the quality of its programming.\n“We have been going around the country and most people feel the pricing of radio and TV licences needs attention if it becomes mandatory. We also need to see high-quality programming, news, movies, and trending soap operas among others,” he said.",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "Govt confirms most local authorities submitted master plans",
            "href": "https://www.zbcnews.co.zw/govt-confirms-most-local-authorities-submitted-master-plans-2/",
            "content": "Story by Tichaona Kurewa\nThe government reports that most local authorities have submitted their master plans in accordance with the Call to Action blueprint, with the exception of Harare and Chitungwiza.\nPresident Emmerson Mnangagwa launched the local authorities’ service delivery blueprint in November 2023 to enhance service delivery and accountability.\nAmong other deliverables, local authorities were tasked to submit master plans to the government by the end of June 2024 and to implement urban renewal programmes.\nLocal Government and Public Works Minister, Honourable Daniel Garwe, confirmed most local authorities have met the deadline, submitting their master plans for review.\nThe plans are now being made available for public viewing, allowing residents to provide feedback and contribute to the development of their communities.\n“The majority of our local authorities have submitted the master plans for approval to the parent ministry,” the Minister said.\n“We have since taken them back to them for onward public displays for people like yourselves to go and assess and make comments if you have any. That’s where we are now. But we are happy that we are only left with the two problem children, Harare and Chitungwiza.”",
            "time": "06:41",
            "date": "21 Feb 2025"
        },
        {
            "title": "President Mnangagwa tours Carousel Edgars clothing factory",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-expected-to-tour-carousel-edgars-clothing-factory/",
            "content": "Story by Sifiso Sibanda",
            "time": "06:41",
            "date": "21 Feb 2025"
        }
    ]
}