{
    "news": [
        {
            "title": "Calls grow for construction of traffic circle at Dzivarasekwa Turn-Off accident hotspot",
            "href": "https://www.zbcnews.co.zw/calls-grow-for-construction-of-traffic-circle-at-dzivarasekwa-turn-off-accident-hotspot/",
            "content": "Story by Peter Chivhima\nTHE urgent need for a traffic circle at the Dzivarasekwa Turn-Off, a known high-accident zone along Bulawayo Road, was highlighted on Monday as various Christian denominations gathered at the site.\nThe gathering took place at the location where eight people tragically lost their lives, and eleven others sustained serious injuries following a collision involving a commuter omnibus, a haulage truck, and a UD truck last week.\nThe collective initiative sought to raise awareness and explore measures to reduce accidents at the site, which has become notorious for frequent road fatalities.\nThe Chairperson of the Zimbabwe Council of Churches Dzivarasekwa Ecumenical Fellowship and Resident Pastor of The Salvation Army Dzivarasekwa Citadel, Major Joseph Nyamuzihwa, has urged the government to construct a traffic circle at the high-accident zone\n“Our gathering here is so important but the most critical thing is that the government can assist us by construction of a traffic circle. I think this will go a long way in reducing accidents here. Last year, we lost a member of our church as a result of an accident which occurred here,” he said.\n“There is a need for the government to consider the construction of a traffic circle and put warning signs here so that issues of accidents are minimised,” Reverend Munyaradzi Mukorombindo, of the Methodist Church in Zimbabwe said.\n“Our gathering here as churches is to seek divine intervention from God. We are convinced that our prayers will be heard,” Mrs Laina Kurebwaseka of the Methodist Church in Zimbabwe said.\nCommunity members noted the need for enforcement of road rules, as the driver involved in the latest fatal accident did not possess a driver’s licence.",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Govt reaffirms commitment to Bulawayo-Nkayi road rehabilitation",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-bulawayo-nkayi-road-rehabilitation/",
            "content": "Story by Mhlomuli Ncube\nWORKS in the rehabilitation of the Bulawayo-Nkayi Road are progressing well, with the government reiterating its commitment to the modernisation and development of key national infrastructure across the country.\nThe Bulawayo-Nkayi Road is one of the key social and economic routes in Matabeleland North Province, and the Second Republic says it is committed to seeing the completion of the ongoing rehabilitation works.\nRoad users have welcomed the commitment by the government as it had become a daunting task using the road.\n“This road is very important to us and when we see such efforts by the government, it makes us happy. We want to thank the government for ensuring that this road is repaired. We applaud the government for continuing on such interventions, we use this road every week, and it is critical to us,’’ a motorist said.",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Tributes pour in for veteran journalist Geoff Nyarota",
            "href": "https://www.zbcnews.co.zw/tributes-pour-in-for-veteran-journalist-geoff-nyarota/",
            "content": "Story by Peter Chivhima\nRENOWNED journalist Geoff Nyarota has died at the age of 74 after a prolonged battle with colon cancer.\nHis passing on Sunday morning has left the media fraternity in mourning, as colleagues and admirers pay tribute to his immense contribution to journalism in Zimbabwe.\nNyarota, widely regarded as a pioneer in investigative journalism, is being remembered as a mentor, leader, and fearless voice in the profession.\n“We have lost a man who inspired us to take up the journalism career. He was such a man who was ready to assist everyone,” colleague and board member of the Voluntary Media Commission of Zimbabwe, Lenox Mhlanga said.\n“Nyarota was a doyen in the media fraternity and today we are mourning his loss. We interacted a lot with him. He is our hero in the media fraternity” national coordinator of the Editors Forum, Njabulo Ncube said.\nZimbabwe Union of Journalists Secretary General, Perfect Hlongwane said the media industry has lost a giant and brave man.\n“We have lost a giant really, on whose shoulders we were standing. As journalists, we have been engaging Nyarota on quite a number of programmes that we were carrying out to ensure that he passes on the knowledge and the wisdom to the young that are upcoming in the sector,” Hlongwane said.\n“We really have lost a gallant fighter within the media, a gallant contributor within the media, and one whose contribution, like I said, has impacts that are tangible.”\nReactions of his passing on have extended beyond professional circles, with tributes flooding social media, where people from all walks of life, including government officials, have expressed their loss at his demise.\nPosting on his X-page, Information, Publicity, and Broadcasting Services Permanent Secretary, Mr Nick Mangwana said he is saddened by the loss of Zimbabwean media giant, describing him as a pioneering editor who left an indelible mark on the country’s journalism landscape.",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Earth Hour 2025: Zim highlights the importance of wetlands and biodiversity",
            "href": "https://www.zbcnews.co.zw/earth-hour-2025-zim-highlights-the-importance-of-wetlands-and-biodiversity/",
            "content": "Story by Tichaona Kurewa\nZIMBABWE joined the global community in observing Earth Hour at Chidobe Secondary School in the Hwange District this Saturday.\nHeld annually on the last or penultimate Saturday of March, Earth Hour brings together millions of individuals across more than 180 countries and territories in a collective demonstration of support for our planet.\nLaunched by the World Wide Fund for Nature (WWF) and its partners as a symbolic lights-out event in Sydney in 2007, Earth Hour has since evolved into one of the world’s largest grassroots movements dedicated to raising environmental awareness and promoting action.\nMore than just a symbolic gesture of switching off lights, Earth Hour has become a powerful catalyst for positive environmental change.\nIt has successfully driven significant legislative shifts by harnessing the power of public engagement and collective action.",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Desiltation of Chidobe Dam brings hope to Hwange communities",
            "href": "https://www.zbcnews.co.zw/desiltation-of-chidobe-dam-brings-hope-to-hwange-communities/",
            "content": "Story  by Tichaona Kurewa\nTHE desiltation of Chidobe Dam in Hwange District is making a tangible difference, with the reservoir now providing a lifeline for the community and other surrounding areas.\nFor years, Chidobe Dam suffered from severe siltation, drastically reducing its capacity, and leaving local communities vulnerable to acute water shortages, particularly during the dry season.\nHowever, a collaborative effort spearheaded by the World Wide Fund for Nature (WWF) under its Climate Adaptation and Protected Areas Initiative, in partnership with local authorities, the community, and other development partners, has revitalised the reservoir.\nThis offers a crucial lifeline to the community and in the attainment of national and international development targets such as Vision 2030 and the Sustainable Development Goals.\n“We are grateful for the partners that come to our rescue, water has been a challenge in this community but now we can do various horticulture projects, that can earn us money to survive,” a community member said.\n“It is a blessing to us youths, we can now do various projects such as horticulture taking us away from vices such as drug abuse and prostitution,” another community member said.\nProject partners, traditional leaders, and local authorities are equally optimistic about the project’s transformative impact.\n“We thank WWF and its partners for assisting our community in rehabilitating our dam and our springs, it took us years trying to rehabilitate the source but we faced many challenges in the process, the rehabilitation will alleviate water challenges, especially for our livestock, we can now venture into fisheries and other income generating projects that will uplift our community livelihoods,” Acting Chief Mvuthu, Mr Bishop Mathatha Sibanda said.\n“Before we struggled, our livestock suffered, and we had to travel long distances for water. Now, with the dam full, our animals are healthy, and we have water for our gardens. This is a blessing,” Hwange RDC Ward 2, Councillor Bonginkosi Moyo said.\n“Fellow residents this is your project that WWF and other partners are bringing to our community, let us protect and preserve our dam and our natural resource, as the Hwange Rural district council and the traditional leadership we pledge to allocate land that will be used for income generating projects like gardens, beekeeping, and others that will assist the community to raise capital to assist in paying school fees for less privileged children of our community and also keep our youths busy and keep away from drug and substance abuse,” CEO of Hwange RDC, Mr Pindile Ncube said.\n“We have largely been working in protected areas but as time moved we also realised that communities are an integral part of conservation. You can’t do conservation without considering communities,” WWF Country Director, Mr Itayi Chibaya said.\n“As you are aware, over recent years, rainfall has declined by 40%, and our dams are being filled with silt while also drying up. But these dams also bring a number of challenges because communities rely on them for their livelihoods.",
            "time": "18:44",
            "date": "24 Mar 2025"
        }
    ]
}