{
    "news": [
        {
            "title": "Govt strengthens commitment to inclusive and quality education",
            "href": "https://www.zbcnews.co.zw/govt-strengthens-commitment-to-inclusive-and-quality-education/",
            "content": "Story by Fungai Jachi\nTHE government has reaffirmed its commitment to providing and promoting quality, inclusive, and relevant education through the procurement of essential learning and teaching materials, particularly for rural learners.\nAs part of efforts to realise this objective, Kamwa Primary School in Gweru recently received a donation aimed at enhancing access to education for the pupils.\nBoth learners and parents expressed gratitude for the support, highlighting the positive impact the provision of educational materials will have on their academic progress.\n“We are grateful that we have been given textbooks, now we can read and when we write exams we will excel,” a pupil said.\n“We used to struggle without textbooks and other materials but now we have really been helped,” another pupil added.\n“We greatly appreciate this initiative by the government, it shows that our children are not forgotten,” a parent said.\n“For the longest time our children struggled because they did not have enough learning material but today all that has been answered.”\nKamwa Primary School Head Mr Silence Ruzive appreciated the government’s inclusive agenda.\nPrimary and Secondary Education Minister Honourable Torerayi Moyo emphasised the government’s commitment to strengthening the education sector.",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Provincial Hero Cde Ricky Erico Magwaza laid to rest in Chinhoyi",
            "href": "https://www.zbcnews.co.zw/provincial-hero-cde-ricky-erico-magwaza-laid-to-rest-in-chinhoyi/",
            "content": "Story by Tamuka Charakupa\nCDE Ricky Erico Magwaza who was declared Mashonaland West Provincial Hero was buried at the Chinhoyi Provincial Heroes Acre this Saturday.\nHe died at the age of sixty-five.\nThe Magwaza family thanked President Emmerson Mnangagwa for the befitting honour accorded to the late cadre.\n“We are grateful that the government has recognised the contributions of my late brother,” Mr Andrew Magwaza said.\n“My father was a loving man who not only cared for this family but the community at large. This is a huge loss to us but we have been comforted by this top honour,” his son, Leeroy Magwaza said\nThe Minister of State for Mashonaland West Provincial Affairs and Devolution, Honourable Marian Chombo described the late cadre as a visionary leader who was passionate about community development.\n“We are saddened as a province by the loss of Cde Magwaza. He was a dedicated leader who was passionate about development. He participated in the liberation struggle and after independence he was actively involved in the Zanu PF party to the time of his death. We are grateful to President Emmerson Mnangagwa for honouring us as a province,” Honourable Chombo said.\nCde Magwaza whose Chimurenga name was Cde Garikai Vatema did his primary education at Kuwadzana Primary school in Banket and his secondary studies at Waddilove High School before joining the liberation struggle in 1976.",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Harare to host “Fitness Against Drug Abuse” awareness campaign",
            "href": "https://www.zbcnews.co.zw/harare-to-host-fitness-against-drug-abuse-awareness-campaign/",
            "content": "Story by Fairstars Mukungurutse\nAS the fight against drug and substance abuse gains momentum, stakeholders are urging society to unite in combating this growing crisis.\nIn a bid to raise awareness of the devastating impact of drug abuse, the “Fitness Against Drug Abuse” campaign will be held on March 28 and March 29 in Harare.\nThe programme will feature a 3km fun run, aerobics, boxing matches, Zumba, and entertainment, promoting a healthy and drug-free lifestyle through sport and fitness.Founder of the initiative, Mr Lycan White, reaffirmed his commitment to empowering communities to lead healthier lives, free from drug abuse.\n“We are using sport to raise awareness because it is what everybody can relate to. Everybody in the world, no matter what age group, no matter what race, no matter what culture, there are two things we relate to, that is music and sports, which is why we have chosen sports.\n“When people do sport, they feel confident, they are more open, and it seems to be a crowd puller, we are looking at every individual, from the addicts, families that are suffering because of somebody who has an addiction, to communities trying to get people to know where they can get help and how they can overcome the drug addiction. All of us are affected indirectly. So we are looking at the nation as a whole,” Mr White said.\nSince its inception, the campaign has inspired people to prioritise their health and well-being.",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mabhikwa Chieftaincy welcomes new regent",
            "href": "https://www.zbcnews.co.zw/mabhikwa-chieftaincy-welcomes-new-regent/",
            "content": "\nStory by Yolanda Moyo\nMS Zanele Khumalo was installed as Regent Chief Mabhikwa of the Mlonyeni Chieftaincy at the family homestead in Jotsholo, Lupane this Friday.\nThe introduction of the regent chief ceremony was held following the appointment of the nine-year-old, Wayne Makhosemvelo Khumalo as the substantive Chief in January by the government.\nChief Makhosemvelo Khumalo is the son of the late Chief Vusumuzi Khumalo who died in 2022 in a car accident, and until he comes of age to fully assume his duties, his aunt, Zanele Khumalo, will serve as regent, ensuring continuity and guidance.\nSpeaking during the installation, Chief Siansali, who represented the Matabeleland North Chief’s Council, urged members of the community to work hand in glove with the regent Chief as the government moves in to align the Traditional Leaders Act with the constitution.\n“The Mlonyeni Chieftancy follows the Nguni tribe of having the eldest son take over at the age of 18. This is not the first time we have had this in the Matabeleland region, we have seen it in the Dakamela Chieftancy. The ministry is currently working towards the alignment of the Traditional Leaders Act in line with the constitution.\n“Traditional leaders and their respective communities have various rights enshrined in the Constitution. As a Chief, you are therefore expected to safeguard and promote your Ndebele practices and values. As a ministry which administers the Traditional Leaders Act we encourage the promotion and safeguarding of Ndebele primogeniture custom of succession,” Chief Siansali said.\nThe installation of Regent Chief Mabhikwa represents a crucial period for the community, as they look forward to a future of continued tradition and leadership.",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Nembudziya gears up for Zim’s 45th independence celebrations",
            "href": "https://www.zbcnews.co.zw/nembudziya-gears-up-for-zims-45th-independence-celebrations/",
            "content": "Story by Hardlife Luntu\nCONSTRUCTION works at Nembudziya Open Grounds in Gokwe are progressing swiftly as the venue prepares to host this year’s Independence Anniversary Celebrations and the Uhuru Cup.\nOn April 18, Zimbabwe will mark 45 years of independence, with the Second Republic continuing its decentralisation efforts under the mantra “Leaving No One and No Place Behind.”\nPreparations are well on course, with key infrastructure projects already more than halfway complete, ensuring a memorable national event.\n“Everyone is busy here in Gokwe Nembudziya where the 2025 Independence Day Celebrations will be held. We have scaled up our pace and works are at 75 % completion and we are targeting April 10 for all works to be done,” Ministry of Local Government and Public Works Director, Engineer Akim Maravira said.\nThe road connecting Kadoma, Sanyati and Nembudziya is currently under rehabilitation, with works moving at a fast pace.\n“We are working on the Kadoma-Sanyati road and we are progressing well with our works. We are happy that this year’s Independence Day Celebrations will be held in our area for the first time, thanks to the Second Republic,” Contractor, Benny Majoni said.",
            "time": "08:42",
            "date": "18 Mar 2025"
        }
    ]
}