{
    "news": [
        {
            "title": "ZRP ramps up fight against cattle rustling",
            "href": "https://www.zbcnews.co.zw/zrp-ramps-up-fight-against-cattle-rustling/",
            "content": "Story by Mercy Bofu-Matinha\nCases of stock theft continue to increase in areas between Bikita and Buhera and the Zimbabwe Republic Police (ZRP) has intensified awareness campaigns against cattle rustling in the affected areas.\nWith 215 people having been arrested and 419 cases of stock theft having been recorded in Masvingo province in 2024, communities around Bikita have been urged to work with the police to curb the vice.\nThe plea was made at an awareness campaign meeting held in Budzi area of Bikita by the Zimbabwe Republic Police this Tuesday.\n“As ZRP, we are moving around the country educating communities on the importance of looking after their cattle. This area of Bikita is one of the most affected as thieves are operating between this area and Buhera. We are saying, let’s work together to ensure those criminals are arrested. Our goal is to ensure an increased herd for our country,” ZRP National Anti-Stock Theft Unit coordinator, Commissioner Wicklef Makamache said.\nCommunity members applauded the ZRP for increasing their visibility in rural communities saying they are looking forward to a decrease in crime rate.",
            "time": "21:26",
            "date": "11 Feb 2025"
        },
        {
            "title": "Private players lauded for supporting the education sector",
            "href": "https://www.zbcnews.co.zw/private-players-lauded-for-supporting-the-education-sector/",
            "content": "Story by Tamuka Charakupa\nPrivate players have been commended for supporting the education sector, with Tendera Primary School in Makonde being the latest to receive furniture from a local farmer.\nThe gesture, according to learners and parents, addresses the learning gap which widely contributed to low enrolment and poor pass rates at the school.\n“We were recording very low pass rates because learners had no motivation to come to school and the lack of learning materials also forced parents to transfer their children to better schools.”\n“Our learners are very excited today because over the years, they were attending classes without furniture,” noted a teacher.\nA learner said, “The majority of our parents do not pay school fees, making it difficult for the school’s authorities to drive development here.”\nLocal farmer and businessman, Mr Dominic Jairos said the gesture is a direct response to the Call to Action Policy, which urges collective efforts to national development.\nHe said, “I am a beneficiary of the land reform and this donation is my way of giving back to the community. I believe the private sector has a role to play in community development so that we cut the burden on our government.”",
            "time": "21:26",
            "date": "11 Feb 2025"
        },
        {
            "title": "ZACC to launch National Anti-Corruption Strategy 2",
            "href": "https://www.zbcnews.co.zw/zacc-to-launch-national-anti-corruption-strategy-2/",
            "content": "Story by John Nhandara\nTHE Zimbabwe Anti-Corruption Commission (ZACC) will this year launch the National Anti-Corruption Strategy 2 as it upscales efforts to combat corruption.\nThe launch follows the successful implementation of the first strategy, which sought to curb corruption and restore public confidence in government institutions.\nZACC’s acting executive secretary, Mrs Charity Matumbi said, “We came 21 out of 100, but some of the variables were not indicative of our work as ZAAC. These include strides that we have made, for example, in asset recovery and forfeiture as well as money laundering.”\nMeanwhile, Zimbabwe has improved its corruption perception rankings as evidenced by the 2024 Corruption Perception Index Report released this Tuesday.",
            "time": "21:26",
            "date": "11 Feb 2025"
        },
        {
            "title": "Land developers database to restore sanity in urban development",
            "href": "https://www.zbcnews.co.zw/land-developers-database-to-restore-sanity-in-urban-development/",
            "content": "Story by Tichaona Kurewa\nThe development of a comprehensive database for land developers to monitor their activities and restore sanity in land development is on course.\nGovernment temporarily suspended the sale of state land last year after reports of unethical practices, corruption and other malpractices detrimental to development.\nThis has prompted government to develop a database for land developers to monitor their activities and protect the citizenry.\nLocal Government and Public Works Minister Honourable Daniel Grarwe told ZBC News in Victoria Falls recently that there won’t be a blanket lifting of the moratorium for the 92 local authorities.\nHe said, “We have 92 local authorities with a variety of challenges. Some have human capital challenges. Others are swimming in corruption like the City of Harare. Others are immersed in incompetence. So we wanted to clean all that mess as we audit the land. In areas where we think we are happy that this area is now clean, like Mutare for instance, Chiredzi Rural District Council, Chipinge Rural District Council, Chipinge Town Council, those ones we are ready to say look we can lift the moratorium here so it’s not a blanket lift throughout the country. It’s local authority based.”\nThe ongoing land developers audit is bearing fruit in some local authorities.",
            "time": "21:26",
            "date": "11 Feb 2025"
        },
        {
            "title": "New fire tender commissioned at Tongogara RDC",
            "href": "https://www.zbcnews.co.zw/new-fire-tender-commissioned/",
            "content": "Story by Courage Bushe\nGovernment continues to walk the talk on its efforts to empower local authorities, with Tongogara Rural District Council receiving a fire tender purchased by government from Belarus.\nTongogara Rural District Council received a fire tender from government under the Belarus facility, a development set to help council to cope with fire incidents.\n“This equipment is a critical tool in the fight against veld fires. There are always fire outbreaks where some accidents occur and lives are lost because there will be no immediate assistance,” said a firefighter.\n“There was nothing we could do if a huge fire incident occurred because it was dangerous to try to put it out, but with this fire tender, we can easily overcome that obstacle,” added another fire fighter.\nTongogara Rural District Council chief executive officer Engineer Liberty Ncube expressed gratitude to government.\n“As the Tongogara RDC, we are one of the recipients of the fire tenders procured by the government, and we are grateful to the central government for this. This will go a long way in enhancing our capacity response to emergency services. We are there to ensure public safety through providing emergency services to the communities that we serve,” he said.",
            "time": "21:26",
            "date": "11 Feb 2025"
        }
    ]
}