{
    "news": [
        {
            "title": "Transport operators urged to shun unreasonable daily targets",
            "href": "https://www.zbcnews.co.zw/transport-operators-urged-to-shun-unreasonable-daily-targets/",
            "content": "Story by Fairstars Mukungurutse\nTRANSPORT operators have been urged to desist from setting unreasonable targets which are exerting unnecessary pressure on drivers, leading to an increase in road traffic accidents.\nWith statistics indicating that 94 percent of road accidents are due to human error, the Traffic Safety Council of Zimbabwe (TSCZ) has implored transport operators to shun unreasonable daily targets for drivers as they end up defying road rules and regulations.\n“We urge transport operators to avoid giving hard targets. When you do an analysis of the accidents, particularly during this festive season, they are a result of speeding, and we believe they are a result of targets given to drivers that forces the driver to go beyond their limits. Our appeal to operators is to avoid giving those targets, they are not helpful, they endanger passengers,” said TSCZ’s managing director, Mr Munesu Munodawafa.\nAcknowledging the risk associated with high daily targets, local transport operators highlighted measures put in place to curb road carnage during the crossover into the New Year.\n“We have a team which engages even the passengers on board because they spend more time with the drivers than us. We urge them to report to us whenever they feel like their lives are in danger and we take action,” said transport operator, Dr Afra Nhanhanga.",
            "time": "08:34",
            "date": "31 Dec 2024"
        },
        {
            "title": "Youths rally each other to play role in national development",
            "href": "https://www.zbcnews.co.zw/youths-rally-each-other-to-play-role-in-national-development/",
            "content": "Story by Farai Gwaze\nYouths continue to rally each other towards playing a key part in the country’s attainment of an upper middle income society by 2030.\nZimbabwe youth council board member, Mr Tinashe Ngirandi highlighted government’s efforts to ensure youth participation in national development.\n“Generally, young people have supported NDS1 through one of its pillars which looks at increasing youth participation, decision making and also in developmental processes… We have seen young commissioners being appointed and part of boards. We have seen an increase in young parliamentarians showing that young people are taking the call of NDS1 to increase youth participation,” Ngirandi said.",
            "time": "08:34",
            "date": "31 Dec 2024"
        },
        {
            "title": "47 murder cases reported between 20 and 26 December 2024",
            "href": "https://www.zbcnews.co.zw/47-murder-cases-reported-between-20-and-26-december-2024/",
            "content": "Story by Peter Chivhima\nThe country continue to witness an alarming surge in violence, with 47 murder cases reported across the country between December 20 and 26 this year.\nThe disturbing statistics were confirmed by Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, in a statement released on Friday evening.\nAccording to Commissioner Nyathi, most murder cases resulted from disputes at social gatherings during Christmas celebrations, often triggered by excessive beer drinking.\nAdditionally, attacks by unknown suspects, particularly on individuals walking alone at night, contributed to the high number of murders.\nThe ZRP also attributed the rise in murder cases to conflicts over love relationships.\nAmong the disturbing cases is one of Mastard Chauke, aged 22, who is now facing a murder charge for allegedly killing Ostern Mangaru (29) on Christmas Day, with a stone during a beer-fuelled dispute in Mwenezi.\nLearnmore Mudzengi (36) of Shurugwi is also in trouble over allegations of stabbing his brother, Sydney Mudzengi (21) to death following a misunderstanding at Musavezi Business Centre in Shurugwi.\nIt is alleged the conflict arose over a missing pool token.",
            "time": "08:34",
            "date": "31 Dec 2024"
        },
        {
            "title": "77 people killed in more than 1 000 accidents",
            "href": "https://www.zbcnews.co.zw/77-people-killed-in-more-than-1-000-accidents/",
            "content": "Story by John Nhandara\nThe Zimbabwe Republic Police (ZRP) has reported a surge in fatalities on the country’s roads, with 77 people losing their lives in over 1 000 traffic accidents recorded during the 12-day period from the 15th to the 26th of December.\nPolice spokesperson, Commissioner Paul Nyathi said while fatalities increased, the total number of accidents recorded declined, compared to the same period last year.\n“We recorded 1211 road traffic accidents 65 fatal accidents, with 77 people being killed. 401people were injured,” he said.",
            "time": "08:34",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe students excel in Cambridge examinations",
            "href": "https://www.zbcnews.co.zw/zimbabwe-students-excel-in-cambridge-examinations/",
            "content": "Story by Wellington Makonese\nThe wave of academic excellence continues to sweep across the country as demonstrated by outstanding results in the recently-released Cambridge Primary Checkpoint Results.The results, released earlier this month, reveal sweeping pass rates across various subjects with most schools that include Samuel Centenary Junior School, Havard Junior School and St Martins Allure Elementary clocking 100% pass rates.\nAmong them is wizkid Rugare Mutendi, whose exceptional performance has ignited dreams of a future in medicine.\n“I’m super excited about my achievement and now looking forward to do sciences at a better level and be a doctor the exams where quite decent,” Rugare says.\nThe consistent performance over the years highlights the dedication and strength of Zimbabwe’s education system.",
            "time": "08:34",
            "date": "31 Dec 2024"
        }
    ]
}