{
    "news": [
        {
            "title": "Zimbabwe Cabinet Eleventh Post-Cabinet Press Briefing April 29, 2025",
            "href": "https://www.zbcnews.co.zw/zimbabwe-cabinet-eleventh-post-cabinet-press-briefing-april-29-2025/",
            "content": "TODAY, April 29, 2025, His Excellency the President, Dr. E.D. Mnangagwa chaired the Eleventh Cabinet Meeting and the following issues, among others, were considered and approved: 1.0 SECOND ROUND CROP, LIVESTOCK AND FISHERIES ASSESSMENT REPORT Cabinet received an Update on the Second Round Crop, Livestock and Fisheries Assessment Report.\nThe Report indicates that the area planted to maize increased from 1 728 897 hectares (ha) in the 2023/24 season to 1 839 373 hectares in the 2024/25 season. The 6.4% increase is marginally above the target of 1 800 000 hectares. Based on this assessment, maize production in the 2024/25 season is estimated at 2 293 556 metric tonnes, the fourth highest ever production by the country.\nThe production of tobacco, cotton and sunflower increased by 15%, 52% and 303%, respectively. The total national herd is at 5.7 million, a 0.4% increase on last year with communal areas dominating and accounting for 64% of the total cattle population. A total of 94 623 metric tonnes of beef was produced in 2024, compared to 90 000 metric tonnes in 2023.\nMashonaland East, Manicaland and Midlands were the top milk producing provinces in 2024, accounting for 89% of the country’s production of 115 million litres last year, a 10% increase from last year. Overall fish production in 2024 is 31 296 metric tonnes, while crocodile skin sales increased by 34%.\n2.0 ZIMBABWE’S CAMPAIGN STRATEGY ON THE COUNTRY’S CANDIDATURE FOR A NON-PERMANENT SEAT ON THE UNITED NATIONS SECURITY COUNCIL FOR THE TERM 2027- 2028\nCabinet considered and approved Zimbabwe ‘s Campaign Strategy on the country’s candidature for a Non-Permanent Seat on the United Nations Security Council for the term 2027-2028. Zimbabwe’s bid for a non-permanent seat at the United Nations Security Council for the 2027-2028 term has already been endorsed by both the Southern African Development Community and the African Union, and will be officially launched by His Excellency the President Dr. E. D. Mnangagwa in Harare, and in New York during the 80th Session of United Nations General Assembly in September 2025. The outcome will be the reaffirmation of the country’s commitment to upholding international peace and security as well as the generation of international goodwill towards the country.\n3.0 HOSTING OF THE 2025 EDITION OF THE NATIONAL CULTURE MONTH: MAY 1 – MAY 31 2025\nGovernment considered and approved the hosting of the 2025 Edition of the National Culture Month from 1 to 31 May, 2025. The 2025 National Cultural Month will be held under the theme “Celebrating Indigenous Voices”. The objectives are: to celebrate the rich cultural heritage of Zimbabwe, promote cultural diversity and foster national unity; to showcase the diverse cultural practices through various forms that include dance, food, attire, visual arts, literary arts, film, television music and poetry; and to promote intellectual dialogue for crosscultural understanding and exchange.\nThe National Culture Month Launch will be presided over by His Excellency the President, Dr. E.D. Mnangagwa on a date to be advised, at the homestead of Chief Tshovani in Masvingo Province. The event will celebrate our identity and diverse cultures.\nIt will also be a platform to showcase Zimbabwe’s success stories in cultural development and its commitment to fulfilling regional and international protocols that promote the growth of the creative and cultural industries. The first week will focus on encouraging historical recipes and cooking techniques, connecting modern eaters to their culinary heritage. The second week will be an Indigenous Fashion Week where the colourful and unique forms of cultural wear will be rolled out.\nThe third week is the National Culture month launch while the fourth week is the Indigenous Languages and Cultural Dialogue Week. It will be dedicated to recognizing and celebrating indigenous voices through music, dance, visual displays, poetry, films and language workshops. Communities are encouraged to celebrate their indigenous languages during the month of May. Provinces will schedule their activities around the culture month, and each province will host its Provincial Launch where the respective Minister of State for Provincial Affairs and Devolution will officiate as the Guest of Honour.\n4.0 REPORTS ON PROJECTS AS AT DAY 50 OF THE 1ST 100-DAY CYCLE OF 2025\nCabinet received and noted progress Reports presented by four line Ministers as at Day 50 of the First 100-Day Cycle of 2025.\n4.1 In terms of the Devolution and Decentralisation pillar of the National Development Strategy 1, the Minister of Local Government and Public Works highlighted the following achievements on projects under his purview:i. Renovation of the Chegutu Civil Registry in Mashonaland West Province is at 70% of completion;ii. Renovation of the Chegutu District Development Coordinator’s office is at 65% of completion;iii. Construction of the Binga Civil Registry in Matabeleland North Province is at 65% completion; andiv. Installation of 66 boreholes in Mashonaland East Province has reached 66% of completion.\n4.2 Under the Thematic Area on Housing Delivery, preparatory works for the construction of the Munhumutapa Government Office complex in Gweru and Vungu, Midlands Province has commenced.\n4.3 In terms of the Environment Protection, Climate Resilience and Natural Resources Management pillar of the National Development Strategy 1, the Minister of Environment, Climate and Wildlife highlighted the following achievements on projects under her purview:\ni. the rehabilitation of 200 hectares of the Ditchwe Wetland in Makonde District, Ward 4 for improved human well-being and ecosystem management is on course;ii. the restoration and protection of 154 hectares of the Chidobe Wetland in Hwange District, Ward 2 is on course. A total of 2 340 livestock and 400 households are already benefitting from the project;iii. the establishment of a waste sorting and processing centre at the Tafara Integrated Resource Recovery Centre in Mabvuku, Harare Metropolitan Province is on course;iv. the construction of a state-of-the-art One Stop Pavilion at Hwangwe National Park Main Camp in Matabeleland North Province has reached 95% completion;v. the planting of a total of 4 000 indigenous trees on 2 494 hectares of land at Zamazama, Bondongwe, Zunga-Tinhira, Cheza, Hananda and Poshayi villages in Shurugwi district, Midlands Province is on course;vi. the planting of 52 000 fruit trees under the 45th Independence Plantation Legacy project in Gokwe North and South districts is at 95% completion; andvii. the installation of 15 Prototype 3 Dimensional-Printed Automatic Weather Stations at 15 Meteorological Stations at Victoria Falls, Marondera, Hwange, Binga, Beitbridge, Kezi, Rupike, Kadoma, Zvishavane, Chipinge, Kanyemba, Mutoko, Mt Darwin, Chisumbanje and West Nicholson is on schedule.\n4.4 In terms of the Economic Growth pillar of the National Development Strategy 1, the Minister of Finance, Economic Development and Investment Promotion highlighted that the mobilisation of tax revenue and Non- Tax Revenue has surpassed the first quarter target.\n4.5 Under the Economic Growth and Stability Pillar, the Tax and Revenue Management System being implemented in three phases and has achieved the following: the Release 1 Core Fronted processes and Release 2 Tax Agent Module are both 100% complete. Meanwhile, the Release 3 Back-end processes 4 of 5 were also successfully implemented, although the system integration and Risk Compliance Management Module is still in progress.\n4.6 Under the Fiscalisation processes, the following achievements were highlighted: internal integration with three banks is in progress, while external integration is ongoing with five Government departments. The User acceptance testing of the Risk Compliance Management Module Phase 1 is now complete, and Phase 2 is ongoing. The Business Intelligence Reporting project is on course, while the launch of the Single Account Automatic Re-opening is in progress.\n4.7 under the civil works projects, construction of the ZIMRA Chirundu cottages in Mashonaland West Province has reached 95% of completion; and\n4.8 refurbishment of the IDBZ Kanyemba Zambezi lodges in Mashonaland Central Province is 100% complete.\n4.9 Under the Governance Thematic Area, the Enterprise Risk Management Project performed as follows: 19 executives from the Ministry of Tourism and Hospitality Industry and 29 risk champions from the Zimbabwe Human Rights Commission were trained.\n4.10 under Conferences, the Manicaland and Midlands Investment Conferences were held in February and March 2025, respectively;\n4.11 the Manicaland and Midlands Investment Compendiums were completed;\n4.12 the Fifty-Seventh Session of the Economic Commission for Africa Conference of African Ministers of Finance, Planning and Economic Development was held from 12 to 18 March 2025, in Addis Ababa, Ethiopia; and\n4.13 Zimbabwe, as the outgoing Chair of both the Committee of Experts and the 56th Bureau, handed over the Chairmanship to Morocco.\n4.14 under the implementation of the International Financial Service Centre, completion and gazetting of the International Financial Service Centre is on course;\n4.15 the Nation-wide Venture Capital Fund Investment projects are on course; and 4.16 crafting of the National Development Strategy 2 (NDS2) (2026-2030) is on course.\n4.17 In terms of the Economic Growth and Stability pillar of the National Development Strategy 1, the Minister of Mines and Mining Development highlighted the following projects under his purview:\ni. the establishment of an Online Permit system is at 90% of completion;ii. drafting of the Mineral Development Policy is 96% complete;iii. Construction of the Palm River Energy Plant in Beitbridge is on course; iv. the expansion of the Zimplats Sulphur Dioxide Abatement Plant in Mashonaland West Province is on track; andv. the establishment of the Disco Carbon Steel Plant in ChivhuMvuma, Mashonaland East and Midlands Provinces is 100% complete.\n5.0 OFFICIAL OPENING OF THE 65TH EDITION OF THE ZIMBABWE INTERNATIONAL TRADE FAIR:",
            "time": "20:27",
            "date": "29 Apr 2025"
        },
        {
            "title": "Govt commits to enhancing disaster and risk management",
            "href": "https://www.zbcnews.co.zw/govt-commits-to-enhancing-disaster-and-risk-management/",
            "content": "Story by John Nhandara\nTHE government is enhancing national resilience against disasters through homegrown solutions to achieve the goals of the current global frameworks for disaster and risk management.\nThe country is a signatory to the Sendai Framework for Disaster Risk Reduction (2015 to 2030) and the sustainable development agenda 2030.\nThis emerged during a workshop on disaster management and risk profiling at the Parliament Building in Mt Hampden this Tuesday.\n“If disaster risk reduction is not prioritised at the highest echelon, all our endeavours in achieving Vision 2030 will go to waste as disasters can divert our development resources towards humanitarian assistance. It is for this reason that the coordination structure for disaster risk reduction is underpinned by the Cabinet Committee on Environment, Disaster Prevention and Management (CCEDPM) tasked with the responsibility for optimal readiness and management of emergencies and disasters and ensuring integration of disaster risk reduction into development,” the Deputy Minister of Local Government and Public works, Honourable Albert Mavhunga said.",
            "time": "20:27",
            "date": "29 Apr 2025"
        },
        {
            "title": "Mashonaland East mourns national hero, Cde Rungani",
            "href": "https://www.zbcnews.co.zw/mashonaland-east-mourns-national-hero-cde-rungani/",
            "content": "Story by Jerold Sasa\nTHE body of Brigadier General (Retired) Victor Rungani is now at his Bally Vaghuan Farm in Goromonzi where it was welcomed by government and ZANU PF officials, family members, farm workers and neighbouring farmers who came to bid farewell to a national hero who dedicated his life to serving the nation.\nThe Mashonaland East Province has expressed gratitude to government for granting Brigadier General (Retired) Victor Rungani national hero status, describing his demise as a huge loss to the province and the nation at large.\nMashonaland East Minister of State for Provincial Affairs and Devolution Advocate Itayi Ndudzo said the province is grateful to government for honouring one of its prominent farmers.\n“As a province, we feel very much honoured that one of us has been accorded such a status.”\nThe death of Cde Rungani has been described as a huge loss by the local farming community which him as a father figure who was always willing to assist.",
            "time": "20:27",
            "date": "29 Apr 2025"
        },
        {
            "title": "National hero Cde Walter Basopo remembered as a unifier and patriotic leader",
            "href": "https://www.zbcnews.co.zw/national-hero-cde-walter-basopo-remembered-as-a-unifier-and-patriotic-leader/",
            "content": "Story by Tamuka Charakupa\nTHE body of National Hero Cde Walter Basopo is now at his Chinhoyi residence, with the local community describing the late cadre as a patriotic leader and unifier.\nThe body was received in Chinhoyi Monday afternoon by Mashonaland West Permanent Secretary for Provincial Affairs and Devolution Mr Josphat Jaji, the provincial and district leadership, relatives, friends and community members.\nWife to the late national hero Mrs Ketty Basopo expressed gratitude to government for the befitting honour bestowed upon her husband.\n“My husband was an honest man. He served the country wholeheartedly. We are grateful to President Emmerson Mnangagwa for honouring his legacy,” she said.\nThe provincial leadership, colleagues and war veterans paid tribute to Cde Basopo for his patriotic leadership.\n“As a province, we are deeply saddened by the loss of Cde Basopo who was living in Chinhoyi. He was always available to guide us as the ruling party. Truly to his death, Cde Basopo was a patriotic son of the soil, who worked for his country before and after independence.  We continue to cherish his good works of defending the country before and after independence,” ZANU PF Mashonaland West Provincial Chairperson Cde Mary Mliswa-Chikoka said.\n“As a party, we have lost one of our own who was a true example of being patriotic. We thank President Emmerson Mnangagwa for giving Cde Basopo a national hero status,” Makonde Legislator Hon Simba Ziyambi added.",
            "time": "20:27",
            "date": "29 Apr 2025"
        },
        {
            "title": "Air Vice Marshal (Retired) Winnie Mandeya dies",
            "href": "https://www.zbcnews.co.zw/air-vice-marshal-retired-winnie-mandeya-dies/",
            "content": "Story by Peter Chivhima\nAIR Vice Marshal (Retired) Winnie Mandeya, a senior officer of the Air Force of Zimbabwe (AFZ), has died.\nShe was 64.\nAir Vice Marshal Retired Mandeya died early Monday morning at St Anne’s Hospital in Harare.\nConfirming the sad news, Commander Air Force of Zimbabwe, Air Marshal Jacob John Nzvede, said the late Air Vice Marshal Retired Mandeya served the AFZ with dedication and loyalty since 1984.\n“The Air Force of Zimbabwe family is saddened by the passing on of Air Vice Marshal Winnie Cabby Mandeya (Retired) on April 28 2025. She was a determined cadre who served the Air Force of Zimbabwe since 1984 and a liberation war heroine,” he said.\n“The late AVM Winnie Cabby Mandeya (Retired) joined the liberation struggle on September 29, 1975 and successfully completed basic military training at Nachingweya, Tanzania and was deployed in Gaza Province where she operated until 1978 when she was selected for a nursing course. At independence, she joined the President’s Department where she actively participated in the commission of inquiry into missing persons in 1981 and later transferred to the Air Force of Zimbabwe on July 1, 1984,”\nBorn on the 14th of July in 1960, in Rusape, Air Vice Marshal Retired Mandeya’s journey was marked by groundbreaking achievements.\nShe was among the cadres who survived the Chimoio attack.",
            "time": "20:27",
            "date": "29 Apr 2025"
        }
    ]
}