{
    "news": [
        {
            "title": "ZITF 2025 to spotlight Second Republic’s rural industrialisation vision",
            "href": "https://www.zbcnews.co.zw/zitf-2025-to-spotlight-second-republics-rural-industrialisation-vision/",
            "content": "Story by Lisa Masuku\nTHE 65th edition of the Zimbabwe International Trade Fair slated for April 21 to April 26 in Bulawayo is set to amplify the Second Republic’s rural industrialisation agenda through the first-ever rural industrialisation conference.\nDubbed the “Blue Sapphire” edition, the country’s biggest trade showcase is set to host an inaugural rural industrialisation conference on April 22.\nThe first-ever rural industrialisation conference is spearheaded by the Ministry of Industry and Commerce as part of efforts to promote inclusivity, ensuring no one and no place is left behind.\n“On April 22 we have the rural industrialisation conference. It’s an inaugural one, spearheaded by the parent ministry, the Ministry of Industry and Commerce,” ZITF CEO, Dr Nicholas Ndebele said.",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Chiredzi fire incident claims one life, leaves trail of destruction",
            "href": "https://www.zbcnews.co.zw/chiredzi-fire-incident-claims-one-life-leaves-trail-of-destruction/",
            "content": "Story by Gay Matambo\nA fire tore through a home in the Lyonnaise area of Chiredzi on Sunday evening, claiming the life of one unidentified individual and destroying property worth an undetermined amount.\nAccording to eyewitnesses, the blaze broke out around 1830 hours and quickly engulfed the entire house.\nOne person, whose identity is not yet confirmed, was reportedly trapped inside and died after being burnt beyond recognition.\n“We were sitting outside when we suddenly saw the front window shatter and flames erupt from inside. The fire spread so fast, in just a few minutes, the entire house was gone. There was nothing we could do,” one witness said.\nAnother resident, who was a tenant in the house, recounted their narrow escape.\n“I only managed to grab a bag with my child’s clothes. Everything else was lost in the fire.”",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "UAE and Zimbabwean Govt collaborate to support food security",
            "href": "https://www.zbcnews.co.zw/uae-and-zimbabwean-govt-collaborate-to-support-food-security/",
            "content": "Story by Tichaona Kurewa\nTHE First Lady, Dr Auxillia Mnangagwa in collaboration with the United Arab Emirates (UAE), has stepped up efforts to ensure food security for communities affected by the El Niño-induced drought, beginning with the donation of six tonnes of mealie meal to the Matetsi community in Hwange District, Matabeleland North Province.\nThis is the first phase of a three-part donation that will ultimately total over 17 tonnes, signifying growing bilateral cooperation aimed at alleviating hunger and improving rural livelihoods.\nThe mealie meal consignment was warmly received by the Matetsi community, where residents expressed deep gratitude.\n“We will certainly have something to feed our families, many thanks to Amai for the mealie meal,” a beneficiary said.\n“This will cushion us definitely, it will take us somewhere, we are thankful,” another beneficiary said.\n“Life will not be the same, this will add to what we have, thank you Amai,” a beneficiary added.\nTraditional leaders and representatives from the UAE reaffirmed their commitment to improving livelihoods across Zimbabwe.\n“We are thankful to the First Lady for remembering us. I encourage continued efforts to build our country. We also appreciate this community’s efforts in preserving wildlife may this continue so future generations can enjoy these natural treasures,” Chief Hwange, Amos Chibaya said.\n“This food is not just for today it carries a message of hope and togetherness it shows the values of kindness, support, and working together values that the UAE believes in. We hope this help will make a difference and be the beginning of more good work between our two countries,” UAE Deputy Ambassador to Zimbabwe, Mr Rashed Al Shamsi.\nIn a speech read on her behalf by Mr Fulton Mangwanya, Director General in the President’s Department, the First Lady highlighted the significance of the United Arab Emirates’ gesture in supporting Zimbabwe’s national development agenda.\n“It is my wish to see everyone benefiting from this initiative and continue until we are satisfied with our 2025 harvest. I am very optimistic that our people’s livelihoods will inevitably be greatly improved. However, I challenge this community to value the gesture made here by UAE bearing in mind that we are the builders of our nation that answers to the president’s mantra “Nyika inovakwa nevene vayo, ilizwe Lakhiwa Ngabanikazi balo” which is our guiding philosophy for the Second Republic.",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "COP15 summit to boost wetland conservation in Zim",
            "href": "https://www.zbcnews.co.zw/cop15-summit-to-boost-wetland-conservation-in-zim/",
            "content": "Story by Theophilus Chuma\nZIMBABWE is looking at expanding its listed Ramsar sites as the country assumes the chairmanship post at the forthcoming 15th meeting of the conference of the contracting parties to the Convention on Wetlands (COP 15) to be held in Victoria Falls in July this year.\nFor the past 12 years, the government has implemented policies to protect this and other wetlands listed under the Ramsar Convention, an international treaty that promotes the sustainable use and management of wetlands and their resources.\nThis is one site that international delegates will witness as the country hosts delegates from 172 nations, at the 15th meeting of the Conference of the Contracting Parties to the Convention on Wetlands (COP 15) to be held in Victoria Falls from July 23 to July 31 this year.\n“As the hosts for the COP15 and together with the other 172 countries, we will then be discussing how we can mobilise all relevant stakeholders. There is a need for us to embark on serious awareness campaigns on wetlands protection.\n“Over the next three years that Zimbabwe will be holding the Chairmanship of Ramsar we are going to be mainstreaming and identifying additional wetlands for Zimbabwe,” Permanent Secretary of the Ministry of Environment, Climate and Wildlife, Ambassador Tadeous Chifamba said.\nThe COP15 meeting is a critical pedestal to amplify the conversation on protecting wetlands as a protection against climate change.",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Government launches Independence and Easter road safety campaign",
            "href": "https://www.zbcnews.co.zw/government-launches-independence-and-easter-road-safety-campaign/",
            "content": "Story by Tapiwa Machemedze\nTHE government has launched the 2025 Independence and Easter Road Safety Campaign, with authorities set to deploy breathalysers and advanced road surveillance technologies to reduce traffic accidents.\nThe campaign was launched in Mashonaland Central province this Monday, amid growing concern over road fatalities, especially during peak travel periods such as the Easter holidays.\nSpeaking at the launch, the Minister of Transport and Infrastructure Development, Honourable Felix Mhona, confirmed that breathalysers will be introduced at roadblocks across the country as a key tool in combating drunk driving.\n“We promised to use breathalysers at roadblocks, so you will find that our roadblocks will have breathalysers,” he said.\nThe government is also targeting to deploy new technologies to enhance road safety enforcement and eliminate human error and corruption.\n“This year, our target is to see technologies and cameras on the roads. We must agree that we all have failed on our own as there are some ’exchanges’ that happen on the roads. So, we have seen that camera and technology is the solution. Technology can’t be bribed,” the Minister of Home Affairs and Cultural Heritage, Honourable Kazembe Kazembe noted.\nMotorists welcomed the safety awareness campaign while the Greater Harare Association of Commuter omnibus operators highlighted deployment of technologies will enhance benefits for both operators and passengers.\n“It is good to see our leaders coming from their offices for such a worthy cause as road traffic safety. The accidents on the roads are indeed a major concern,” a motorist said.\n“I am happy that technologies are soon to be deployed on the roads. This is a good thing for us as operators and the passengers,” another added.",
            "time": "08:44",
            "date": "15 Apr 2025"
        }
    ]
}