{
    "news": [
        {
            "title": "Bubi hosts traditional cookout competition, empowering women and youths through indigenous cuisine",
            "href": "https://www.zbcnews.co.zw/bubi-hosts-traditional-cookout-competition-empowering-women-and-youths-through-indigenous-cuisine/",
            "content": "Story by Mhlomuli Ncube\nAMAI’s Traditional Cookout Competition was taken to Bubi district in Matabeleland North Province, where culinary skills were on show this Wednesday.\nThis year’s provincial cookout competition was held at Inyathi Training Centre, in Bubi and attracted participants from across Matabeleland North Province.\nWith traditional delicacies informing the basis of the event, the array of dishes reflected the stance to promote healthy uptake of indigenous foods.\nThe participants who took part said they will continue to promote traditional foods in their homes and professionally.\n“I am glad to be involved in promoting traditional diets and this the right platform to do so,” a participant said.",
            "time": "08:38",
            "date": "10 Apr 2025"
        },
        {
            "title": "Zim launches National Energy Efficiency Policy",
            "href": "https://www.zbcnews.co.zw/zim-launches-national-energy-efficiency-policy/",
            "content": "Story by Tichaona Kurewa\nZIMBABWE has officially launched its National Energy Efficiency Policy, aimed at optimising the use of existing energy resources, minimising waste and promoting sustainable practices across the economy.\nThe policy was unveiled this Wednesday by Vice President, General (Retired) Dr Constantino Chiwenga during the Sixth International Renewable Energy Conference and Expo in Victoria Falls.\nThis policy is designed to strengthen Zimbabwe’s transition to green energy while complementing various incentives aimed at attracting private sector investment in the renewable energy sector.\n“This policy seeks to optimise the use of our existing energy resources, reduce waste, and promote sustainable practices across our economy. Additionally, private sector-driven projects, such as Captive Power Plants, are already underway. These projects are expected to significantly reduce load shedding soon, contributing to a more reliable energy supply for all Zimbabweans,” the Vice President said.\n“It is crucial to note that the production of coke generates an important by-product known as coke oven gas. However, as a country, we have not yet fully optimised this resource. Currently, coke oven gas is flared into the atmosphere, causing negative environmental impacts.\n“As a government, we see this as an opportunity to strategically invest in the conversion of waste gas into fuel for power generation. This would allow self-supply, with any excess being supplied to the national grid. Furthermore, there are opportunities to use the gas for boiler flame support in existing thermal power stations located near coke operations,” he added.\nPrivate renewable energy players are optimistic about the potential impact of the new policy.",
            "time": "08:38",
            "date": "10 Apr 2025"
        },
        {
            "title": "Mvurwi residents hail govt for prioritising education in 2025 national budget",
            "href": "https://www.zbcnews.co.zw/mvurwi-residents-hail-govt-for-prioritising-education-in-2025-national-budget/",
            "content": "Story by Tapiwa Machemedze\nTHE government has been applauded for prioritising primary and secondary education in the 2025 National Budget.\nThis came out when the Parliamentary Portfolio Committee on Budget, Finance and Investment Promotion held a 2025 national budget feedback meeting in Mvurwi, Mashonaland Central province, with residents sharing their views on the allocations.\n“You did well because the highest allocation went to primary and secondary education, which is what we wanted, but you can still do better in health care. We need more facilities and medicines,” a resident said.\nActing Chairperson of the Parliamentary Portfolio Committee, Honourable Edwin Mshoriwa said the post-budget feedback meetings are constitutional and a key part of the budget process.\n“We were mainly concerned with the feedback. We came here before the budget was announced and now we are saying this is what was recommended. Were your expectations met and where did they fall short?”",
            "time": "08:38",
            "date": "10 Apr 2025"
        },
        {
            "title": "Ninth Post-Cabinet Press Briefing April 8, 2025",
            "href": "https://www.zbcnews.co.zw/ninth-post-cabinet-press-briefing-april-8-2025/",
            "content": "Today, April 8 2025, His Excellency, the President Dr. E.D. Mnangagwa chaired the Ninth Cabinet Meeting and the following issues among others, were considered and approved:\n1.0 IMPLEMENTATION OF THE PRESIDENTIAL INTERNET PROGRAMME SCHEME (PIPS)\nCabinet considered and approved the Implementation of the Presidential Internet Programme Scheme. In accordance with the provisions of the Thematic Area on Digital Economy of the National Development Strategy 1, the Presidential Internet Scheme aims to provide reliable broadband internet Connectivity targeting all the 2 400 administrative wards across the nation. This initiative will employ advanced Low Earth Orbit satellite technology and fibre optic infrastructure to ensure comprehensive coverage and accessibility.\nThese will cover schools, Community Information Centres, Zimbabwe Republic Police Stations, Health Institutions, Traditional Leaders’ homesteads, Agriculture Extension Offices, Courts, District Development Coordinators’ offices, Vocational Training Centres and Growth Points in the wards.\nThe programme will target to connect the unconnected by focusing on the areas and sites that are situated in the remote parts of the country and are currently not connected. The project is expected to start in June 2025 and run until 2030 with continuous review due to the ever-changing technology landscape.\nThe Presidential Internet Programme Scheme will bring out the following outcomes to rural communities: enhanced broadband connectivity; improved access to digital services; increased Information Communication Technology utilisation; improved financial inclusion; increased digital literacy; improved digital economy growth; increased transparency, effectiveness and efficiency in governance services. This is in line with the Smart Zimbabwe Master Plan.\n2.0 UPDATE ON THE ESTABLISHMENT OF THE YOUTH SERVICE IN ZIMBABWE TRAINING PROGRAMME AND EMPLOYMENT OF GRADUATES\nCabinet received an Update Report on the Establishment of the Youth Service in Zimbabwe Training Programme and Employment of Graduates. The Youth Service in Zimbabwe Programme that was launched by His Excellency President Dr. E.D. Mnangagwa in May 2024, is already harnessing positive dividends on the youth demographic group.\nThe first two cohorts of students numbering 1 077 who graduated from the six months’ training programme are already earmarked for employment at State-funded higher and tertiary education institutions, the Public Service, Uniformed forces, State-Owned Enterprises, including special programmes, Page 3 of 11 such as the Presidential Solarisation Programme, the Emergency Road Rehabilitation Programme and the Presidential Borehole Drilling Scheme.\nOther graduates are already enrolling for further skills upgrading at various Vocational Training Centres around the country. Government has already made it mandatory that vocational certificates will be prioritised for accessing empowerment loans and entrepreneurial start-ups, from the Empower Bank.\n3.0 STATE OF PREPAREDNESS FOR THE 2025 ZIMBABWE INTERNATIONAL TRADE FAIR: APRIL 21 TO APRIL 26, 2025\nCabinet received an update on the State of Preparedness for the 2025 Zimbabwe International Trade Fair: 21-26 April, 2025. The 65th Edition of the Zimbabwe International Trade Fair (ZITF) is scheduled for 21 to 26 April 2025, and will be held under the theme Industrialisation: Crafting an Integrated landscape”. A key highlight is the extension of the event to six days. The President of the Republic of Mozambique, His Excellency Daniel Chapo will officially open the 65th Edition of ZITF April 25, 2025.\nThe Ministry of Industry and Commerce is conducting strategic dialogues with national Business Member Organisations and industry associations to maximize private sector participation and input. As part of preparations for the event, Air Zimbabwe and Fast Jet were engaged with the aim to increase flight frequency for exhibitors and visitors and ensuring a positive customer experience.\nAs at April 7 2025, 596 direct exhibitors had registered to participate, compared to 428 who registered during the same period in 2024. Of these, 98 are exhibiting for the first time. In terms of current space booking situation, 95% has been booked to date, compared to 87% booked during the same period in 2024. International exhibitor space uptake has increased, with 29 countries having registered.\nThese include: Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the European Union delegation, Egypt, Ethiopia, France, German, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the United Kingdom, the United States of America, United Arab Emirates and Zambia. This surpasses 27 participating nations as at 2024. Additionally, India will also be participating. Some of the events that will take place during ZITF include:\n• International Business Community• Connect Africa Symposium• And a return of the CBZ Original Equipment Manufacturers among others.• There will also be the Rural Industrialisation Indaba featuring for the first time.\n4.0 REPORTS ON PROJECTS AS AT DAY 50 OF THE 1ST 100- DAY CYCLE OF 2025\n4.1 In terms of the Infrastructure Development Thematic Area of the National Development Strategy 1, the Minister of Public Service, Labour and Social Welfare highlighted the following achievements under his purview:\ni. Rehabilitation of Dzivarasekwa Pumpstation, Pumping/Gravity Mains and treated water Reservoir Repairs, in Harare Metropolitan Province has been finalised;\nii. Disposal of 94 Glaudina and 12 Borrowdale Residential stands in Harare Metropolitan Province is ongoing;\niii. Final finishings and external works for the Glaudina Flats Project (Phase 1) are almost complete, and commissioning of the project is expected to be done by end of May 2025;\niv. Preparations for the servicing of 616 residential stands in Runyararo, Masvingo Province have been completed;\nv. Project site works for the servicing of 124 residential stands under Mathendele Project in Plumtree, Matabeleland North Province have began;\nvi. Construction of Zvishavane Mixed Accommodation (Phase 2) in Zvishavane, Midlands Province is progressing well, with 156 residential units ready to be commissioned;\nvii. Zim Hydro-Power Project at Lake Mutirikwi, in Masvingo Province had been completed and awaits commissioning;\nviii. Civil works have been completed at Rupurara Valley Lodge and awaits commissioning;\nix. Tokwe Mukosi Hydro-Power Project in Masvingo Province is ongoing;\nx. Marondera Commercial Centre Warehouse construction in Marondera, Mashonaland East province is ongoing;\nxi. New Glovers Solar Project, at Munyati, Midlands Province is ongoing;\nxii. Brickwork and construction of columns Madokero Creek Phase 2 Housing ongoing;\nxiii. Paving works-ARLAC Dricway and Parking bays in Harare Metropolitan Province is almost complete;\nxiv. Refurbishment of Children’s Dormitory and Administration Block at Hupenyu Hutsva Residential Care Facility is almost complete;\nxv. On Social Protection Thematic Area the Potato Production Project at Khayelihle Children’s Village in Umguza, Matabeleland South Province and the Rabbit Production Project in Shamva, Mashonaland Central Province are progressing well.\n4.2 Under the Infrastructure and Utilities pillar of the National Development Strategy 1, the Minister of Transport and Infrastructural Development highlighted the following achievements under his purview:\ni. Construction of Trabablas Interchange exceeded cycle target and is ongoing with two bridges at Amalinda road and Harare drive missing link having been completed and opened to the traffic;\nii. Upgrading of Harare-Masvingo-Beit Bridge Road, and HarareKanyemba Road is ongoing;\niii. Construction of the Traffic Safety Council of Zimbabwe offices in Masvingo, Masvingo Province is on target;\niv. Upgrading of the Chipinge-Mt. Selinda Road and ShurugwiMhandamambwe Road fencing Project are underway.\n4.3 In terms of Governance pillar of the National Development Strategy 1, the Minister of Home Affairs and Cultural Heritage highlighted the following achievements under his purview:\ni. Installation of Solar System at ten (10) registry offices across 7 Provinces namely, Harare Metropolitan, Mashonaland Central, Mashonaland East, Manicaland, Masvingo, Matabeleland North and Matabeleland South is ongoing;\nii. Revamping of telecommunication systems for 50 Police Stations is at 90% of completion, while Deployment of Online Border Management System at all borders and airports; and Basic Automation of 23 Police Stations are ongoing;\niii. The following projects are also ongoing under the Youth, Sports, and Culture pillar of the National Development Strategy 1: Digitisation of Delineation reports in Mwenezi and Chiredzi Districts, Masvingo Province is going on well; Construction of Hebert Chitepo Trust Training Centre workshop at Bonda Mission, Mutasa District, in Manicaland Province, and Sikombela Monument Development Project in Gokwe North, Midlands Province are progressing well;\niv. The following projects have been undertaken under the Infrastructure and Utilities pillar of the National Development Strategy 1: the renovation of Mswenhede Clinic and construction of Semi-detached staff house in Mswenhede area, Mazowe District in Mashonaland Central Province is nearing completion, while construction of classroom block at Kundayi High School in Concession, Mazowe District, Mashonaland Central Province is ongoing.\n5.0 THE ZIMBABWE SCHOOL EXAMINATION COUNCIL (AMENDMENT BILL, 2024\nUnder the Legislative Programme, Cabinet considered and approved the Zimbabwe School Examination Amendment Bill. The decision to amend the Zimbabwe School Examinations Council Act [Chapter 25:18] is to address challenges obtaining in the education sector, in particular examination leakages, registration anomalies and fraudulent practices at some examination centres country-wide.\nThe Zimbabwe School Examinations Amendment Bill, 2024 therefore has inter-alia, the following objectives: streamlining Board functions to provide for the deregistration of non-compliant examination centres; strengthening of the operational efficiency of the Board; and reviewing of penalties for examination malpractices. More critically, the Bill eliminates leakages across all examination centres.\n6.0 MEMORANDUM OF UNDERSTANDING BETWEEN THE REPUBLIC OF ZIMBABWE AND THE REPUBLIC OF ALGERIA ON COOPERATION IN THE FIELD OF TECHNICAL AND VOCATIONAL EDUCATION AND TRAINING\nCabinet considered and approved the Memorandum of Understanding Between the Republic of Zimbabwe and the Republic of Algeria on Cooperation in the Field of Technical and Vocational Education and Training. The Memorandum of Understanding seeks to promote cooperation in the fields of technical and vocational education, skills development through student and staff exchange programmes as well as research and technology transfer among other activities.\n7.0 MEMORANDUM OF UNDERSTANDING BETWEEN THE REPUBLIC OF ZIMBABWE AND THE INTERNATIONAL SOLAR ALLIANCE (ISA) FOR THE ESTABLISHMENT OF A SOLAR TECHNOLOGY APPLICATION RESOURCE CENTRE (STAR-C) IN ZIMBABWE\nCabinet considered and approved the Memorandum of Understanding between the Republic of Zimbabwe and the International Solar Alliance (ISA) for the Establishment of a Solar Technology Application Resource Centre (STAR-C) in Zimbabwe.\nThe objective of the Memorandum is to provide for the establishment of the Solar Technology Application Resource Centre at Chinhoyi University in Zimbabwe. The University’s Innovation Hub shall deliver expertise to Zimbabwe and act as a one-stop centre for capacity building, testing, standardization and incubation. The STAR Centre will be expected to champion education and awareness programmes and facilitate the adoption of renewable energy technologies thereby contributing to the country’s transition from fossil fuels to sustainable and clean energy sources.",
            "time": "08:38",
            "date": "10 Apr 2025"
        },
        {
            "title": "Kuwirarana–Mutora road project brings relief to Gokwe residents",
            "href": "https://www.zbcnews.co.zw/kuwirarana-mutora-road-project-brings-relief-to-gokwe-residents/",
            "content": "\nStory by Tafara Chikumira, Midlands Bureau Chief\nTHE surfacing of the road connecting Kuwirarana and Mutora Business Centre in Gokwe, hosts of this year’s Independence Day celebrations has commenced, bringing renewed optimism to the local community.\nContractors are currently laying tarmac on sections of the Kuwirarana–Mutora stretch, while rehabilitation works are also underway on parts of the Kwekwe–Gokwe road.\nThe improved access forms part of broader road rehabilitation efforts across Gokwe North District, much to the delight of residents and motorists who frequent these routes.\n“This is a great initiative. I am impressed by the road work done thus far. We used to spend around seven hours to reach Kadoma but now it only takes us three hours. Time is of paramount importance when one is in the transport business,” a transport operator who plies the area said.\n“We used to have challenges with spares as we travelled on this route. Now it is just but a thing of the past as we just cruise at ease. We thank the President for this independence celebration. I wish they could be hosted in Gokwe every year,” a motorist added.\n“It is like a dream come true to see a tarred road in our community. Now we can wake up and marvel at our tar which is attracting more traffic in our area making it easy if one wants to travel,” a community member said.\nMeanwhile, the gravelling of the road between Gokwe Centre and Kuwirarana, which provides the shortest route from Gokwe Centre to Mutora business centre is also moving with pace after contractors have beefed personnel and equipment to attend the route.",
            "time": "08:38",
            "date": "10 Apr 2025"
        }
    ]
}