{
    "news": [
        {
            "title": "Broadcasting Services Amendment Bill set for Parly second reading",
            "href": "https://www.zbcnews.co.zw/broadcasting-services-amendment-bill-set-for-parly-second-reading/",
            "content": "\nStory by Batsirai Shoko\nThe Broadcasting Services Amendment Bill is set to go for the second parliamentary reading this coming Tuesday, following nationwide consultations.\nThe bill, among other issues, seeks to strengthen the public broadcasters’ operations.\nParliament has thrown its weight behind the bill and there is optimism it will sail through.\n“The Broadcasting Services Amendment Bill is coming to Parliament next week. We went across the country in all provinces asking what they wanted to see in the Bill.\n“The issues were around radio licensing where we need you to pay up your licenses before your Zinara tax disc,” Parly Media Committee chairperson, Honourable Caston Matewu said.\nThe Zimbabwe Broadcasting Corporation says its mandate will be greatly enhanced if the Bill sees the light of day.",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Financial inclusion key towards formalisation of the economy",
            "href": "https://www.zbcnews.co.zw/financial-inclusion-key-towards-formalisation-of-the-economy/",
            "content": "\nStory by Fairstars Mukungurutse\nThe adoption of digital payment systems by small and medium enterprises is key to promoting financial inclusion and advancing formal economic activity.\nThe call was made by the Minister of Women Affairs, Community, Small and Medium Enterprises Development Senator Monica Mutsvangwa, after emerging from a lecture titled “The Participation of Women in Economic Development: A Case of Zimbabwe” at the Zimbabwe National Defence University this Thursday.\n“The most important thing that I keep on recommending is the adoption of digital money to avoid the challenge of financial arbitrage and also ensure cash circulation in our banks. If the Ministry of Finance and the Reserve Bank avail many POS machines to our SMEs, this would allow for smooth financial transactions. When they have a conducive workspace, already registered one is bound to pay a levy to the local authority and pay tax as well,” she said.",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Over 20 people feared dead after bus and haulage truck collision",
            "href": "https://www.zbcnews.co.zw/over-20-people-feared-dead-after-bus-and-haulage-truck-collision/",
            "content": "Story by ZBC Reporter\nMore than 20 people are feared dead after a bus and a haulage truck collided head-on near the Lutumba tollgate in Beitbridge this Thursday morning.\nIt is believed the bus driver tried to overtake another vehicle and rammed into an oncoming haulage truck.\nZimbabwe Republic Police, Commissioner Paul Nyathi confirmed the accident claimed 24 lives in a statement.\n“24 people were killed when an Urban Connect bus carrying 65passengers was involved in a head-on collision with an Auto Transporthaulage truck with four occupants on board,” read the statement.",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Lyeja FM launched in Hwange",
            "href": "https://www.zbcnews.co.zw/lyeja-fm-launched-in-hwange/",
            "content": "Story by Batsirai Shoko\nWorld Radio Day commemorations in Hwange this Thursday coincided with the launch of a new community radio station, Lyeja FM, with players in the media industry praising the government for further opening up the airwaves.\nIt was a cocktail of diverse media players who all converged for a unified cause.\nWhile commemorating the day, the theme of the day was “Radio and Climate Change Resilience in Zimbabwe”, there was consensus that local radios must inform communities on this critical subject.\n“I represent six radio stations, and when we talk about radio and climate change, we say now we are talking, research by the UN has revealed that radio is the most powerful tool in developing countries.\n“We have several stations which are critical as a template to our community radio stations and we will render all the support required. We are paying tribute to the ways in which radio serves as a tool for adapting to and mitigating climate destruction in our rapidly changing world,” the Deputy Minister of Information, Publicity and Broadcasting Secretary, Dr Omphile Marupi.\nThe government continues to play a leading role in shaping the thrust of community radio stations which are identified as key information drivers.",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Manicaland to host the 18th Sanganai/Hlanganani Tourism Expo",
            "href": "https://www.zbcnews.co.zw/manicaland-to-host-the-18th-sanganai-hlanganani-tourism-expo/",
            "content": "Story by Kenias ChivuzheManicaland province will host the 18th edition of the Sanganai/Hlanganani World Tourism Expo as the prime tourism event that was only being held in Bulawayo for the past 17 years is now being taken to other provinces in line with the devolution agenda.In an interview during the tour of Mutare Sports Club in Mutare, which will be the main venue for Africa’s premier tourism event between the 10th and the 12th of September, the Minister of Tourism and Hospitality Industry, Honourable Babra Rwodzi spoke on the decision to take the tourism event to Manicaland province.“The decision that prompted us to host Sanganai away from the usual venue for the past 17 years, which is ZITF in Bulawayo, is to follow the vision of the President and achieve Vision 2030 of an upper middle income economy,” she said.“We have realised that we are one of the key ministries which are pillars to the economy of the country and the President has, since 2017, been telling the world that ‘I will achieve an upper middle income economy by devolving my economy and by taking all the programmes of the government to every corner of the country, leaving no one and no place behind’. Sanganai is a huge event, and we thought the event would contribute towards the growth of GDP in Manicaland.“We did not randomly choose Manicaland, but we agreed that every year, we must have a destination that we speak loud about so as to promote and market it. As a strategy, we want to go to different provinces every year. Victoria Falls is well known as one of the Seven Wonders of the World, but Victoria Falls is not Zimbabwe. This year, we are in Manicaland, and next year, we will be in Masvingo before moving to Mashonaland West. We want to promote local destinations.“We need to promote Nyanga, Hotsprings and our mountains among other destinations. Mutare Sports club will host the main events this year. Last year, tourism contributed 12 percent to the GDP overtaking agriculture due to the El Nino induced drought and mining due to the fluctuation of the prices. Hence, tourism is important for the country.”Manicaland Minister of State for Provincial Affairs and Devolution, Advocate Misheck Mugadza is convinced that his province will benefit from hosting the event.“We are happy to be hosting this event this year and we can see that the President’s devolution policy is being implemented and as Manicaland we are ready for the challenge.“Manicaland has many outstanding tourism destinations that include Nyangani Mountains, Mutarazi falls and Zipline, Nyangome Falls, Bridal Falls, Nyachowe Falls and many more tourism destinations.“This place should be able to accommodate the event. We were projecting the tourism sector in Manicaland to contribute seven percent to the provincial GDP, but with the province hosting this big event we are now projecting it to contribute over ten percent to the provincial GDP,” he said.The Sanganai/Hlanganani World Tourism Expo is an annual tourism trade fair organised by the Zimbabwe Tourism Authority to showcase a wide range of Africa’s best tourism products, and attracts international visitors, exhibitors, investors, suppliers, buyers and the media from across the world.\nStory by Kenias Chivuzhe\nManicaland province will host the 18th edition of the Sanganai/Hlanganani World Tourism Expo as the prime tourism event that was only being held in Bulawayo for the past 17 years is now being taken to other provinces in line with the devolution agenda.\nIn an interview during the tour of Mutare Sports Club in Mutare, which will be the main venue for Africa’s premier tourism event between the 10th and the 12th of September, the Minister of Tourism and Hospitality Industry, Honourable Babra Rwodzi spoke on the decision to take the tourism event to Manicaland province.\n“The decision that prompted us to host Sanganai away from the usual venue for the past 17 years, which is ZITF in Bulawayo, is to follow the vision of the President and achieve Vision 2030 of an upper middle income economy,” she said.\n“We have realised that we are one of the key ministries which are pillars to the economy of the country and the President has, since 2017, been telling the world that ‘I will achieve an upper middle income economy by devolving my economy and by taking all the programmes of the government to every corner of the country, leaving no one and no place behind’. Sanganai is a huge event, and we thought the event would contribute towards the growth of GDP in Manicaland.\n“We did not randomly choose Manicaland, but we agreed that every year, we must have a destination that we speak loud about so as to promote and market it. As a strategy, we want to go to different provinces every year. Victoria Falls is well known as one of the Seven Wonders of the World, but Victoria Falls is not Zimbabwe. This year, we are in Manicaland, and next year, we will be in Masvingo before moving to Mashonaland West. We want to promote local destinations.\n“We need to promote Nyanga, Hotsprings and our mountains among other destinations. Mutare Sports club will host the main events this year. Last year, tourism contributed 12 percent to the GDP overtaking agriculture due to the El Nino induced drought and mining due to the fluctuation of the prices. Hence, tourism is important for the country.”\nManicaland Minister of State for Provincial Affairs and Devolution, Advocate Misheck Mugadza is convinced that his province will benefit from hosting the event.\n“We are happy to be hosting this event this year and we can see that the President’s devolution policy is being implemented and as Manicaland we are ready for the challenge.",
            "time": "18:40",
            "date": "14 Feb 2025"
        }
    ]
}