{
    "news": [
        {
            "title": "Masvingo City Council eyes collaboration with GeoPomona Waste Management",
            "href": "https://www.zbcnews.co.zw/masvingo-city-council-eyes-collaboration-with-geopomona-waste-management/",
            "content": "Story by Owen Mandovha\nMASVINGO City Council is seeking to collaborate with the GeoPomona Waste Management Company for the construction of a landfill that will be a waste management solution in the city.\nThe GeoPomona Waste to Energy project continues to receive widespread attraction from stakeholders across the country and this Wednesday, a delegation from the city of Masvingo visited the site on a benchmarking visit in an attempt to replicate the project in their city.\nThe city has decommissioned its age-old dumpsite to pave the way for the construction of a landfill.\n“The City of Masvingo is bedevilled with a huge problem of waste management and hence this project has become a benchmark. We have seen it fit to come and learn so that we know how to develop a landfill since we have decommissioned our dumpsite,” Masvingo City Council’s Deputy Director of Environmental Health Services, Ms Sitabile Matava said.",
            "time": "20:37",
            "date": "02 Apr 2025"
        },
        {
            "title": "Mazowe and Glendale benefit from solar powered boreholes",
            "href": "https://www.zbcnews.co.zw/mazowe-and-glendale-benefit-from-solar-powered-boreholes/",
            "content": "Story by Tapiwa Machemedze\nMAZOWE and Glendale communities in Mashonaland Central Province are the latest beneficiaries of the Water, Sanitation and Health programmes being implemented by the government and its development partners.\nCommunity members gathered to witness the commissioning of solar powered water points under the programme.\nThe development comes as an intervention in areas that have experienced devastating cholera outbreaks in recent years.\n“We are happy that we have this new borehole that has been commissioned, we had some challenges in the past with cholera,” a community member said.\n“This borehole has brought a lot of relief in our area, we expect that we will now be safe and exercise high standards of hygiene,” another community member said.\n“I want to thank the National Aids Council(NAC) and Chief Negomo for building this project in our area. It will help us greatly.”\nTraditional leader, Chief Negomo extended his gratitude to NAC for complementing government efforts in providing safe and clean water to various communities.\n“I want to thank NAC for responding when we call, but it is saddening to note that we have gathered for a disease caused by uncleanliness. Let us change our habits so that we gather for good things,” Chief Negomo said.\nFor the NAC, the boreholes signify a step in promoting good health, while the government maintained its commitment to providing clean water for all people.",
            "time": "20:37",
            "date": "02 Apr 2025"
        },
        {
            "title": "Bulawayo family loses Over US$20k to mysterious fires",
            "href": "https://www.zbcnews.co.zw/bulawayo-family-loses-over-us20k-to-mysterious-fires/",
            "content": "Story by Lisa Masuku\nA family in Bulawayo is living in fear as it is reportedly being plagued by inexplicable fires that erupt spontaneously, destroying property and leaving them in financial ruin.\nJournalist Methuseli Moyo and his family have been experiencing these mysterious fires since late February, with the blazes breaking out without warning and wreaking havoc in their home.\n“These fires started towards the end of February. They ignite from nowhere, and this has been happening for some time now. We no longer feel safe here,” said Moyo.\nThe inexplicable infernos have already consumed most of the family’s possessions, including US$20 000 in cash, money they had just received from selling one of their properties.\n“The fires intensified on March 1, and now it has become a daily struggle to put them out. If you look at our walls and furniture, they are in a terrible state,” he added.\nMoyo’s wife, Ntombizodwa Mhlanga, recounted the devastating moment when the family lost their money in one of the sudden blazes.\n“We had planned to move out, but as soon as we collected the money and placed it in the wardrobe, the section where the cash was stored mysteriously caught fire. Within seconds, it was gone,” she said.\nIt is even more difficult for Moyo’s wife, Ntombizodwa Mhlanga, who has had to watch her husband sustain severe burns from the strange fires.\n“The fires have not only destroyed our property. My husband has sustained serious burns. The funny thing is that when the fire attacks him, it’s invisible. He will be screaming that he is on fire, but we won’t be seeing anything,” Ntombizodwa Mhlanga said.\nThe heart-wrenching mystery fires experienced by the Moyo family have left the community in shock and grief.\n“What is happening to the Moyo family is very sad. The family has suffered, and they no longer feel safe in their own house,” Community member, Skha Dlodlo said.",
            "time": "20:37",
            "date": "02 Apr 2025"
        },
        {
            "title": "ZIMSEC Amendment Bill set to be tabled before parliament",
            "href": "https://www.zbcnews.co.zw/zimsec-amendment-bill-set-to-be-tabled-before-parliament/",
            "content": "Story by John Nhandara\nTHE ZIMSEC Amendment Bill is set to be tabled before Cabinet this month after it went through the cabinet committee on legislation.\nThe Bill, aims to tackle persistent issues related to examination leakages, among other grey areas in the country’s education system.\nProgress on the deliberations of the bill were discussed in Harare this Tuesday during an engagement between the government and private schools and colleges.\n“The ZIMSEC Amendment Bill seeks to criminalise all malpractices that include leakages and also malpractices in terms of examinations fees for money that is supposed to be paid for examinations to the examining body. So that will act as a deterrent to stamp out all the malcontents within the education sector,” Minister of Primary and Secondary Education, Honourable Torerai Moyo said.\nThe government and private sector partnership in the education sector, registration of schools as well as mushrooming of illegal learning institutions also hogged the limelight.",
            "time": "20:37",
            "date": "02 Apr 2025"
        },
        {
            "title": "ZANU PF Hails public and security services for maintaining order",
            "href": "https://www.zbcnews.co.zw/zanu-pf-hails-public-and-security-services-for-maintaining-order/",
            "content": "Story by Fairstars Mukungurutse\nTHE ruling ZANU PF party has commended the nation for heeding the call to disregard the March 31 planned protests.\nAddressing journalists in Harare this Tuesday, ZANU PF Secretary for Information and Publicity, Ambassador Christopher Mutsvangwa, applauded the peace-loving people of Zimbabwe for refusing to participate in Monday’s illegal demonstrations.\n“I want to congratulate the people of Zimbabwe for maintaining peace and order and for maintaining faith in the leadership of President Mnangagwa, but most importantly, for keeping the gospel of the revolution on the straight and the narrow,” he said.\n“Our people have fought a war. They are very wary of the trouble of mayhem because they know what it does, so they were cautious, it is called vigilance on their part. They wanted to see the depth, scale and scope of what the detractors were up to. So they were assessing the situation, that is what happened yesterday. They did not want to fall into the trap of those in Mozambique, in Maputo and then have unnecessary loss of life.\nAmbassador Mutsvangwa also paid tribute to the security services for ensuring peace across the country.",
            "time": "20:37",
            "date": "02 Apr 2025"
        }
    ]
}