{
    "news": [
        {
            "title": "Govt pledges media sector growth, stresses importance of operating within the law",
            "href": "https://www.zbcnews.co.zw/govt-pledges-media-sector-growth-stresses-importance-of-operating-within-the-law/",
            "content": "Story by Memory Chamisa\nTHE government has reaffirmed its commitment to the media sector transformation but warned players to always operate within the confines of the law.\nSpeaking on the sidelines of the third anniversary of a local broadcasting media house in Harare this Friday, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere said, that while media freedom is fully guaranteed in Zimbabwe, advocating for the overthrowing of a legitimate government is unconstitutional.\n“The government says the media has no room to fuel the overthrowing of a legitimate government. As the nation journeys towards Vision 2030, it is important to appreciate and understand the constitutional obligations particularly Section 61 and Section 62 of the Constitution of Zimbabwe,” Dr Muswere said.\n“Section 61 of the Constitution is clear in terms of the freedom of expression and the freedom of media and Section 62, also speaks to access to information. We should also be very clear in terms of the supreme law of the country, the right to broadcast the overthrowing of a legitimate and democratic government does not exist in our Constitution. The media freedom, the freedom of expression that we have should always be guarded jealously and we should always protect our journalists.”\nMinister Muswere also said the Zimbabwe Media Commission and the Ministry will continue to work together with members of the fourth estate to give direction for the nation’s development as witnessed by the opening up of airwaves.",
            "time": "20:39",
            "date": "02 Mar 2025"
        },
        {
            "title": "Illegal mining causes major crack in Zvishavane’s Novale Road, raising safety concerns",
            "href": "https://www.zbcnews.co.zw/illegal-mining-causes-major-crack-in-zvishavanes-novale-road-raising-safety-concerns/",
            "content": "Story by Courage Bushe\nA portion of Zvishavane’s Novale road has developed a huge crack due to illegal mining activities, a worrying development that has raised safety concerns among the travelling public and residents.\nIn the National Development Strategy One (NDS1) blueprint, mining has been identified as a key accelerator to Vision 2030, however, illegal mining activities are hindering progress.\nZvishavane District Development Coordinator, Mr Darlington Chokera condemned illegal mining activities, occurring around residential areas and public infrastructures, saying concerted efforts are needed to curb the scourge.",
            "time": "20:39",
            "date": "02 Mar 2025"
        },
        {
            "title": "Woman kills hubby over infidelity",
            "href": "https://www.zbcnews.co.zw/woman-kills-hubby-over-infidelity/",
            "content": "Story by Thembinkosi Mangena\nTragedy rocked Mabvuku community in Harare after a woman allegedly stabbed her 43-year-old husband following accusations of infidelity.\nWhen the ZBC News crew arrived at the scene of the crime, the body of the deceased, Duncan Chiwaya had just been taken by the police and relatives were left cleaning blood stains in the house.\nA visibly distraught mother, Janet Dumbu, was at a loss for words after the death of her son Chiwaya.\n“I knew nothing about their marital problems and I was only shocked to be called to see my son lying in a pool of blood, with my daughter-in-law beside the body,” she said.\nA neighbour, Ellen Luundi, who was playing the role of an aunt in the couple’s marriage, confirmed the two had been having problems.\n“They have been having problems. The wife accused Chiwaya of infidelity. Last week she had packed her bags with the intention of quitting the marriage and I helped them reconcile. Then I woke up to see missed calls from the husband, and when I tried to call back it was too late, a child was at my door knocking to tell me about this tragic event,” she said.\nThe incident has left the neighbourhood shell-shocked.\n“This is painful, why do people kill each other when they have problems in marriage?” a community member asked.\n“It is better to walk out of a toxic marriage than killing each other, I am pained by the loss,” another community member said.",
            "time": "20:39",
            "date": "02 Mar 2025"
        },
        {
            "title": "Govt intensifies accountability drive in central govt operations",
            "href": "https://www.zbcnews.co.zw/govt-intensifies-accountability-drive-in-central-govt-operations/",
            "content": "Story by Theophilus Chuma\nTHE Second Republic is tightening accountability and transparency within central government operations, with Deputy-Ministers, Deputy Secretaries and Public Service Commissioners set to sign performance contracts, with effect from this year.\nRe-affirming a programme targeted to strengthen the capacity of government and increase accountability, the Chief Secretary to the President and Cabinet Dr Martin Rushwaya engaged Deputy-Ministers, Deputy Secretaries and commissioners at an induction workshop convened in Kadoma this Thursday.\n“As Zimbabwe strives to achieve Vision 2030 and respond to the diverse needs of our citizens, performance contracting emerges as a strategic approach that aligns our efforts with the priorities of our government. It establishes clear expectations, measurable outcomes and a culture of accountability that is essential for effective public service,” said Dr Rushwaya.\nThe focus of the engagement was to prepare the officials on performance contracts, a mandatory initiative that will now rate the performance of Deputy Ministers.\n“As you perform your daily duties, you are expected to drive implementation of the national vision. Your responsibilities are multi-faceted, and your success will be measured against the impact you will make in the lives of Zimbabweans.\n“Accountability is the barometer for entrenching a market-facing and people-centred government as espoused by His Excellency the President. Performance contracts are not developed in isolation, they are directly linked to Zimbabwe’s national blueprints, including Vision 2030,” noted Dr Rushwaya.\nGovernment reckons performance contracting and service delivery are critical for enhanced public administration and governance.\n“Through performance contracting, you are now part of a framework where results of your work are not only seen but measured. What Gets Measured Gets Done,” stated Dr Rushwaya.\nSince its launch by President Emmerson Mnangagwa in 2021, performance contracting continues to post significant traction and is on a critical pedestal in driving accountability.",
            "time": "20:40",
            "date": "02 Mar 2025"
        },
        {
            "title": "President Mnangagwa consoles recent flood victims as rescue efforts intensify",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-consoles-recent-flood-victims-as-rescue-efforts-intensify/",
            "content": "Story by Oleen Ndori\nPRESIDENT Emmerson Mnangagwa has extended his condolences to the families impacted by the recent rainfall-induced disasters across Zimbabwe.\nIn a statement issued via the Ministry of Local Government and Public Works, President Mnangagwa expressed his deep sorrow over the unprecedented destruction caused by the recent rains.\nThe disasters have severely affected essential infrastructure, including schools, healthcare facilities, homes, roads, and bridges, resulting in the tragic loss of life.",
            "time": "20:40",
            "date": "02 Mar 2025"
        }
    ]
}