{
    "news": [
        {
            "title": "Calls made for a multi-sectoral approach to mitigate effects of climate change",
            "href": "https://www.zbcnews.co.zw/calls-made-for-a-multi-sectoral-approach-to-mitigate-effects-of-climate-change/",
            "content": "\nStory by Tamuka Charakupa\nTHERE is a growing call for a multi-sectoral approach to address the negative effects of climate change, with the Church pledging its full support for this initiative.\nThe Roman Catholic Church in Chinhoyi recently joined the fight against climate change, emphasising the need for a comprehensive societal effort to protect the environment.\nAs part of this commitment, the church launched a tree-planting initiative aimed at promoting environmental sustainability.\n“We have organised this event to share among church followers, particularly students, the importance of environmental conservation,” Priest, Father Peter Paul said.\n“Pope Francis in his encyclical letter clearly states that climate change is a serious moral issue, driven by human activity, and demands urgent action to protect the Earth and its most vulnerable inhabitants. He has consistently called for global leaders to take concrete steps to address climate change, criticising irresponsible lifestyles while prioritising the needs of the poor in the fight against environmental degradation.\n“As young people, we have the mandate to protect our environment through engaging in actions that do not contribute towards climate change. We should plant more trees and avoid littering the environment.\n“Nature provides solutions to our daily needs be it food, medicine, ecosystem, etc and without proper and safe practices we are on the verge of destroying everything including humanity.”\nMakonde District Forestry Officer Mr Wisdom Nduku revealed the district has surpassed its 5 000 indigenous tree planting target.",
            "time": "08:38",
            "date": "23 Feb 2025"
        },
        {
            "title": "Rains claim two lives in Matabeleland North",
            "href": "https://www.zbcnews.co.zw/rains-claim-two-lives-in-matabeleland-north/",
            "content": "Story by Tichaona Kurewa\nINCESSANT rains affecting much of Zimbabwe have resulted in the loss of two lives in Matabeleland North Province.",
            "time": "08:38",
            "date": "23 Feb 2025"
        },
        {
            "title": "Zim to influence regional labour standards",
            "href": "https://www.zbcnews.co.zw/zim-to-influence-regional-labour-standards/",
            "content": "\nStory by Tichaona Kurewa\nTHE government has announced that it will leverage Zimbabwe’s position as the chairperson of the Southern African Development Community (SADC) to promote decent work and fair labour practices throughout the region.\nZimbabwe is set to host the Meeting of SADC Ministers of Employment and Labour, along with Social Partners, next month in Victoria Falls.\nDuring this meeting and other forums, Zimbabwe aims to advocate for the adoption of decent work and fair labor practices, not only within the country but also across the entire SADC region.\n“We are hosting the labour and employment forums and we shall be driving decent work and a better working standard agenda as we want that to cascade to all countries in the SADC region so that our chairmanship of SADC drives key narratives in terms of labour within the region,” Minister of Public Service, Labour and Social Welfare, Honourable Edgar Moyo said.\n“We know there is a lot of labour migration within the region and we want to consolidate that and make sure that we drive it. During our term as chairperson of SADC, we will ensure that these are some of the deliverables that we achieve.”",
            "time": "08:38",
            "date": "23 Feb 2025"
        },
        {
            "title": "Gwanda school under threat from local diverted river",
            "href": "https://www.zbcnews.co.zw/gwanda-school-under-threat-from-local-diverted-river/",
            "content": "Story by Providence Maraneli\nSEBOZA Primary School in Gwanda South is facing a serious threat from the Mkhaliphe River, which has redirected its flow towards the school.\nThe continuous rains in Matabeleland South province have made conditions unbearable for both staff and learners as they endured several hours of flooding at the school this Wednesday afternoon.\nDue to heavy siltation of the Seboza Dam downstream, the Mkhaliphe River has shifted its flow towards the school, endangering the lives of learners and teachers.\n“We are so scared to send our children to school because they might be swept away, yesterday after heavy rains teachers and children had to find shelter in unaffected classes,” a concerned villager said.\n“Water covered everything in the teacher’s quarters, so we are worried we might lose our teachers fearing for their lives,” another villager added.",
            "time": "08:38",
            "date": "23 Feb 2025"
        },
        {
            "title": "Stakeholders commit to the success of the heritage-based curriculum",
            "href": "https://www.zbcnews.co.zw/stakeholders-commit-to-the-success-of-the-heritage-based-curriculum/",
            "content": "Story by Tamuka Charakupa\nThe Better Schools Programme Zimbabwe held its Mashonaland West Provincial Awards in Kadoma, with government officials encouraging education stakeholders to support the newly introduced heritage-based curriculum.\nJameson High School in Kadoma hosted this year’s awards ceremony on Thursday.\nThe awards aims to enhance education standards in schools with Mr Tawonezvi Makoni, a representative of the award winners, emphasising that recognising students, as well as academic and non-academic staff within the educational sector, plays a crucial role in the successful implementation of the heritage-based curriculum.\n“Obviously an award is a natural push factor. It motivates everyone to continue to put more effort into their respective roles therefore contributing towards the attainment of the ministry’s goals and targets,” he said.\nThe government is upbeat that the introduction of the Education 5.0 model will unlock more economic benefits for the country.\n‘’As the Ministry of Primary and Secondary Education, our goal is to ensure that every learner is equipped with a life skill that she/he will be able to rely on as a means of survival,” Mashonaland West Provincial Education director, Mr Gabriel Mhuma said.\n“We have trained all teachers on the heritage-based curriculum and today’s event buttresses all our efforts to promote this new direction by recognizing those who are excelling in their various roles within the ministry.”\n‘’As the government, we are rolling out the devolution programme where we are constructing schools and providing essential services to our communities,” the Minister of State for Mashonaland West Provincial Affairs and Devolution director, Mr Douglas Chiwiro said.\n“The goal is to ensure that we create a conducive environment for them that stimulates economic growth.”",
            "time": "08:38",
            "date": "23 Feb 2025"
        }
    ]
}