{
    "news": [
        {
            "title": "Several feared dead in early morning collision at Dzivarasekwa turn-off",
            "href": "https://www.zbcnews.co.zw/several-feared-dead-in-early-morning-collision-at-dzivarasekwa-turn-off/",
            "content": "Story by Fairstars Mukungurutse\nSEVERAL people are feared dead and others seriously injured following a tragic accident early Wednesday morning at the Dzivarasekwa turn-off along Bulawayo Road. The collision involved a commuter omnibus, a haulage truck, and a UD truck.\nThe Dzivarasekwa turn-off area has become notorious for frequent fatal accidents.",
            "time": "18:43",
            "date": "19 Mar 2025"
        },
        {
            "title": "50 Chefs compete in Amai’s Traditional Cook-out Competition in Harare",
            "href": "https://www.zbcnews.co.zw/50-chefs-compete-in-amais-traditional-cook-out-competition-in-harare/",
            "content": "Patience Nyagato\nPROFESSIONAL chefs, along with 50 other participants, including tertiary students, community members, and individuals with disabilities, are currently taking part in the Amai’s Traditional Cook-out Competition held at Belvedere Technical Teachers College in Harare.\nHonourable Barbra Rwodzi, the Minister of Tourism and Hospitality Industry, emphasised that such cook-out competitions play a crucial role in promoting local hospitality tourism.",
            "time": "18:43",
            "date": "19 Mar 2025"
        },
        {
            "title": "Govt relocates Dema tollgate, easing costs for motorists",
            "href": "https://www.zbcnews.co.zw/govt-relocates-dema-tollgate-easing-costs-for-motorists/",
            "content": "Story by Peter Chivhima\nGOVERNMENT has started relocating tollgates from areas close to residential zones, with new facilities set to be transformed into modern toll plazas.\nMotorists in Seke have welcomed government’s decision to relocate Dema tollgate and transform the new facility into a toll plaza.\n“Sometimes I pass this area four to six times because I have a small business I am operating in this area so I end up paying a lot of money. So if this tollgate is relocated I am convinced that I will make a good profit,” a motorist said.\n“As a community member it means that we are going to pay less because transport operators will no longer paying for toll fees,” a community member said.\nThe construction of the Toll Plaza is also expected to create jobs for youths.\n“I am excited that the majority of those who will be employed are from this community. I want to thank His Excellency Cde Emmerson Mnangagwa for his vision,” Seke legislator Honourable Manyaradzi Kashambe said.\nZINARA Board Chairperson, Dr George Manyaya and the Chairperson of the Parliamentary Portfolio Committee on Transport and Infrastructural Development, Honourable Karikoga, who toured the new site for the Dema toll plaza this Tuesday, confirmed that several tollgates across the country will be relocated to about 40 kilometres from every town.",
            "time": "18:43",
            "date": "19 Mar 2025"
        },
        {
            "title": "Full Post-Cabinet Press Briefing – March 18, 2025",
            "href": "https://www.zbcnews.co.zw/full-post-cabinet-press-briefing-march-18-2025/",
            "content": "1.0 UPDATE ON THE FOOD DEFICIT MITIGATION PROGRAMME\nCabinet received and noted the Report on the Food Deficit Mitigation Programme, as presented by the Minister of Public Service, Labour and Social Welfare, Honourable Edgar Moyo. The 4th Blitz Food Distribution exercise is underway and will continue to cushion the most vulnerable food-insecure households as they await harvest of their produce. Nationally, a cumulative total of 45 513.23 metric tonnes of grain has been distributed to the communities in need under the exercise. In addition, the cumulative distribution under the Zunde raMambo/Isiphala SeNkosi stands at 4 372.51 metric tonnes of grain. Processes are underway to replenish grain stocks allocated to the Chiefs. Meanwhile, the Cash-for-Cereal Programme continues.\n2.0 WATER SECURITY UPDATE AND PREPAREDNESS FOR THE 2025 WINTER PLAN\nCabinet received the Water Security Update and Preparedness for the 2025 Winter Plan, as presented by the Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Honourable Dr. Anxious Jongwe Masuka. Page 2 of 7 In order to effectively support the 2025 Winter Plan a total of 151 major dams were monitored across the country to verify existing irrigation capacities. As at 13 March 2025, dams across the country’s ten provinces are 88.5% full. The average national levels are above the 82% recorded during the same time last season. The 2025 Winter Cereal Production target for three major crops is 135 250 hectares, with wheat on 120 000 hectares, barley on 6 500 hectares, and Irish potatoes on 8 750 hectares.\nThe Wheat Plan aims to produce 600 000 metric tonnes, surpassing the national annual requirement of 360 000 metric tonnes. Additionally, barley and potato production are expected to rise to 39 000 and 263 250 metric tonnes, respectively. To ensure the Plan’s success, Government will closely monitor 21 critical enablers, including power, water, seed, fertiliser, and fuel; financial support enablers comprising farmer payments, finance, and insurance; operational efficiency enablers comprising mechanization, coordination and contract farming; risk management enablers comprising migratory pests, land issues, security, and veld fire management; as well as other enablers such as capacity-building, the policy regulatory environment, soil management, marketing, and monitoring and evaluation. A whole of Government and indeed, a whole of sector approach, will be used to achieve the set target.\n3.0 UPDATE ON PREPARATIONS FOR THE MEETING OF SADC MINISTERS OF EMPLOYMENT AND LABOUR AND SOCIAL PARTNERS: 24 TO 28 MARCH 2025: VICTORIA FALLS, ZIMBABWE\nCabinet received an update on the Preparations for the Meeting of Southern African Development Community (SADC) Ministers of Employment and Labour and Social Partners, which will be held from 24 to 28 March 2025, at Elephant Hills Hotel, in Victoria Falls, as presented by the Minister of Public Service, Labour and Social Welfare, Honourable Edgar Moyo. The objective of the Meeting is to enable the Ministers of Labour and Employment and Social Partners in the SADC region to take stock of the implementation of Employment and Labour Sector Programmes, and to decide on issues of strategic relevance to the region.\nThe Meeting is also expected to discuss signature and ratification status of the SADC Protocol on Employment and Labour; Declaration of the promotion of Decent Works and the Elimination of Forced Labour in the fisheries sector in the SADC region; and Development of the Revised Regional Technical and Vocational Education and Training. Cabinet assures the Nation that Preparations for the Meeting are progressing well.\n4.0 PUBLIC PROCUREMENT AND DISPOSAL OF PUBLIC ASSETS AMENDMENT BILL, 2025\nCabinet considered and approved the Public Procurement and Disposal of Public Assets Amendment Bill, 2025, which was presented by the Minister of Justice, Legal and Parliamentary Affairs, Honourable Ziyambi Ziyambi, as Chairperson of the Cabinet Committee on Legislation. The Public Procurement and Disposal of Public Assets Amendment Bill seeks to fortify the existing Public Procurement and Disposal of Public Assets Act [Chapter 22:23] by addressing gaps and challenges that hinder its alignment with the Constitution of Zimbabwe.\nAmong other key amendments, the Bill introduces the restriction of employees and their relatives from participating in the procurement of disposed assets, thereby preventing potential conflicts of interest and undue influence. This move aims to promote transparency, fairness, and accountability in public procurement processes for ease of doing business while facilitating the country’s road to rapid industrialisation in pursuit of Vision 2030. The Amendment generally ensures better management in the procurement and disposal of public assets.\n5.0 MEMORANDUM OF UNDERSTANDING BETWEEN THE REPUBLIC OF ZIMBABWE AND THE REPUBLIC OF NICARAGUA ON THE ESTABLISHMENT OF A JOINT PERMANENT COMMISSION ON COOPERATION\nCabinet considered and approved the Memoranda of Understanding between the Republic of Zimbabwe and the Republic of Nicaragua on the Establishment of a Joint Permanent Commission on Cooperation, which was presented by the Minister of Justice, Legal and Parliamentary Affairs, Honourable Ziyambi Ziyambi, as Chairperson of the Cabinet Committee on Legislation.\nThe Agreement aims to bolster bilateral relations and cooperation by promoting mutual understanding and collaboration. The Joint Permanent Commission on Cooperation will focus on strengthening bilateral ties and fostering cooperation across various sectors, including Economic Cooperation, Scientific and Technological Advancements, Environmental Protection, Education, and Cultural Exchange.\n6.0 THE CONVENTION ESTABLISHING THE INTERNATIONAL ORGANISATION FOR MEDIATION\nCabinet considered and approved the signing of the Convention Establishing the International Organisation for Mediation, which was presented by the Minister of Justice, Legal and Parliamentary Affairs, Honourable Ziyambi Ziyambi, as Chairperson of the Cabinet Committee on Legislation. Zimbabwe is continuously increasing its participation in regional and international organisations that champion peace and human well-being.\nAccordingly, it is desirable for Zimbabwe to become a party to the Convention on the Establishment of the International Organisation for Mediation (IOMed). Spearheaded by the People’s Republic of China, the IOMed will be the first intergovernmental international legal organisation dedicated to resolving international disputes through mediation. The Page 6 of 7 IOMed plays a crucial role in implementing the peaceful resolution of international disputes, as stipulated in the United Nations Charter, and offers a new option for countries to resolve disputes peacefully.\n7.0 REPORT ON THE SADC EXTRAORDINARY SUMMIT OF HEADS OF STATE AND GOVERNMENT: 13 MARCH 2025",
            "time": "18:43",
            "date": "19 Mar 2025"
        },
        {
            "title": "Ministry of Youth Empowerment collaborates with CZA Church to boost youth development",
            "href": "https://www.zbcnews.co.zw/ministry-of-youth-empowerment-collaborates-with-cza-church-to-boost-youth-development/",
            "content": "Story by ZBC Reporter\nTHE Ministry of Youth Empowerment, Development, and Vocational Training is in the process of formalising a Memorandum of Understanding (MoU) with the CZA Church to collaborate on advancing youth development initiatives in Mashonaland Central province.\nThis came out when a delegation from the ministry led by the Deputy Minister, Honourable Kudakwashe Mupamhanga held a meeting with church leaders in Goora, Madziwa this Tuesday.\nThe CZA Church has been actively involved in training and upskilling youths in Mashonaland Central Province, particularly at their headquarters at Goora, Mt. Darwin South Constituency.\nThe church’s initiatives feeds into the rebranded Youth Service Zimbabwe programme which aims to create patriotic youths who are of service to their localities and the nation.",
            "time": "18:43",
            "date": "19 Mar 2025"
        }
    ]
}