{
    "news": [
        {
            "title": "Kwekwe community rallies behind Broadcasting Amendment Bill",
            "href": "https://www.zbcnews.co.zw/kwekwe-community-rallies-behind-broadcasting-amendment-bill/",
            "content": "Story by Tafara Chikumira\nThe Kwekwe community has thrown its weight behind the proposed Broadcasting Services Amendment Bill saying the piece of legislation will change the national broadcasting landscape if passed into law.\nThe Bill is drawing huge interest from stakeholders who are yearning for a better broadcasting industry that speaks to their needs.\nThe Parliamentary Portfolio Committee on Media, Information and Broadcasting Services was in Kwekwe this Saturday where stakeholders proved their knowledge on the tenets of the bill while airing their expectations on the piece of legislation.\nPastors for ED chairperson Evangelist Idirashe Dongo said, “What we want is to see ourselves in the media. This bill must address issues like local content being aired in vernacular languages. We want the bill to stimulate energy on having diverse content so that we deal with foreign content which promotes immoral behaviours like homosexuality. We also want critical programmes like parliament debate to be done in vernacular languages.”\n“As a Kwekwe resident, I am so happy that you came here to listen to our views regarding this bill. We want to see to it that we have exciting programmes on our radio and television stations. This can only happen if our state broadcaster is capacitated. I therefore support the clause that says people should pay their car radio licenses before paying ZINARA licences. That way, our state broadcaster will be capacitated in a huge way and we are bound to receive quality programming,” said a resident.\nAnother added, “I am happy on the proposal that BAZ should sit after every year to consider granting of new radio licenses. This will bring efficiency on prospective license seekers, unlike in the past where it took forever before such considerations were made.”",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Festive season safety; ZRP increases patrols and roadblocks",
            "href": "https://www.zbcnews.co.zw/festive-season-safety-zrp-increases-patrols-and-roadblocks/",
            "content": "Story by Fungai Jachi\nLAW enforcement agencies have geared up for a significant deployment on the country’s major highways to ensure compliance with traffic regulations during the festive season.\nThe Zimbabwe Republic Police (ZRP) says enough deployments have been made in all major roads, warning errant motorists that decisive action will be taken against those who flout traffic rules.\n“The ZRP has made enough deployments on all the major roads. The deployments include roadblocks, traffic blitz, stop and search, motorised and cycle patrols to curb crime, road traffic accidents, maintain law and order in the central business district, residential, industrial as well as leisure centres. The ZRP will impound all unworthy road vehicles. The commuting public are discouraged from boarding non-public service vehicles for their own safety,” ZRP Commissioner General Godwin Matanga said.",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Zimparks gains ground in war against poaching",
            "href": "https://www.zbcnews.co.zw/zimparks-gains-ground-in-war-against-poaching/",
            "content": "Story by Memory Chamisa\nTHE Zimbabwe Parks and Wildlife Management Authority (Zimparks) has reiterated its commitment to ensuring zero poaching and maximum protection of wildlife in national parks.\nDeterrent measures and laws have significantly contributed to a successful 2024 for the Zimbabwe Parks and Wildlife Management Authority.\nResponding to their 2024 legislative report, Zimparks Spokesperson Mr Tinashe Farawo alluded to the fact that the organisation had recorded wins in combating poaching, especially in north-west Matabeleland centred on Hwange National Park.\nHe said, “Not a single incident of poaching of high value elephants has been recorded since the past three years. We are working closely with the police and the judiciary to achieve our goal of zero poaching and I want to reiterate and warn members of the public to make sure they are not found in protected areas while armed. We also recovered more than 80 rifles and other ammunition. Over 58 convictions of mandatory sentences were done. We have also managed to recover live pangolins which people are poaching for different reasons. Community engagements have also played a significant role in protecting our wildlife and ensuring perpetrators are brought to book and justice is delivered.”",
            "time": "20:32",
            "date": "21 Dec 2024"
        },
        {
            "title": "Govt urges home seekers to follow proper procedures",
            "href": "https://www.zbcnews.co.zw/govt-urges-home-seekers-to-follow-proper-procedures/",
            "content": "Story by Oleen Ndori\nGOVERNMENT has implored home seekers to ensure all applications and acquisitions are above board, as the Second Republic targets to deliver one million housing units by 2025.\nResponding to questions from the media during the inaugural Ministers Meet the Media Forum in Harare this Thursday, National Housing and Social Amenities Minister Honourable Zhemu Soda said the current crisis of home demolitions stem from irregular acquisition or building on improperly acquired land, urging all potential home seekers to be diligent.\n“To our potential home seekers, all applications and acquisitions must be above board. Whenever that is done irregularly, obviously the harm of the law will take its course. We encourage all home seekers, despite their desperation, that acquisition of ten houses must be done properly. Whenever it is not done properly, there are problems that are associated with that. Already, we are grappling with the issue of regularisation of dysfunctional settlements that were created previously where people just went on to construct their homes without adequate supporting services like roads, the other amenities, schools, crèches and even the shopping centres. They are supposed to be there to support a community or a settlement. So we are at the moment grappling with that correction,” he said.\nHonourable Soda also revealed government is intervening in providing solutions to poor town planning by the City of Harare which has led to illegal structures, with some being built on wetlands.\n“The issue comes back to Harare City Council, where there has to be new planning for the discharge of waste, especially from the houses that are being constructed and also the other link has been to the wetlands where we are finding that some houses are now being constructed in wetlands which ordinarily are not supposed to be available for house construction.\n“All that comes back to the issue of planning, which the city of Harare is responsible for and even the upgrades of the waste management and waste reticulation assistance. But as a ministry, working together with them, it is our wish that whenever people are being settled, the places must be habitable, places which are not susceptible to hazards like natural hazards. Plus, for instance, what we did in Budiriro 5B in 2021, where some families were left homeless as a result of poor planning. So it is our hope that whenever our local authorities are allocating areas for settling people, the areas must be suitable, properly planned so that we don’t have a repeat of what’s currently obtaining.”\nThe Housing Minister also celebrated significant milestones his portfolio has made towards national housing targets which have been revised to one million housing units by 2025.",
            "time": "20:32",
            "date": "21 Dec 2024"
        },
        {
            "title": "Heritage-based curriculum bears fruit",
            "href": "https://www.zbcnews.co.zw/heritage-based-curriculum-bears-fruit/",
            "content": "Story by John Nhandara\nGovernment says the introduction of the Heritage-based Curriculum (2024–2030) is a game changer in the delivery of inclusive quality primary and secondary education, as it inculcates critical thinking skills among learners.\nGovernment’s review of the Competence-Based Education Curriculum and subsequent introduction of the Heritage-based Curriculum has helped cultivate critical thinking skills, problem solving techniques and team work among learners.\nThis was said by Primary and Secondary Education Minister Honourable Torerai Moyo while highlighting some of the major milestones that Zimbabwe has recorded in the education sector this year.\nHe said, “Another milestone that we have achieved as a ministry is to review the Competence-based curriculum and introduce the Heritage-based curriculum. We want learners to have a deep understanding of their heritage, their surroundings and to identify challenges they face at home, schools, communities and they then do research based on the problem and try to proffer solutions through the power of digital tools.”",
            "time": "20:32",
            "date": "21 Dec 2024"
        }
    ]
}