{
    "news": [
        {
            "title": "Manicaland ear veterans receive boost from govt programmes",
            "href": "https://www.zbcnews.co.zw/manicaland-ear-veterans-receive-boost-from-govt-programmes/",
            "content": "Story by Oliver Karuru\nWAR Veterans in Manicaland Province have started to benefit from the welfare and empowerment programmes being spearheaded by the government and the ruling ZANU PF party.\nThe War Veterans Provincial Inter-district meeting held in Mutasa district this Saturday saw the Manicaland War Veterans leadership expressing appreciation to the government and the ruling party for the empowerment initiatives that are already benefiting freedom fighters within the province with over 150 benefitting so far.\n“On behalf of Manicaland province war veterans league leadership and on my own behalf, we jointly thank the President His Excellency Cee Emmerson Mnangagwa for the Presidential Revolving Fund Scheme, Borehole Scheme, loans, the Housing Scheme. On the Presidential Revolving Fund, Manicaland province received a total of US$150 000 and a total of 175 war veterans benefited so far,” Manicaland War Veterans League Chairperson, Cde Linda Matatu said.\nWar Veterans Affairs Minister, Senator Monica Mavhunga spoke on the efforts and programmes being spearheaded by her ministry to improve the welfare of war veterans.\n“We are engaging the Ministry of Finance to increase war veterans’ monthly income. We are also pushing for all the war collaborators who have been vetted to start receiving money soon. All the war veterans who have been given farms but have no offer letters are going to be given their permits by mid next month. They are also going to be given tittle deeds while all those without land will be allocated,” Senator Mavhunga said.",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Govt rolls out digital devices and drug awareness campaigns to empower youths",
            "href": "https://www.zbcnews.co.zw/govt-rolls-out-digital-devices-and-drug-awareness-campaigns-to-empower-youths/",
            "content": "Story by Tamuka Charakupa\nGOVERNMENT is forging ahead with the empowerment of youths through availing digital devices and information on the dangers of drug and substance abuse.\nTwo youth empowerment programmes were held in Chinhoyi, Mashonaland West Province this Friday, with government seeking to capacitate and boost the potential of the youth dividend to contribute to national development.\nA total of 36 junior parliamentarians from the province received digital devices in the form of tablets are part of government efforts to enhance their oversight duties.\n“We want to thank the Second Republic for implementing an inclusive development agenda that also considers young people. These gadgets will facilitate effective communication as we continue to advocate for youth rights,” Junior Minister of State for Mashonaland West Provincial Affairs, Stacy Mapfuti said.\nA drug and substance awareness campaign was also held, allowing imprisoned survivors to share their sad stories of being hooked to drugs.\n“I am now finishing my degree in prison after I was convicted for stealing at my workplace where I got money to fund my drug addiction.”",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Inclusivity celebrated at Amai’s Cookout in Bulilima",
            "href": "https://www.zbcnews.co.zw/inclusivity-celebrated-at-amais-cookout-in-bulilima/",
            "content": "Story by Providence Maraneli\nTHE Second Republic’s mantra of leaving no one and no place behind was again demonstrated at the First Lady Dr Auxillia Mnangagwa’s traditional cookout competition held in Makhulela area in Bulilima this Thursday, with scores of people taking part in the culinary competition.\nBeyond the imaginary gloomy picture of poverty and despair painted by some sections of the media on the San People, lies a traditional system that takes one’s careful understanding to appreciate.\nAs part of the development phase of humanity, the San were known for being nomadic hunters and gatherers, and it is from this phase that they mastered the art of protecting wild animals and fruits.\nThese traditional knowledge systems have been passed from generation to generation as exhibited by Maxwell Moyo’s elephant biltong dishes and other preserved wild fruits that dominated the competition.\nBeyond the ordinary, Moyo and other two other contestants are men who joined this year’s traditional culinary competition.\n“It is our culture that when the father brings meat from a hunt, we cut it into pieces and sun-dry for three days, and after it has dried, we pack it. I was raised by my grandmother so I realised I can cook just like anyone and I said let me try,” a contestant said.\n“As a person with a disability, I participated in this year’s competition, and I cooked the traditional dishes of the San culture,” another contestant said.\n“I am delighted to be part of this competition. I am glad to be the winner of this competition. I took the notes from my mother and here I am,” another participant said.\nThe local leadership is convinced Amai’s Traditional Cookout Competition dovetails with the Second Republic’s mantra of not leaving anyone and any place behind in terms of development.\n“The choice of Makhulela as the other venue for the cookout programme in the province tells us that the First Lady is serious in terms of inclusive development. We are so grateful,” the Acting Director for Coordination in Matabeleland South, Mrs Sikhangele Ndlovu said.\n“We are so grateful to the First Lady that she has this community at heart and having a cookout here is evidence enough that she loves these once marginalised people,” Provincial Officer in the Ministry of Women Affairs, Small and Medium Enterprises Development, Mrs Marjory Sikhundla said.",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Mtawatawa Magistrates Court officially opened",
            "href": "https://www.zbcnews.co.zw/mtawatawa-magistrates-court-officially-opened/",
            "content": "Story by Jerold Sasa\nTHE Second Republic continues to score success stories in various sectors with its drive for taking justice to the people having been witnessed by the opening of the Mtawatawa Magistrates Court this Friday.\nThe Judicial Services Commission which has been operating a court at the Mtawatawa government complex has constructed a magistrate’s court which also has holding cells and a witness shelter.\nSecretary of the Judicial Services Commission, Mr Walter Chikwana said the court is set to bring justice delivery system to the people.\n“Many people faced challenges accessing justice with some experiencing delays so this new court brings justice to the people,” Mr Chikwana said.\nStakeholders have welcomed the opening of the court in the area.\n“We have so many cases which used to give us challenges as ZRP but we are now happy that we have a court,” a police officer said.",
            "time": "20:38",
            "date": "05 Apr 2025"
        },
        {
            "title": "Govt reaffirms commitment to grant title deeds to war veterans",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-grant-title-deeds-to-war-veterans/",
            "content": "Story by Tafara Chikumira\nTHE government has reaffirmed its commitment to ensuring that all war veterans have title deeds for their land, a move aimed at empowering freedom fighters, who played a crucial role in the country’s independence.\nThe government confirmed that over 600 war veterans are on land but without title deeds, promising that their documents should be processed by mid-next month under the Presidential Title Deeds programme.\nSpeaking at an interactive meeting with Ministers of State for Provincial Affairs and Devolution and heads of government departments in Kwekwe this Thursday, the Minister of Lands, Agriculture, Fisheries, Water, and Rural Development, Dr Anxious Masuka emphasised the government’s efforts to empower war veterans.\n“The government’s policy position is that war veterans ought not to be disturbed. 632 war veterans are on land but without tenure documents and their documents should be processed by mid-next month. 129 issues related to the war veterans have been resolved. We also discussed the Independence Celebrations which are proceeding at pace and we have received a report that the VBUs have been established according to plan.”\nThe Minister of War Veterans of the Liberation Struggle, Senator Monica Mavhunga urged veterans of the liberation struggle who are facing challenges related to land to visit relevant offices for assistance.\n“Our war veterans went to war to fight for our liberation and for us to get the land we now have. Today, we received a report that a lot of disputes related to the war veterans have been resolved and those who still have issues must go to the relevant offices and check if their names are there.”",
            "time": "20:38",
            "date": "05 Apr 2025"
        }
    ]
}