{
    "news": [
        {
            "title": "Two killed and two injured in Masvingo – Beitbridge Road multi-bus accident",
            "href": "https://www.zbcnews.co.zw/two-killed-and-two-injured-in-masvingo-beitbridge-road-multi-bus-accident/",
            "content": "Story by Gay Matambo\nTwo people died while two others were injured in a road traffic accident that occurred along the Masvingo-Beitbridge Road early Sunday morning.\nZimbabwe Republic Police Masvingo Provincial Spokesperson, Inspector Kudakwashe Dhewa confirmed the accident.\nThe accident involved three buses – Rimbi, Tombs and Mbokodo buses, which were all travelling towards Beitbridge.",
            "time": "06:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Church commits to ending drug and substance abuse",
            "href": "https://www.zbcnews.co.zw/church-commits-to-ending-drug-and-substance-abuse/",
            "content": "Story by Fungai Jachi\nTHE church continues to extend its long-standing efforts to nurture and protect children and youths from the effects of societal ills, particularly drug and substance abuse.\nAddressing social norms and attitudes that drive harmful practices among children and the youth has been a key component of Christian faith since time immemorial.\nThis Saturday, scores of children drawn from various parts of Harare converged in Highfield for the Johane Masowe Chishanu children’s interface aimed at tackling drug and substance abuse among youths.\nThe event was also a platform to award scholars who excelled in the just ended public examinations.\nThe children highly condemned the use of drugs.\n“It’s wrong for children to take drugs because it will ruin their mental capacity and they end up unable to realize their dreams,” said a child.\nAnother added, “Drugs are harmful to health. Also while others are focusing on their studies, you will be concentrating on intoxicating yourself and it destroys your future.”\n“It is a big embarrassment to parents because they work hard to make sure you get quality education so we should make them proud,” a child added.",
            "time": "06:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Kwekwe community rallies behind Broadcasting Amendment Bill",
            "href": "https://www.zbcnews.co.zw/kwekwe-community-rallies-behind-broadcasting-amendment-bill/",
            "content": "Story by Tafara Chikumira\nThe Kwekwe community has thrown its weight behind the proposed Broadcasting Services Amendment Bill saying the piece of legislation will change the national broadcasting landscape if passed into law.\nThe Bill is drawing huge interest from stakeholders who are yearning for a better broadcasting industry that speaks to their needs.\nThe Parliamentary Portfolio Committee on Media, Information and Broadcasting Services was in Kwekwe this Saturday where stakeholders proved their knowledge on the tenets of the bill while airing their expectations on the piece of legislation.\nPastors for ED chairperson Evangelist Idirashe Dongo said, “What we want is to see ourselves in the media. This bill must address issues like local content being aired in vernacular languages. We want the bill to stimulate energy on having diverse content so that we deal with foreign content which promotes immoral behaviours like homosexuality. We also want critical programmes like parliament debate to be done in vernacular languages.”\n“As a Kwekwe resident, I am so happy that you came here to listen to our views regarding this bill. We want to see to it that we have exciting programmes on our radio and television stations. This can only happen if our state broadcaster is capacitated. I therefore support the clause that says people should pay their car radio licenses before paying ZINARA licences. That way, our state broadcaster will be capacitated in a huge way and we are bound to receive quality programming,” said a resident.\nAnother added, “I am happy on the proposal that BAZ should sit after every year to consider granting of new radio licenses. This will bring efficiency on prospective license seekers, unlike in the past where it took forever before such considerations were made.”",
            "time": "06:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Festive season safety; ZRP increases patrols and roadblocks",
            "href": "https://www.zbcnews.co.zw/festive-season-safety-zrp-increases-patrols-and-roadblocks/",
            "content": "Story by Fungai Jachi\nLAW enforcement agencies have geared up for a significant deployment on the country’s major highways to ensure compliance with traffic regulations during the festive season.\nThe Zimbabwe Republic Police (ZRP) says enough deployments have been made in all major roads, warning errant motorists that decisive action will be taken against those who flout traffic rules.\n“The ZRP has made enough deployments on all the major roads. The deployments include roadblocks, traffic blitz, stop and search, motorised and cycle patrols to curb crime, road traffic accidents, maintain law and order in the central business district, residential, industrial as well as leisure centres. The ZRP will impound all unworthy road vehicles. The commuting public are discouraged from boarding non-public service vehicles for their own safety,” ZRP Commissioner General Godwin Matanga said.",
            "time": "06:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Zimparks gains ground in war against poaching",
            "href": "https://www.zbcnews.co.zw/zimparks-gains-ground-in-war-against-poaching/",
            "content": "Story by Memory Chamisa\nTHE Zimbabwe Parks and Wildlife Management Authority (Zimparks) has reiterated its commitment to ensuring zero poaching and maximum protection of wildlife in national parks.\nDeterrent measures and laws have significantly contributed to a successful 2024 for the Zimbabwe Parks and Wildlife Management Authority.\nResponding to their 2024 legislative report, Zimparks Spokesperson Mr Tinashe Farawo alluded to the fact that the organisation had recorded wins in combating poaching, especially in north-west Matabeleland centred on Hwange National Park.\nHe said, “Not a single incident of poaching of high value elephants has been recorded since the past three years. We are working closely with the police and the judiciary to achieve our goal of zero poaching and I want to reiterate and warn members of the public to make sure they are not found in protected areas while armed. We also recovered more than 80 rifles and other ammunition. Over 58 convictions of mandatory sentences were done. We have also managed to recover live pangolins which people are poaching for different reasons. Community engagements have also played a significant role in protecting our wildlife and ensuring perpetrators are brought to book and justice is delivered.”",
            "time": "06:33",
            "date": "23 Dec 2024"
        }
    ]
}