{
    "news": [
        {
            "title": "Cyclone Chido weakens, to reach Zimbabwe Tuesday",
            "href": "https://www.zbcnews.co.zw/cyclone-chido-weakens-to-reach-zimbabwe-tuesday/",
            "content": "Story by Chantay Ruswa\nTropical Cyclone Chido, which is set to hit Zimbabwe this Tuesday, has weakened after it made landfall in Mozambique on Sunday, the Metrological Services Department has reported.\nIn a brief by Tapiwa Masawi of the Metrological Services Department, the Cyclone had more strength when it was in the ocean, but weakened when it made landfall over Mozambique early Sunday morning.",
            "time": "18:44",
            "date": "16 Dec 2024"
        },
        {
            "title": "Advocate Mudenda honoured for defending democracy",
            "href": "https://www.zbcnews.co.zw/advocate-mudenda-honoured-for-defending-democracy/",
            "content": "Speaker of Parliament, Advocate Jacob Francis Nzwidamilimo Mudenda has received the Grand Defender of Democracy award for “the unflinching dedicated service, unwavering commitment to duty and iconic visionary leadership as an inspiring Member of the Executive Committee of the SADC Parliamentary Forum for the period November 2022 to December 2024” during the just ended SADC PF Plenary Assembly and related meetings.\n\nThe SADC Parliamentary Forum (SADC-PF) successfully concluded its business on 14th December 2024 in Livingstone, Zambia.\n\nThemed “Leveraging Technology and Innovation for Smart, Inclusive, and Responsive Parliaments in the SADC Region,” the Plenary Assembly session brought together Parliamentary delegations from across the region to deliberate on key issues driving regional integration, technological advancement and inclusive governance.\n\nSpeaker Mudenda, who has heralded both the Executive Committee Meeting held previously in Johannesburg, South Africa and the Plenary Assembly meetings for his unparalleled leadership antecedents, presented high-profile deliveries, including a tribute to Hon. Professor Peter H. Katjavivi, the outgoing Speaker of the National Assembly of Namibia, in recognition of his extraordinary contributions to regional integration and parliamentary diplomacy. The tribute formed part of the SADC PF’s Legacy Project, celebrating Prof. Katjavivi’s distinguished service ahead of his retirement in March 2025.\n\nAdvocate Mudenda also delivered the Vote of Thanks during the Official Opening Ceremony, which featured an address by the Guest of Honour, His Excellency President Hakainde Hichilema of the Republic of Zambia. His remarks underscored Zimbabwe’s commitment to regional collaboration and its readiness to host the 57th Plenary Assembly Session, scheduled for June/July 2025 in Zimbabwe.\n\nSpeaker Mudenda, leading the SADC PF Strategic Lobbying Team has been entrusted with the critical mandate to secure the remaining signatures for the Amendment of the Treaty to establish a regional Parliament from Botswana, Madagascar and Mauritius to ensure that no SADC country is left out in the critical signature process. As Chairman of the Strategic Lobbying Team, Speaker Mudenda’s mission is to rally all countries and bring to fruition the Transformation of the SADC PF into a fully-fledged Regional Parliament, a process that he has led for over 14 years.\n\nApplauded for his steadfast strategic guidance, past and present, Advocate Mudenda’s efforts have positioned the Forum on the brink of transformation. This effort aims to facilitate the seamless transition of the SADC PF into a Regional Parliament, ensuring operational coherence during the transformation process matrix.\n\nAdvocate Mudenda’s instrumental role as Chairperson of the Strategic Lobbying Team was further reaffirmed through his endorsement by the Plenary Assembly as an ex-officio member of the SADC PF Executive Committee. This position underscores his invaluable contribution to the Forum’s operations and strategic objectives. Added to this, Speaker Mudenda will join his Colleagues, including the Speaker of South Africa, Hon. Thoko Didiza and Speaker Carolina Cerqueira of Angola as part of the established Resource Mobilization Committee to muster resources for the Forum.\n\nZimbabwe’s representation at the Assembly also included Hon. Maybe Mbohwa, endorsed Member of the Executive Committee of the SADC PF (2024 to 2028), Hon. Chinhenza Chigwajara (Chief Matsiwo), Hon. Tendai Nyabani, Hon. Lynette Karenyi and Hon. Mercy Mugomo. Their active participation showcased Zimbabwe’s commitment to advancing regional integration, fostering digital innovation in governance and promoting the transformation of the SADC PF into a Regional Parliament.\n\nThe 56th Plenary Assembly Session ended with a collective pledge to harness digital technologies for inclusive and responsive legislative institutions across the region.",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Fire damages Army Headquarters complex at Josiah Magama Tongogara Barracks",
            "href": "https://www.zbcnews.co.zw/fire-damages-army-headquarters-complex-at-josiah-magama-tongogara-barracks/",
            "content": "The Zimbabwe National Army informs the public that a fire broke out at its Army Headquarters administrative complex located at Josiah Magama Tongogara Barracks, formerly KG6, in Harare, resulting in damage to some of the offices at the complex.",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Government and private players intensify fight against GBV",
            "href": "https://www.zbcnews.co.zw/government-and-private-players-intensify-fight-against-gbv/",
            "content": "Story by Courage Bushe\n\nThe private sector has been called upon to foster safer and more inclusive workplaces in bid to combat gender-based violence (GBV).\n\nAs gender-based violence continues to plague communities worldwide, survivors, activists, policy makers, and implementers in the Midlands Province have called for urgent and collaborative action to address the scourge.\n\n“We are happy that we got an opportunity to learn and give solutions to old ways that promote gbv in our communities. This is a good initiative, and we are happy with this initiative,” a community member said.\n\nAnother said, “Let’s not mock survivors. Let’s believe in them. If we believe in them, then we will adopt comprehensive and inclusive approaches that tackle root causes.”\n\nMidlands Minister of State for Provincial Affairs and Devolution, Honourable Owen Ncube highlighted steps being taken by the government to address the worrisome trajectory trend.\n",
            "time": "18:45",
            "date": "16 Dec 2024"
        },
        {
            "title": "Binga Chiefs receive fishing rigs",
            "href": "https://www.zbcnews.co.zw/binga-chiefs-receive-fishing-rigs/",
            "content": "Story by Mhlomuli Ncube\n\nTraditional leaders in Binga have received fishing rigs under a Presidential scheme which has also benefitted women and youths in the district.\n\nEmpowering communities is a key priority in the Second Republic. In Binga, where the Zambezi River is a critical source of livelihoods, government has been supporting communities who survive on fishing by availing fishing rigs.\n\nBeneficiaries told the ZBC News, “We want to thank government for continuing to enable empowerment in Binga. This is an important initiative for us here who have always been fishing for a living. We recognise the importance attached by government and our President to empowering Binga people.”\n\nThe capacitation of communities is an important part of government’s drive towards an upper middle-income economy by 2030.\n\nMatabeleland North Minister of State for Provincial Affairs and Devolution, Hon Richard Moyo said, “This is a timely intervention by the 2nd Republic under the able leadership of His Excellency, the President E.D. Mnangagwa meant to improve household income levels and general livelihoods for economic benefit.”\n\n“We are seeing a critical drive to empower young people also. This is exactly how our President wants economic empowerment to be,” said the Minister of Youth Empowerment, Development and Vocational Training, Hon Tino Machakaire.\n",
            "time": "18:45",
            "date": "16 Dec 2024"
        }
    ]
}