{
    "news": [
        {
            "title": "Pottery saves Chitungwiza man from drug addiction",
            "href": "https://www.zbcnews.co.zw/pottery-saves-chitungwiza-man-from-drug-addiction/",
            "content": "Story by Memory Chamisa\nPottery has saved a 25-year-old Chitungwiza man, as the craft represents a dividing line in his life between drug abuse and finding purpose.\nWhile some of his peers still abuse drugs and other substances, Gift Zirende, popularly known as MaCenturion has turned a new leaf and is optimistic about what the future holds for him.\nHaving hanged around the wrong crowd which contributed to him using drugs, MaCenturion received his Damascus moment when he met a well-wisher who took him in and rehabilitated him through pottery.\nFrom just passing time, the craft has now become a part of his identity and purpose.\n“I was a troubled young man and was always in trouble as I associated with the wrong crowd which contributed to a lot of wrong decisions I made in my life. It also affected my life to the extent that I was thrown out of our family home by parents. I became homeless and was taken in by a well-wisher who then taught me pottery,” he said.",
            "time": "06:28",
            "date": "27 Dec 2024"
        },
        {
            "title": "Govt works to ease Bulawayo water crisis",
            "href": "https://www.zbcnews.co.zw/govt-works-to-ease-bulawayo-water-crisis/",
            "content": "Story by Grace Sibanda\nGovernment says it is working on robust short term measures to address water challenges in the city of Bulawayo.\nThe assurance comes as some residents have gone for weeks without the precious liquid.\nWith the water crisis escalating each day in Bulawayo, residents are forced to resort to alternative water sources in search of the precious source that is proving to be more scarce day by day.\n“We have had no water for the past 3 months and when water does come, it is in very small quantities such that it is not enough for everyone. We now rely on buying water from bowsers,” a Bulawayo resident said.\nAnother added, “This water has been flowing for a long time and since we do not have any water in our taps, we come and fetch here.”\n“We have had no water for a long time and we really need the government to assist us because the situation is no longer nice at all.”",
            "time": "06:28",
            "date": "27 Dec 2024"
        },
        {
            "title": "Exploring Christmas behind bars",
            "href": "https://www.zbcnews.co.zw/christmas-behind-bars/",
            "content": "Story by Abigirl Tembo\nChristmas Day is a time for joy, love and celebration for many, but for those behind bars, it’s a stark reminder of their isolation.\nAs the ZBC News walked through the prison yards, some inmates were eagerly unwrapping gifts and enjoying treats brought by their loved ones.\nHowever, others sat alone, their faces a picture of sadness and longing.\n“I’m grateful that my family remembered me. It’s a small comfort, but it means a lot to me,” said an inmate.\nBut not all inmates were as fortunate. Many had not received any visitors or gifts, and the loneliness was evident.\n“It’s hard to be away from my family on Christmas Day. I have been here for six years and I have never received a single visitor. I just wish someone would come and visit me, just to remind me that I’m not forgotten,” and inmate narrated.\n“My family please forgive me. I am serving my time and I am sorry, please come and visit me.”\n“I wish someone could come and visit me. Even for 30 minutes only,” said another inmate.",
            "time": "06:28",
            "date": "27 Dec 2024"
        },
        {
            "title": "Christmas gifts: Families welcome newborns on joyous holiday",
            "href": "https://www.zbcnews.co.zw/christmas-gifts-families-welcome-newborns-on-joyous-holiday/",
            "content": "Story by Grace Sibanda\nWhile others were celebrating Christmas with friends and family, delighted mothers rejoiced after receiving their newborns, with some terming them “Christmas miracles.”\nChristmas Day is a time of joy, love and celebration, for some families, this Christmas was a time to welcome new additions to their families.\n“I am leaving this Christmas with my baby girl and this is a happy day for me. I will always remember this day as a day I brought my baby to the earth with no hustle at all. I am leaving with no stitch or any pain at all,” said a mother.\nThe maternity ward this Christmas was a hive of activity as new mothers suckled their newly-born babies while others hummed their new borns to sleep.\nThe new mothers cited how Christmas Day will always hold fond memories as it is a day their Christmas miracles were brought into the world, symbolically the day that Jesus Christ was born.\n“I am so happy for my little Christmas gift, she is so amazing and I wouldn’t have asked for a better gift,” a mother said.\nAnother added, “Christmas will always be a special day for me and my family as this is the day I got my first child, I am more than happy.”",
            "time": "06:28",
            "date": "27 Dec 2024"
        },
        {
            "title": "Meet and Greet initiative excites tourists",
            "href": "https://www.zbcnews.co.zw/meet-and-greet-initiative-excites-tourists/",
            "content": "Story by Mhlomuli Ncube\nGovernment says the Meet and Greet Concept where tourists are welcomed personally by the Ministry of Tourism and Hospitality Industry is a culmination of a transformative growth plan for the sector.\nThe Tourism Meet and Greet initiative has also excited tourists who expressed joy at the country’s hospitality approach.\nMany visiting Zimbabwe’s tourism capital Victoria Falls testify of a great welcoming moment which is unique and places the country at the pinnacle of destinations to visit.\n“I am travelling from California, USA and am visiting Zimbabwe to see the Victoria Falls. Thank you for the amazing gift, we love it,” a tourist told the ZBC News.",
            "time": "06:28",
            "date": "27 Dec 2024"
        }
    ]
}