{
    "news": [
        {
            "title": "Christmas gifts: Families welcome newborns on joyous holiday",
            "href": "https://www.zbcnews.co.zw/christmas-gifts-families-welcome-newborns-on-joyous-holiday/",
            "content": "Story by Grace Sibanda\nWhile others were celebrating Christmas with friends and family, delighted mothers rejoiced after receiving their newborns, with some terming them “Christmas miracles.”\nChristmas Day is a time of joy, love and celebration, for some families, this Christmas was a time to welcome new additions to their families.\n“I am leaving this Christmas with my baby girl and this is a happy day for me. I will always remember this day as a day I brought my baby to the earth with no hustle at all. I am leaving with no stitch or any pain at all,” said a mother.\nThe maternity ward this Christmas was a hive of activity as new mothers suckled their newly-born babies while others hummed their new borns to sleep.\nThe new mothers cited how Christmas Day will always hold fond memories as it is a day their Christmas miracles were brought into the world, symbolically the day that Jesus Christ was born.\n“I am so happy for my little Christmas gift, she is so amazing and I wouldn’t have asked for a better gift,” a mother said.\nAnother added, “Christmas will always be a special day for me and my family as this is the day I got my first child, I am more than happy.”",
            "time": "18:33",
            "date": "25 Dec 2024"
        },
        {
            "title": "Meet and Greet initiative excites tourists",
            "href": "https://www.zbcnews.co.zw/meet-and-greet-initiative-excites-tourists/",
            "content": "Story by Mhlomuli Ncube\nGovernment says the Meet and Greet Concept where tourists are welcomed personally by the Ministry of Tourism and Hospitality Industry is a culmination of a transformative growth plan for the sector.\nThe Tourism Meet and Greet initiative has also excited tourists who expressed joy at the country’s hospitality approach.\nMany visiting Zimbabwe’s tourism capital Victoria Falls testify of a great welcoming moment which is unique and places the country at the pinnacle of destinations to visit.\n“I am travelling from California, USA and am visiting Zimbabwe to see the Victoria Falls. Thank you for the amazing gift, we love it,” a tourist told the ZBC News.",
            "time": "18:33",
            "date": "25 Dec 2024"
        },
        {
            "title": "Zimbabweans honoured in China",
            "href": "https://www.zbcnews.co.zw/zimbabweans-honoured-in-china/",
            "content": "Story by Jonathan Marerwa in Beijing, China\nTwo Zimbabweans based in China have been honoured by the Public Diplomacy Network for promoting Africa-China co-operation.\nThe two, Bridget Mutambirwa and Melody Zekey Pand, were presented with the Public Diplomacy Persons of the Year award during a ceremony held recently in Beijing, becoming the first Africans and women to get such recognition.\nMutambirwa and Pand are media personalities and have both been mouthpieces of the Africa-China co-operation initiative.",
            "time": "18:33",
            "date": "25 Dec 2024"
        },
        {
            "title": "ZRP’s festive season campaigns intensified",
            "href": "https://www.zbcnews.co.zw/zrps-festive-season-campaigns-intensified/",
            "content": "Tafara Chikumira\nThe Zimbabwe Republic Police in the Midlands province has intensified campaigns on traffic and crime awareness during the festive period, imploring the public to be on high alert for possible mishaps associated with the season.\nWith massive deployments having been made across districts, the provincial police team is currently holding campaigns to conscientise the public on the new trends being used by robbers and thieves, while urging motorists to adhere to road rules during the holidays.",
            "time": "18:33",
            "date": "25 Dec 2024"
        },
        {
            "title": "Two killed and two injured in Masvingo – Beitbridge Road multi-bus accident",
            "href": "https://www.zbcnews.co.zw/two-killed-and-two-injured-in-masvingo-beitbridge-road-multi-bus-accident/",
            "content": "Story by Gay Matambo\nTwo people died while two others were injured in a road traffic accident that occurred along the Masvingo-Beitbridge Road early Sunday morning.\nZimbabwe Republic Police Masvingo Provincial Spokesperson, Inspector Kudakwashe Dhewa confirmed the accident.\nThe accident involved three buses – Rimbi, Tombs and Mbokodo buses, which were all travelling towards Beitbridge.",
            "time": "18:33",
            "date": "25 Dec 2024"
        }
    ]
}