{
    "news": [
        {
            "title": "Zimbabwe Gender Commission & UN unite in fighting GBV",
            "href": "https://www.zbcnews.co.zw/32322-2/",
            "content": "Story by Fairstars Mukungurutse\nA national study on violence against women in politics by the Zimbabwe Gender Commission has revealed that gender-based violence is a significant barrier to women’s full participation in politics.\nThe national study commissioned by the Zimbabwe Gender Commission in partnership with United Nations Women in Harare this Wednesday seeks to promote zero tolerance to all forms of gender-based violence against women in politics.\nThe survey revealed a worrying trend of women parliamentary candidates experiencing some form of violence including harassment, cyber-bullying, emotional and verbal abuse perpetrated by both men and women.\nChairperson of the Zimbabwe Gender Commission, Commissioner Margaret Mukahanana Sangarwe called for a multi-stakeholder approach to effectively address violence against women in the politics.\n“No single solution can eradicate this vice. Instead, we must adopt a wide array of measures across different levels to effectively address the various forms of violence women face in the political arena while taking into account the complex contexts in which these incidents occur. The report comes with a set of recommendations for multi-sectoral stakeholders on preventing and responding to violence some of which include the implementation of legislation and policies that address violence against women in politics and holding political parties accountable to gender equality and women empowerment commitments,” Commissioner Sangarwe noted.\nJapanese Deputy Ambassador to Zimbabwe Mr Hiro Yuki expressed commitment to continue supporting the country’s efforts to eradicate GBV, sentiments echoed by a representative from the French embassy Mrs Lucie Gal-Ong.",
            "time": "06:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "Government commissions fire tenders for RDCs",
            "href": "https://www.zbcnews.co.zw/government-commissions-fire-tenders-for-rdcs/",
            "content": "Story by Tafara Chikumira\nGovernment has commissioned fire tenders for rural local authorities in the Midlands province as the Second Republic moves to ensure previously marginalised communities benefit from the country’s industrialisation efforts.\nThe two fire tenders commissioned for Vungu and Chirumanzu-Zibagwe rural district councils mark a new chapter for the communities, which previously relied on help from nearby cities in the event of fire challenges.\nThe fire tenders are part of the 133 firefighting trucks acquired from Belarus, a testimony of the Second Republic’s inclusive development approach.\n“This is a first for us. Previously we would rely on Gweru City Council to deal with fire. This meant that we could not move with speed in addressing such outbreaks and chances of serving lives and properties were slim. Now we have just been equipped with this truck and hopefully our services will improve,” said Vungu Rural District Council acting chairperson, Miss Loreen Maheru.",
            "time": "06:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zim launches new carbon market framework to tackle climate change",
            "href": "https://www.zbcnews.co.zw/zim-launches-new-carbon-market-framework-to-tackle-climate-change/",
            "content": "IN a bold step toward combating climate change and fostering sustainable development, Zimbabwe has officially launched a comprehensive carbon market framework.\nThe initiative, unveiled at a high-profile event at the COP29 Climate Conference in Balu Azerbaijan, aims to position the country as a leader in carbon market development, while advancing national commitments under the Paris Agreement.\nThe new framework, developed in collaboration with international environmental experts and local stakeholders, provides a regulated platform for the development and trade of Article 6 compliant carbon credits.\nBuilding on the experience of other early movers like Ghana, Zimbabwe’s framework includes several first of their kind innovations, including;\n• A blockchain based national carbon registry: designed to support seamless digital transactions within a secure digital ecosystem.\n– Strict environmental and social safeguards: ensuring that all carbon projects make meaningful contributions to sustainable development and do not come at the expense of the wellbeing of local communities and the natural environment.\n– Strengthened legal protections: securing the rights of investors and local communities.\n– An improved regulatory framework: designed to provide clear guidelines for public and private sector participation while providing all projects a clear pathway to Article 6 eligibility.\nThe framework introduces clear guidelines for verifying, registering, and trading carbon credits, ensuring transparency and alignment with international standards.\nClear guidelines not only guide investors through the project development process but streamline the steps needed for end users to purchase and use Article 6 eligible credits.\nIn addition to requiring all project developers to increase their investment in community development, the government has pledged to allocate the majority of all carbon market proceeds to the National Climate Fund (NCF) to finance national climate mitigation and adaptation initiatives.\nThe framework comes at a crucial moment, paving the way for existing projects to transition to Article 6 eligibility.\nBy generating Article 6 eligible credits, local developers will not only be able to achieve higher profits but will be able to access new markets, including CORSIA and national compliance markets abroad.\nWith this framework, Zimbabwe joins a growing list of African nations leveraging carbon markets to address climate change while creating economic opportunities.\nThe country’s abundant natural resources and commitment to sustainability make it well-positioned to become a key player in the global carbon trading ecosystem.",
            "time": "06:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "Ruling ZANU PF leads charge against hunger in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/ruling-zanu-pf-leads-charge-against-hunger-in-zimbabwe/",
            "content": "Story by Bruce Chahwanda, Political Editor\nThe ZANU PF-led government has made significant strides in ensuring national food security despite the adverse effects of the El Nino induced drought.\nThis was confirmed by the party’s Secretary for Information and Publicity, Ambassador Christopher Mutsvangwa during a media briefing in Harare this Tuesday.\nAmbassador Mutsvangwa gave credit to government and its partners for a successful year across all sectors.\nBriefing journalists at the party’s headquarters in Harare this Tuesday, Ambassador Mutsvangwa extoled President Emmerson Mnangagwa for ensuring food security in the country despite the El Nino-induced drought.\n“ZANU PF has lived to its billing in terms of food distribution, ensuring that no one dies of hunger. Kudos to President Emmerson Mnangagwa, the business community and other stakeholders for delivering food to the people of Zimbabwe. We haven’t seen pictures of people struggling and this alone we give thanks to the Second Republic leadership,” he said.",
            "time": "06:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "Development partners support identified as key in fostering youth development",
            "href": "https://www.zbcnews.co.zw/development-partners-support-identified-as-key-in-fostering-youth-development/",
            "content": "Story by Fairstars Mukungurutse\nThe Campaign for Female Education (CAMFED) has partnered the Ministry of Youth Empowerment, Development, and Vocational Training to foster a supportive environment for youth development.\nThe move is in line with the government’s vision to achieve an upper-middle-income economy by 2030.\nThe memorandum of understanding signed by the Ministry Of Youth Empowerment, Development and Vocational Training with the Campaign for Female Education (Camfed) seeks to enhance educational and economic opportunities for young women from marginalized areas through training and mentorship programmes.\nCAMFED Zimbabwe Co-national Director, Mrs Justina Hama said, “This partnership will mainly be focusing on girls that are out of school, who have finished school and now want to venture into different pathways. So, we have girls that want to become entrepreneurs, we have girls who want to go the formal route. Right now, our CAMA network has just around 85 000 girls. So, we are targeting as many girls as possible that can benefit from this partnership. The partnership is going to improve the capacity of our young women in terms of running their businesses, increase their income and improve livelihoods.”\nYouth Empowerment, Development and Vocational Training Permanent Secretary, Mr Solomon Mhlanga underscored the importance of stakeholder support to advance youth development.",
            "time": "06:34",
            "date": "19 Dec 2024"
        }
    ]
}