{
    "news": [
        {
            "title": "Kwekwe-Zhombe Road upgrade brings relief to communities",
            "href": "https://www.zbcnews.co.zw/kwekwe-zhombe-road-upgrade-brings-relief-to-communities/",
            "content": "Story by Tafara Chikumira\nTHE Government has commissioned the Kwekwe-Zhombe road following the completion of the critical infrastructure which connects Kwekwe district to Gokwe North and South districts.\nThe road is among several infrastructural projects accelerated ahead of this year’s Independence Day commemorations hosted in Gokwe North District.\nPreviously in a state of disrepair, the road had become a serious hazard for motorists and pedestrians alike.\n“I don’t know how to thank the President for his visionary leadership. We were now in trouble. The road had become such a sore. I witnessed 16 fatal road accidents as a result of the state of the road. Todayweare relieved. Thanks to our President for his work,” Chief Gwesela said.\nLocalresidents echoed similar sentiments, expressing gratitude for the time saved, reduced vehicle breakdowns, and improved business opportunities.\n“We used to spend three hours from Kwekwe to this place. Now it is a matter of 30 minutes.Thismeans more money in our businesses.\n“We used to have a lot of problems with regard to breakdowns, now that the road is smooth, everything is now a thing of the past.\n“I want to thank our President for this road. We need more such projects,” locals in the area said.",
            "time": "20:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Lawmakers sensitised on aligning development programmes with national vision",
            "href": "https://www.zbcnews.co.zw/lawmakers-sensitised-on-aligning-development-programmes-with-national-vision/",
            "content": "Story by Peter Chivhima\nLAWMAKERS have been challenged to implement programmes that advance the attainment of Sustainable Development Goals (SDGs) and the country’s vision to become an upper-middle-income society by 2030.\nThis comes as legislators gathered for a sensitisation session at the New Parliament Building in Mt Hampden this Thursday, where they were briefed on the importance of mainstreaming SDGs and Agenda 2063 into community-based development initiatives.\nThe session, which drew participation from several members of Parliament, sought to strengthen the link between policy, implementation, and community impact.\n“For us, the session was an eye-opener, as you know that I represent people with special needs, so this will enable me to carry their needs from communities to Parliament,”Senator Annah Shiri, who represents persons with disabilities, said.\n“We are happy to note that our government is leading in implementing these Sustainable Development Goals which were unpacked today. We are seeing that the issue of education, there are several initiatives in place,” Zaka North legislator, Honourable Ophias Murambiwa said.\n“During the meeting a number of issues were discussed in regards to the Sustainable Development Goals, so it is important that we continue to engage on such so that Members of Parliament fully understand how to implement those SDGs in their communities,” Chairperson of the Thematic Committee on SDGs, Honourable Senator Chief Nkatazo Siansali added.\nHonourable Chenjerai Kangausaru, legislator for Hurungwe East Constituency, also pledged to act on the knowledgegained\n“We are going to implement what we have learnt today for the benefit of our communities, as you are aware that we are here because of them.”\nMrs Sylocoius Chaturuka, Director for Sustainable Development Goals and Agenda 2063 in the Ministry of Public Service, Labour and Social Welfare, emphasised the crucial role of lawmakers in grassroots development.\n“The idea stemmed from the recognition that parliamentarians are closest to thepeoplethey operate at the community level, where real development and transformation must occur,” she said.\n“We are rolling out Voluntary Local Reviews (VLRs) with local authorities and communities to track SDG progress. We want parliamentarians to be our advocates, ensuring SDGs and Agenda 2063 are fully integrated into the Mid-Term Development Strategy (MDS2).”",
            "time": "20:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Blanket Mine hands over solar plant to CrossBoundary Energy",
            "href": "https://www.zbcnews.co.zw/blanket-mine-hands-over-solar-plant-to-crossboundary-energy/",
            "content": "Story by Providence Maraneli\nZIMBABWE continues to make strides in its transition towards clean energy, with the government supporting investments in renewable energy development.\nThis Thursday, Blanket Mine, a Gwanda-based gold mining giant, officially handed over its solar power plant toCrossBoundary Energy (CBE), a leading regional energy firm, as part of a broader push towards sustainable production and energy security.\nThe mine, which is projecting gold production of between73 000and78 000ounces this year, is concurrently investing in both output expansion and renewable energy integration.\n“Through prioritising local procurement, we further strengthen regional economic development, ensuring that the benefits of our operations extend far beyond the mine and into the heart of our communities. As Caledonia Mining, we remain focused on growing our gold production while staying true to our environmental and social commitments,” Mr Victor Gapare, Director of Caledonia MiningCorporationsaid.\nCrossBoundary Energy, which will now operate the solar plant, expressed excitement over the new partnership.\n“CBE exists to decarbonise industry by providing clean, affordable and reliable power directly to Africanbusiness. Incorporating this solar plant into our growing portfolio to supply Blanket Mine with affordable power perfectly aligns with our mission and marks the start of a long partnership,” Ms Tessa Lee, CBE’s Chief Regulatory Officer said.\nGovernment is committed to supporting investments that empower provinces to unlock their economic potential through infrastructure, energy, and industrial growth.\n“We commend Caledonia Mining Corporation and CrossBoundary Energy for their visionary investment in green energy and for choosing to plant the seeds of sustainability right here in Matabeleland South. This initiative goes beyond powering a mine, it powers local development, job creation, and economic resilience in our province,” Mr Richmond Ncube, Director of Economics in the Ministry of Provincial Affairs andDevolutionsaid.\nDeputy Minister of Mines and Mining Development, Honourable Caleb Makwiranzou, also praised the development.\n“We are pleased by the establishment of this plant as it will enhance production at this plant.”\nOfficiating at the handover ceremony at Blanket Mine in Gwanda this Thursday, the Minister of Energy and Power Development, Honourable July Moyo,saidthe government is committed to supporting energy investments through incentivessuch asduty exemptions for all energy capital equipment and solar products.",
            "time": "20:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Colonel (Rtd) Makova remembered for patriotic service",
            "href": "https://www.zbcnews.co.zw/colonel-rtd-makova-remembered-for-patriotic-service/",
            "content": "Story by Mercy Bofu-Matinha\nMASVINGO-A funeral parade for liberation war hero, Colonel Retired Claudious Makova has been held at 4 Infantry Brigade in Masvingo, with the late being described as a patriotic cadre.\nThe Zimbabwe National Army (ZNA) Chief of Staff Quartermaster Staff, Major General Simo Maseko, who led proceedings at the funeral parade, described the late Colonel Retired Makova as a dedicated and principled man who served his country until the time of his death.\n“Colonel Retired Claudious Makova served diligently and purposefully in the Zimbabwe Defence Forces, he left a legacy of excellence in the organisation. His loyalty and patriotism towards his beloved country remind us of how lucky we are as a nation to have a generation of officers and commanders of the caliber of the departed Colonel. His willpower to fight for the liberation of the country and defend its ideals after independence remained unwavering,” Major General Simo Maseko said.\nThe late Colonel Retired Makova’s family said they are mourning their pillar of strength and a unifier.\n“Our father was a hard worker who strived for his family. He helped a lot including his extended family to ensure many were educated. He was also an honest man hence a principled father figure. We want to thank the Zimbabwe National Army and our government for honouring him,” family representative, Mr Oliver Makova said.\nBorn in Bikita in 1949, Colonel Retired Makova joined the liberation struggle in 1977 as a ZANLA cadre in Mozambique.\nHe went through training in Tanzania and was selected to be an instructor at Nachingeta Training Camp.\nHe was later assigned to Tete, and in 1979 he was sent to Romania for further training.\nAfter Independence, he joined the Zimbabwe National Army in 1982 and rose through the ranks to become a Colonel.",
            "time": "20:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "Government steps up revival of Community Share Ownership Trusts",
            "href": "https://www.zbcnews.co.zw/government-steps-up-revival-of-community-share-ownership-trusts/",
            "content": "Story by Tafara Chikumira\nGOVERNMENT has intensified efforts to revive Community Share Ownership trusts (CSOTs) with a view to ensure that communities benefit from proceeds accrued from mining activities in their respective areas.\nThis renewed thrust comes amid concerns that only six out of the 59 registered CSOTs remain operational at a mere 10 % survival rate, with the rest either dormant or defunct.\nThe revival of the CSOTs is part of the Second Republic’s broader rural industrialisation agenda, which aims to ensure the equitable distribution of mineral wealth while promoting inclusive and sustainable local development.\n“We are saying people should be able to benefit from the economic activities in their localities. We cannot fold our hands when the law is clear on what needs to be done. The consultations we are carrying out will culminate in a policy position to be approved by the cabinet. We want to see the industrialisation of communities being driven by CSOTs which remain vital in the development matrix,” Minister of Industry and Commerce, Honourable Mangaliso Ndlovu said.\nIn mineral-rich provinces like the Midlands, authorities believe the revival of CSOTs will play a catalytic role in boosting local economies and unlocking entrepreneurship potential.\n“The revitalisation of the Community Share Ownership Trusts resonates with the Second Republic’s Heritage-based Modernisation and industrialisation agenda which is anchored on harnessing local resources and empowering Indigenous people to spearhead innovation that addresses local problems guided by His Excellency, President Emmerson Mnangagwa’ s mantra: ‘Nyika inovakwa, inotongwa, inonamatirwa nevene vayo,” Minister of State for Midlands Provincial Affairs and Devolution, Honourable Owen Ncube said.\nEstablished to foster community development in areas where extractive industries operate, CSOTs were initially envisioned as a mechanism to fund local infrastructure, education, health, and income-generating projects through a percentage of profits from mining companies operating in those areas.\nHowever, years of inactivity, poor oversight, and lack of clarity in implementation frameworks led to stagnation.",
            "time": "20:46",
            "date": "11 Jul 2025"
        }
    ]
}