{
    "news": [
        {
            "title": "Sekuru Kashiri buried",
            "href": "https://www.zbcnews.co.zw/sekuru-kashiri-buried/",
            "content": "Story by Kenias Chivhuzhe\nMr Leonard Mwatambandini Kashiri, who died on the 14th of February at the age of 103, has been buried at Yeovil Cemetery in Mutare with government, the church, family and friends celebrating his long life.\nVice President General (Retired) Dr Constantino Chiwenga first went to the Kashiri residents in Murambi, Mutare before proceeding to Holy Name Anglican Church in Sakubva for a church service where he described the late as a humble father whose legacy of love and unity should guide the family, the church and the nation.\nHe said, “It is with a sad heart that we gather here to lay to rest Sekuru Tambandini Kashiri. President Mnangagwa tasked me to come here for the burial of sekuru. We are celebrating the life of Sekuru Kashiri who was aged 103 years at the time of his passing on. This is an indication of a long life worth celebrating. Sekuru Kashiri worked at St Faith as a building instructor and built most buildings we see today at the Anglican Church. Sekuru was passionate about football. He once played for Mutare United as a defender with his son as a goalkeeper in the same team.\n“He was fit and God rewarded him with long life as an ardent church member. Sekuru was a respected member of the community, a God-fearing man and an ardent churchgoer at the Anglican Church. At the Holy Name Church, he was a Mubvuwi. He was a loving and respected family man. When his wife was on wheelchair, Sekuru would push and assist his wife with love. He left a spirit of love and unity. I urge you Antony to continue with Sekuru Kashiri’s legacy of love and guide the family to live a Christian life as love and unity are two important virtues in life.”\nThe late Sekuru Kashiri’s first-born child, Mr Antony Kashiri who is husband to the Minister of Defence, Cde Oppah Muchinguri Kashiri, says the family is humbled by the love and condolences coming from people from all walks of life.\nHe said, “The late raised us in a Christian way. I want to thank my wife for allowing us to take care of my father and taking care of his medical bills. Our father passed away at a time God saw it fit.  He was a family man and disciplinarian and that is what shaped me. It was a blessing to have a father like him. He was a church member and a teacher. We are humble and we thank the president and vice president for this honour.”\nThe late Sekuru Kashiri is remembered by fellow church members and government officials as an ardent Christian.\n“Sekuru Kashiri was a strong church member who led other church members in advancing the word of God. As a teacher, he helped in the construction of St Faith High School. We should learn from him the need to promote education with productivity,” a church mate said.",
            "time": "20:25",
            "date": "19 Feb 2025"
        },
        {
            "title": "Harare City Council executives gobble US$500 000",
            "href": "https://www.zbcnews.co.zw/executives-gobble-us500-000-as-residents-yearn-for-proper-service-delivery/",
            "content": "Story by Theophilus Chuma\nHarare City Council executives have once again courted controversy, amid shocking revelations of hefty salaries and holiday perks, running into several millions of dollars at the expense of service delivery.\nThe misconduct charge sheet of the Harare City Council stretches as long as the Zambezi River, exposing a series of conspiracies and alleged underhand operations within the local authority.\nA salary bill running into half a million United States dollars monthly awarded to only a few executives at Town House is just but a tip of the iceberg to the shenanigans at Harare City Council.\nAnd the Mayor has been kept in the dark, according to the evidence presented during a session of the Commission of Inquiry on Harare City Council this Tuesday.\n“It is an anomaly. I have not been able to access the salary roll for the executives. The only time I saw it was when the acting human resources director came to my office and presented the document and he said that he had been instructed by the town clerk not to leave it with me. I just managed a glimpse of the document and saw that the town clerk earned as much as US$27 000 per month, and the figure goes to around US$13 000 per month as the grade goes downwards. All in all it is costing us at least US$500 000 per month and that is unsustainable,”\nAt the centre of the controversy, official documents reveal a 2024 holiday expense bill of over US$100 000 for the executives.\n“I am actually shocked that they can award themselves such perks I was not aware,” he said.\nHarare City is paying dearly for the discord on priorities by the City Father’s.",
            "time": "20:25",
            "date": "19 Feb 2025"
        },
        {
            "title": "Govt commits to supporting media industry growth in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/govt-commits-to-supporting-media-industry-growth-in-zimbabwe/",
            "content": "Story by Abigirl Tembo\nGovernment has committed to supporting the growth of the media industry, citing it as a crucial partner in national development.\nThis came out during a media Indaba hosted by the Zimbabwe Union of Journalists (ZUJ) in Harare this Wednesday.\nThe media Indaba brought together stakeholders to discuss the critical role of the media in nation-building and to explore ways to promote a robust and professional journalism fraternity in Zimbabwe.\nThe Minister of Information, Publicity, and Broadcasting Services, Dr Jenfan Muswere emphasised the importance of well-paid and professional journalists in achieving Zimbabwe’s vision of an upper-middle-income society by 2030.\nHe said, “Let’s focus on socio-economic issues, developmental issues developed for the media cannot survive as an institution if the economy is not performing well. This will also ensure that the media industry also grows, but we are very open and we want you to criticise, we want you to write about the truth. We want you to ensure that we leave no one in no place behind, in terms of access to information and education.\n“But it is also the responsibility of ZUJ and its memberships to be part of a democratic process, reality and nation-building. To form an educated nation is very important for nation-building. But a fourth estate that supports treason, hate and division is not good for the growth of our country. A media fraternity that focuses on defending other people is not good for the growth of our country. For, as a people, we all have rights, and there is no right to violate other people’s rights.”\nPanel discussions at the Indaba raised important questions about government’s commitment to defending media freedom and promoting a favourable working environment.\n“Minister you said during your tenure, no journalist has been arrested, commendable. However, we still have acts that have a chilling effect on the practice of journalism. For example, the fact of just being called to the law and order, the statements sometimes that are issued, they then posit and have an effect of us self-censoring. And in some cases, we’ve even had threats of civil defamation, but from government to say, well, we will sue you. And we are already facing sustainability challenges, but with the legal handle on our heads, the legal field and so forth, on things that can possibly be addressed by dialogue and by engagement. Which brings me to my first question, to what extent is our minister, with whom we are dialoguing and engaging with, are you defending our terrain, our space in the cabinet, with your principals and colleagues?”\nThe minister responded by emphasising the importance of access to information and the government’s willingness to engage with journalists and media stakeholders.\n“I am available anytime you want to ask questions. We can discuss anything, if you want we can transform this engagement into questions and answers. With every sector, I’m available to respond to every question that you want. We also have a platform where you have an opportunity every week to ask cabinet ministers questions on anything,” said the Minister.\nZimbabwe Union of Journalists President, George Maponga said such engagements are necessary for the development of the media industry.\n“The Indaba was a platform to breathe oxygen into the lungs of the media industry in Zimbabwe, specifically looking at issues that are afflicting the media industry, journalism in particular. I think you’re quite aware that we have several outstanding issues that we feel were drawing the industry back. Issues to do with the standardisation of the profession itself, issues to do with professionalism that speak to the Media Practitioners Act, which is still at a bill level at the moment. So the Indaba sought to aid impetus to push the industry to improve the media industry. The responsible authorities, that is the legislature and the government, to make sure that there is a movement towards the actualisation of the Media Practitioners Act.",
            "time": "20:25",
            "date": "19 Feb 2025"
        },
        {
            "title": "Hwange’s Big Charlie dies",
            "href": "https://www.zbcnews.co.zw/hwanges-big-charlie-dies/",
            "content": "Story by Batsirai Donavan Shoko\nA Hwange man popularly known as Big Charlie on account of his unique physical attributes has passed away.\nThe giant from the mining town famed for his 2,1 metres height and 300kgs weight reportedly passed away this Tuesday morning at St Patrick’s Hospital in Empumalanga Suburb.\nAccording to family Spokesperson Ms Susan Ndlovu, Big Charlie had been suffering from high blood pressure and diabetes.",
            "time": "20:25",
            "date": "19 Feb 2025"
        },
        {
            "title": "Bikita community benefits from wetlands conservation",
            "href": "https://www.zbcnews.co.zw/bikita-community-benefits-from-wetlands-conservation/",
            "content": "Story by Mercy Bofu-Matinha\nVillagers in Bikita are benefitting from their wetlands conservation efforts through sustainable agriculture projects, with more communities being called upon to embrace sustainable management of natural resources.\nThe restoration of Mukweture and Chapedo wetlands in Bikita has come as a major relief for the surrounding community as it has enabled them to expand their agricultural initiatives.\nThe two projects spearheaded by the community through assistance from the Environmental Management Agency (EMA) and Christian Care Zimbabwe, are benefitting nearly 1 000 families through gardening, apiculture, livestock and fish farming projects.\n“We are excited about this project of wetlands conservation, when we started we never thought the project would benefit us. We managed to put up a weir as our water reservoir and our partners helped with water pump and pipes. Now we have got four community gardens supplied water from the reservoir,” said a community member.\n“From this wetland, we also put up bee hives and we are now into apiculture supplying the community and beyond with honey,” said another community member.\nEMA emphasised the importance of wetlands conservation in ensuring food security at the same time addressing the impact of climate change.\n“As EMA we encourage communities to take advantage of natural resources in their areas and use them sustainably for development. Today we are witnessing the importance of wetlands conservation as the people of Bikita are now able to do a number of agriculture initiatives. Now they have got weirs that conserve water throughout the year and even their livestock is now benefitting.  This shows that if we work together we can address the impact of climate change even at community level,” said EMA Masvingo provincial manager, Mr Milton Muusha.\nChristian Care Zimbabwe continues to compliment government efforts in empowering rural communities through food security.",
            "time": "20:25",
            "date": "19 Feb 2025"
        }
    ]
}