{
    "news": [
        {
            "title": "Mtawatawa Magistrates Court officially opened",
            "href": "https://www.zbcnews.co.zw/mtawatawa-magistrates-court-officially-opened/",
            "content": "Story by Jerold Sasa\nTHE Second Republic continues to score success stories in various sectors with its drive for taking justice to the people having been witnessed by the opening of the Mtawatawa Magistrates Court this Friday.\nThe Judicial Services Commission which has been operating a court at the Mtawatawa government complex has constructed a magistrate’s court which also has holding cells and a witness shelter.\nSecretary of the Judicial Services Commission, Mr Walter Chikwana said the court is set to bring justice delivery system to the people.\n“Many people faced challenges accessing justice with some experiencing delays so this new court brings justice to the people,” Mr Chikwana said.\nStakeholders have welcomed the opening of the court in the area.\n“We have so many cases which used to give us challenges as ZRP but we are now happy that we have a court,” a police officer said.",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Govt reaffirms commitment to grant title deeds to war veterans",
            "href": "https://www.zbcnews.co.zw/govt-reaffirms-commitment-to-grant-title-deeds-to-war-veterans/",
            "content": "Story by Tafara Chikumira\nTHE government has reaffirmed its commitment to ensuring that all war veterans have title deeds for their land, a move aimed at empowering freedom fighters, who played a crucial role in the country’s independence.\nThe government confirmed that over 600 war veterans are on land but without title deeds, promising that their documents should be processed by mid-next month under the Presidential Title Deeds programme.\nSpeaking at an interactive meeting with Ministers of State for Provincial Affairs and Devolution and heads of government departments in Kwekwe this Thursday, the Minister of Lands, Agriculture, Fisheries, Water, and Rural Development, Dr Anxious Masuka emphasised the government’s efforts to empower war veterans.\n“The government’s policy position is that war veterans ought not to be disturbed. 632 war veterans are on land but without tenure documents and their documents should be processed by mid-next month. 129 issues related to the war veterans have been resolved. We also discussed the Independence Celebrations which are proceeding at pace and we have received a report that the VBUs have been established according to plan.”\nThe Minister of War Veterans of the Liberation Struggle, Senator Monica Mavhunga urged veterans of the liberation struggle who are facing challenges related to land to visit relevant offices for assistance.\n“Our war veterans went to war to fight for our liberation and for us to get the land we now have. Today, we received a report that a lot of disputes related to the war veterans have been resolved and those who still have issues must go to the relevant offices and check if their names are there.”",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Govt calls for unified approach in driving development",
            "href": "https://www.zbcnews.co.zw/govt-calls-for-unified-approach-in-driving-development/",
            "content": "Story by Tamuka Charakupa\nGOVERNMENT ministries, departments and agencies have been implored to integrate the whole of government approach in executing their mandate with collaboration identified as critical towards the attainment of Vision 2030.\nThe Minister of State for Mashonaland West Provincial Affairs and Devolution, Honourable Marian Chombo, reiterated this, while addressing heads of government departments and agencies in Chinhoyi on Wednesday.\n“His Excellency, the President, Cde Emmerson Mnangagwa has consistently emphasised the government’s unwavering commitment to development,” she said.",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Masvingo hosts successful traditional cookout competition",
            "href": "https://www.zbcnews.co.zw/masvingo-hosts-successful-traditional-cookout-competition/",
            "content": "Story by Mercy Bofu-Matinha\nA total of 44 contestants participated at the Masvingo Provincial Amai’s Traditional Cookout competition held at Masvingo Polytechnic College this Wednesday.\nThe cookout competition continues to grow and become more inclusive, with this year’s edition including people with disabilities.\nMasvingo Polytechnic College was the place to be with contestants drawn from communities, tertiary institutions, people with disability and professional chefs showcasing their cooking skills.\nWinners of the competition paid tribute to the First Lady for promoting traditional foods at the same time affording them a platform to learn and sharpen their cooking skills.\n“Representing people with disability, I stand here with so much joy and pride. Our First Lady realised that we also have potential, hence she allowed us to come and showcase our talents. Through the interaction only, we have learnt a lot and it shows that the government is embracing us all,” winner, Courage Murambadare said.\nThe government acknowledged gastronomy tourism as a key driver for the transformation of economies, community empowerment and a catalyst for cultural branding.",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Govt unveils plans to revitalise leather industry",
            "href": "https://www.zbcnews.co.zw/govt-unveils-plans-to-revitalise-leather-industry/",
            "content": "Story by Patience Nyagato\nPLANS to revive the country’s leather industry are afoot with government strengthening its systems to revitalise the leather value chain.\nThis came out at the August House during the Parliamentary Question and Answer session this Wednesday.\n“I spoke of a collaboration with the Ministry of Agriculture among other ministries. I highlighted that we have not done as much as we want in our leather sector. We will be working with rural communities to create a system where leather will be produced. Bata is on its recovery path,” Minister of Industry and Commerce, Honourable Mangaliso Ndlovu said.\n“We are trying to make sure we expand the domestic market, and we are expanding to export to other countries, including Zambia. Government departments have been directed to make local purchases, which will also help expand the leather industry,” he added.\nIt also came to light that the country is keeping abreast with current trends and technological advancements after introducing automated border control systems at various ports of entry to increase security and reduce smuggling cases.\n“We have done a lot in deploying technology at airport and border technology. We have tried to computerise all our systems and the online border management systems, and we now have e-gates without the help of any officer. We have deployed this at Victoria Falls and Beitbridge. Now e-visas are available, and we have started embarking on this journey,” the Minister of Home Affairs and Cultural Heritage, Honourable Kazembe Kazembe said.",
            "time": "09:28",
            "date": "05 Apr 2025"
        }
    ]
}