{
    "news": [
        {
            "title": "Africa & BRICS interface; focus on Agenda 2063",
            "href": "https://www.zbcnews.co.zw/africa-focus-on-agenda-2063/",
            "content": "Story by Oleen Ndori, Foreign Editor\n\nThe continent has been implored to unite in the implementation of the African Union’s Agenda 2063 towards increased intra-continental trade for development.\n\nBuilding ‘The Africa We Want’ is a key target of the African Union by the year 2063 and as such, various policies and programmes have been put in place by the continental body for the sustainable development of Africa.\n\nThis emerged during an interface between Government and African diplomats accredited to Zimbabwe this Monday.\n\nForeign Affairs and International Trade Minister, Professor Amon Murwira, who presided over the meeting, highlighted the importance of AU member states coming together to boost intra-continental trade.\n\n“Your Excellencies, we are just 39 years away from the African Union Agenda 2063. Our ambitious blueprint transformed our continent. In this regard, we are making efforts to silence the guns in line with the AU clarion call, although isolated conflicts or spots present immediate challenges. Let us remain committed to working towards addressing peace and security issues in line with African solutions to African problems, as opposed to the reliance on external forces who may be complicit in some of the conflicts.\n\n“Despite our excellent relations, political relations, Your Excellencies, it is worrying that intra-African trade remains low. The advent of the African Continental Free Trade Area, AFCTA, is a welcome development that should reverse this state of affairs and enable us to recalibrate our efforts towards benefiting from the single market for goods and services across our continent. As we create a bigger market for our goods and services, we should jealously guard against such a market benefiting other regions. The market should benefit Africa first, hence the imperative to enhance local productive practices on our continent. Let us strive to continuously advance common African positions and interests towards the transformation of our countries on the continent for the benefit of our peoples. Our salvation lies in local production, in intra-regional trade, and not aid,” he said.\n\nThe Dean of African Groups of Ambassadors in Zimbabwe and Ambassador of Equatorial Guinea to Zimbabwe, His Excellency Jose Ela Ebang said unity among African countries will move the continent forward.\n\n“We commend the Republic of Zimbabwe’s contribution to the realisation of the Africa We Want, with a goal for inclusive and sustainable development and a Pan-African drive for unity, self-determination, freedom, progress and collective prosperity pursued under Pan-Africanism and African nations, as you rightly stated. Honourable Minister, may I also take this opportunity to express our solidarity with the people of Zimbabwe during the challenging period of the severe drought caused by the El Nino-induced effects. As climate change worsens globally, and in Southern Africa particularly, urgent actions on climate emergencies are imperative,” said Ambassador Ebang.\n\nFrom meeting the African envoys, Professor Murwira went on to meet BRICS representatives in the country, where he stressed the importance of bilateral and multilateral ties for economic growth.\n\nHe noted, “Zimbabwe sees BRICS partnership as a catalyst for global growth and development, a partnership that is strongly meaningful for all nations. In this regard, it is the right of Africa and the entire Global South to fully reap the benefits of global trade and investment. Without trade and investment, our economies cannot thrive, and the livelihoods for our people cannot improve. Your Excellencies, we wish to appreciate the importance of BRICS partnership and the new development plan for leading in the efforts to increase the resilience of the Global South and the world at large, and to bring fairness to global trade and financial systems by strengthening the use of BRICS services. Your Excellencies, we have to reform the moderate bilateral trading system so that we create a conducive environment for investment and fair trade. By working together, sharing skills and capabilities, mobilising resources, we shall be able to give renewed indicators to global growth and renewed and sustained development.”\n\nDean of the BRICS Group of Ambassadors and Russia’s envoy to Zimbabwe, His Excellency Nikolai Krasilnikov said the group acknowledges the deep ties that exist between the countries and the drive towards inclusive development.\n",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabwe to receive rains as a result of Cyclone Chido",
            "href": "https://www.zbcnews.co.zw/zimbabwe-to-receive-rains-as-a-result-of-cyclone-chido/",
            "content": "Story by John Nhandara\n\nMost parts of Zimbabwe are expected to receive some rains this week due to the effects of Cyclone Chido which has made landfall in Mozambique and Malawi.\n\nThe Meteorological Services department (MSD) has confirmed that the remnants of Cyclone Chido are expected to bring significant rainfall to Zimbabwe, with projections indicating accumulations of up to 30 to 50mm in some regions.\n\nMSD Head of Forecast, Mr James Ngoma says Cyclone Chido has since lost its intensity and downgraded to a tropical depression.\n\n“Cyclone Chido made landfall in Northern Mozambique near Pemba and drifted southwards. By this morning, it was in southern Malawi….in that path it was losing its strength as it traversed the northern parts of Mozambique. It is now weaker and now a tropical depression which will give light showers in the eastern parts of Zimbabwe.\n",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Government intensifies the fight against drug and substance abuse",
            "href": "https://www.zbcnews.co.zw/government-intensifies-the-fight-against-drug-and-substance-abuse/",
            "content": "Story by Tafara Chikumira\n\nGovernment is crafting a cocktail of measures to upscale the fight against drug and substance abuse, with stakeholders focusing on lasting solutions to eradicate the menace that is slowly destroying society.\n\nThe negative effects of drug and substance abuse have prompted stakeholders to spring to action and come up with strategies to arrest the vice through a three-day workshop in Kwekwe.\n\nThe national chairperson of the Inter-Ministerial Committee on Drugs and Substance Abuse, Honourable Oppah Muchinguri-Kashiri who was represented by her deputy Honourable Kazembe Kazembe, who is also Minister of Home Affairs and Cultural Heritage, challenged stakeholders to come up with strategies that will end the vice.\n\n“Let me reiterate that to ensure that our efforts are both comprehensive and sustainable, we need to adopt a multi-sectoral approach, whole-of-government and whole-of-society approach as enshrined in the Zimbabwe Multi-Sectoral Drug and Substance Abuse Plan (2024-2030). The plan clearly spells out the significant and specialised roles each of you has to play in ensuring the success of critical areas. We must disrupt the flow of illicit drugs into our country. This requires cooperation between law enforcement agencies, boarder security and the judiciary. As leaders, you must advocate for stricter enforcement of laws and support efforts to strengthen our country’s ability to combat drug trafficking,” he said.\n\nThe Midlands province has made significant progress in dealing with drug and substance abuse by targeting drug kingpins.\n\nMidlands Minister of State for Provincial Affairs and Devolution, Hon Owen Ncube noted, “During the period January to October 2024, the Midlands Province Drugs and Substance Supply Reduction Pillar identified 57 hot spots, and undertook 101 raids, Kwekwe included, leading to a total of 379 arrests. The Demand Reduction Pillar reached out to over 36 500 Youths through drugs and substance abuse awareness campaigns, whilst the Treatment and Rehabilitation Pillar admitted 977 people. Furthermore, the Reintegration and Psychosocial Support Pillar reached out to over 1 900 people who use drugs for counselling and caregiving.”",
            "time": "09:47",
            "date": "17 Dec 2024"
        },
        {
            "title": "Kariba power generation set to increase",
            "href": "https://www.zbcnews.co.zw/kariba-power-generation-set-to-increase-by-70/",
            "content": "Story by Tichaona Kurewa\n\nPower generation at Kariba Hydro-Power Station is expected to increase by 70% after the Zambezi River Authority (ZRA) granted double allocation of water to the power plant.\n\nThe Zambezi River Authority Council of Ministers 42nd Ordinary Meeting held last week in Livingstone, Zambia, came up with the decision to allocate a total of 27 billion cubic meters of water for power generation at Kariba Dam next year.\n\nThe allocation, which will be shared equally between Zimbabwe and Zambia, is expected to see the Zimbabwe Power Company (ZPC) increase electricity generation at Kariba Power Station to 350 megawatts from the current 200 megawatts.\n\nActing ZPC managing Director, Engineer Nobert Matarutse said, “We are quite excited that we are coming out of a situation where we had low generation at Kariba. We are not going to be where we want to be in 2025, but that improvement is significant. We appreciate it and we will continuously engage with the water authority to see whether there will be a possible revision upwards of the water allocation depending on the inflows that will be coming into Lake Kariba.”\n",
            "time": "09:47",
            "date": "17 Dec 2024"
        },
        {
            "title": "Ruling party urged to prioritise implementation of national conference resolutions",
            "href": "https://www.zbcnews.co.zw/ruling-party-urged-to-prioritise-implementation-national-conference-resolutions/",
            "content": "Story by Tamuka Charakupa\n\nThe ZANU PF Mashonaland West provincial leadership has been implored to ensure National People’s Conference resolutions cascade to the grassroots.\n\nThe leadership led by chairperson, Cde Mary Mliswa Chikoka, met Zvimba district party members in Banket Sunday afternoon where emphasis was on the need to take conference resolutions to the people.\n\nCde Mliswa told the ZBC News, “We have just concluded our inter-district meetings held across the entire province. Our goal is to ensure that all party leaders from cell level are informed of the outcome of the conference and its resolutions.”\n\nCentral Committee members, Honourable Marian Chombo and Cde Absolom Zvidzai echoed the same sentiments, imploring ZANU PF members to abide by the party’s directives and ideology.\n\n“In my capacity as the Minister of State, my role is to implement ZANU PF’s developmental manifesto as the seating government. This also entails that there should be strong working relationships between government heads and their corresponding party portfolio holders,” said Cde Chombo.",
            "time": "09:47",
            "date": "17 Dec 2024"
        }
    ]
}