{
    "news": [
        {
            "title": "Tributes pour in for veteran journalist Geoff Nyarota",
            "href": "https://www.zbcnews.co.zw/tributes-pour-in-for-veteran-journalist-geoff-nyarota/",
            "content": "Story by Peter Chivhima\nRENOWNED journalist Geoff Nyarota has died at the age of 74 after a prolonged battle with colon cancer.\nHis passing on Sunday morning has left the media fraternity in mourning, as colleagues and admirers pay tribute to his immense contribution to journalism in Zimbabwe.\nNyarota, widely regarded as a pioneer in investigative journalism, is being remembered as a mentor, leader, and fearless voice in the profession.\n“We have lost a man who inspired us to take up the journalism career. He was such a man who was ready to assist everyone,” colleague and board member of the Voluntary Media Commission of Zimbabwe, Lenox Mhlanga said.\n“Nyarota was a doyen in the media fraternity and today we are mourning his loss. We interacted a lot with him. He is our hero in the media fraternity” national coordinator of the Editors Forum, Njabulo Ncube said.\nZimbabwe Union of Journalists Secretary General, Perfect Hlongwane said the media industry has lost a giant and brave man.\n“We have lost a giant really, on whose shoulders we were standing. As journalists, we have been engaging Nyarota on quite a number of programmes that we were carrying out to ensure that he passes on the knowledge and the wisdom to the young that are upcoming in the sector,” Hlongwane said.\n“We really have lost a gallant fighter within the media, a gallant contributor within the media, and one whose contribution, like I said, has impacts that are tangible.”\nReactions of his passing on have extended beyond professional circles, with tributes flooding social media, where people from all walks of life, including government officials, have expressed their loss at his demise.\nPosting on his X-page, Information, Publicity, and Broadcasting Services Permanent Secretary, Mr Nick Mangwana said he is saddened by the loss of Zimbabwean media giant, describing him as a pioneering editor who left an indelible mark on the country’s journalism landscape.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Earth Hour 2025: Zim highlights the importance of wetlands and biodiversity",
            "href": "https://www.zbcnews.co.zw/earth-hour-2025-zim-highlights-the-importance-of-wetlands-and-biodiversity/",
            "content": "Story by Tichaona Kurewa\nZIMBABWE joined the global community in observing Earth Hour at Chidobe Secondary School in the Hwange District this Saturday.\nHeld annually on the last or penultimate Saturday of March, Earth Hour brings together millions of individuals across more than 180 countries and territories in a collective demonstration of support for our planet.\nLaunched by the World Wide Fund for Nature (WWF) and its partners as a symbolic lights-out event in Sydney in 2007, Earth Hour has since evolved into one of the world’s largest grassroots movements dedicated to raising environmental awareness and promoting action.\nMore than just a symbolic gesture of switching off lights, Earth Hour has become a powerful catalyst for positive environmental change.\nIt has successfully driven significant legislative shifts by harnessing the power of public engagement and collective action.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Desiltation of Chidobe Dam brings hope to Hwange communities",
            "href": "https://www.zbcnews.co.zw/desiltation-of-chidobe-dam-brings-hope-to-hwange-communities/",
            "content": "Story  by Tichaona Kurewa\nTHE desiltation of Chidobe Dam in Hwange District is making a tangible difference, with the reservoir now providing a lifeline for the community and other surrounding areas.\nFor years, Chidobe Dam suffered from severe siltation, drastically reducing its capacity, and leaving local communities vulnerable to acute water shortages, particularly during the dry season.\nHowever, a collaborative effort spearheaded by the World Wide Fund for Nature (WWF) under its Climate Adaptation and Protected Areas Initiative, in partnership with local authorities, the community, and other development partners, has revitalised the reservoir.\nThis offers a crucial lifeline to the community and in the attainment of national and international development targets such as Vision 2030 and the Sustainable Development Goals.\n“We are grateful for the partners that come to our rescue, water has been a challenge in this community but now we can do various horticulture projects, that can earn us money to survive,” a community member said.\n“It is a blessing to us youths, we can now do various projects such as horticulture taking us away from vices such as drug abuse and prostitution,” another community member said.\nProject partners, traditional leaders, and local authorities are equally optimistic about the project’s transformative impact.\n“We thank WWF and its partners for assisting our community in rehabilitating our dam and our springs, it took us years trying to rehabilitate the source but we faced many challenges in the process, the rehabilitation will alleviate water challenges, especially for our livestock, we can now venture into fisheries and other income generating projects that will uplift our community livelihoods,” Acting Chief Mvuthu, Mr Bishop Mathatha Sibanda said.\n“Before we struggled, our livestock suffered, and we had to travel long distances for water. Now, with the dam full, our animals are healthy, and we have water for our gardens. This is a blessing,” Hwange RDC Ward 2, Councillor Bonginkosi Moyo said.\n“Fellow residents this is your project that WWF and other partners are bringing to our community, let us protect and preserve our dam and our natural resource, as the Hwange Rural district council and the traditional leadership we pledge to allocate land that will be used for income generating projects like gardens, beekeeping, and others that will assist the community to raise capital to assist in paying school fees for less privileged children of our community and also keep our youths busy and keep away from drug and substance abuse,” CEO of Hwange RDC, Mr Pindile Ncube said.\n“We have largely been working in protected areas but as time moved we also realised that communities are an integral part of conservation. You can’t do conservation without considering communities,” WWF Country Director, Mr Itayi Chibaya said.\n“As you are aware, over recent years, rainfall has declined by 40%, and our dams are being filled with silt while also drying up. But these dams also bring a number of challenges because communities rely on them for their livelihoods.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Tertiary institutions step up efforts against GBV and drug abuse with new campaign",
            "href": "https://www.zbcnews.co.zw/tertiary-institutions-step-up-efforts-against-gbv-and-drug-abuse-with-new-campaign/",
            "content": "Story by Tamuka Charakupa\nTHE government and its development partners are implementing the Safer Campuses Campaign aimed at raising awareness on drug and substance abuse, and gender-based violence in tertiary institutions.\nA recent survey conducted by the United Nations Educational, Scientific and Cultural Organisation (UNESCO) revealed that at least one out of three females in tertiary institutions has encountered either physical and sexual or verbal abuse from their male counterparts.\nAgainst this background, a Safer Campuses Campaign has been launched in Mashonaland West, with the Chinhoyi University of Technology and the Mupfure Industrial Training College pioneering the initiative.\nMupfure students held an awareness march in Chegutu this Friday, with a clarion call to shun drug and substance abuse taking centre stage.\n“As students, we are vulnerable to abuse not only by our fellow students but by surrounding communities who sell and distribute drugs to students,” a student said.\n“Lack of resources is driving female students to get involved in toxic relationships resulting with some having unwanted pregnancies, getting involved in drugs and most commonly encountering sexual and physical abuse,” another student said.\n“We are marching to send a message to the community that all forms of abuse should stop. We are also trying to enlighten our fellow age mates that drugs are not good for them,” a student stated.\nMupfure Industrial Training College academics are convinced the awareness campaigns are influencing positive community attitudes.",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "SADC RPTC graduates poised to strengthen regional peacekeeping efforts",
            "href": "https://www.zbcnews.co.zw/sadc-rptc-graduates-poised-to-strengthen-regional-peacekeeping-efforts/",
            "content": "Story by Elroi Ngara\nTHE role of the SADC Regional Peacekeeping Training Centre (RPTC) in promoting regional peace and integration efforts, took centre stage during a graduation ceremony held at the facility in Harare this Friday.\nOfficiating at the graduation ceremony for the SADC Civilian Foundation Course in Peace Support Operations at the regional peacekeeping centre in Marlborough, Harare, Zambia’s Deputy Ambassador to Zimbabwe Ms Nabulanga Ntalasha highlighted the facility’s critical role in achieving peace and regional integration agenda.\n“The role the Center plays is critical in realising the SADC agenda for peace and indeed regional integration. We have also been instrumental in helping our brothers and sisters beyond the region to resolve their issues and not let their situations degenerate into instability,” she said.\n“The Civilian Foundation cause was aimed at building capacities for the civilian component with the view to prepare for peace support operations. Ladies and gentlemen, I applaud the expert facilitation team for excellent presentations and mentorship, facilitating active discussions, the positive and careful preparations of presentations made for effective learning and participation for all.\n“I can safely conclude that the purpose of the Civilian Foundation cause has been completely accomplished. Once again, congratulations. Well done. Put the knowledge you have gained to good use.”\nParticipants concurred that the course has capacitated them to contribute to regional peace.\n“As you know, right now, our security system is quite fragile. We can see there’s violence in DRC, and in Mozambique, so peace support operations are very crucial. This course is going to capacitate us with the knowledge that we get posted to various missions across Africa and across SADC. We will be able to deliver on our mandate,” Zimbabwe’s graduand at the ceremony, Elvis George Hove said.",
            "time": "06:35",
            "date": "24 Mar 2025"
        }
    ]
}