{
    "news": [
        {
            "title": "Tertiary institutions drive govt’s rural industrialisation agenda",
            "href": "https://www.zbcnews.co.zw/tertiary-institutions-drive-govts-rural-industrialisation-agenda/",
            "content": "Story by Fungai Jachi\nKADOMA – THE government says the Rural Industrialisation Agenda is on track, with tertiary institutions spearheading the initiative as enunciated in the National Development Strategy One.\nUniversities and Tertiary institutions who participated at a Rural Industrialisation Conference held in Kadoma this Thursday believe they have made strides in implementing various projects which have improved rural communities.\nThe adoption of the Heritage Based Education 5.0 Model has made aspirations of rural industrialisation a reality, with the Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development having scored successes on that front.\n“Universities have managed to put up agro-industrial parks as well as innovation hubs that have transformed various communities. We have set up processing plants that process fruits found in specific areas and this has created jobs and changed the face of the communities. Now, the focus is on the commercialisation of these products so that the same areas get to enjoy their local products as well,” research specialist at the University of Zimbabwe, Professor Ancila Nhamo said.\nBulawayo Polytechnic Principal, Mrs Chiedza Masanganise, echoed similar sentiments, highlighting the sector’s critical role in skills development.\n“As tertiary institutions, our area of specialisation is skills training and through this, we are providing expertise in the development of rural communities, be it in the construction of schools, clinics or bridges. We invest in human capital with the right skills, contributing to improved communities.”\nThe Permanent Secretary in the Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development, Professor Fanuel Tagwira, outlined how the Heritage-Based Education 5.0 Model has shaped the rural industrialisation agenda.",
            "time": "20:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Govt charts rural industrialisation roadmap under NDS2",
            "href": "https://www.zbcnews.co.zw/govt-charts-rural-industrialisation-roadmap-under-nds2/",
            "content": "Story by Fungai Jachi\nKADOMA – THE Ministry of Higher and Tertiary Education, Innovation Science and Technology Development is hosting a Rural Industrialisation Conference in Kadoma where participants are expected to review and validate the Rural Industrialisation Workbook as well as draft an implementation roadmap for the National Development Strategy 2 (NDS2).",
            "time": "20:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Zimbabwe bridges digital divide in education sector",
            "href": "https://www.zbcnews.co.zw/zimbabwe-bridges-digital-divide-in-education-sector/",
            "content": "Story by Tafadzwa Chigwedere\nTHE government is accelerating its drive to transform the education sector through public-private partnerships to create digital classrooms, with a Digital Research and Innovation Hub set to be commissioned in Glen View, Harare.\nThe initiative forms part of the broader Smart Schools programme, aimed at bridging the digital divide by transforming conventional classrooms into interactive learning spaces equipped with modern technology.\nBeneficiaries of the programme expressed their appreciation for the initiative, which has introduced computers and smart boards to the school, making education more engaging and less reliant on traditional paper-based methods.\n“We are very happy with the government’s project of bringing technology to schools as this will enable our children at primary level to have computer knowledge. This government programme is very important, it has improved learning, and it should be implemented in all schools,” one parent said.\nEdutech Chief Executive Officer, Mr Luke Musambasi spoke on the importance of the private sector involvement in education, while the Minister of Primary and Secondary Education, Honourable Torerai Moyo reiterated the government’s commitment to creating smart classrooms.",
            "time": "20:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Youths encouraged to leverage land for economic transformation",
            "href": "https://www.zbcnews.co.zw/youths-encouraged-to-leverage-land-for-economic-transformation/",
            "content": "Story by Lisa Masuku-Kurira\nBULAWAYO – THE transformative Land Tenure Implementation Programme launched by President Emmerson Mnangagwa was this Wednesday taken to Bulawayo where the critical role played by land in unlocking generational wealth took centre stage.\nThe second edition of the Land Tenure Leadership Success Series organised by Young Women for Economic Development was held at the National University of Science and Technology (NUST) where young people came in their numbers to witness the unpacking of the Land Tenure Implementation Programme.\nChairperson of the Land Tenure Committee, Dr Kudakwashe Tagwirei said empowering young people with land is critical in promoting the country’s economic transformation.\n“Land is the cornerstone for generational wealth so empowering youths with land is important in promoting economic development.”\nWith the nation on a drive to regain its status as the breadbasket of Africa, a number of speakers emphasised the need for young people to establish themselves in the agriculture value chain.\n“The demand for land is ever increasing. We cannot all own it but can benefit from it by establishing ourselves in the agriculture value chain,” ZANU PF National Political Commissar, Cde Munyaradzi Machacha said.\n“This programme is important because by empowering youths with land, we are securing and safeguarding our natural resources,” ZANU PF Bulawayo Chairperson, Cde Jabulani Sibanda added.\nThe Minister of Information Communication Technology (ICT), Postal and Courier Services Honourable Tatenda Mavetera implored youths to leverage on digital technologies to transform the agriculture sector.",
            "time": "20:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "National Disability Expo kicks off in Vic Falls with record exhibitor turnout",
            "href": "https://www.zbcnews.co.zw/national-disability-expo-kicks-off-in-vic-falls-with-record-exhibitor-turnout/",
            "content": "Story by Tichaona Kurewa\nVICTORIA FALLS – THE fifth edition of the National Disability Expo (NDE) kicked off at Chinotimba Stadium in Victoria Falls this Wednesday, drawing over 300 exhibitors eager to engage and inspire.\nThis year’s edition has attracted exhibitors, including international participants, making it arguably the largest expo to date.\nThe event is hosted on a rotational basis across provinces, with Matabeleland North playing host this year after Mashonaland Central hosted the previous edition.\nExhibitors expressed optimism about the potential impact of the three-day event, calling on society to promote the independence and inclusion of persons with disabilities.\n“We are here as mothers of children living with cerebral palsy. Our message to Zimbabweans is to embrace people with disabilities and include them in everyday life, they are just like anyone else,” an exhibitor said.\n“People with disabilities must strive to be self-reliant rather than wait for handouts. That is why we are showcasing the products we produce,” another added.\n“We believe in working with our hands to provide for ourselves and our children. We want to show the world that we are capable of working. People should buy our goods, not offer handouts,” an exhibitor noted.\nOrganisers are upbeat about the expo’s success.",
            "time": "20:42",
            "date": "26 Jun 2025"
        }
    ]
}