{
    "news": [
        {
            "title": "Beatrice road accident claims three lives",
            "href": "https://www.zbcnews.co.zw/beatrice-road-accident-claims-three-lives/",
            "content": "Story by Jerold Sasa\nThree people are feared dead after two buses collided near Beatrice along the Harare Beitbridge Highway this Saturday.\nAccording to officials, the accident occurred mid-afternoon this Saturday when a Mandaza bus which was coming from Chipinge towards Harare collided with a Glen View 2 High School bus which was heading towards Masvingo to ferry church members who had hired it and had three people on board.\nTwo of the people who are feared dead were in the Mandaza bus while the other deceased was in the Glen View High 2 Bus.\nOver 30 passengers and the drivers of buses were injured and ferried to Beatrice Hospital where they were later transferred to Chitungwiza and Harare Hospitals.",
            "time": "20:23",
            "date": "16 Feb 2025"
        },
        {
            "title": "Drug abuse survivors acquire entrepreneurial skills",
            "href": "https://www.zbcnews.co.zw/drug-abuse-survivors-acquire-entrepreneurial-skills/",
            "content": "\nStory by Tamuka Charakupa\nMore than 200 youths and women from across Norton town have been capacitated with various life-changing skills as the government’s youth empowerment drive gathers pace.\nThe 248 drawn from across Norton town are reportedly former drug addicts who have acquired knowledge and skills in various entrepreneurial activities including detergent making, leather shoe production and baking, among other skills.\nAmong those who graduated under Manake Empowerment Trust (MET), are two young men Paul Mangena and Tinashe Dube who are leading a group of 14 other youths engaged in leather shoe production.\nManaka Empowerment Trust Director Dr Sibongile Sokane said the initiative targets to eradicate the drug and substance abuse menace.\n“Our aim is to drive the youth from the scourge of drug and substance abuse by impacting them with life skills that drive self-empowerment. We also aim to fight gender-based violence through training women as well.”\nPermanent Secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, Dr Mavis Sibanda said the initiative dovetails with Vision 2030 which also prioritises youth empowerment.\n“The skills training programme that are being offered help tackle the challenge of livelihood skills gaps that women and communities struggle with and help them realize significant economic empowerment and self-sustenance.",
            "time": "20:23",
            "date": "16 Feb 2025"
        },
        {
            "title": "Broadcasting Services Amendment Bill set for Parly second reading",
            "href": "https://www.zbcnews.co.zw/broadcasting-services-amendment-bill-set-for-parly-second-reading/",
            "content": "\nStory by Batsirai Shoko\nThe Broadcasting Services Amendment Bill is set to go for the second parliamentary reading this coming Tuesday, following nationwide consultations.\nThe bill, among other issues, seeks to strengthen the public broadcasters’ operations.\nParliament has thrown its weight behind the bill and there is optimism it will sail through.\n“The Broadcasting Services Amendment Bill is coming to Parliament next week. We went across the country in all provinces asking what they wanted to see in the Bill.\n“The issues were around radio licensing where we need you to pay up your licenses before your Zinara tax disc,” Parly Media Committee chairperson, Honourable Caston Matewu said.\nThe Zimbabwe Broadcasting Corporation says its mandate will be greatly enhanced if the Bill sees the light of day.",
            "time": "20:23",
            "date": "16 Feb 2025"
        },
        {
            "title": "Financial inclusion key towards formalisation of the economy",
            "href": "https://www.zbcnews.co.zw/financial-inclusion-key-towards-formalisation-of-the-economy/",
            "content": "\nStory by Fairstars Mukungurutse\nThe adoption of digital payment systems by small and medium enterprises is key to promoting financial inclusion and advancing formal economic activity.\nThe call was made by the Minister of Women Affairs, Community, Small and Medium Enterprises Development Senator Monica Mutsvangwa, after emerging from a lecture titled “The Participation of Women in Economic Development: A Case of Zimbabwe” at the Zimbabwe National Defence University this Thursday.\n“The most important thing that I keep on recommending is the adoption of digital money to avoid the challenge of financial arbitrage and also ensure cash circulation in our banks. If the Ministry of Finance and the Reserve Bank avail many POS machines to our SMEs, this would allow for smooth financial transactions. When they have a conducive workspace, already registered one is bound to pay a levy to the local authority and pay tax as well,” she said.",
            "time": "20:23",
            "date": "16 Feb 2025"
        },
        {
            "title": "Over 20 people feared dead after bus and haulage truck collision",
            "href": "https://www.zbcnews.co.zw/over-20-people-feared-dead-after-bus-and-haulage-truck-collision/",
            "content": "Story by ZBC Reporter\nMore than 20 people are feared dead after a bus and a haulage truck collided head-on near the Lutumba tollgate in Beitbridge this Thursday morning.\nIt is believed the bus driver tried to overtake another vehicle and rammed into an oncoming haulage truck.\nZimbabwe Republic Police, Commissioner Paul Nyathi confirmed the accident claimed 24 lives in a statement.\n“24 people were killed when an Urban Connect bus carrying 65passengers was involved in a head-on collision with an Auto Transporthaulage truck with four occupants on board,” read the statement.",
            "time": "20:23",
            "date": "16 Feb 2025"
        }
    ]
}