{
    "news": [
        {
            "title": "Bindura hailstorm leaves 14 families homeless",
            "href": "https://www.zbcnews.co.zw/bindura-hailstorm-leaves-14-families-homeless/",
            "content": "Story by ZBC News Reporter\n14 families were left homeless following a hailstorm that hit Bindura district in Mashonaland Central province.\nThe hailstorm which affected the province left fourteen families stranded forcing provincial leadership to visit the area to assess the damage.\nThe delegation led by Mashonaland central provincial affairs and devolution Honourable Christopher Magomo visited the area to assess the damage and come up with strategies of assisting the hailstorm victims.",
            "time": "08:39",
            "date": "12 Jan 2025"
        },
        {
            "title": "2024 A Level results out",
            "href": "https://www.zbcnews.co.zw/2024-a-level-results-out/",
            "content": "Story by Farai Gwaze\nThe 2024 Zimbabwe School Examinations Council (ZIMSEC) Advanced Level results are out.\nThe results were announced at a news conference addressed by ZIMSEC Chairperson, Professor Paul Mapfumo in Harare this Friday.\nThe results reflect that 94 percent of students who wrote a minimum of two subjects passed the examinations.\n“The total number of candidates who sat for the November 2024 examinations was 33585 compared to 34427 in 2023. This translates to a decrease of 852 candidature yielding a percentage decrease of 2.47%. For those who wrote two or more subjects, 31 443 obtained Grade E or better. This translates to a 94.58% pass rate. The total number of school candidates who set for November 2024 was 29,041 while in 2023 the number was 29,910.\n“28,900 candidates wrote two or more subjects in November 2024. Of these, 27,509 obtained grade E or better in two or more subjects, achieving a percentage of 95.18%. The total number of private candidates who sat for the November 2024 examinations was 4544 while in 2023 the number was 4527,” Professor Mapfumo said.",
            "time": "08:39",
            "date": "12 Jan 2025"
        },
        {
            "title": "Harare City Council in strategic partnership for water treatment & billing",
            "href": "https://www.zbcnews.co.zw/harare-city-council-in-strategic-partnership-for-water-treatment-billing/",
            "content": "Story by Theophilus Chuma\nHarare water treatment and provision services are heading for massive transformation under a private-public initiative sealed between Harare City Council and private players this Thursday.\nThe arrangement is expected to provide relief to the perennial water challenges that have haunted the capital city for years.\nThe new scope of arrangement for service delivery in Harare, culminating in a new water treatment plant for the capital city as well as the provision of smart metering, forms part of the strategies being implemented to enhance service delivery in local authorities.\nEarly this week, the Ministry of Local Government and Public Works announced a green light for private players to participate in service delivery in local authorities.\nA Memorandum of Understanding signed between Harare City Council and private players this Thursday signals the start of a new chapter for the capital.\n“We have said that our focus is to see improvement in service delivery within local authorities. The arrangement between Harare City Council, Helcrow and Laison will cover water purification, the construction of a treatment plant as well as the provision of smart metering. This falls in line with our vision to improve service delivery in Harare,” said the Minister of Local Government and Public Works Honourable Daniel Garwe\nThe new arrangement is expected to reduce Harare’s water purification bill running into several millions of dollars annually.\nHarare Mayor Councillor Jacob Mafume said, “The net effect is that all the money that we were using to purify water will be directed for other service use. What we anticipate is that when we reduce the loss of non-revenue water and reduce leakages, we increase our revenue collection, it will reduce the cost per head, and generally it will make it a bit more efficient than what we were having. We hope that we will get more water for the money we have been using.”\nImplementing partners, Helcrow Private Limited and Laison Technology Company, are confident the deal will enhance the provision of reliable and portable water services for the capital city.",
            "time": "08:39",
            "date": "12 Jan 2025"
        },
        {
            "title": "Bulawayo residents fed up with sewage pipe bursts",
            "href": "https://www.zbcnews.co.zw/bulawayo-residents-fed-up-with-sewage-pipe-bursts/",
            "content": "Story by Lisa Masuku\nResidents of Bulawayo’s Cowdray Park are sitting on a ticking health time bomb, with burst sewage pipes having gone for days without being attended to.\nSeemingly oblivious of the health risks, the little ones play around the raw effluent flowing into their homes.\n“We are always sick because of these spillages. To make matters worse our clinics are far,” said a resident.\n“Sewage flowing into houses has become a normal site here, and this is exposing us to health hazards like cholera,” said another resident.\n“We have been reporting to the local authority, but it seems they are not interested,” another resident noted.\n“We are pleading with the Bulawayo City Council to hear our cries. We are tired of being neglected. We will end up dying because of this,” added another resident.",
            "time": "08:39",
            "date": "12 Jan 2025"
        },
        {
            "title": "Current rains push dam levels up",
            "href": "https://www.zbcnews.co.zw/current-rains-pushes-dam-levels-up/",
            "content": "Story by Tendai Munengwa\nWater levels in major dams are improving, owing to the current wet spell being experienced across the country.\nThe dam levels which were affected by the El Nino-induced drought last summer, are rising again with the average national dam level at 59 percent.\nZINWA spokesperson Mrs Marjorie Munyonga said, “The current wet spell being experienced in the country continues to push water levels in major dams up with national average at 59 percent, making 1.59 improvement by December 30, the average levels, however, remain below the 78 percent during the same period last year.”",
            "time": "08:39",
            "date": "12 Jan 2025"
        }
    ]
}