{
    "news": [
        {
            "title": "Festive season safety; ZRP increases patrols and roadblocks",
            "href": "https://www.zbcnews.co.zw/festive-season-safety-zrp-increases-patrols-and-roadblocks/",
            "content": "Story by Fungai Jachi\nLAW enforcement agencies have geared up for a significant deployment on the country’s major highways to ensure compliance with traffic regulations during the festive season.\nThe Zimbabwe Republic Police (ZRP) says enough deployments have been made in all major roads, warning errant motorists that decisive action will be taken against those who flout traffic rules.\n“The ZRP has made enough deployments on all the major roads. The deployments include roadblocks, traffic blitz, stop and search, motorised and cycle patrols to curb crime, road traffic accidents, maintain law and order in the central business district, residential, industrial as well as leisure centres. The ZRP will impound all unworthy road vehicles. The commuting public are discouraged from boarding non-public service vehicles for their own safety,” ZRP Commissioner General Godwin Matanga said.",
            "time": "18:27",
            "date": "21 Dec 2024"
        },
        {
            "title": "Zimparks gains ground in war against poaching",
            "href": "https://www.zbcnews.co.zw/zimparks-gains-ground-in-war-against-poaching/",
            "content": "Story by Memory Chamisa\nTHE Zimbabwe Parks and Wildlife Management Authority (Zimparks) has reiterated its commitment to ensuring zero poaching and maximum protection of wildlife in national parks.\nDeterrent measures and laws have significantly contributed to a successful 2024 for the Zimbabwe Parks and Wildlife Management Authority.\nResponding to their 2024 legislative report, Zimparks Spokesperson Mr Tinashe Farawo alluded to the fact that the organisation had recorded wins in combating poaching, especially in north-west Matabeleland centred on Hwange National Park.\nHe said, “Not a single incident of poaching of high value elephants has been recorded since the past three years. We are working closely with the police and the judiciary to achieve our goal of zero poaching and I want to reiterate and warn members of the public to make sure they are not found in protected areas while armed. We also recovered more than 80 rifles and other ammunition. Over 58 convictions of mandatory sentences were done. We have also managed to recover live pangolins which people are poaching for different reasons. Community engagements have also played a significant role in protecting our wildlife and ensuring perpetrators are brought to book and justice is delivered.”",
            "time": "18:27",
            "date": "21 Dec 2024"
        },
        {
            "title": "Govt urges home seekers to follow proper procedures",
            "href": "https://www.zbcnews.co.zw/govt-urges-home-seekers-to-follow-proper-procedures/",
            "content": "Story by Oleen Ndori\nGOVERNMENT has implored home seekers to ensure all applications and acquisitions are above board, as the Second Republic targets to deliver one million housing units by 2025.\nResponding to questions from the media during the inaugural Ministers Meet the Media Forum in Harare this Thursday, National Housing and Social Amenities Minister Honourable Zhemu Soda said the current crisis of home demolitions stem from irregular acquisition or building on improperly acquired land, urging all potential home seekers to be diligent.\n“To our potential home seekers, all applications and acquisitions must be above board. Whenever that is done irregularly, obviously the harm of the law will take its course. We encourage all home seekers, despite their desperation, that acquisition of ten houses must be done properly. Whenever it is not done properly, there are problems that are associated with that. Already, we are grappling with the issue of regularisation of dysfunctional settlements that were created previously where people just went on to construct their homes without adequate supporting services like roads, the other amenities, schools, crèches and even the shopping centres. They are supposed to be there to support a community or a settlement. So we are at the moment grappling with that correction,” he said.\nHonourable Soda also revealed government is intervening in providing solutions to poor town planning by the City of Harare which has led to illegal structures, with some being built on wetlands.\n“The issue comes back to Harare City Council, where there has to be new planning for the discharge of waste, especially from the houses that are being constructed and also the other link has been to the wetlands where we are finding that some houses are now being constructed in wetlands which ordinarily are not supposed to be available for house construction.\n“All that comes back to the issue of planning, which the city of Harare is responsible for and even the upgrades of the waste management and waste reticulation assistance. But as a ministry, working together with them, it is our wish that whenever people are being settled, the places must be habitable, places which are not susceptible to hazards like natural hazards. Plus, for instance, what we did in Budiriro 5B in 2021, where some families were left homeless as a result of poor planning. So it is our hope that whenever our local authorities are allocating areas for settling people, the areas must be suitable, properly planned so that we don’t have a repeat of what’s currently obtaining.”\nThe Housing Minister also celebrated significant milestones his portfolio has made towards national housing targets which have been revised to one million housing units by 2025.",
            "time": "18:27",
            "date": "21 Dec 2024"
        },
        {
            "title": "Councils urged to start implementing masterplans",
            "href": "https://www.zbcnews.co.zw/councils-urged-to-start-implementing-masterplans/",
            "content": "Story by Tamuka Charakupa\nGovernment has rallied local authorities to start implementing their masterplans to ensure improved service delivery, especially in rural communities.\nIn this regard, there is optimism of improved service delivery in Zvimba after the local authority capacitated its councillors with motorbikes and mobile phones.\nThe development was complemented by the commissioning of service delivery equipment that includes a grader, a fire tender truck, a borehole drilling rig and utility vehicles purchased using devolution funds and internally generated funds.\nZvimba Rural District Council (RDC) chairperson, Mr Spencer Magaya said, “The provision of motorbikes and mobile phones means our councillors can now monitor developments with no excuse regarding movements and communication.”\n“We are serving our people who are in hard-to-reach communities, so this is a major boost,” added Councillor Zandile Maseko.\n“This is a development which we are proud of as a local authority. We have capacitated our officers so that we swiftly respond to our people’s needs and requests,” Zvimba RDC chief executive officer, Mr Enias Chidhakwa said.\nFor Chief Zvimba, the development is a catalyst towards the attainment of Vision 2030.\n“Our President is indeed walking the talk in the implementation of his developmental vision of leaving no one and no place behind. Zvimba is transforming so will be the livelihoods,” he said.\nThe Minister of Local Government and Public Works, Honourable Daniel Garwe implored local authorities to start implementing their respective masterplans in line with Vision 2030.",
            "time": "18:27",
            "date": "21 Dec 2024"
        },
        {
            "title": "Govt constructs over 100 new schools this year",
            "href": "https://www.zbcnews.co.zw/govt-constructs-over-100-new-schools-this-year/",
            "content": "Story by John Nhandara\nGovernment has constructed more than 100 new schools this year as the drive to invest in school infrastructure gathers pace.\nIn a significant investment aimed at enhancing the country’s landscape, the government has announced the completion of 105 new schools across urban and rural areas this year alone in a development Primary and Secondary Education Minister, Honourable Torerai Moyo says will improve access to quality education.\n“We have a deficit in terms of the number of schools that we want to construct to the tune of 2 800 new schools in 2024. As a ministry, we have managed to construct 105 new schools these are schools that have been built by the government through disbursements from the fiscus. We also have public-private partnerships which have resulted in the development of new other schools,” said the Minister.",
            "time": "18:27",
            "date": "21 Dec 2024"
        }
    ]
}