{
    "news": [
        {
            "title": "Tragedy strikes in Harare’s Adelaide Park as young boy (11) drowns in abandoned pit",
            "href": "https://www.zbcnews.co.zw/tragedy-strikes-in-harares-adelaide-park-as-young-boy-11-drowns-in-abandoned-pit/",
            "content": "\n\nStory by Fairstars Mukungurutse\nPLAY-time ended tragically for an 11-year-old boy from Adelaide Park in Harare this Sunday after he drowned in a water-filled open pit that had been left unattended.\nThe deceased, Tanaka Makosa, was in the company of his friend when he slipped inside the water-filled pit.\n“I asked Tanaka to accompany me to Area 600. Upon our return, we passed through the water-filled pit and Tanaka said I want to test how deep the water is, that’s when he slipped inside. He called my name once before his whole body was submerged in water. That’s when I rushed to look for help,” a young boy who was with Tanaka narrated the ordeal.\nHelp came, but it was already too late to save the young boy.\n“When I heard a child had drowned, I quickly dashed to the spot, removed my clothes and went inside the water. My whole body was submerged in water because the pit was deep. I then managed to locate the child and carried him out of the water, but I noticed that we had already lost him,” a neighbour, Mr Japhet Chinganga said.\nHis mother, Mrs Mercy Taimo narrated her sad story.\n“I spent the greater part of the day with Tanaka and his friend here at home. I didn’t even notice the time they left home. I only became aware they were not home after my other son came running saying Tanaka had drowned. We then rushed to the spot and by the time we arrived, my child had been taken out of the water. We then drove to a nearby clinic, but unfortunately, it was too late.”\nAdelaid Park residents have raised concern over the open pits dotted across the area.\n“This is not the only pit in this area, there are a lot of holes dug by the quarry mine and we don’t even know why they are putting the lives of our children at risk,” a resident said.\n“We have little children and how are we supposed to ensure our kids are safe? Kids being kids, they love to explore,” voiced another.\n“Apart from these dangerous pits, our children are at risk of being run over by speeding trucks from the mine,” another stated.",
            "time": "20:33",
            "date": "30 Jan 2025"
        },
        {
            "title": "Mutare farmer reaps huge from snail production",
            "href": "https://www.zbcnews.co.zw/mutare-farmer-reaps-huge-from-snail-production/",
            "content": "Story by Kenias Chivuzhe\nSnail production has become a lucrative enterprise, with a Mutare based farmer raising edible land snails for cosmetics and human consumption.\nHeliciculture, commonly known as snail farming, has not been widely practiced in the country, but Mutare-based Godfrey Gurupira is seeking to take the initiative to another level.\nGurupira, from Natiview, is now a knowledge repository of snail production and currently boosts of a collection of over 300 snails.\nAlthough the introduction of snail relish in global dishes is still low, Gurupira targets to reach 1 000 snails by the end of February, buoyed by the good rains and anticipated returns from cosmetic products developed from slime.\n“I breed snails to make lotions, soaps and dyes. I started the project last October after being motivated by President Mnangagwa who encourages the youths to be productive. The snails can live up to 15 years. We can also make use of shells to produce buttons and necklaces among other products. In Nigeria and Kenya there are snail farmers. So far, I have 350 snails and I am targeting to increase the number of snails to 1 000 by end of February. Snails lay four or five eggs every four weeks. This is a profitable business but the biggest challenge is the demand for my products is growing yet I lack capacity to expand the venture in line with the increasing demand,” said Mr Gurupira.\nWith snail slime primarily used for cosmetics, Gurupira believes with more support he can acquire a bigger place to operate from, thereby increasing production.\n“Snails eats lettuces, cabbage, greens and bulgur. The snails passes out slime as an act of defense. Each snail produces three millimetres of slime per day. The slime is used to make lotions, soaps and dyes. Snails have a highly delicious meat more than chicken. We are eating the snails alone at the moment.",
            "time": "20:33",
            "date": "30 Jan 2025"
        },
        {
            "title": "11-year-old Ugandan pan-Africanist’s adventure continues in Vic Falls",
            "href": "https://www.zbcnews.co.zw/11-year-old-ugandan-pan-africanists-adventure-continues-in-vic-falls/",
            "content": "Story by ZBC Reporter\n11-year-old Ugandan pan-Africanist Emmanuel Akot, who is in Zimbabwe for a week long visit, is now in Victoria Falls.\nMr Akot, who is accompanied by the Deputy Minister of Tourism and Hospitality Industry, Honourable Tongai Mnangagwa and his mentor, Mr Isaac Kamulegeya, will be in the resort city for two days.",
            "time": "20:33",
            "date": "30 Jan 2025"
        },
        {
            "title": "EU diplomats partner government in fighting GBV",
            "href": "https://www.zbcnews.co.zw/eu-diplomats-partner-government-in-fighting-gbv/",
            "content": "Story by Theophilus Chuma\nThe European Union has mobilised a US$300 million funding to boost current efforts to end gender-based violence (GBV) in Zimbabwe.\nA bold messages clearly denouncing a vice that is tearing through the social fabric became the common position for over 100 men and women who embarked on an awareness campaign against gender-based violence in Harare this Wednesday.\nThe HeforShe march, meant to champion gender equality and women rights, is one of the interventions being implemented by global partners to curb the menace of domestic violence.\nOn the sidelines of the solidarity march, the European Union stated it has mobilised funds to support government programmes to ending GBV.\n“We are working with the government to ensure that gender based violence issues are effectively addressed. This is why we have come up with a funding model to the tune of US$300 million which will be used to support GBV awareness programmes in Zimbabwe,” said European Union Ambassador, Jobst von Kirchmann.\nGovernment has implemented various strategies to ending gender-based violence, including stringent legislation such as the Marriage Act of 2022 which outlawed the exploitation of children through early marriages.\n“Ending gender-based violence is top priority for government. We continue to work in communities to raise awareness against domestic violence while also amplifying that cases are reported through one stop centres,” said the Minister of Women Affairs, Community, Small and Medium Enterprises Development, Senator Monica Mutsvangwa.",
            "time": "20:33",
            "date": "30 Jan 2025"
        },
        {
            "title": "Cultural heritage preservation through AI",
            "href": "https://www.zbcnews.co.zw/cultural-heritage-preservation-through-ai/",
            "content": "Story by Farai Gwaze\nThe use of Artificial Intelligence (AI) in local languages has been identified as the best strategy to preserve indigenous knowledge systems and cultural heritage.\nAccess to AI technology increasing globally, adoption of local languages is expected to promote inclusion in the digital economy.\nFounder and developer of Vimbiso AI, Chido Dzinotyiwei is convinced of the power AI in promoting inclusivity through the use of national languages.\n“Across Africa there are over 2 000 languages spoken yet most global AI systems only support a handful of languages, which means a lot of people and their languages are not represented. When we have local languages we included more people in the digital economy. Local languages in AI makes it possible for no one to be left behind,” said Ms Dzinotyiwei.\nShe is also self-assured that adopting Local languages in AI will also help in the preservation of cultural heritage.",
            "time": "20:33",
            "date": "30 Jan 2025"
        }
    ]
}