{
    "news": [
        {
            "title": "Ntabazinduna horticulture project a beacon of rural development",
            "href": "https://www.zbcnews.co.zw/ntabazinduna-horticulture-project-a-beacon-of-rural-development/",
            "content": "Story by Yolanda Moyo\nA vibrant horticultural project is blossoming at Ntabazinduna in Umguza district, where women and youths have become active players in the country’s economic development.\nVillagers in Ntabanzinduna, many of whom previously relied on subsistence farming, are cultivating a diverse range of crops which have become a source of economic empowerment.\nThe project is being implemented by government in collaboration with Gender Links and was launched two years ago and provides crucial support to the farmers in the form of technical expertise and market linkages.\n“Before the project, our lives revolved around struggling to grow enough food for our families. Now, we are able to not only feed ourselves but also generate income. This has empowered us women, giving us financial independence and a sense of self-worth,” a villager who spoke to the ZBC News said.Another stated, “With this project, as women we are seeing a change in the gender-based violence because of the self-independence we have gained here. In most cases financial constraints perpetuate GBV, but having an income as a woman reduces this.”\nLooking ahead, Thuthukani Luthi B project is set to shift towards piloting high-value crops specifically for the export market.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Harare operating below capacity in water production",
            "href": "https://www.zbcnews.co.zw/city-council-operating-below-capacity-in-water-production/",
            "content": "Story by John Nhandara\nHarare City Council is operating at below capacity in the production of water for the capital owing to a number of challenges at its sewage and water treatment plants.\nResidents are receiving 300 megalitres of water per day, against a demand of about 1 000 megalitres as the city council is currently operating below capacity.This emerged during an appreciation tour of Morton Jaffrey Water Works and Firle Sewage Treatment works by a technical committee formed to address the on-going water supply crisis in the city.\nHarare City Council Acting Town Clerk, Engineer Phakamile Mabhena Moyo told the ZBC News, “For Harare we are currently treating water at our Morton Jaffrey Water Works and we not operating at full capacity. We have an installed capacity of 614 mega litres but we are only producing 300 megalitres. This is as a result of high cost of treating water from Lake Chivero which is heavily polluted. Some of our chlorifiers are also not working and need repairs.”\nMeanwhile, the city council’s sewage treatment facilities that include Firle Sewage Treatment plant in Harare have been severely impacted by inadequate processing capabilities as a result of archaic equipment, leading to significant reductions in water production.“Our sewage treatment works are not operating at full capacity. Ordinarily, our production capacity is at 176 megalitres per day against our capacity of 234. We are producing 72 megalitres,” said Director Water, Engineer Tapiwa Kunyadini.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Massive fire destroys Avondale West house",
            "href": "https://www.zbcnews.co.zw/massive-fire-destroys-avondale-west-house/",
            "content": "Story by Fairstars Mukungurutse\nA family residing in Harare’s Avondale West has been left counting losses after their home was gutted by fire this Monday.\n74-year-old Gogo Petronella Maliselo watched helplessly as fire destroyed her family home of 42 years, leaving nothing but memories.\nA widow, who lives with her daughter and three-year-old grandson, Gogo Maliselo recounts how the raging fire, which started from a tenant’s room, engulfed the house and burnt the roofing sheets, leaving just the wall behind.\n“I was outside when I noticed smoke in the air around 8am in the morning and I thought maybe my neighbours were burning trash. One of our neighbours then rushed inside the gate screaming that the roof was on fire. I quickly dashed in the house and switched off the electric socket. The fire was coming from my tenant’s room so I unlocked the door, that’s when the flame spread across the house. I only came out holding my phone, national ID and my NSSA card. We managed to get hold of the Fire Brigade, but when they finally came, everything was destroyed, they only managed to contain the fire. We literally have nothing left,” said Gogo Maliselo.\n\nThe incident has also left the neighbourhood devastated.\n“We only thank God for preserving lives, but the incident has left us baffled. After the electricity was disconnected and the guys from ZESA pronounced the yard safe, fire started again inside the cottage and we all rushed inside to remove property, the fire brigade also came back and managed to contain the cottage fire,” said a neighbour, Mrs Agnes Muringai.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Universal Services Fund boosts connectivity in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/universal-services-fund-boosts-connectivity-in-zimbabwe/",
            "content": "Story by Tichaona Kurewa\nGovernment through the Universal Services Fund (USF) has made significant strides in expanding telecommunications infrastructure across the country.\nData released by the Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) reveals that as of November 2024, the USF had collected a substantial ZiG 276 million, which has been invested in various projects aimed at improving connectivity.\nAdministered by POTRAZ, the fund has seen the successful completion of 17 base stations under the Tower Relocation Programme which are now operational.\nAn additional 10 sites are currently under construction and are expected to be operational by the first quarter of the year.\nFurthermore, 20 macro base stations were constructed using USF funds and subsequently handed over to telecommunications operators.\nPOTRAZ director general, Dr Gift Machengete told ZBC News in Victoria Falls this Tuesday that USF is transforming the digital landscape.\n“POTRAZ aims to improve network coverage and capacity in areas where it is most needed, thereby ensuring that no community is left behind in the digitisation process. This initiative aligns with the broader goal of promoting digital inclusion across all demographics and all areas in Zimbabwe,”he said.",
            "time": "18:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Wetlands protection policies benefit rural communities",
            "href": "https://www.zbcnews.co.zw/wetlands-protection-policies-benefit-rural-communities/",
            "content": "Story by Theophilus Chuma\nSustainable use of wetlands has turned into a new agricultural frontier for rural communities that are reaping huge from utilising the natural resource to power productivity.\nAs part of the Second Republic’s environmental protection, government has strengthened mechanisms to protect wetlands as a measure towards poverty reduction, livelihood security, and resilience against climate change in line with Vision 2030.\nJessy Nyoni is among the women who have worked in this garden for years, utilising the available water resource from the revived wetland in the Kasibo area of Hwange.\nIn this farming venture, they have unlocked agricultural potential, boosting their income and savings.\nTheir produce feeds many within Hwange, providing food and nutrition security for thousands within this town.\nFarmer, Jessy Nyoni said, “We are seeing so many benefits from this wetland. We can now look into the future with hope because our incomes are now more secure. We utilise the water all year round and this allows us to diversify our produce. That way, we can sell different products.”\n“We are grateful to this programme that has revived the wetland. We can safely say that we are now resilient to the effects of climate change as we no longer depend on rains for production,” another farmer added.\nEnvironmental protection and resilience is one of the priority areas under the Second Republic, with government implementing the Zimbabwe National Wetlands Policy and Wetlands Management Guidelines of 2022.\nThe Environmental Management Agency reveals that over 300 000 hectares of wetlands have been rehabilitated so far.\nThe restoration of wetlands has emerged as a critical resilience tool for communities, important for poverty reduction and livelihood security in the face of climate change.",
            "time": "18:34",
            "date": "28 Jan 2025"
        }
    ]
}