{
    "news": [
        {
            "title": "SADC Ministers to discuss key regional development plans at mid-term meetings in Harare",
            "href": "https://www.zbcnews.co.zw/sadc-ministers-to-discuss-key-regional-development-plans-at-mid-term-meetings-in-harare/",
            "content": "Story by Oleen Ndori, Foreign Editor\nTHE stage is now set for the Southern African Development Community (SADC) Council of Ministers to be held at the New Parliament Building in Mt Hampden starting this Wednesday.\nForeign Affairs Ministers from the SADC will converge at the New Parliament Building in Mt Hampden for a council of ministers meeting from this Wednesday until March 14.\nZimbabwe’s Minister of Foreign Affairs and International Trade, Professor Amon Murwira, will chair the meeting, which is expected to be attended by ministers or their representatives from the 16 SADC member states.\nAccording to a statement from the Ministry of Foreign Affairs and International Trade, the council will review the status of the implementation of previous council and summit decisions.",
            "time": "06:41",
            "date": "12 Mar 2025"
        },
        {
            "title": "Search efforts continue for two missing children following Bandama Dam tragedy in Chipinge",
            "href": "https://www.zbcnews.co.zw/search-efforts-continue-for-two-missing-children-following-bandama-dam-tragedy-in-chipinge/",
            "content": "Story by Kenias Chivuzhe\nTHE search operation for two missing children continues in Chipinge following the tragic Bandama Dam disaster on Sunday, which claimed five lives.\nAfter the discovery of the fifth body on Monday night, two children remain unaccounted for.\nOn Tuesday, the Deputy Minister of Local Government and Public Works, Engineer Benjamin Kabikira, together with the Deputy Minister of Lands, Agriculture, Fisheries, Water, and Rural Development, Honourable Vangelis Haritatos, visited the affected communities.\nThey expressed their condolences and reaffirmed the government’s commitment to providing support to the bereaved families.",
            "time": "06:41",
            "date": "12 Mar 2025"
        },
        {
            "title": "President Mnangagwa expected to launch the Presidential Solarisation Programme",
            "href": "https://www.zbcnews.co.zw/president-mnangagwa-expected-to-launch-the-presidential-solarisation-programme/",
            "content": "Story by Oleen Ndori, Foreign Editor\nPRESIDENT Emmerson Mnangagwa is expected to launch the Presidential Solar Programme aimed at the provision of solar power to 200 000 households.\nThe programme is expected to benefit villages across the country’s eight rural provinces.\nThis was revealed by the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere during this Tuesday’s post cabinet media briefing.\n“Following the approval of the Implementation Plan for the Presidential Solarisation Programme in December 2024, significant milestones have been made towards the provision of solar power to 200 000 households,” Dr Muswere said.\n“Guidelines for the implementation of the programme have been established with stakeholder mapping and identification of beneficiaries in villages across the eight rural provinces already completed. Community mobilisation and awareness processes spearheaded by the Ministers of State for Provincial Affairs and Devolution have also been completed.\n“Graduates of the Youth Service in Zimbabwe, with assistance from experts from the Harare Institute of Technology and the Rural Electrification Agency, will install a total of 200 000 solar kits to the identified households.\n“His Excellency President Mnangagwa will launch the Presidential Solarisation Programme to mark the official commencement of the first year of the Programme.”\nNational priorities for the National Development Strategy 2 were also discussed.\n“Cabinet considered and approved the National Priorities for the National Development Strategy 2, running from January 2026 to December 2030 (NDS2), as presented by the Minister of Finance, Economic Development and Investment Promotion. The National Development Strategy 1 has been running from 2021 and will come to an end in December 2025. As such, the National Development Strategy 2 will be the Second Republic’s second five-year Medium-Term Plan for attaining the country’s Vision 2030,” Dr Muswere said.\n“The government has now adopted 10 National Priorities that will guide and underpin the formulation and implementation of the NDS 2 blueprint as follows:1) Macro-Economic Stability and Financial Sector Deepening;2) Inclusive Economic Growth and Structural Transformation;3) Infrastructural Development and Housing;4) Food Security, Climate Resilience and Environmental Protection;5) Technology, Innovation and Human Capital Development;6) Job Creation, Youth Development, Creative Industry and Culture;7) Social Development and Social Protection;8) Regional Development and Inclusivity through Devolution and Decentralization;9) Image Building, International Diplomacy and Trade; and10) Good Governance, Institution Building, and Security.\n“The streamlined National Priorities are geared to optimise resource allocation and strengthen sectoral coordination for effective and impactful delivery of services to the citizenry.\n“A broad-based consultative process will buttress Thematic Working Group re-alignment across the different socio-economic sectors, leading to the actual drafting and launch of the NDS2 by October 2025,” he said.\nRelating to NDS 2, the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, outlined strides that have been recorded within NDS1 and lessons learnt.\n“I think a very important lesson we have learned from NDS 1 which we will carry over into NDS 2 is that, we need a whole of government approach in attacking some of these pillars and strategies within NDS 2, which we tried to do under NDS 1, but this has to continue.\n“We have to be even better at it and make sure that we do away with the silos that may creep in from time to time to make sure that we can all work together to deliver on the goal of achieving an upper middle income society by year 2030,” Minster Ncube said.\nCabinet also discussed the food security outlook for the 2024/2025 summer cropping season.",
            "time": "06:41",
            "date": "12 Mar 2025"
        },
        {
            "title": "Wise Owl Group of Schools triumphs in inaugural Midlands girls cricket tournament",
            "href": "https://www.zbcnews.co.zw/wise-owl-group-of-schools-triumphs-in-inaugural-midlands-girls-cricket-tournament/",
            "content": "Story by Tafara Chikumira\nMARONDERA’s Wise Owl Group of Schools emerged as the overall winners of the inaugural Midlands Girls Cricket Tournament, held in Gweru over the weekend.\nThe tournament, hosted at Midlands Christian College, was a celebration of young female talent, as cricket enthusiasts enjoyed some exciting moments while the girl child showcased her skills in a thrilling cricket extravaganza.\nIn a captivating final, Wise Owl proved their prowess by defeating Gweru’s Chaplin High School to claim the championship.\nZimbabwe Cricket’s Under-19 Women’s Cricket Team Head Coach, Trevor Garwe, expressed his satisfaction with the level of competition, commending the teams for their impressive performances.\n“It is good to see girls undertaking cricket and schools supporting this development programme. I am impressed by the number of girls playing and the standard of cricket being displayed,” he said.\n“I think these are good signs for us as Zimbabwe Cricket and it is a platform for me and my technical team to scout for the next group of players to represent Zimbabwe. I think cricket is in good hands and its growing fast so I would encourage parents and other schools to keep on supporting us as it can give the children a bright future.”\nStakeholders chipped in heaping praises on Zimbabwe Cricket for coming up with a junior policy that guarantees posterity.",
            "time": "06:41",
            "date": "12 Mar 2025"
        },
        {
            "title": "Three suspects remanded in custody over marijuana seizure",
            "href": "https://www.zbcnews.co.zw/three-suspects-remanded-in-custody-over-marijuana-seizure/",
            "content": "By Fungai Jachi\nTHREE suspected drug dealers have been remanded in custody following their arrest on Monday in Harare’s Msasa industrial area, where they were allegedly found in possession of a significant haul of illegal drugs.\nThe accused, Michael Alfanet (49), Justice Mahope (42), and Loyd Matamba (35) face charges of unlawful dealing in dangerous drugs and contravention of the Liquor Act and are remanded in custody pending bail ruling.\nAccording to reports, the suspects were apprehended after police received a tip-off regarding suspicious activities at a warehouse in Msasa.\nAuthorities conducted a raid at the premises, during which they discovered four and a half tonnes of loose marijuana, along with several cases of smuggled alcoholic beverages.\nThe marijuana seized is estimated to have a street value of over ZiG$500 million, while the illicit alcoholic beverages are believed to be worth at least US$50 000.\nThe suspects reportedly failed to provide adequate documentation to justify their possession of the marijuana and could not present a liquor license for the beverages in their possession.",
            "time": "06:41",
            "date": "12 Mar 2025"
        }
    ]
}