{
    "news": [
        {
            "title": "Minister Muswere tours the Zim Zhongxin Smelting Company",
            "href": "https://www.zbcnews.co.zw/minister-muswere-tours-the-zim-zhongxin-smelting-company/",
            "content": "Story by Gay Mathambo\nTHE Minister of Information Publicity and Broadcasting Services, Dr Jenfan Muswere accompanied by the Masvingo Minister of State for Provincial Affairs and Devolution, Honourable Ezra Chadzamira have toured the Zimbabwe Zhongxin Smelting Company in Mashava where a US$60 million chrome smelting plant was constructed by the Chinese firm, creating more than 200 jobs for the locals in the mineral rich area.\nDr Muswere who is on a tour of signature projects in Masvingo Province told members of the media who are part of the tour that the chrome smelting plant is a game changer, given that Mashava has very huge chromite deposits and hundreds of small-scale miners have been earning a living from extracting the mineral for sale.",
            "time": "20:34",
            "date": "21 Jan 2025"
        },
        {
            "title": "Zim students benefit from Chinese scholarships",
            "href": "https://www.zbcnews.co.zw/zim-students-benefit-from-chinese-scholarships/",
            "content": "Story by Farai Gwaze\nTHE China-Zimbabwe Friendship Scholarship programme has been commended for ensuring the less privileged have access to education through placement at Chinese tertiary institutions.\nRelations between China and Zimbabwe remain steadfast and progressive through educational and cultural exchange initiatives, with the China-Zimbabwe Friendship Scholarships Awards ceremony being held in Harare this Tuesday.\nThe Deputy Minister of Higher and Tertiary Education, Innovation, Science and Technology Development, Honourable Simelisizwe Sibanda who was the guest of honour highlighted the importance of inclusion in the education sector.\n“It is impressive to note that the program in its design targets students from poor backgrounds who cannot afford tertiary education, to acquire culture, knowledge and skills from China. This resonates well with the Republic of Zimbabwe’s ideology of leaving no one and no place behind in the national building.”",
            "time": "20:34",
            "date": "21 Jan 2025"
        },
        {
            "title": "Sinomine Resource Group construct million-dollar clinic",
            "href": "https://www.zbcnews.co.zw/sinomine-resource-group-construct-million-dollar-clinic/",
            "content": "\nStory by Gay Mathambo\nTHE Masvingo provincial media tour has commenced at Bikita Minerals where the Sinomine Resource Group constructed a US$1 million state-of-the-art clinic which is currently benefitting more than 5 000 locals in Bikita and Gutu districts.\nThe healthcare facility was built by Bikita Minerals Sinomine as part of the lithium miner’s corporate social responsibility programme.\nThe tour also witnessed the Petalite and Spodumene plants worth US$200 million constructed by the company which are ramping up lithium production in Zimbabwe while extending the mine’s lifespan.\nThe plants also produce more than 30 000 tonnes of lithium adding to the 10 000 tonnes which the mine was already producing before the two plants were constructed.",
            "time": "20:34",
            "date": "21 Jan 2025"
        },
        {
            "title": "ZANU PF urged to remain united and disciplined",
            "href": "https://www.zbcnews.co.zw/zanu-pf-urged-to-remain-united-and-disciplined/",
            "content": "Story by Tamuka Charakupa\nThe ruling ZANU PF party says it has begun the initiation process towards the implementation of resolutions passed at the National People’s Conference held in Bulawayo last year.\nThe first ZANU PF Mashonaland West Provincial Coordinating Committee (PCC) meeting was held in Chinhoyi this Saturday, where the party leadership led by politburo member, Cde Ziyambi Ziyambi implored members to unite ahead of the implementation of party resolutions passed at the National People’s Conference late last year.\nCde Ziyambi said the ruling party has already started the initiation process to enable President Emmerson Mnangagwa to see through the attainment of his Vision 2030 agenda.\n“We have the numbers as the ruling party to ensure that we smoothly move towards the implementation of our first party resolution. We should remain united working together as a team. We should maintain our discipline as party members particularly regarding social media use. Looking at it, our President has initiated several policies and initiatives that are benefiting the ordinary citizens including solving the land issue through issuance of title deeds among other developments,” Hon Ziyambi said.Provincial chairperson, Cde Mary Mliswa-Chikoka buttressed the need for unity of purpose warning against misuse of social media in fanning factionalism and division in the party.\nShe said, “We are closely monitoring unwarranted social media groups which some of the members are using to leak party information and causing division. We should stand guided by the party’s ideology and always respect party leadership. We remain resolute and standing with our resolution that President Mnangagwa should see through the attainment of Vision 2030.”",
            "time": "20:34",
            "date": "21 Jan 2025"
        },
        {
            "title": "Urban farmers hopeful of securing food surplus this season",
            "href": "https://www.zbcnews.co.zw/urban-farmers-hopeful-of-securing-food-surplus-this-season/",
            "content": "Story by Fairstars Mukungurutse\nUrban farmers in Harare are optimistic of recording a good harvest following the heavy rains currently being received across the country.\nSlowly evolving into a vibrant urban agriculture ecosystem, nearly every household in Harare has its own small plot or back yard garden where a variety of crops are grown for consumption and profit.\nWhile most crops had suffered severe moisture stress following a prolonged dry spell characterized by high temperatures, the rainfall currently being received across the country has brought some relief to farmers as most crops have been rejuvenated.“We are happy the rains are back, we had lost hope of getting something because the heat wave was too much. Now we are expecting a bumper harvest,” said a farmer who spoke to the ZBC News.",
            "time": "20:34",
            "date": "21 Jan 2025"
        }
    ]
}