{
    "news": [
        {
            "title": "Veteran Cde Chirenda dies, leaves impactful legacy",
            "href": "https://www.zbcnews.co.zw/veteran-cde-chirenda-dies-leaves-impactful-legacy/",
            "content": "Story by Zbc Reporter\nTHE widow of national hero, Lieutenant Colonel (Retired) Harold Mtandwa Chirenda, Cde Florence Mankosi Chirenda, died on Tuesday at Mater Dei Hospital in Bulawayo after a long illness.\nShe was 71.\nBorn on July 10, 1954, in Kezi District, Matabeleland South, Cde Chirenda began her education at Mtshumayeli Primary School before proceeding to Usher Mission for secondary education.\nShe later studied at Moeng College in Botswana.\nA war veteran in her own right, Cde Chirenda made significant contributions during and after Zimbabwe’s liberation struggle.\nIn the 1970s, she was sent to Romania under the auspices of the Zimbabwe African People’s Union (Zapu) to study journalism.\nIt was in Romania, while stationed in Bucharest, that she met her husband, the late Lt-Col (Rtd) Chirenda.\nUpon returning to Zimbabwe, she worked as a journalist at the Zimbabwe Inter-Africa News Agency (Ziana) in Harare until retirement.\nHer passion for storytelling was matched by her business acumen and creativity.",
            "time": "06:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "United Methodist Bishops stand firm against homosexuality",
            "href": "https://www.zbcnews.co.zw/united-methodist-bishops-stand-firm-against-homosexuality/",
            "content": "Story by Fungai Jachi\nTHE United Methodist Church (UMC) in Africa has reaffirmed its opposition to homosexuality and same-sex marriages, saying such practices are not in line with Christian values and pose a threat to African cultural norms and the sanctity of human existence.\nSpeaking to ZBC News on the sidelines of a church service in Harare on Sunday, Bishop Mande Muyombo, the President of the African Bishops in the United Methodist Church, who is in Zimbabwe on an official visit said the church in Africa remains unwavering in its stance and is calling on congregants to remain rooted in biblical teachings and African traditions.\n“We have been very clear, not only we but even our elders who have gone ahead of us, Africa has been very consistent that we continue to be consistent with our values that marriage is between a man and a woman. We also believe that this is the biblical message as well. We are also guided by marriage laws in our different cultures that do not allow same sex marriages and even when paying a bride price, they will not accept if it’s for the same gender,” Muyondo said.\nCongregants at the service welcomed the church’s reaffirmed position, expressing relief that the leadership has publicly clarified its stance.",
            "time": "06:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Thorngroove artists turn clay into stories of culture and identity",
            "href": "https://www.zbcnews.co.zw/thorngroove-artists-turn-clay-into-stories-of-culture-and-identity/",
            "content": "Story by Zanele Ndlovu\nIN a small workshop nestled in Thorngroove, Bulawayo, a team of passionate creatives is transforming clay into artwork which ranges from kitchenware to decorative vases and plates.\nEach piece is individually designed and handcrafted with passion and style to create a unique product. These artists do not just mould ceramics, they mould stories.\nInspired by Zimbabwe’s rich wildlife and cultural heritage, much of their artwork prominently features bold depictions of the Big Five alongside traditional patterns drawn from Shona and Ndebele artistic motifs.\nAmong the team is a female painter, Marion Moyo, who stands confidently in a male-dominated space, proving that creativity knows no gender.\n“When I arrived, I was told the company still existed. I had left my pieces at the art gallery and had come to collect my money. That’s how I ended up here. I had studied at Mzilikazi and, though I had never drawn on ceramics before, only canvas, I passed the interview. I was the only woman among 33 men in the art production industry. But I never felt intimidated. I challenged myself to stand out. Art and pottery are my passion; they keep me going,” she said.\nColin Mpofu, a highly experienced and decorated artist, says art is more than his profession, it’s his identity.\n“First of all, we are given concepts, and then I express them in a way that someone can easily understand, depending on the colours that are wanted. Sometimes they can make demands, like they want certain colours and variations, hence I sit down and get cracking on it. Each piece can take me about two weeks, and then I hand it over to glazing. This is my life.\n“I am passionate about art. I joined ceramics in 1995, so that is about 29 years. I could say I have spent my whole life here. With this work, we can take our kids to school and support the family through this art. Apart from this, I do canvas art to supplement my income,” he noted.",
            "time": "06:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Masakadza electrification sparks growth and community empowerment drive",
            "href": "https://www.zbcnews.co.zw/masakadza-electrification-sparks-growth-and-community-empowerment-drive/",
            "content": "Story by Tafara Chikumira\nMASAKADZA business centre in Gokwe North District has been powered with electricity, a development that has triggered downstream success.\nThe arrival of electricity, delivered under the government’s rural industrialisation drive, is expected to significantly boost local economic activity with community members applauding the upgrade.\n“We are very grateful for this development that has been initiated in our area. Our businesses will now flourish with the coming into power set to help,” one of the beneficiaries said.\n“Our schools now have electricity.  This means that our children can now learn some subjects like ICT with ease. They can now study in a good environment,” another beneficiary noted.\n“The base station has come at the right time. We were having challenges in seeking help in times of emergencies. We are indeed experiencing meaningful help in our area,” one of the beneficiaries added.",
            "time": "06:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Over five million benefit from GBV Spotlight Initiative in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/over-five-million-benefit-from-gbv-spotlight-initiative-in-zimbabwe/",
            "content": "Story by Memory Chamisa\nThe government says it remains firmly committed to eliminating Gender Based Violence (GBV), as it acknowledges significant gains made through the Spotlight Initiative, a global UN-EU-funded programme.\nSpeaking to ZBC News, the Minister of Women Affairs, Community, Small and Medium Enterprises Development, Senator Monica Mutsvangwa, said the programme has surpassed its original target, reaching over five million beneficiaries, more than double the projected two million.\n“The Zimbabwe Spotlight Initiative Country programme has recorded significant gains. Of note is the High-Level Political Compact (HLPC) on Gender Based Violence which was signed by the President in October 2021, and has demonstrated a high-level political commitment to end violence against women and girls as well as harmful practices, including child marriages. To date, the Zimbabwe Spotlight Initiative programme has reached over five million beneficiaries exceeding the targeted two million,” she said.",
            "time": "06:51",
            "date": "21 Jul 2025"
        }
    ]
}