{
    "news": [
        {
            "title": "Gwanda – Maphisa road upgrade breathes life into Mat South’s development plans",
            "href": "https://www.zbcnews.co.zw/gwanda-maphisa-road-upgrade-breathes-life-into-mat-souths-development-plans/",
            "content": "Story by Providence Maraneli\nTHE government has commenced construction of the initial 10-kilometre stretch on the Gwanda-Maphisa Highway in Matabeleland South Province.\nConstruction on the highway is critical as it is poised to transform connectivity and economic activity in the region.\nThe project’s commencement comes in the wake of the Cabinet’s strategic decision to hold the 2026 Independence Day celebrations at Maphisa Open Grounds, a move already catalysing investment in key infrastructure.\n“We are so excited to see this road being constructed in our lifetime,” a local resident said.\n“We used to struggle at times, it made more sense to go through Bulawayo to reach Maphisa from Gwanda,” a motorist said.\n“We are happy to see this road being constructed as we were being overcharged by transport operators,” a commuter added.\nThe Gwanda-Maphisa Road connects several districts and links vital economic centres, including ARDA Antelope, the Makwe irrigation scheme, two border posts, and various tourist sites in Matobo.\nConstruction is already underway on the initial 10-kilometre stretch starting from Mvana.\n“The contractor is already on site. Initial grading and detour works have been completed, and we are now in the major construction phase. The initial focus is on the first 10-kilometre segment,” Provincial Roads Engineer, Mangisi Nkomo said.\nOnce completed, the road is expected to significantly reduce travel time between Gwanda and surrounding districts, particularly Matobo, improving access to services and opening up new economic opportunities in mining, agriculture, and tourism.\n“We are thankful to the government for choosing our province to host the Independence celebrations. This road is the heartbeat of Matabeleland South. With its completion, we are reducing travel distances by over 150 kilometres to some areas, which is transformative for business and service delivery,” the Minister of State for Matabeleland South Provincial Affairs and Devolution, Honourable Albert Nguluvhe said.",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "Chitungwiza residents live in fear of disease outbreaks amid raw sewage flows",
            "href": "https://www.zbcnews.co.zw/chitungwiza-residents-live-in-fear-of-disease-outbreaks-amid-raw-sewage-flows/",
            "content": "Story by Fairstars Mukungurutse\nCHITUNGWIZA residents have expressed growing frustration over the local authority’s continued failure to provide a lasting solution to the town’s persistent sewage challenges, which they say are threatening their health and general well-being.\nA strong stench from raw sewage is what greets visitors and residents alike in most parts of the dormitory town, where overflowing effluent has become a daily reality.\nConcerned residents are now appealing to central government and other responsible authorities to urgently intervene.\n“We are living in constant fear of a cholera outbreak because raw sewage continuously flows, we are now tired of living in this situation,” one resident said.\n“Toddlers and young children always fall into the sewage trenches that we have dug, and we do not know how the sewage challenge is going to end,” added another resident.\n“We drink water from boreholes and wells, but we are not sure if the water is safe anymore, considering the rate at which sewage is flowing inside homes,” a third resident lamented.\nChitungwiza Municipality has acknowledged the crisis, attributing the continued sewer bursts to ageing infrastructure.\nThe local authority says efforts are underway to replace damaged pipes and rehabilitate key sewer lines.",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "Second Republic’s social protection programme uplifts woman with rare disability",
            "href": "https://www.zbcnews.co.zw/second-republics-social-protection-programme-uplifts-woman-with-rare-disability/",
            "content": "Story by Tafara Chikumira\nTHE Government has intervened to ease the plight of a Gweru woman living with a rare medical condition, facilitating both her healthcare needs and the provision of a wheelchair to enhance her mobility.\nBorn 38 years ago in rural Rusape, Ms Francisca Zvapera has endured a challenging life journey, grappling with a rare, undiagnosed condition despite undergoing multiple medical tests.\nHer condition, which prevented her from attending school due to special needs, deteriorated over the years. By 2019, she was unable to walk, and her relatives resorted to transporting her in a wheelbarrow.\nTouched by her circumstances, thegovernment moved swiftly to provide assistance and alleviate the family’s burden.\n“It has been a difficult moment for us. Back then, she would struggle with her walk and talk, but it was a bit better. However, things turned worse when her mother died in 2019. At the hospital, several tests were done, but nothing was found. We have been struggling to take her from point A to B, as we had to push her in a wheelbarrow.\n“She is a devout Christian who doesn’t want to miss church, and this wheelchair will help her a lot. We want to thank the government for remembering us at our hour of need,” Mrs Rosemary Sibanda, a relative of Zvapera.\nThe government says meeting the social needs of communities is part of the Second Republic’s inclusive development approach.",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "Air Zimbabwe charts return to global skies after settling US$1million debt",
            "href": "https://www.zbcnews.co.zw/air-zimbabwe-charts-return-to-global-skies-after-settling-us1million-debt/",
            "content": "Story Tichaona Kurewa\nAIR Zimbabwe is back on course with its turnaround strategy, with the national airline having paid over US$1 million to key international service providers.\nThis development will see Air Zimbabwe re-joining global ticketing and code-sharing platforms, hence boosting passenger numbers and the airline’s international footprint.\nSpeaking on the development in Victoria Falls this Tuesday, Air Zimbabwe Chief Executive Officer, Mr Edmund Makona, said the airline identified global visibility as a critical business enabler in its turnaround plan.\n“We asked ourselves: what’s on the critical path to our revival? Visibility on global selling platforms was top. Without it, we couldn’t do code-sharing or interlining. Now, with shareholder support, we have cleared most of the debt,” said Mr Makona.\nMr Makona confirmed that Air Zimbabwe is now integrating its systems with global distribution networks, the backbone of international travel bookings.\nThe integration process is expected to takeaboutthree months or lessandoncecompleted, passengers worldwide will once again be able to book Air Zimbabwe flights through any travel agent or partner airline.\nRejoining code-sharing platforms also means Air Zimbabwe flights can now be sold through partner carriers globally, improving access to Zimbabwe’s major tourist destinations and boosting arrivals.",
            "time": "08:48",
            "date": "03 Jul 2025"
        },
        {
            "title": "FC Platinum midfielder, Brian Banda, remembered as humble hero",
            "href": "https://www.zbcnews.co.zw/fc-platinum-midfielder-brian-banda-remembered-as-humble-hero/",
            "content": "Story by Mthokozisi Dube\nZVISHAVANE -THE football fraternity has united in mourning FC Platinum midfielder Brian Banda, who died in a horrific car accident along the Zvishavane – Bulawayo Highwaythis Sunday.\nZvishavane came to a standstill this Monday, with the football fraternity converging in the mining town’s home of football, Mandava Stadium, for a funeral service of FC Platinum midfielder, Brian Banda, who died in a horrendous crash.\nFC Platinum supporters will always remember Banda as a player who was instrumental in the team’s success.\nThe team’s leadership and coach, NormanMapezawere at a loss for words as they tried to explain the loss to both the club and the football fraternity.\n“Brian is in our hearts. He played more than a hundred games,” FC Platinum Chairperson, Mr Dumisini Sisane said.\n“He was not just a footballplayer,he wasa very goodhuman being, someone who was very humble. It is just difficult losing him,” Mapeza said.\nIt is not only the mining town of Zvishavane that has been plunged into mourning, with the player, who started his career at Bulawayo giants, Highlanders, having also touched many hearts in the city.\nA jovial character, Banda used to chill with his friends along Entumbane’s Small Street.\nThe ZBC News visited Banda’s residence in Entumbane, where the community expressed shock at the demise of a promising football star.\nFootball has lost a precious gem, as confirmed by coaches who witnessed the rise of the footballer.",
            "time": "08:48",
            "date": "03 Jul 2025"
        }
    ]
}