{
    "news": [
        {
            "title": "Dr Kudakwashe Tagwirei makes history as first black recipient of global award of excellence",
            "href": "https://www.zbcnews.co.zw/dr-kudakwashe-tagwirei-makes-history-as-first-black-recipient-of-global-award-of-excellence/",
            "content": "Story by Yolanda MoyoDR Kudakwashe Tagwirei, the Chief Executive Officer of SAKUNDA Holdings, made history this weekend at Solusi University by becoming the first black individual to be honoured with the Global Award of Excellence by the General Conference of the Seventh-Day Adventist Church.The Global Award of Excellency is a prestigious accolade in the Seventh Day Adventist Church awarded to an individual who has made a global impact in education worldwide.Dr Tagwirei became the first black person to receive such an award owing to the work being done by his foundation, bridging the gap which has transformed 63 schools across Zimbabwe through availing tractors, farming implements and infrastructure development.At Solusi University, projects worth at least US$7 million have been implemented and are at different stages of completion.“Installation of a comprehensive turnkey irrigation system at Mananda Farm, including electrical and pump plants, conveyance systems, infield setups, fencing, and telemetry control systems.  Over nine kilometers of pipeline were installed for five of six center pivots, covering 127 hectares, alongside 5 850 meters of perimeter fencing.“Enhanced water access through the drilling of six boreholes (three operational) and the fabrication of a pontoon at Mananda Dam. University Ttransportation, donation of vehicles to support the university’s transportation needs, including nine SUVs, two double-cab vehicles for senior personnel, one single-cab truck, two UDI lorries, two buses with 65-passenger capacity each, five tractors, enhanced Water, Sanitation, and Hygiene (WASH), successful rehabilitation of the campus water supply and sewer systems, with ongoing improvements to ensure sustainability,” Solusi University Vice Chancellor, Professor Khumbulani Mpofu said.Seventh Day Adventist Church General Conference Director for Education, Dr Lisa Hardy said Bridging Gap Foundation Founder Mr Tagwirei is the first black person to scoop the award owing to his immense contribution to education in Zimbabwe, Africa, Asia, the Americas, and Europe.“Through his Bridging Gap Foundation, Tagwirei’s outreach extends well beyond the university. His dedicated capacity-building and welfare programmes are making a significant impact across the region’s primary and secondary schools.“Under the Centers of Influence Department, numerous beneficiary institutions, including Bindura University, among others, are receiving enhanced support designed to uplift educational standards and foster community growth,” she said.In his acceptance speech, Dr Tagwirei said education is a centre of influence hence it must transform nations through the implementation of tangible projects.“When we dedicate ourselves to the Lord’s work, we do not do it for accolades or recognition, we do it out of obedience, love, and a deep sense of mission. Yet, standing here today, I feel profoundly humbled that the work we do has been noticed and appreciated at such a high level.  For me, Solusi University has been more than just an institution, it is a pillar of Adventist education, a beacon of excellence, and a center of influence. This is why we have invested over US$7 million in capacity building at the Solusi farm not merely as a financial contribution but as a deliberate and strategic effort to ensure that our beloved university has long-term sustainability, self-sufficiency, and a future of excellence. Our institutions must not only survive, they must thrive, and that requires leadership, vision, and commitment,” he said.Besides investing in education, Dr. Tagwirei has contributed to the country’s health sector through Arundel Hospital in Harare, which provides free medical services with more than half a million people having been assisted so far. Over US$3,5  million has been channeled to six church conferences.\nStory by Yolanda Moyo\nDR Kudakwashe Tagwirei, the Chief Executive Officer of SAKUNDA Holdings, made history this weekend at Solusi University by becoming the first black individual to be honoured with the Global Award of Excellence by the General Conference of the Seventh-Day Adventist Church.\nThe Global Award of Excellency is a prestigious accolade in the Seventh Day Adventist Church awarded to an individual who has made a global impact in education worldwide.\nDr Tagwirei became the first black person to receive such an award owing to the work being done by his foundation, bridging the gap which has transformed 63 schools across Zimbabwe through availing tractors, farming implements and infrastructure development.\nAt Solusi University, projects worth at least US$7 million have been implemented and are at different stages of completion.\n“Installation of a comprehensive turnkey irrigation system at Mananda Farm, including electrical and pump plants, conveyance systems, infield setups, fencing, and telemetry control systems.  Over nine kilometers of pipeline were installed for five of six center pivots, covering 127 hectares, alongside 5 850 meters of perimeter fencing.\n“Enhanced water access through the drilling of six boreholes (three operational) and the fabrication of a pontoon at Mananda Dam. University Ttransportation, donation of vehicles to support the university’s transportation needs, including nine SUVs, two double-cab vehicles for senior personnel, one single-cab truck, two UDI lorries, two buses with 65-passenger capacity each, five tractors, enhanced Water, Sanitation, and Hygiene (WASH), successful rehabilitation of the campus water supply and sewer systems, with ongoing improvements to ensure sustainability,” Solusi University Vice Chancellor, Professor Khumbulani Mpofu said.\nSeventh Day Adventist Church General Conference Director for Education, Dr Lisa Hardy said Bridging Gap Foundation Founder Mr Tagwirei is the first black person to scoop the award owing to his immense contribution to education in Zimbabwe, Africa, Asia, the Americas, and Europe.\n“Through his Bridging Gap Foundation, Tagwirei’s outreach extends well beyond the university. His dedicated capacity-building and welfare programmes are making a significant impact across the region’s primary and secondary schools.\n“Under the Centers of Influence Department, numerous beneficiary institutions, including Bindura University, among others, are receiving enhanced support designed to uplift educational standards and foster community growth,” she said.",
            "time": "08:35",
            "date": "10 Mar 2025"
        },
        {
            "title": "Zim welcomes Asian travel agents amid growing tourism appeal",
            "href": "https://www.zbcnews.co.zw/zim-welcomes-asian-travel-agents-amid-growing-tourism-appeal/",
            "content": "Story by Tichaona Kurewa\nZIMBABWE is currently hosting nine travel agents from key Asian markets, including Singapore, Hong Kong, and the Philippines.\nThe agents arrived in the country this Friday through the Victoria Falls International Airport, courtesy of Qatar Airways, Thompsons Africa, and Gateway Singapore.\nAs part of a familiarisation tour, the agents will experience the country’s iconic attractions, such as the Victoria Falls rainforest, The Boma dining experience, and site inspections of various accommodation facilities in Victoria Falls.\nThis tour highlights Zimbabwe’s increasing appeal to new markets, particularly in Asia. With Hong Kong’s outbound tourism market projected to reach 863.2 million by 2025, Zimbabwe is poised to capitalise on this growth.",
            "time": "08:35",
            "date": "10 Mar 2025"
        },
        {
            "title": "Motorbikes(50) commissioned for Mberengwa councillors to boost service delivery",
            "href": "https://www.zbcnews.co.zw/motorbikes50-commissioned-for-mberengwa-councillors-to-boost-service-delivery/",
            "content": "Story by Courage Bushe\nGOVERNMENT has commissioned 50 motorbikes for Mberengwa Rural District Council through devolution and internally generated funds.\nAs the government continues with the devolution agenda, Mberengwa District Councillors have received 50 motorbikes to accelerate developmental projects.\n“Today’s occasion marks yet another major milestone in our efforts to enhance public service delivery and community engagement. These motorbikes will facilitate our mobility, enabling us to connect with constituents more effectively,” said a beneficiary.\n“Equipment recapitalisation is a key driver in the achievement of the National Development Strategy 1. We appreciate this and, we are going to reach every part of the community,” said a beneficiary.\nMberengwa Rural District Council Chairperson, Councillor Garisikai Moyo hailed the Government’s devolution strategy.\n“We appreciate this, we managed to secure this on our own, we need to improve and up our game in service delivery. This will enhance their mobility in their respective wards, resulting in the effective and efficient coordination of developmental activities throughout the 35 wards,” he said.\nThe Government has reaffirmed commitment to the turnaround of local authorities.\n“The commissioning of these motorbikes confirms the Second Republic’s desire for speedy and impactful people-centric and results oriented implementation of programs and projects as we move towards the attainment of a prosperous and empowered upper-middle income society, earlier than 2030,” said Midlands Province director coordination, Mr Kudakwashe Machako.",
            "time": "08:35",
            "date": "10 Mar 2025"
        },
        {
            "title": "Kuvimba Mining house unveils “green belt” initiative",
            "href": "https://www.zbcnews.co.zw/kuvimba-mining-house-unveils-green-belt-initiative/",
            "content": "Story by Tapiwa Machemedze\nKUVIMBA Mining House has unveiled a “green belt” initiative targeting to plant at least 100 000 trees at its mines this year under an environmental sustainability programme.\nThe initiative which will be conducted annually dovetails with the national drive focusing on interlinked interventions such as tree planting.\n21-year-old Vongai Chimbunde engages her fellow graduate trainee, Florence Mangai in a deep conversation as they make their way to participate in a programme that will not only help their future but generations beyond.\nUnmindful of the scorching heat, they get busy joining their colleagues to relay tufts of grass as part of rehabilitating the environment at Freda Rebecca Mine after the construction of a new Tailings Storage Facility (TSF).\n“It is very important to me in terms of maintaining the natural environment since I am doing mining engineering, we have to consider the ecosystem left after we are done with the mining process,” Chimbunde said.\n“Well it is important for me as a SHEQ student because we are restoring nature, and we are showing the importance of biodiversity to us as a mining company,” Mangai said.\nUnveiled at Freda Rebecca Mine in Bindura this Friday, the sustainability campaign aims to promote environmental stewardship and build environmental resilience across mines under Kuvimba Mining House.\n\nThe programme is double fold, interlinked to afforestation while also acting as a critical tool to control soil erosion.\n“From our TSF extension, we moved a lot of soil and vegetation, clearly the natural habitat has been disturbed so we have to go some way in restoring the natural environment to what it was, so it’s just the beginning. This year alone, we planted 10 000 trees in January, and we added another 800 last week, and today we are doing 1 000,” said Freda Rebecca Mine managing director, Mr Patrick Shayawabaya.\nThe local leadership has hailed the initiative as critical in promoting sustainable woodland management practices.",
            "time": "08:35",
            "date": "10 Mar 2025"
        },
        {
            "title": "GeoPomona waste-to-energy project enters final construction phase",
            "href": "https://www.zbcnews.co.zw/geopomona-waste-to-energy-project-enters-final-construction-phase/",
            "content": "Story by Owen Mandovha, Business Reporter\nTHE GeoPomona Waste to Energy Project is entering its final construction phase and continues to garner widespread support from key partners, including the country’s largest commercial bank, CBZ Holdings.\nA delegation from CBZ, led by Group Chief Executive Officer Mr Lawrence Nyazema, visited the project in Harare this Thursday.\nSince taking over waste collection responsibilities from the City of Harare last year, GeoPomona has made a significant impact, collecting an average of 1 500 tonnes of solid waste per day from illegal dumpsites.\nWith the sorting plant at the waste management project site in Harare now complete, the firm awaits construction of the main waste-to-energy plant which will generate at least 22 megawatts of electricity once operational.\n“This project is the first of its kind in Africa and we are excited to continue supporting GeoPomona until the project gets to finality. The modern equipment at this site attests to the effectiveness of the project as a solution to the waste management challenges faced by Harare,” Nyazema said.\nGeoPomona Chief Executive Officer Dr Dilesh Nguwaya owes the success of the project to their partners who are providing key support.",
            "time": "08:35",
            "date": "10 Mar 2025"
        }
    ]
}