{
    "news": [
        {
            "title": "Strategic partnerships accelerate national housing delivery across the Country",
            "href": "https://www.zbcnews.co.zw/strategic-partnerships-accelerate-national-housing-delivery-across-the-country/",
            "content": "Story by Fairstars Mukungurutse\nGOVERNMENT says it is confident of achieving one million housing units by the end of this year through enhanced public-private participation.\nA ground-breaking ceremony of a new housing project to provide at least 600 low cost stands in the Retreat area of Waterfalls in Harare, was held this Wednesday.\nOperation Nehemiah Housing Project is an initiative implemented under the United Family International Church.\nThe noise of the yellow machines ignites excitement among beneficiaries as they look forward to becoming owners of their destiny.\nThis is the conversation among these women who are set to become home owners after enduring decades as tenants.\n“I am very happy, finally I will be a landlord. This is indeed a dream come true for me after 20 years as a tenant,” a beneficiary, Gogo Mupfunya, said.\n“I am really overjoyed. I want a corner stand so that I can decorate and showcase the beauty of my house. I cannot wait for this day,” beneficiary Mrs Ndlovu said.\n“I am young and this is an opportunity that has come my way. I am really grateful,” a beneficiary said.\nIt will not be long before their dreams are fulfilled, as the project is expected to be completed within the next few months.\nAccording to government, Operation Nehemiah Housing Project, re-affirms the national vision of providing smart and affordable housing for all, through enhanced collaboration between the public and the private sector.\n“We are really impressed with the participation of private sector players within the real estate. As government we look at more players coming on board to support the national vision as spelt out by His Excellency President Emmerson Mnangagwa. Through private sector participation we remain confident of achieving the revised target to achieve one million housing units by end of this year,” Deputy Minister of Local Government and Public Works, Engineer Benjamin Kabikira said.",
            "time": "06:34",
            "date": "27 Mar 2025"
        },
        {
            "title": "Labour practitioners push for productivity boost to meet growth target",
            "href": "https://www.zbcnews.co.zw/labour-practitioners-push-for-productivity-boost-to-meet-growth-target/",
            "content": "Story by ZBC Reporter\nZIMBABWE’s labour sector is intensifying engagements with the government and business community to implement measures that will support the achievement of a 6% economic growth target for 2025.\nThe importance of productivity was highlighted at the launch of the Association for Labour Practitioners of Zimbabwe in Harare this Wednesday, where stakeholders emphasised the need for collective policy efforts to sustain the country’s economic momentum.\n“This launch is coming at a time when as an association, we are also looking into issues related to economic growth including embracing stability in the economy. It becomes imperative to further look at other workable strategies to keep the economy moving forward,” the Association for Labour Practitioners in Zimbabwe’s secretary Ms Patience Kavuru said.\nLabour law practitioners also explained the importance of engagements with government and business.",
            "time": "06:34",
            "date": "27 Mar 2025"
        },
        {
            "title": "Govt partners with CZA Vadzidzi vaJesu Church to boost youth empowerment",
            "href": "https://www.zbcnews.co.zw/govt-partners-with-cza-vadzidzi-vajesu-church-to-boost-youth-empowerment/",
            "content": "Story by ZBC Reporter\nIN a bid to strengthen youth empowerment and foster economic participation, the Deputy Minister of Youth Empowerment, Development and Vocational Training, Honourable Kudakwashe Mupamhanga recently engaged with the leadership of CZA Vadzidzi vaJesu Church.\nThe engagement marks a significant step in building a collaborative partnership between the ministry and the church, with a shared focus on equipping young people with vocational skills and opening doors to opportunities in key economic sectors.",
            "time": "06:34",
            "date": "27 Mar 2025"
        },
        {
            "title": "Seventh full post-cabinet press briefing – March 25, 2025",
            "href": "https://www.zbcnews.co.zw/seventh-full-post-cabinet-press-briefing-march-25-2025/",
            "content": "March 25, 2025, His Excellency, the President Dr E.D. Mnangagwa chaired the Seventh Cabinet Meeting and the following issues among others, were considered and approved:\n1.0 REPORTS ON PROJECTS AS AT DAY 50 OF THE 1ST 100- DAY CYCLE OF 2025\nCabinet received reports on progress made in the implementation of priority projects for the First 100-Day Cycle of 2025. 1.1 In the “moving the economy up of the value chain” pillar of the National Development Strategy 1, the Minister of Industry and Commerce highlighted the following achievements for projects under his purview:\n(i) Installation of a Beer Pet Project worth US$1.7 million at Ingwebu Breweries in Bulawayo Metropolitan Province is on course;(ii) Installation of an advanced tissue converting and printing plant to the tune of US$ 2,5 million by Supreme Brands is on course;(iii) Establishment of the ZITF 2025 Business Connections in strategic partnership with Private Sector Business Member Organisations;(iv) Conducting Reserved Sector Blitz and registration of 779 businesses in 6 provinces of Zimbabwe;(v) Intensification of the Consumer Protection Programme including product inspections; measuring instruments checks; and consumer education awareness campaigns inspections in the ten provinces of Zimbabwe is on course;(vi) Drilling of 3 boreholes in Mutare, Gweru and Masvingo as part of Trade Measures Infrastructure Capacitation is on course; and(vii) Equipping and commissioning of mobile van laboratories as part of Trade Measures Infrastructure Capacitation.\n1.2 In terms of the digital economy pillar, the Minister of Information Communication Technology, Postal and Courier Services, reported the following progress:\n(i) Equipping of 10 000 citizens with Digital Skills is on course in all Provinces, with 5 000 citizens having already been trained;(ii) Resourcing of the remaining 21 Rural District Councils across all Provinces, with distribution of ICT gadgets completed;(iii) Establishment of 10 ICT laboratories in all Provinces is on course with the inclusion of Starlink gadgets;(iv) Establishment of a Post Office kiosk at Tsanzaguru, Makoni District in Manicaland Province is well on course;(v) Installation of a Digital Postal System in Harare is in progress. The Zimpost mobile application was developed and completed;(vi) Deployment of 62 broadband network base stations in all Provinces, with 31 base stations having been completed;(vii) Deployment of e-learning platforms to 20 schools;(viii) Establishment of a Technology Park in Harare is on course;(ix) Construction of the Fibre distribution Hub under the Fibre to the Home Project in Belvedere Harare is on course;(x) Implementation of the Long-Term Evolution Project is on course; Implementation of the Bulawayo-Victoria FallsKazungula Fibre Backbone Project completed;(xi) Development of the Government Applications Procurement Framework is on course; and(xii) Connection of health facilities in Gokwe North on the Telemedicine system is on reported the, following progress.\n1.3 The Minister of Energy and Power Development, in order to achieve energy security reported the following progress:\n(i) Implementation of the Zvarota Institutions Grid Extension Project in Shurugwi is 100% complete;(ii)Construction of the 120-Megawatt (MW) Maximind Thermal Power Plant in Buhera District Manicaland Province has been completed;(iii) Construction of 100-MW Prestige Thermal Power Plant in Beitbridge District is on course;(iv) Construction of the 2.5-Megawatt Guruve Solar Plant is on course; (v) Construction of the NewGlovers 10-Megawatt Solar Project in Kwekwe District is on course;(vi) Construction of the 45 MW Zimplants Solar Plant in Chegutu District is 40% complete;(vii) Construction of the 20-Megawatt Manhize Thermal Power Plant in Mvuma is on course;(viii) Construction of the 20-Megawatt Dinson 100 MW Prestige Thermal Power Plant in Beitbridge District is on course;(ix) Construction of the 240-Megawatt Zhongzhing Heli Thermal Power Plant (Coal powered) in Hwange district is on course and currently generating 20 MW;(x) Construction of Gandavaroyi Community Mini Solar Grid in Gokwe North District is 83% complete;(xi) Construction of the 160kilowatts Soti Source Community Solar Mini Grid Project is 85% complete;(xii) Construction of Makhaza Institution Grid Extension Project in Tsholotsho District is 100% complete; and(xiii) Implementation of the Zendele Primary School Solar Mini Grid Project is 70% complete.\n1.4 Under the Food Security pillar of National Development Strategy 1, the Minister of Lands, Agriculture, Fisheries, Water and Rural Development highlighted the following achievements:\n(i) Implementation of the 50 hectares Gororo Irrigation Scheme in Chivi is 90% complete;(ii)Implementation of the 37 hectares Wanezi Irrigation Scheme in Insiza District is 80% complete;(iii) Planting of 1 822 904 hectares of maize against a target 1,8 million under the 2024/2025 summer season. A 1% increase was recorded;(iv) Planting of 717481 hectares against a target of 720 000 hectares for traditional grains, a 99,7% target;(v) Production of 29 million litres of milk as at day 50, against a target of 28 million litres;(vi) Production of 22 500 metric tonnes of beef as at day 50 against a target of 22 500 metric tonnes;(vii) Production of 2 820 metric tonnes of goat meat against a target of 2 500 measuring the, target was surpassed; and(viii) Distribution of 108 700 chicks at day 50 against a target of 150 000 chicks under the Presidential Rural Poultry Scheme, project on course.\n2.0 THE PIPELINES AMENDMENT BILL\nCabinet considered and approved the Pipelines Amendment Bill. The amendment will ensure maximum protection of pipelines by prohibiting all activities within the pipeline reserve; to impose stiffer penalties as well as provide for the inspection and maintenance of the pipeline reserve.\n2.1 MEMORANDUM OF UNDERSTANDING BETWEEN THE REPUBLIC OF ZIMBABWE AND THE REPUBLIC OF ALGERIA ON COOPERATION IN THE FIELD OF SCIENCE AND TECHNOLOGY\nCabinet considered and approved the Memorandum of Understanding between the Republic of Zimbabwe and the Republic of Algeria on Cooperation in the Field of Science and Technology. The objective of the Memorandum is to create a framework for cooperation in Science and Technology between the Republic of Zimbabwe and the Republic of Algeria, through exchange of experts, capacity building, collaboration in research among other activities. The two countries shall collaborate in areas such as biotechnology, electronics, pharmacology and management of information systems.\n3.0 REPORT ON HIS EXCELLENCY THE PRESIDENT’S VISIT TO NAMIBIA FOR THE INAUGURATION CEREMONY OF PRESIDENT NETUMBO NANDI-NDAITWAH\nCabinet received a Report on His Excellency the President’s Visit to Namibia for the Inauguration of President Netumbo Nandi-Ndaitwah, which was held on 21st March 2025. His Excellency the President Cde Dr. Emmerson Dambudzo Mnangagwa attended the Inauguration Ceremony of the President of the Republic of Namibia, Her Excellency Netumbo Nandi-Ndaitwah.\nThe inauguration ceremony coincided with the celebrations of Namibia’s 35th Independence Anniversary, which was held under the theme “Honouring the past, embracing the future”.",
            "time": "06:34",
            "date": "27 Mar 2025"
        },
        {
            "title": "Govt commits to enhancing industry-university collaboration",
            "href": "https://www.zbcnews.co.zw/govt-commits-to-enhancing-industry-university-collaboration/",
            "content": "Story by ZBC Reporter\nTHE government has reiterated its commitment to strengthening collaboration between universities and industry, focusing on developing skills that drive economic growth and achieve key national development goals.\nThis was emphasised by the Minister of Skills Audit and Development, Professor Paul Mavima during the Industry-University Innovate Together Summit this Tuesday.\n“Industry-university collaboration emerges as one of the most promising solutions to be embraced in our effort to bridge the skills gap.  Our government is committed to providing platforms and mechanisms that build stronger partnerships for skills development,” the Minister said.\n“As we emphasise modernising our education systems, we must recognise that traditional academic curricula alone are no longer sufficient to equip students with the practical skills needed to thrive in this evolving landscape. Our Ministry has embarked on a transformative skills development drive by partnering line Ministries and other stakeholders in promoting digital skills development for all citizens while prioritising communities that are furthest left behind,” Professor Mavima said.\nThe Minister noted the importance of these collaborations in achieving Zimbabwe’s Vision 2030, the 2030 Agenda for Sustainable Development, and Agenda 2063, “The Africa We Want” in transforming Zimbabwe into an upper-middle-income economy.\n“Zimbabwe’s industrialisation and modernisation thrust will be realised through the development and effective and efficient utilisation of the skills of its people, hence the relevance of a platform such as this where great minds come together to develop key recommendations that can move our nation forward,” he said.\nProfessor Mavima highlighted that industry-university collaboration creates a fertile ground for innovation.\n“Universities are hubs of creativity and intellectual exploration, while industries focus on solving real-world problems. When these two forces converge, the result is a dynamic synergy that drives technological advancement and economic growth,” he said.\n“The future workforce will be defined by adaptability, creativity, and problem-solving ability. Our Industry and universities must ensure effective nurturing of these qualities by offering students real-world exposure and development of both technical and soft skills.",
            "time": "06:34",
            "date": "27 Mar 2025"
        }
    ]
}