{
    "news": [
        {
            "title": "Mashonaland East mourns national hero, Cde Rungani",
            "href": "https://www.zbcnews.co.zw/mashonaland-east-mourns-national-hero-cde-rungani/",
            "content": "Story by Jerold Sasa\nTHE body of Brigadier General (Retired) Victor Rungani is now at his Bally Vaghuan Farm in Goromonzi where it was welcomed by government and ZANU PF officials, family members, farm workers and neighbouring farmers who came to bid farewell to a national hero who dedicated his life to serving the nation.\nThe Mashonaland East Province has expressed gratitude to government for granting Brigadier General (Retired) Victor Rungani national hero status, describing his demise as a huge loss to the province and the nation at large.\nMashonaland East Minister of State for Provincial Affairs and Devolution Advocate Itayi Ndudzo said the province is grateful to government for honouring one of its prominent farmers.\n“As a province, we feel very much honoured that one of us has been accorded such a status.”\nThe death of Cde Rungani has been described as a huge loss by the local farming community which him as a father figure who was always willing to assist.",
            "time": "08:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "National hero Cde Walter Basopo remembered as a unifier and patriotic leader",
            "href": "https://www.zbcnews.co.zw/national-hero-cde-walter-basopo-remembered-as-a-unifier-and-patriotic-leader/",
            "content": "Story by Tamuka Charakupa\nTHE body of National Hero Cde Walter Basopo is now at his Chinhoyi residence, with the local community describing the late cadre as a patriotic leader and unifier.\nThe body was received in Chinhoyi Monday afternoon by Mashonaland West Permanent Secretary for Provincial Affairs and Devolution Mr Josphat Jaji, the provincial and district leadership, relatives, friends and community members.\nWife to the late national hero Mrs Ketty Basopo expressed gratitude to government for the befitting honour bestowed upon her husband.\n“My husband was an honest man. He served the country wholeheartedly. We are grateful to President Emmerson Mnangagwa for honouring his legacy,” she said.\nThe provincial leadership, colleagues and war veterans paid tribute to Cde Basopo for his patriotic leadership.\n“As a province, we are deeply saddened by the loss of Cde Basopo who was living in Chinhoyi. He was always available to guide us as the ruling party. Truly to his death, Cde Basopo was a patriotic son of the soil, who worked for his country before and after independence.  We continue to cherish his good works of defending the country before and after independence,” ZANU PF Mashonaland West Provincial Chairperson Cde Mary Mliswa-Chikoka said.\n“As a party, we have lost one of our own who was a true example of being patriotic. We thank President Emmerson Mnangagwa for giving Cde Basopo a national hero status,” Makonde Legislator Hon Simba Ziyambi added.",
            "time": "08:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "Air Vice Marshal (Retired) Winnie Mandeya dies",
            "href": "https://www.zbcnews.co.zw/air-vice-marshal-retired-winnie-mandeya-dies/",
            "content": "Story by Peter Chivhima\nAIR Vice Marshal (Retired) Winnie Mandeya, a senior officer of the Air Force of Zimbabwe (AFZ), has died.\nShe was 64.\nAir Vice Marshal Retired Mandeya died early Monday morning at St Anne’s Hospital in Harare.\nConfirming the sad news, Commander Air Force of Zimbabwe, Air Marshal Jacob John Nzvede, said the late Air Vice Marshal Retired Mandeya served the AFZ with dedication and loyalty since 1984.\n“The Air Force of Zimbabwe family is saddened by the passing on of Air Vice Marshal Winnie Cabby Mandeya (Retired) on April 28 2025. She was a determined cadre who served the Air Force of Zimbabwe since 1984 and a liberation war heroine,” he said.\n“The late AVM Winnie Cabby Mandeya (Retired) joined the liberation struggle on September 29, 1975 and successfully completed basic military training at Nachingweya, Tanzania and was deployed in Gaza Province where she operated until 1978 when she was selected for a nursing course. At independence, she joined the President’s Department where she actively participated in the commission of inquiry into missing persons in 1981 and later transferred to the Air Force of Zimbabwe on July 1, 1984,”\nBorn on the 14th of July in 1960, in Rusape, Air Vice Marshal Retired Mandeya’s journey was marked by groundbreaking achievements.\nShe was among the cadres who survived the Chimoio attack.",
            "time": "08:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "Masvingo City wows global audience at the Colours of the World Expo",
            "href": "https://www.zbcnews.co.zw/masvingo-city-wows-global-audience-at-the-colours-of-the-world-expo/",
            "content": "Story by Mercy Bofu-Matinha\nMASVINGO City recently made a strong debut at the Colours of the World Tourism Expo in Turkey, proudly showcasing Zimbabwe’s rich cultural heritage and securing potential business and cultural exchange opportunities. The city’s impressive presentation further cemented Zimbabwe’s reputation on the global tourism stage.\nRepresenting the home of the legendary Great Zimbabwe, the Masvingo delegation participated in the just-ended Colours of the World International Culture, Tourism, and Destination Expo held in Istanbul.\nThe delegation featured experts from tourism, gastronomy, and traditional music, leaving an indelible impression on an international audience.\n“We had an awesome and eye-opening experience. We managed to sell our culture as Zimbabweans specifically from Masvingo province and we were well received. They even asked us for more and we had to go back on stage on many occasions. They appreciated our culture as a people,” musician Blessing Maramba said.\n“As a Chef, I am excited to participate at this important platform.  I have been exposed to an international platform, meeting chefs from different countries hence I learned a lot. Again I was excited that people here were attracted by our food, they were even asking for more hence I am so excited,” a participant at the Expo, Rejoice Gundura said.\nMasvingo City exhibition stand was a hub of cultural exchange, captivating visitors with an authentic taste of Zimbabwe delicacies such as Mopani worms, dried vegetables and exotic fruits like “Nyii” or “Umnyi” Bird Plum attracting international guests.\n“The experience was quite exciting, we believe we achieved the objectives we set for our participation. We wanted to provide exposure.  To our business people, our chefs and artists to international events so that they find collaborations and we also speak about our culture to the world. Our performances were well received and we participated in the panel discussions,” Masvingo City Council Finance Director, Mr Danster Jori said.\nNot to be outdone, were Masvingo’s traditional dancers from Charles Theatre Club, showcasing the vibrancy of Zimbabwean culture.",
            "time": "08:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "National hero Brigadier General Rtd Rungani described as a unifier",
            "href": "https://www.zbcnews.co.zw/national-hero-brigadier-general-rtd-rungani-described-as-a-unifier/",
            "content": "Story by Jerold Sasa\nTHE late national hero Brigadier General Retired Victor Rungani has been described as a family man and unifier.\nMembers of the Rungani family said the late decorated soldier was a family man who loved all and instilled discipline in his children.\n“Our father loved us so much and he also valued education such that all of us managed to reach the levels we all wanted because of his love,” his son, Daniel Rungani said.\n“He was a unifier who managed to unite all members of our extended family together,” uncle, Mr Enias Magate added.\n“He started this journey when he was still very young as he was against white oppression, especially in rural areas where he had grown up,” his aunt, Ms Christine Rungani added.\nThe daughter of the late hero, Professor Ellen Rungani explained how her father ended up having so many names as he was a man of the people.",
            "time": "08:40",
            "date": "29 Apr 2025"
        }
    ]
}