{
    "news": [
        {
            "title": "Gender equality seal launched for public institutions",
            "href": "https://www.zbcnews.co.zw/gender-equality-seal-launched-for-public-institutions/",
            "content": "Story by Fairstars Mukungurutse\nGOVERNMENT in collaboration with the United Nations Development Programme (UNDP) has launched the Gender Equality Seal for public institutions aimed at integrating gender equality standards across various organisations.\nPositioning Zimbabwe as one of the gender equality champion countries within the Southern African region, UNDP’s flagship programme; the Gender Equality Seal for Public Institutions was officially launched this Monday with the Zimbabwe Revenue Authority (ZIMRA) becoming the first institution in the country to undertake the certification programme.\n“It is a comprehensive and holistic approach that takes public institutions into a learning journey of about 24 months, really working with these institutions to make sure that SDG 5, as well as other gender commitments that Zimbabwe is part of are also implemented through these institutions. Zimbabwe is one of the pioneer countries in the region when it comes to implementing the Gender Equality Seal. We’ve got a number of countries in the region, but beyond the region this is something that is also being implemented across four regions that is Latin America, Asia and others,\n“Zimbabwe, is also joining a number of other countries that have been implementing this, like Uganda, Rwanda, and Ghana. So in the context of Zimbabwe, the focus is around helping the Zimbabwe Revenue Authority, to really support them to systematically integrate gender into their processes, procedures, as well as policies, and to see how this align with their mandate of tax revenue. But most importantly, to apply the gender lens and make sure that within their mandate, gender is also integrated and upheld,” UNDP Regional Service Centre for Africa gender team leader, Mrs Cleopatra Hurungo said.\nZIMRA acting commissioner general, Mrs Constance Shumbayawonda weighed in, “We will be training the trainers who will then go around ZIMRA to train our staff on gender equality in public institutions under fiscal services. We are also going to support the SMEs, UNDP is coming to bridge the gap of educating our small and medium enterprises, not all of them alone, but across the whole tax divide, because we know that without the taxpayers, we are not able to surpass our targets. So we actually have picked hundreds of similar staff that are going to go around the country to train all our staff, so that we’ll be able to educate and reach out to our clients and provide the necessary expertise and reduce the cost of compliance, because We want them to concentrate on payment of tax and not any other costs that come with that.”\nThe Minister of Women Affairs, Community, Small and Medium Enterprises Development, Senator Monica Mutsvangwa, said the initiative aligns with the national strategy to advance gender equality in Zimbabwe.\n“ZIMRA’s commitment to implement this initiative as one of the pioneer public institutions in Zimbabwe to implement the Gender Equality Seal framework is commendable and demonstrates strong leadership. This process will enable ZIMRA to enhance its operations and establish a national standard for gender-responsive public service. This also conveys a significant message, gender equality is not solely the responsibility of my Ministry, but rather a priority for the entire government and the whole Zimbabwean society,\n“I therefore call upon all other government entities, including the Reserve Bank of Zimbabwe, the Office of the Auditor General, and the Ministry of Finance, Economic Development, and Investment Promotion, to adopt the Gender Equality Seal programme, and we can see that ZIMRA is ready now to work with everybody, more so the SMEs.",
            "time": "08:50",
            "date": "22 Jul 2025"
        },
        {
            "title": "MPs urged to act on transport, employment challenges facing people with special needs",
            "href": "https://www.zbcnews.co.zw/mps-urged-to-act-on-transport-employment-challenges-facing-people-with-special-needs/",
            "content": "Story by Peter Chivhima\nPARLIAMENTARIANS have been rallied to continue supporting and crafting inclusive development programmes that cater for people with special needs.\nThe call was made this Monday during a presentation before the Parliamentary Portfolio Committee on Public Service, Labour and Social Welfare, where representatives of people with special needs outlined the challenges they face daily.\n“We are facing a number of challenges which includes transport so we feel that our Parliamentarians must look into the issues,” noted Disability Rights Advocate,Mr Francis Dembetembe.\n“We feel that we should have the same opportunities in employment which is accorded to groups such as the youths and some of the privileges given to the elderly because we suffer from similar problems, notedDisability Rights Advocate, Mr Simbarashe Namusi.",
            "time": "08:50",
            "date": "22 Jul 2025"
        },
        {
            "title": "Veteran Cde Chirenda dies, leaves impactful legacy",
            "href": "https://www.zbcnews.co.zw/veteran-cde-chirenda-dies-leaves-impactful-legacy/",
            "content": "Story by Zbc Reporter\nTHE widow of national hero, Lieutenant Colonel (Retired) Harold Mtandwa Chirenda, Cde Florence Mankosi Chirenda, died on Tuesday at Mater Dei Hospital in Bulawayo after a long illness.\nShe was 71.\nBorn on July 10, 1954, in Kezi District, Matabeleland South, Cde Chirenda began her education at Mtshumayeli Primary School before proceeding to Usher Mission for secondary education.\nShe later studied at Moeng College in Botswana.\nA war veteran in her own right, Cde Chirenda made significant contributions during and after Zimbabwe’s liberation struggle.\nIn the 1970s, she was sent to Romania under the auspices of the Zimbabwe African People’s Union (Zapu) to study journalism.\nIt was in Romania, while stationed in Bucharest, that she met her husband, the late Lt-Col (Rtd) Chirenda.\nUpon returning to Zimbabwe, she worked as a journalist at the Zimbabwe Inter-Africa News Agency (Ziana) in Harare until retirement.\nHer passion for storytelling was matched by her business acumen and creativity.",
            "time": "08:50",
            "date": "22 Jul 2025"
        },
        {
            "title": "United Methodist Bishops stand firm against homosexuality",
            "href": "https://www.zbcnews.co.zw/united-methodist-bishops-stand-firm-against-homosexuality/",
            "content": "Story by Fungai Jachi\nTHE United Methodist Church (UMC) in Africa has reaffirmed its opposition to homosexuality and same-sex marriages, saying such practices are not in line with Christian values and pose a threat to African cultural norms and the sanctity of human existence.\nSpeaking to ZBC News on the sidelines of a church service in Harare on Sunday, Bishop Mande Muyombo, the President of the African Bishops in the United Methodist Church, who is in Zimbabwe on an official visit said the church in Africa remains unwavering in its stance and is calling on congregants to remain rooted in biblical teachings and African traditions.\n“We have been very clear, not only we but even our elders who have gone ahead of us, Africa has been very consistent that we continue to be consistent with our values that marriage is between a man and a woman. We also believe that this is the biblical message as well. We are also guided by marriage laws in our different cultures that do not allow same sex marriages and even when paying a bride price, they will not accept if it’s for the same gender,” Muyondo said.\nCongregants at the service welcomed the church’s reaffirmed position, expressing relief that the leadership has publicly clarified its stance.",
            "time": "08:50",
            "date": "22 Jul 2025"
        },
        {
            "title": "Thorngroove artists turn clay into stories of culture and identity",
            "href": "https://www.zbcnews.co.zw/thorngroove-artists-turn-clay-into-stories-of-culture-and-identity/",
            "content": "Story by Zanele Ndlovu\nIN a small workshop nestled in Thorngroove, Bulawayo, a team of passionate creatives is transforming clay into artwork which ranges from kitchenware to decorative vases and plates.\nEach piece is individually designed and handcrafted with passion and style to create a unique product. These artists do not just mould ceramics, they mould stories.\nInspired by Zimbabwe’s rich wildlife and cultural heritage, much of their artwork prominently features bold depictions of the Big Five alongside traditional patterns drawn from Shona and Ndebele artistic motifs.\nAmong the team is a female painter, Marion Moyo, who stands confidently in a male-dominated space, proving that creativity knows no gender.\n“When I arrived, I was told the company still existed. I had left my pieces at the art gallery and had come to collect my money. That’s how I ended up here. I had studied at Mzilikazi and, though I had never drawn on ceramics before, only canvas, I passed the interview. I was the only woman among 33 men in the art production industry. But I never felt intimidated. I challenged myself to stand out. Art and pottery are my passion; they keep me going,” she said.\nColin Mpofu, a highly experienced and decorated artist, says art is more than his profession, it’s his identity.\n“First of all, we are given concepts, and then I express them in a way that someone can easily understand, depending on the colours that are wanted. Sometimes they can make demands, like they want certain colours and variations, hence I sit down and get cracking on it. Each piece can take me about two weeks, and then I hand it over to glazing. This is my life.\n“I am passionate about art. I joined ceramics in 1995, so that is about 29 years. I could say I have spent my whole life here. With this work, we can take our kids to school and support the family through this art. Apart from this, I do canvas art to supplement my income,” he noted.",
            "time": "08:50",
            "date": "22 Jul 2025"
        }
    ]
}