{
    "news": [
        {
            "title": "National Prosecuting Authority enhances prosecutor efficiency in Mashonaland Central",
            "href": "https://www.zbcnews.co.zw/national-prosecuting-authority-enhances-prosecutor-efficiency-in-mashonaland-central/",
            "content": "Story by Tapiwa Machemedze\nTHE National Prosecuting Authority (NPA) is ramping up efforts to strengthen its workforce and enhance service delivery, with prosecutors in Mashonaland Central Province already reaping the benefits of these initiatives.\nAs part of its latest efforts to improve employee welfare, the NPA has provided a new staff bus to the Bindura Magistrates Court to address longstanding transport challenges faced by prosecutors.",
            "time": "09:46",
            "date": "19 Apr 2025"
        },
        {
            "title": "Fake job adverts lure desperate job seekers into scam",
            "href": "https://www.zbcnews.co.zw/fake-job-adverts-lure-desperate-job-seekers-into-scam/",
            "content": "Story by Theophilus Chuma, Investigative Editor\nA syndicate of recruiting agents is prowling on desperate job seekers, fleecing them of their hard-earned cash through non-existing job promises.\nThe adverts are printed in bold black and white, listing what appear to be attractive packages for job seekers that include accommodation and a starting salary of between US$200 and US$300 for a post as a security guard or shop merchandiser.\nAdverts are strategically placed across residential suburbs, waiting for the next catch on innocent victims who are made to pay an agent consultation fee of US$40 before they can be linked to the job.\n23-year-old Hazvinei Foroma (not her real name) is among many lured into this web of fake promises.\n“I got the number of the agent from a WhatsApp group and contacted them over a job that was said to be in a supermarket. He asked for US$40 but I told him I had US$20, which I paid on the agreement I was going to pay the balance after I got my first salary,” she said.\nBut there is no guarantee that after paying this fee, the job will be available.\n“I was told to go and start work on a Monday, but when I got to the place, I was told a different story,” another victim said.\nAfter hearing this story, the ZBC News placed a call to the agent.\nThe conversation with the agent seals the fears from a previous engagement with another recruiting agent.\nHe had demanded cash payment before he could provide details of the job.\nThe job adverts were not clear on the number of candidates needed for the vacancy, leaving the possibility of the agent collecting more money for a non-existing placement.",
            "time": "09:46",
            "date": "19 Apr 2025"
        },
        {
            "title": "ZITF 2025 to spotlight Second Republic’s rural industrialisation vision",
            "href": "https://www.zbcnews.co.zw/zitf-2025-to-spotlight-second-republics-rural-industrialisation-vision/",
            "content": "Story by Lisa Masuku\nTHE 65th edition of the Zimbabwe International Trade Fair slated for April 21 to April 26 in Bulawayo is set to amplify the Second Republic’s rural industrialisation agenda through the first-ever rural industrialisation conference.\nDubbed the “Blue Sapphire” edition, the country’s biggest trade showcase is set to host an inaugural rural industrialisation conference on April 22.\nThe first-ever rural industrialisation conference is spearheaded by the Ministry of Industry and Commerce as part of efforts to promote inclusivity, ensuring no one and no place is left behind.\n“On April 22 we have the rural industrialisation conference. It’s an inaugural one, spearheaded by the parent ministry, the Ministry of Industry and Commerce,” ZITF CEO, Dr Nicholas Ndebele said.",
            "time": "09:46",
            "date": "19 Apr 2025"
        },
        {
            "title": "Chiredzi fire incident claims one life, leaves trail of destruction",
            "href": "https://www.zbcnews.co.zw/chiredzi-fire-incident-claims-one-life-leaves-trail-of-destruction/",
            "content": "Story by Gay Matambo\nA fire tore through a home in the Lyonnaise area of Chiredzi on Sunday evening, claiming the life of one unidentified individual and destroying property worth an undetermined amount.\nAccording to eyewitnesses, the blaze broke out around 1830 hours and quickly engulfed the entire house.\nOne person, whose identity is not yet confirmed, was reportedly trapped inside and died after being burnt beyond recognition.\n“We were sitting outside when we suddenly saw the front window shatter and flames erupt from inside. The fire spread so fast, in just a few minutes, the entire house was gone. There was nothing we could do,” one witness said.\nAnother resident, who was a tenant in the house, recounted their narrow escape.\n“I only managed to grab a bag with my child’s clothes. Everything else was lost in the fire.”",
            "time": "09:46",
            "date": "19 Apr 2025"
        },
        {
            "title": "UAE and Zimbabwean Govt collaborate to support food security",
            "href": "https://www.zbcnews.co.zw/uae-and-zimbabwean-govt-collaborate-to-support-food-security/",
            "content": "Story by Tichaona Kurewa\nTHE First Lady, Dr Auxillia Mnangagwa in collaboration with the United Arab Emirates (UAE), has stepped up efforts to ensure food security for communities affected by the El Niño-induced drought, beginning with the donation of six tonnes of mealie meal to the Matetsi community in Hwange District, Matabeleland North Province.\nThis is the first phase of a three-part donation that will ultimately total over 17 tonnes, signifying growing bilateral cooperation aimed at alleviating hunger and improving rural livelihoods.\nThe mealie meal consignment was warmly received by the Matetsi community, where residents expressed deep gratitude.\n“We will certainly have something to feed our families, many thanks to Amai for the mealie meal,” a beneficiary said.\n“This will cushion us definitely, it will take us somewhere, we are thankful,” another beneficiary said.\n“Life will not be the same, this will add to what we have, thank you Amai,” a beneficiary added.\nTraditional leaders and representatives from the UAE reaffirmed their commitment to improving livelihoods across Zimbabwe.\n“We are thankful to the First Lady for remembering us. I encourage continued efforts to build our country. We also appreciate this community’s efforts in preserving wildlife may this continue so future generations can enjoy these natural treasures,” Chief Hwange, Amos Chibaya said.\n“This food is not just for today it carries a message of hope and togetherness it shows the values of kindness, support, and working together values that the UAE believes in. We hope this help will make a difference and be the beginning of more good work between our two countries,” UAE Deputy Ambassador to Zimbabwe, Mr Rashed Al Shamsi.\nIn a speech read on her behalf by Mr Fulton Mangwanya, Director General in the President’s Department, the First Lady highlighted the significance of the United Arab Emirates’ gesture in supporting Zimbabwe’s national development agenda.\n“It is my wish to see everyone benefiting from this initiative and continue until we are satisfied with our 2025 harvest. I am very optimistic that our people’s livelihoods will inevitably be greatly improved. However, I challenge this community to value the gesture made here by UAE bearing in mind that we are the builders of our nation that answers to the president’s mantra “Nyika inovakwa nevene vayo, ilizwe Lakhiwa Ngabanikazi balo” which is our guiding philosophy for the Second Republic.",
            "time": "09:46",
            "date": "19 Apr 2025"
        }
    ]
}