{
    "news": [
        {
            "title": "ZIFA elections: Former footballers speak out",
            "href": "https://www.zbcnews.co.zw/zifa-elections-former-footballers-speak-out/",
            "content": "Story by Mthokozisi Dube\nFORMER Zimbabwe Football Association (ZIFA) vice president and seasoned administrator, Peter Dube, has set his sights on completing the task he left prematurely ten years ago.\nDube is one of the candidates vying for the ZIFA Vice Presidency.\nDube believes he has what it takes to contribute to the development of local football.\n“I was at ZIFA 10 years back, and you know what happened. Now is the time for us to complete the task we left. We want to improve the football ecosystem where everyone feels part of the journey to transform Zimbabwean football,” Dube said.\n“We are happy the secretariat has been put in place. We are not inventing anything new. Football has its governing statutes. What we need is to follow those principles and guidelines.\n“We are confident with the available secretariat, we can bring back the lost glamour in our game.”\nMeanwhile, former footballers have added their voice on the impending ZIFA polls.\nSouth Africa-based former Highlanders Defender, Alexander Maseko who has been at the forefront of assisting Zimbabwean teams on assignment across the Limpopo, and CAPS United legend, Stanford ‘Stix’ Mutizwa said football should be the winner after the ZIFA elections.\n“I have a message for the guys nominated for the ZIFA elections, they",
            "time": "18:27",
            "date": "04 Jan 2025"
        },
        {
            "title": "Former Dynamos manager Richard Chihoro dies",
            "href": "https://www.zbcnews.co.zw/former-dynamos-manager-richard-chihoro-dies/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nThe Zimbabwean football community has been plunged into mourning following the death of former Dynamos manager, Richard Chihoro.",
            "time": "18:28",
            "date": "04 Jan 2025"
        },
        {
            "title": "Khama Billiat joins Scottland FC",
            "href": "https://www.zbcnews.co.zw/khama-billiat-joins-scottland-fc/",
            "content": "Story by Tafadzwa Mavhangira\nWarriors star forward, Khama Billiat has joined Castle Lager Premier Soccer League debutants Scottland FC on a free transfer after the expiry of his contract with Yadah FC.\nThe club confirmed the development through their official X handle this Thursday.\nThe 34-year-old Billiat becomes yet another strong addition to the Scottland FC squad after the new boys signed off Soccer Star of the Year Walter Musona who captained Simba Bhora to their maiden premiership title last year.\nThe league debutants have also lured soccer star of the year finalist, Kingsley Mureremba from CAPS United and Coach of the year Tonderai Ndiraya from Simba Bhora.\nMeanwhile, Simba Bhora are reportedly working behind the scenes to strengthen their squad after losing Musona.\nAlthough the club is yet to make any announcement, there are indications Dynamos midfielder, Donald Mudadi and CAPS United goal-minder, Tonderai Mateyaunga are heading to Shamva.\nMudadi and Mateyaunga took to their Facebook pages to announce their departure from the capital to Simba Bhora.",
            "time": "18:28",
            "date": "04 Jan 2025"
        },
        {
            "title": "Lulu hunts for new club as he returns back home",
            "href": "https://www.zbcnews.co.zw/lulu-hunts-for-new-club-as-he-returns-back-home/",
            "content": "Story by Mthokozisi Dube\nFormer Highlanders head coach, Mandla Mpofu has opened up on his stint in the Botswana Premier League after being relieved of his duties a few days before the festive season break.\nCompared to his two fellow countrymen, Madinda Ndlovu and the late Rahman Gumbo who left an indelible mark in the Botswana Premier League, Mpofu has found the going tough.\nLulu was released by Sua Flamingoes before the festive season break following a string of poor results which saw the club slump to fourth position with 13 points from 12 games.",
            "time": "18:28",
            "date": "04 Jan 2025"
        },
        {
            "title": "Zimbabwe to host Women’s Handball Tournament",
            "href": "https://www.zbcnews.co.zw/zimbabwe-to-host-womens-handball-tournament/",
            "content": "Story by Anashe Murombedzi\nZimbabwe is set to make its mark on the international handball scene as the country prepares to host the International Handball Federation (IHF) Trophy Zone VI women’s junior and youth tournament in April.\nThe country’s successful bid to host the event has been described as testament to its growing reputation as a hub for handball in Africa.\nThe tournament, scheduled to take place in Harare from the 28th of April to the 4th of May, will bring together top teams from the region, all vying for a spot in the continental phase.\nSecretary of the Zimbabwe Handball Federation Edison Chirowodza said, “This tournament is set to be hosted in Harare and winners will take part in the continental championship which will be held later and ultimately the continental winners will proceed to the world youth and juniors qualifiers.”",
            "time": "18:28",
            "date": "04 Jan 2025"
        }
    ]
}