{
    "news": [
        {
            "title": "New boys Scottland, MWOS steal the show as giants stumble",
            "href": "https://www.zbcnews.co.zw/new-boys-scottland-mwos-steal-the-show-as-giants-stumble/",
            "content": "Story by Lawrence Trusida, Sports Editor\nPREMIER Soccer League new-boys Scottland and MWOS had a perfect start to their campaign in the top flight after registering wins in their debut matches at the weekend.\nScottland FC showed their intent after recruiting marquee players ahead of the start of the Premier Soccer League (PSL).\nThe Mabvuku-based side were duly rewarded in their debut match in the league after edging Triangle one-nil at Rufaro Stadium in the season opener.\nThe new boys were not at the level that everyone expected but the three points were sweeter in a debut match.\nThe own goal gave them victory and their first set of three points.\nOn Sunday, fellow newcomers, MWOS also needed lady luck to beat Highlanders at Baobab stadium after a mistake from Bosso goalkeeper Raphael Pitisi.\nThe Norton-based side caused Bosso further problems and could have gone away with a wide margin.",
            "time": "18:36",
            "date": "03 Mar 2025"
        },
        {
            "title": "Bonaqua Africa Triathlon Cup set for March 8th",
            "href": "https://www.zbcnews.co.zw/bonaqua-africa-triathlon-cup-set-for-march-8th/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Bonaqua Africa Triathlon Cup is set to be held on March 8, at its usual venue, the Troutbeck Resort in Nyanga.\nThe event draws elite triathletes from across the world who will be vying for ranking points to qualify for other global events and the upcoming 2028 Olympic Games.\nYoungsters will also be battling to be continental champions in the Junior Africa Cup.\nZimbabwe has predominantly featured athletes in the Junior Africa Cup but they have struggled for representation in the Elite categories.",
            "time": "18:36",
            "date": "03 Mar 2025"
        },
        {
            "title": "Former Champions FC Platinum date reigning Champs Simba Bhora",
            "href": "https://www.zbcnews.co.zw/former-champions-fc-platinum-date-reigning-champs-simba-bhora/",
            "content": "Story by Courage Bushe\nFC Platinum are banking on history in their quest to claim their first win of the 2025 Castle Lager Premiership season when they face Simba Bhora at Wadzanayi Stadium this Saturday.\nIt will be a dog-eat-dog affair when two titans, FC Platinum and defending champions, Simba Bhora clash at Wadzanayi Stadium in Shamva this Saturday.\nThe Zvishavane-based side was the only team to come out with three points at Wadzanayi Stadium last season and is eager to repeat the feat.",
            "time": "18:36",
            "date": "03 Mar 2025"
        },
        {
            "title": "Erling Haaland joins exclusive two-man Premier League club alongside Harry Kane",
            "href": "https://www.zbcnews.co.zw/erling-haaland-joins-exclusive-two-man-premier-league-club-alongside-harry-kane/",
            "content": "Erling Haaland became just the second player to score ten goals both home and away in three different Premier League seasons.\nHaaland joins Harry Kane in the elite club as he turned in the opening goal for City from close range in their clash at Tottenham on Wednesday night.\n\nIt was a vintage Haaland goal as he squeezed the ball past Guglielmo Vicario as he latched onto a low cross from the left on 12 minutes.\nIt’s not been been a sparkling season for him with City well off the pace in the title race.\nBut he’s proven himself to be prolific in front of goal than ever with the strike against Tottenham bringing up his 20th league goal, scoring ten at home and ten away this term.\nThe Norwegian hotshot has managed the feat in his other two seasons in the Premier League having scored ten away goals and 17 at home last term.\nAnd in his debut campaign, 14 of his 36 league goals came away from the Etihad Stadium.\nHaaland achieved his own record on Wednesday night, however, with the 24-year-old emulating ex-Manchester United star Ruud van Nistelrooy’s record of scoring 20+ Premier League goals in their first three seasons in the top flight.\nMeanwhile, Kane is the only man to do so five times [2015/16, 2016/17, 2017/18, 2020/21 and 2022/23].\nHaaland thought he’d scored his second of the game in stoppage time but he was adjudged to have handled the ball in the build-up following a lengthy VAR review.\n\n“I never believe that should be disallowed.\n“I think that’s completely wrong, but that’s me.”",
            "time": "18:36",
            "date": "03 Mar 2025"
        },
        {
            "title": "Mighty Warriors bow out of the AWCON qualifiers",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-bow-out-of-the-awcon-qualifiers/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE are out of the Africa Women Cup of Nations qualifiers after losing 5-4 on penalties to Angola at the Lucas Moripe Stadium in South Africa this Wednesday.\nThe Mighty Warriors went into the match needing to overturn a 2- 1 defeat in the first leg.\nZimbabwe started strongly and went into the lead courtesy of Ethel Chinyerere’s strike from close range to give her side the lead.\nThe Mighty Warriors continued to push and were duly rewarded at the stroke of halftime after speedy winger Christabel Katona tapped the ball home.\nZimbabwe went into the breather leading 2-nil but failed to manage the game in the second half, especially after the withdrawal of captain Emmaculate Msipa who was controlling play.\nAngola pounced and scored in the 75th minute, to force a 3-all aggregate score and eventually a penalty shootout.",
            "time": "18:36",
            "date": "03 Mar 2025"
        }
    ]
}