{
    "news": [
        {
            "title": "Magaya honored for football development initiatives",
            "href": "https://www.zbcnews.co.zw/magaya-honred-for-football-development-initiatives/",
            "content": "Story by Raynald Ngwarati, Sports Reporter\nHeart Stadium benefactor and Yadah FC owner, Prophet Walter Magaya was this Thursday honoured for his commitment to developing the country’s football at the Zimbabwe Project Management Achievements Awards in the capital.\nThe aspiring ZIFA presidential candidate won three accolades at the prestigious awards ceremony organised by the Chartered Institute of Project Managers Zimbabwe (CIPMZ) in Harare.\nFor his contribution to football, Magaya was the recipient of the Project Director of The Year, Mega Project of The Year and Engineering and Construction (Sports).\nMagaya, who has been actively taking up sport’s facility construction, was honored mainly for his passion to change the face of Zimbabwean football through the construction of The Heart Stadium in Waterfalls, Harare.\nThe Heart Stadium is a flagship project of the Heart Group’s football infrastructure development drive, with the Chahwanda Stadium project underway in Kwekwe and other projects like Chibuku Stadium renovation waiting for council approval.",
            "time": "08:33",
            "date": "21 Dec 2024"
        },
        {
            "title": "Man United boss Amorim commends team despite Spurs League Cup loss",
            "href": "https://www.zbcnews.co.zw/man-united-boss-amorim-commends-team-despite-spurs-league-cup-loss/",
            "content": "Manager Ruben Amorim took heart from Manchester United’s fightback in Thursday’s 4-3 loss at Tottenham Hotspur in the League Cup quarterfinals but said his side was undone by a more clinical performance from the hosts.\nUnited went 3-0 down shortly after the break but scored twice within seven minutes to bring the game back to life and kept up the pressure even after Son Heung-min scored a fourth for the hosts.\n“We disconnected in the beginning of the second half, it was a tough moment for us, like 10 minutes. And then we returned, I think we did a great job,” Amorim told Sky Sports.\n“I think if you look at all the games, I think we were the best team but they were more clinical. We lost the game but the fight from the lads was really important for me. Overall, it was a good match but there’s no taste in that. We didn’t win; we need to focus on the next game.”\nAmorim, who took over from Erik ten Hag in November, said that 13th-placed United still had a long way to go before they could challenge for the Premier League title.",
            "time": "08:33",
            "date": "21 Dec 2024"
        },
        {
            "title": "Develop soccer from grassroots – Musanhu",
            "href": "https://www.zbcnews.co.zw/develop-soccer-from-grassroots-musanhu/",
            "content": "Story by Jonathan Marerwa in Beijing, China\nSoccer, just like any other sporting code, needs to be developed from grassroots level in order to derive maximum benefits.\nThese sentiments were made by renowned China-based youth soccer coach, Walter Musanhu, during the recently-held Jadel Football Academy 6th year awards ceremony in Beijing.\nMusanhu, who is the founder and chief funder of the academy, said it gives him great pleasure helping in the grooming of young players.\nHe said the academy, which has a branch in Harare, is helping in creating a better future for children, with 278 children being members of the academy.\nThe former Motor Action Football Club player said he is targeting children from high density areas and other disadvantaged communities, and is paying school fees while also providing accommodation for others.\nHe urged business people to partner with his academy since he has been solely funding it from his savings.\nMusanhu said it is his wish to have land to construct soccer facilities so as to have a fully-fledged academy modelled like those found in developed countries.",
            "time": "08:33",
            "date": "21 Dec 2024"
        },
        {
            "title": "Three more aspiring ZIFA presidential candidates face scrutiny",
            "href": "https://www.zbcnews.co.zw/three-more-aspiring-zifa-presidential-candidates-face-scrutiny/",
            "content": "Story by Lawrence Trusida, Sports Editor\nThe run-in to the eagerly anticipated ZIFA Executive committee elections is fast turning into a soap opera after three more candidates, businessman Nqobile Magwizi, former legislator Themba Mliswa and former PSL Chairperson Twine Phiri saw their candidature being questioned after private individuals wrote to the Ethics Committee questioning their eligibility.\nThis comes a few days after Yadah FC Owner, Prophet Walter Magaya, Northern Region Chairperson Martin Kweza and former ZIFA board-member Philemon Machana faced the same scrutiny.\nIt is again the same modus operandi which has been used with letters being written to the ZIFA Ethics committee questioning if the trio of Magwizi, Mliswa and Phiri is suitable for the top post.\nSports Analyst Malvern Moyo has described the current situation as ‘electioneering.’\n“It’s ’s very interesting times ahead of us. 25 January is proving too far,  but coming to the issue at hand this is definitely what I can call electioneering with some candidates trying to get others out of the way. Of you look at the letters it looks like it’s the work of one person who hasn’t done their homework well because some of the allegations have no standing while others have already been cleared of those things , its elections season so you can expect anything,” he said.\nSome of the candidates vying for the ZIFA presidential seat include Marshal Gore of Team Zimbabwe UK, former Warriors captain Benjani Mwaruwari and PSL chairperson Farai Jere.",
            "time": "08:33",
            "date": "21 Dec 2024"
        },
        {
            "title": "Scottland FC to build 15 000-seater stadium in Mabvuku",
            "href": "https://www.zbcnews.co.zw/scottland-fc-to-build-15-000-seater-stadium-in-mabvuku/",
            "content": "Story by Lawrence Trusida, Sports Editor\nScottland FC have set in motion the construction of a 15 000-seater stadium following a ground-breaking ceremony held at the Number One Grounds in Mabvuku this Wednesday.\nThis is a ground that shaped careers of many athletes – the legendary Warriors goalkeeper Brenna Msiska, the Mugeyi brothers William and Wilfred as well as Daniel Jakiel, a cricketer who is now turning out for Malawi.\n\nMarshall Munetsi, the Mabvuku-born Warriors vice-captain would have loved to showcase his skills at the ground, but, unfortunately, it wasn’t to be as the community sports centre was not developed, but his dream will now be lived by many youths in Mabvuku and surrounding areas following the ground breaking ceremony held this Wednesday.\nScottland FC, owned by Mabvuku legislator Honourable Scott Sakupwanya, have secured a 30-year lease for Mabvuku Number One Grounds.\nThe club aims to build a 15 000-seater multi-purpose stadium, swimming pool, cricket pitch, construct new courts for basketball and tennis as well as build a club house for Scottland FC.\n\n\nThe project will be done in phases, with the first phase earmarked to be ready by April next year.\n\n“It’s going to be a multi-purpose sports complex with swimming pools, stadiums and shops. If you know the history of Mabvuku, Number One Ground used to have some of these things and we are just revamping it into a modern facility. We are going to do things in phases and phase one will be the construction of a club house, main pitch as well as practice pitch for Scottland FC,” said Scottland FC chairperson, Tonderai Sakupwanya.",
            "time": "08:33",
            "date": "21 Dec 2024"
        }
    ]
}