{
    "news": [
        {
            "title": "Cricket analysts call for a change of mindset",
            "href": "https://www.zbcnews.co.zw/cricket-analysts-call-for-a-change-of-mindset-2/",
            "content": "Story by Lawrence Trusida, Sports Editor\nCricket analysts believe a change of mindset can help the Chevrons to play better in test cricket.\nZimbabwe’s latest defeat to Ireland continued a downward spiral that has been going on for years now.\nThe defeat to Ireland was the 10th in a row, after last winning a test match three years ago.The loss also means that in the last 50 tests, Zimbabwe has only managed to win five.\nAnalysts believe Zimbabwe’s problems are more mental than technical.\n“Even without, Ervine, Raza and Williams we should be beating Ireland any day, it’s our mental approach to the game that is wrong. I believe our players are playing way too many shorts for a test match as compared to leaving balls and choosing the ones to play. We saw what Madhevere did in the second innings he was patient and he got the reward, we are playing test cricket in limited overs mode and we are rushing,” said cricket analyst, Godwin Mamhiyo.",
            "time": "08:26",
            "date": "14 Feb 2025"
        },
        {
            "title": "Pasuwa appointed Malawi National team’s head coach",
            "href": "https://www.zbcnews.co.zw/pasuwa-appointed-malawi-national-teams-head-coach/",
            "content": "\nStory by Lawrence Trusida, Sport Editor\nFormer Warriors coach Kalisto Pasuwa has been appointed head coach of the Malawi National team.\nThe highly successful coach will be in charge of the Flames for the next two years, as confirmed by the Football Association of Malawi (FAM).\nThe former Dynamos coach has been leading the Flames on an interim basis, but was confirmed as the head coach this Wednesday.",
            "time": "08:26",
            "date": "14 Feb 2025"
        },
        {
            "title": "Cricket analysts call for a change of mindset",
            "href": "https://www.zbcnews.co.zw/cricket-analysts-call-for-a-change-of-mindset/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nCricket analysts believe a change of mindset can help the Chevrons to play better in test cricket.\nZimbabwe’s latest defeat to Ireland continued a downward spiral that has been going on for years now.\nThe defeat to Ireland was the 10th in a row, after last winning a test match three years ago.The loss also means that in the last 50 tests, Zimbabwe has only managed to win five.\nAnalysts believe Zimbabwe’s problems are more mental than technical.\n“Even without, Ervine, Raza and Williams we should be beating Ireland any day, it’s our mental approach to the game that is wrong. I believe our players are playing way too many shorts for a test match as compared to leaving balls and choosing the ones to play. We saw what Madhevere did in the second innings he was patient and he got the reward, we are playing test cricket in limited overs mode and we are rushing,” said cricket analyst, Godwin Mamhiyo.",
            "time": "08:26",
            "date": "14 Feb 2025"
        },
        {
            "title": "FIFA bans Highlanders from signing players",
            "href": "https://www.zbcnews.co.zw/fifa-bans-highlanders-from-signing-players/",
            "content": "Story by Mthokozisi Dube\nBulawayo giants, Highlanders Football Club’s preparations for the 2025 season have been dealt a huge blow after the world football governing body, FIFA handed the club a transfer ban over unpaid salaries to their former gaffer Baltemer Brito.\nLess than a month ago, the club appeared to be on top of the situation in settling the salary arrears owed to their former coach Portuguese, Baltermer Brito and his assistant Antonio Torres.\nThe club made its stakeholders believe that their principal sponsor Sakunda holdings was making plans to settle the debt.\nBrito is owed US$15 000 while Antonio is owed close to US$12 000 in salary and bonus arears.",
            "time": "08:26",
            "date": "14 Feb 2025"
        },
        {
            "title": "Warriors to play two Group B matches in Morocco",
            "href": "https://www.zbcnews.co.zw/warriors-to-play-two-group-b-matches-in-morocco/",
            "content": "Story by Mthokozisi Dube\nThe Zimbabwe senior men’s football team, the Warriors, will play two of their Group B matches at the Stade de Marrakech in Morocco after the Confederation of African Football (CAF) released the 2025 Africa Cup of Nations schedule.\nThe Michael Nees-mentored side begin duty on Unity Day with a tricky encounter against African giants Egypt set for the 45 000-seater Stade d’Agadir on the shore of the Atlantic Ocean near the Atlas Mountains.\nFour days later, the Warriors shift base for their second match against Angola set for the Stade de Marrakech.\nThe Warriors will wind-up their Group B campaign with a battle against South Africa’s Bafana Bafana at the same venue.",
            "time": "08:26",
            "date": "14 Feb 2025"
        }
    ]
}