{
    "news": [
        {
            "title": "Struggling CAPS register 5th loss in 7 games",
            "href": "https://www.zbcnews.co.zw/struggling-caps-register-5th-loss-in-7-games/",
            "content": "Story by Raynald Ngwarati\nTHE Green Machine’s poor start to the season continued again this weekend as the five-time Premier Soccer League champions were left licking wounds at home by Bikita Minerals.\nCAPS United succumbed to their fifth defeat of the season after losing to Bikita Minerals in a Castle Lager Premier Soccer Match played at Rufaro Stadium this Sunday.\nThe Green Machine currently lie in the drop zone with just a single win and a draw, have failed to collect points in their last four matches.\nPlaying at the home arena, Rufaro Stadium, the match was poorly attended, a sign that the fans are frustrated with the form of one of the big three clubs in the country.\nAfter a decent showing, the Lloyd Chitembwe-coached side, failed to find their touch in the final third, which cost them, as Innocent Masiiwa scored a last minute goal to punish the Green Machine.\nWhile, the Green Machine’s struggles continue, fellow strugglers Triangle United bagged their first victory of the season after beating Yadah by a single goal.\nThe victory took Triangle to four points, level with CAPS United, but they still anchor the standings due to an inferior goal difference.\nAt Sakubva Stadium, Herbert Maruwa-coached TelOne recorded a massive comeback, rising from two-nil down to force a two-all draw against Manica Diamonds.",
            "time": "20:34",
            "date": "20 Apr 2025"
        },
        {
            "title": "Lady Sables fall to Uganda in heavy defeat",
            "href": "https://www.zbcnews.co.zw/lady-sables-fall-to-uganda-in-heavy-defeat/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Women’s National Rugby Team, the Lady Sables, endured a difficult outing this Saturday, succumbing to a 63–7 defeat against Uganda in a Rugby Africa Women’s Cup qualifier.\nUganda who had previously outshined Tunisia and the hosts Cote D’Ivoire, implemented a successful game plan crippling the Lady Sables’ aggressive attack line to guard the score line.",
            "time": "20:34",
            "date": "20 Apr 2025"
        },
        {
            "title": "Jnr Sables shift focus to Tunisia after Namibia loss",
            "href": "https://www.zbcnews.co.zw/jnr-sables-shift-focus-to-tunisia-after-namibia-loss/",
            "content": "Story by Raynald Ngwarati\nZIMBABWE Under-20 Rugby team have been given a tough task in their 2025 Rugby Africa Barthes Cup pursuit.\nThis comes after the Junior Sables stuttered in their first challenge of the Cup, succumbing to regional rivals Namibia in an action-packed encounter.\nThe lads had a slow start, being made to trail in the early exchanges, as Namibia drew first blood at the expense of the hosts to signal their intentions in the battle.\nThe Junior Sables had to launch an explosive comeback in the second half after trailing 5-27 at the break.\nAn all-round display from the Junior Sables after the restart withheld much possession and momentum from Namibia, scoring three unconverted tries in the process to cut the deficit to 22-27.\nThe Namibians however, found their first-half rhythm in the closing stages as they caught a late second breath for two more tries in the 70th and 73rd minute.",
            "time": "20:34",
            "date": "20 Apr 2025"
        },
        {
            "title": "Ngoni Stadium to host inaugural top-flight match",
            "href": "https://www.zbcnews.co.zw/ngoni-stadium-to-host-inaugural-top-flight-match/",
            "content": "Story by Tamuka Charakupa\nPREMIERE League debutants MWOS, are set to host giants Dynamos in their first home league fixture at their newly approved Ngoni Stadium in Norton this Monday.\nMWOS, who are riding high at the top of the table, are confident of beating the country’s most decorated club, Dynamos next week.\nThe team has had a dream start to life in the big league our wins and two draws from their opening six matches, collecting 14 out of a possible 18 points.\nDynamos on the other hand are struggling with just six points from six games hovering dangerously close to the relegation zone.\nMWOS head coach Lloyd Mutasa said his team is here to stay, promising improved form following the approval of Ngoni Stadium as its home ground.\n“The team is highly motivated following our positive run since we joined the top flight league. Dynamos, just like any other premiership side, are not any easy game but we are promising our best effort to prove a point. We now have our own home ground in Norton and obviously it’s always a positive atmosphere to play in front of our fans,” Mutasa said.\nThe local community is upbeat the establishment of the Ngoni Stadium will attract downstream benefits.\n“This stadium now has a capacity of around 7 000 up from just 500. In terms of renovations we are at 98 %. However, we have plans to construct our own stadium that is AFCON approved as we are currently renting Ngoni from Norton Town Council,” MWOS Chairperson, Clayton Arimoso said.\n“This is a partnership that is a step towards our goal of attaining a municipal status. Our vendors have also benefitted in the process through the construction of modern vending tables,” Norton Town Council, Mayor, Councillor Action Mataruse said.\n“This means our community now has access to entertainment activities which goes a long way in fighting drug and substance abuse,” Norton town Council, Councillor Tinashe Machemedze said.",
            "time": "20:34",
            "date": "20 Apr 2025"
        },
        {
            "title": "Zim students set for elite sports training in France",
            "href": "https://www.zbcnews.co.zw/zim-students-set-for-elite-sports-training-in-france/",
            "content": "Story by Wellington Makonese\nTHE pursuit of sporting excellence continues to gather momentum within Zimbabwean schools, with Samuel Centenary Academy set to embark on a transformative week-long sports tour at the prestigious FMC Academy in France.\nThe tour will expose talented students to high-level training in rugby, basketball, and football, under the guidance of expert coaches in the French capital.\nThe initiative forms part of an international exchange programme, designed to enhance both physical development and professional exposure for Zimbabwean learners.\n“As a school, we are embarking on this tour as part of an exchange programme, so that our learners get expert training in basketball, rugby and soccer in France. This aligns with the heritage curriculum and is critical in terms of having the physical well-being of our students coupled with expertise in sports. It gives them more options,” a representative from Samuel Centenary Academy, Yeukai Matsikarima said.\nFor the participating students, this tour represents more than just a training opportunity; it is a significant platform and a potential stepping stone to greater heights.\n“I am really excited about this opportunity which affords me an opportunity to get scholarships and even further training in my field,” a student said.",
            "time": "20:34",
            "date": "20 Apr 2025"
        }
    ]
}