{
    "news": [
        {
            "title": "Uhuru Celebrations boosts rural sports development",
            "href": "https://www.zbcnews.co.zw/uhuru-celebrations-boosts-rural-sports-development/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE devolution of the country’s independence celebrations has seen the sport sector being one of the major beneficiaries, with stadia being built in different communities.\nFor decades, Zimbabwe’s Independence Day celebrations were a centralised affair, mostly held in Harare.\nIn recent years however, a quiet transformation has taken place.\nThanks to the government’s push for devolution, national celebrations are no longer confined to the capital, as they are now rotating across provinces and with them comes real, tangible investment in rural infrastructure.\nOne unexpected winner in this shift is the country’s sports sector.\nIn 2022, government officially began decentralising the hosting of National Independence celebrations, aligning with its constitutional mandate to promote equitable development.\nWhat may have looked like a symbolic gesture has turned into a practical development tool, especially when it comes to sports.\nIn 2023, government renovated the once dusty Pfura Stadium in Mt Darwin, putting in a lush green lawn, changing rooms, water and other amenities needed for a sports field.\nThe stadium is now host to Northern Region Division One outfit, Agama United.\nThe same happened last year in Manicaland Province where government went even further to construct terraces at Murambinda B field, which is now home to Deportivo la Murambinda which competes in the Eastern Region Division One league.\nCurrently, work is being done in Gokwe North where another community stadium is getting a facelift.\nThese facilities are not just for one day, they become permanent homes for local clubs, schools, and community leagues.\nMore infrastructure means more access, especially in rural areas where sport is often an afterthought in budgets, hence a new stadium changes the equation.\nYoung athletes now have proper grounds to train, compete, and dream.Local tournaments are no longer played on uneven, dusty fields but on manicured pitches.\nThere’s a cultural shift happening too, when rural communities host the nation’s biggest day, it brings a sense of inclusion and pride.",
            "time": "21:46",
            "date": "15 Apr 2025"
        },
        {
            "title": "Belvedere Teachers College dominates ZTCOSA games in Bulawayo",
            "href": "https://www.zbcnews.co.zw/belvedere-teachers-college-dominates-ztcosa-games-in-bulawayo/",
            "content": "Story by Mthokozisi Dube\nBELVEDERE Teachers College ruled the roost at the Zimbabwe Teachers College Sports Association games which ended in Bulawayo this Tuesday.\nThe road to the annual Zimbabwe Tertiary Institutions Sports Association Games began with teachers college games held at Hillside Teachers College in Bulawayo.\nBelvedere Teachers College scooped 18 gold medals, nine silver and four bronze to emerge overall winners, while hosts, Hillside held on to second spot position with nine gold medals, seven silver and four bronze.\nZTCOSA president, Andrew Moyo said they had to increase their competition dates to have ample time to select the best athletes for the ZTISU games happening between 24 and 27 June in Bulawayo.\n“We had a successful competition and we are happy that this time, our principal allowed us more days for athletes to effectively compete. We want to assemble a strong team which will represent us at the ZITISU games. We are also introducing beach soccer this time around.”",
            "time": "21:46",
            "date": "15 Apr 2025"
        },
        {
            "title": "Zvishavane Taekwondo athlete preparations raring to go",
            "href": "https://www.zbcnews.co.zw/zvishavane-taekwondo-athlete-preparations-raring-to-go/",
            "content": "Story by Courage Bushe\nA talented Taekwondo athlete from Zvishavane, Nathaniel Brown is confident of leaving an indelible mark at the Wuxi 2025 World Taekwondo Championships to be held in China in October this year.\nThe 19 year old Southern Africa big Championships 2023 gold medallist, Nathaniel Brown, is leaving no stone unturned in his quest to raise the country’s flag high at the Wuxi Taekwondo World Championships set for China in October.\nCompeting in the 80kgs category, the Zvishavane based athlete will take his preparations to Eswathini next month, where he will compete with regional athletes.\nBrown says he is looking forward to bringing home some gold medals.\n“We have been training hard for the past three months, and I am happy that everyone is raring to go. Next week, I’m leaving for Mozambique for a one week training with Master Itai before I go to Eswathini for a preparatory tournament next month. For the world Championships, I’m raring to go, and all I’m looking forward to is to come back home with some silverware,” he said.",
            "time": "21:46",
            "date": "15 Apr 2025"
        },
        {
            "title": "Tarryn Leigh de Souza tournament unearths new tennis talent",
            "href": "https://www.zbcnews.co.zw/tarryn-leigh-de-souza-tournament-unearths-new-tennis-talent/",
            "content": "Story by Mthokozisi Dube\nNOW in its 15th year, the annual Tarryn Leigh de Souza tournament held in honour of the late tennis star returned with a bang at two venues in Bulawayo this Monday.\nFrom the dust streets of Emakhandeni, Emakhandeni High School student, Courage Ndlovu bagged gold in the under-16 category of the tournament.\nThe rising star believes the win is a step in the right direction as he prepares to improve rankings in the upcoming ITF tournaments set for next month.\n“This is my third time featuring in this tournament. I have put enough preparations and I am happy I have won it before the ITF tournaments. I want to get better by each tournament and I am happy for myself,” winner, Courage Ndlovu said.\nMakanaka Hwata got it right after winning in the under 18 boys category in a tournament she lost in the semi-finals last year.\nRegina Zibowa triumphed in the girls under 18 category, while Minenhle Moyo was victorious in the under 16 category.\n“It is a good platform to shine. We had stiff competition but I am happy I have made it,” a winner said.\n“I started badly but had to bounce back. I am happy for the comeback and I look forward to the upcoming ITFs,” another winner said.",
            "time": "21:46",
            "date": "15 Apr 2025"
        },
        {
            "title": "Exciting premier league matches lined up for Easter holidays",
            "href": "https://www.zbcnews.co.zw/exciting-premier-league-matches-lined-up-for-easter-holidays/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHERE will be no Easter break in the Castle Lager Premier Soccer League this year as several matches are lined up this holiday.\n24 hours after the much anticipated Uhuru Cup clash between FC Platinum and Simba Bhora in Gokwe, attention shifts to Castle Lager Premier Soccer League action when Green Fuel hosts ZPC Kariba in a delicately poised encounter.\nThree matches are lined up for Sunday when Manica Diamonds host TelOne at Sakubva, while Triangle clashes with Yadah in the Lowveld and CAPS United Welcome Bikira Minerals at Rufaro.\nEaster Monday is packed with log leaders, MWOS set to play their first topflight match at their upgraded home ground, Ngoni Stadium in Norton.",
            "time": "21:46",
            "date": "15 Apr 2025"
        }
    ]
}