{
    "news": [
        {
            "title": "Justice Mutyoramwendo set for kickboxing debut in South Africa",
            "href": "https://www.zbcnews.co.zw/justice-mutyoramwendo-set-for-kickboxing-debut-in-south-africa/",
            "content": "Story by Farai Gwaze\nZIMBABWEAN karateka, Justice Mutyoramwendo, is hoping to fly the country’s flag high once more when he faces South Africa’s Frank Cato in the “Clash of the Warriors II” bout in South Africa this Saturday.\nThe promising martial artist is leaving no stone unturned in his preparations for the highly anticipated kickboxing debut.\nMutyoramwendo, who is under the guidance of decorated Mixed Martial Artist Lewis Mataya, is confident of a strong performance as he transitions from karate to kickboxing.",
            "time": "18:48",
            "date": "14 Jul 2025"
        },
        {
            "title": "JR Mawere Chess Tournament cements status as regional chess showcase",
            "href": "https://www.zbcnews.co.zw/jr-mawere-chess-tournament-cements-status-as-regional-chess-showcase/",
            "content": "Story by Mthokozisi Dube\nTHE annual JR Mawere Memorial Tournament returned better this time around, attracting international players over the weekend.\nZambian player Gillan Bwalya emerged victorious in the men’s open section, while Zimbabwean Tanaka Dzvinyai, who is currently pursuing her studies in Zambia, claimed top honours in the ladies’ category.\nTournament organiser, Mr Itai Madicha, noted that the fifth edition witnessed an impressive turnout, particularly from foreign players, signalling the tournament’s growing regional appeal.",
            "time": "18:48",
            "date": "14 Jul 2025"
        },
        {
            "title": "Simba Bhora soars to the top as the PSL title race heats up",
            "href": "https://www.zbcnews.co.zw/simba-bhora-soars-to-the-top-as-the-psl-title-race-heats-up/",
            "content": "Story by Mthokozisi Dube\nDEFENDING champions Simba Bhora delivered a statement of intent with a dramatic 3-2 comeback victory over Herentals in a pulsating Castle Lager Premier Soccer League encounter at Rufaro Stadium this Saturday.\nThe win propelled the Buju Boys to the summit of the league table, dislodging MWOS, who suffered a 1-0 defeat to Yadah at the Heart Stadium.\nWhile both sides are now tied on 40 points, Simba Bhora’s superior goal difference of 14, scoring 26 goals and conceding 12, gives them the edge at the top.\nThere was sweet revenge at Baobab Stadium where Scotland stunned hosts Ngezi Platinum with a spirited 2-1 comeback win, taking their points tally to 31 and moving them into fourth position.\nTheir final placement, however, remains subject to the outcome of their abandoned match against Chicken Inn.\nMeanwhile, Dynamos’ struggles continued, with the Glamour Boys falling 1-0 to TelOne at Ascot Stadium, compounding a disappointing campaign.\nFC Platinum edged Chicken Inn 1-0 at Mandava Stadium, tightening the competition in the top six.\nZPC Kariba and Manica Diamonds played out a goalless draw in a cagey affair.\nBikita Minerals handed Kwekwe United yet another blow in their fight against relegation, with a narrow 1-0 victory at Gibbo Stadium.\nMatch Day 20 action continues on Sunday with two critical fixtures:\nHighlanders host Greenfuel at Barbourfields Stadium in what is expected to be a tightly contested clash.\nCaps United welcome Triangle to Rufaro Stadium, hoping to bounce back from recent inconsistent performances.\nLog Standings Snapshot (Top 4)Simba Bhora – 40 pts (GD +14)",
            "time": "18:48",
            "date": "14 Jul 2025"
        },
        {
            "title": "Charamba impresses on Diamond League debut",
            "href": "https://www.zbcnews.co.zw/charamba-impresses-on-diamond-league-debut/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWEAN sprinter Makanakaishe Charamba made an impressive Diamond League debut following a third-place finish in the men’s 200m race at the Stade Louis-II in Monaco, France, this Friday.",
            "time": "18:48",
            "date": "14 Jul 2025"
        },
        {
            "title": "Black Rhinos’ Hove Claims Victory in Beitbridge Half Marathon",
            "href": "https://www.zbcnews.co.zw/black-rhinos-hove-claims-victory-in-beitbridge-half-marathon/",
            "content": "Story by Providence Maraneli\nTatenda Hove has emerged the winner of the Beitbridge Mayor’s Half Marathon, held along the Beitbridge–Masvingo highway.\nThe Black Rhinos athlete crossed the finish line in 1 hour, 2 minutes, and 55 seconds, narrowly beating Blanket Mine’s Mthokozisi Mhlanga, who came in at 1 hour and 3 minutes.",
            "time": "18:48",
            "date": "14 Jul 2025"
        }
    ]
}