{
    "news": [
        {
            "title": "Junior Sables, Chipu thriller to decide Barthes finale",
            "href": "https://www.zbcnews.co.zw/junior-sables-chipu-thriller-to-decide-barthes-finale/",
            "content": "Story by Raynald Ngwarati\nEPIC battles are expected this Sunday as the Zimbabwe, Namibia and Kenya Under 20 rugby national teams battle for supremacy in the Rugby Africa Barthes Cup at Old Hararians.\nThe showdown will gain some tempo this Sunday with a humdinger clash pitting the defending champions Kenya and last year’s runners-up Zimbabwe in battle of the titans to set up the finale.\nThe two teams have an identical record after playing two matches in the tournament, winning one and losing one, making Sunday’s tie a must-win battle for either team.\nZimbabwe’s Junior Sables will go into the tie full of confidence after beating Tunisia 78-20 on Wednesday to get back into the competition after a 41-22 defeat to Namibia in the opening match.",
            "time": "06:35",
            "date": "26 Apr 2025"
        },
        {
            "title": "ZIFA hails diaspora engagement success in UK under ‘Roots and Dreams’ initiative",
            "href": "https://www.zbcnews.co.zw/zifa-hails-diaspora-engagement-success-in-uk-under-roots-and-dreams-initiative/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nTHE Zimbabwe Football Association (ZIFA) has expressed satisfaction with its ongoing engagement efforts with the diaspora community, particularly in the United Kingdom, under the ambitious Roots and Dreams initiative.\nZIFA President Nqobile Magwizi, Warriors head coach Michael Nees, and Diaspora Engagement Committee Chairperson Marshall Gore have been in Birmingham and London, meeting stakeholders and sharing their vision for Zimbabwean football.\n“We have had a wonderful time meeting with various stakeholders, so let me clarify, we started the stakeholders’ engagements in Zimbabwe and we went round the country sharing our vision and also getting input, so this is the same thing we are doing. We have a very huge community in England and we have been speaking to them and they are very enthusiastic to help in one way or the other. Zimbabwe is for every Zimbabwean living anywhere and there are opportunities to administer, coach, manage play, referee every aspect of football so this is what we are here for,” Magwizi said.\nMagwizi also confirmed they had separate engagements with professional players with head coach Micheal Nees leading the process while Warriors captains Marvelous Nakamba and Marshal Munetsi were also involved.\n“That process was led by the coach, remember Nees has been here for some time watching players and speaking to those that he feels can be part of the system and he has already spoken to Shumirai Zion Mheuka and Tivonge Rushesha among others and this is the same thing that he was doing when he was in Zimbabwe, he would go around watching matches all over the country and the players that would have been identified will be called for the June camp in Morocco,” he said.\n17-year-old Mheuka plays for English Premier League side Chelsea while 22-year-old Rushesha who has represented Wales at the youth level players for League One side Reading.\nThe Zimbabwe Embassy in England also confirmed they stand ready to assist any player willing to represent the country to have documents.",
            "time": "06:35",
            "date": "26 Apr 2025"
        },
        {
            "title": "Platinum Royals seek to consolidate good start as they date Mambas",
            "href": "https://www.zbcnews.co.zw/platinum-royals-seek-to-consolidate-good-start-as-they-date-mambas/",
            "content": "Story by Courage Bushe\nPLATINUM Royals are aiming to continue with their good start to the Women Premier Soccer League when they lock horns with seasoned campaigners Black Mambas at Mandava Stadium this Sunday.\nAnother enthralling match of goal feasts and heart-stopping action is expected as Platinum Royals, who are in red hot form, welcome Black Mambas to Mandava Stadium this Sunday.\nPure Platinum Play who have managed to find the back of the net eight times and conceding none in two matches are eager to carry their form into the next fixture.\nSpeaking ahead of their epic encounter at home turf, Platinum Royals assistant coach Blessing Govati believes they have enough arsenal to chase glory.\n“We take every fixture as a cup final so getting down to business this weekend, we are all out to fight for maximum points. Our preparations have been going well and this time we are happy that everyone is ready, no injury worries in the squad except for a few juniors who are on national duty. We are hopeful of another clean sweep on Sunday. The girls are ready and raring to go.”",
            "time": "06:35",
            "date": "26 Apr 2025"
        },
        {
            "title": "Defending champions Simba clash with MWOS at Wadzanayi Stadium",
            "href": "https://www.zbcnews.co.zw/defending-champions-simba-clash-with-mwos-at-wadzanayi-stadium/",
            "content": "Story by Lawrence Trusida, Sports Editor\nDEFENDING Castle Lager Premier Soccer League champions, Simba Bhora are adopting the underdog tag ahead of their top-of-the-table encounter against high-riding MWOS at Wadzanayi Stadium this Saturday.\nNew boys MWOS are undefeated in seven outings, mastering five wins and two draws while the defending champions have quietly gone about their business after wholesome changes in the off-season.\nDespite the shake-up that saw more than 10 players leaving together with then head coach Tonderai Ndiraya, the Shamva-based club are second, three points behind Saturday’s opponents.\nWith all the noise being taken by MWOS, the defending champions are pleased to go into the match as underdogs.\n“Well it is what it is they have started the season strongly and they have been the talk of town together with Scottland and somewhat puts us as underdogs which is exactly a situation which suits us after the transition from last season and it takes pressure away from my boys allowing them to play freely,” Simba Bhora coach, Joel Luphahla said.\nSimba Bhora have made Wadzanayi Stadium a fortress, losing just once since the start of last season and head coach Joel Luphahla is hoping for a continuation of the same.\n“We have started well at home, the only blemish being FC Platinum where we drew barring that we have won all and we hope to keep the same, I have been telling my boys that the match is just like any other home match and we need to approach it the same way and remember that our supporters will be behind us,” Luphahla said.\nThe Shamva-based side has a clean bill of health, save for midfielder Liberty Chakoroma who has a long-term injury.\nPSL action, however, starts this Friday with Herentals hosting Green Fuel at Rufaro Stadium.",
            "time": "06:35",
            "date": "26 Apr 2025"
        },
        {
            "title": "Arsenal lacked ‘energy’ in Palace draw as Liverpool prepare to seal title",
            "href": "https://www.zbcnews.co.zw/arsenal-lacked-energy-in-palace-draw-as-liverpool-prepare-to-seal-title/",
            "content": "MIKEL Arteta admitted Arsenal have to get their “energy” back for the Champions League showdown with Paris Saint-Germain after a lacklustre 2-2 draw against Crystal Palace left Liverpool on the brink of winning the Premier League.\nArteta’s sidewere hopingto warm up for their first Champions League semi-final appearance since 2009 with a victory over Palace at the Emirates Stadium on Wednesday.\nBut Jakub Kiwior’s third-minute header for the Gunners was cancelled out by Eberechi Eze’s volley in the 27th minute.\nLeandro Trossard’s strike put Arsenal back in front three minutes before half-time, only for Palace substitute Jean-Philippe Mateta to loft a brilliant lob over out-of-position keeper David Raya in the 83rd minute.\nSecond-placed Arsenal are 12 points adrift of Liverpool, and with only four matches left for the north Londoners, Arne Slot’s team will seal the title if they avoid defeat against Tottenham at Anfield on Sunday.\nTheir title hopes effectively over several weeks ago, Arsenal were already focused on winning the Champions League for the first time.\nBut the sloppy display against Palace was hardly ideal preparation for the showdown with French champions PSG, who have eliminated Liverpool and Aston Villa en route to the last four.\n“We are disappointed with the result and performance. We didn’t find enoughconsistency in actionsto dominate the game,” Arteta said.\n“In many aspects, we should have done better. Palace were very organised and deserved credit but we dropped our standards.\n“We struggled to find consistency. We gave the ball away in simple ways and we were late in everything we did. We have to do much better.”\nAdding to Arteta’s concerns is an injury to Mikel Merino that gave the Spaniard out of the Palace game and could sideline him against PSG.",
            "time": "06:35",
            "date": "26 Apr 2025"
        }
    ]
}