{
    "news": [
        {
            "title": "BBA embraces FIBA’s ‘Girl-Child Drive’ in new term vision",
            "href": "https://www.zbcnews.co.zw/bba-embraces-fibas-girl-child-drive-in-new-term-vision/",
            "content": "Story by Mthokozisi Dube\nBULAWAYO -THE newly-elected Bulawayo Basketball Association (BBA), executive has pledged to grow the sport with emphasis on the girl child.\nTaking a cue from the International Basketball Federation (FIBA)’s stance of involving the girl child in sport through the ‘Her World Her Rules programme,’ the newly elected BBA executive is hoping to ride on the programme and ensure the active involvement of the girl child in the sport.\nRetained president Mthandazo Mono said the focus for the hybrid executive is to ensure the cross-pollination of ideas to grow the sport, with a bias towards the girl child.\n“I want to thank the basketball community for entrusting us to lead them. It is my second and last term according to the Constitution, but I want to leave a legacy were more girls take up the sport. Last year we had twelve officials who were certified to officiate in bigger tournaments after hosting an officials’ course. We now have a third-tier league with many female teams. We want to promote that as we see out our term,” Mono said.",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Sables storm into semis after commanding win over Morocco",
            "href": "https://www.zbcnews.co.zw/sables-storm-into-semis-after-commanding-win-over-morocco/",
            "content": "Story by Lawrence Trusida, Sports Editor\nUGANDA-THE national rugby team, the Sables, have made a strong start to the defence of their Africa Cup after thumping Morocco 43-8 in Uganda this Tuesday.",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "PSL embraces E-ticketing as part of modernisation drive",
            "href": "https://www.zbcnews.co.zw/psl-embraces-e-ticketing-as-part-of-modernisation-drive/",
            "content": "Story by Mthokozisi Dube\nTHE Castle Lager Premier Soccer League is moving with speed to embrace an e-ticketing system meant to counter inconvenience associated with the purchase of match day tickets on the day.\nFollowing a successful phase one pilot during a fully subscribed match between MWOS and Scotland at Ngoni Stadium recently, the PSL is now rolling out phase two, which includes online ticket sales and a digital payment system.\nRodwell Thabe, Acting Chief Executive Officer of the PSL, outlined the progression of the initiative.\n“The PSL recently embarked on an e-ticketing system that is meant to be convenient for our stakeholders to be able to access all our events. Currently, the e-ticketing system is in its pilot or test stage. We have said we cannot roll out the entire programme to the entire country at once. So we have started the test phase at Ngoni Stadium since the facility underwent a lot of renovations. With phase one which was the pre-sell of QR-coded tickets I am happy to announce that for the first time in Zim in many years, we had a sold-out match between MWOS and Scotland. The event went on successfully and right now we have rolled out phase two which integrates the online sell and online payment system to be able to purchase tickets from the comfort of their own homes by buying it on their phone or online,” he said.\nThe pilot is currently being tested at Ngoni Stadium, a venue selected due to its recent renovations, making it more compatible with information communication technology (ICT) standards required for e-ticketing.\nThabe noted that full national rollout would depend on the success of this testing phase, and expressed confidence in the system’s potential to transform how fans interact with local football.",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Minister Sanyatwe appoints new SRC Board to steer strategic transformation in sport",
            "href": "https://www.zbcnews.co.zw/minister-sanyatwe-appoints-new-src-board-to-steer-strategic-transformation-in-sport/",
            "content": "Story by Anashe Murombedzi\nTHE Minister of Sport, Recreation, Arts and Culture, Lieutenant General (Rtd) Anseleme Sanyatwe has appointed a new board for the Sports and Recreation Commission (SRC).\nThe eight-member board has been appointed for a four-year term running from this July to July 2029.\nThis strategic development signals the Ministry’s commitment to fostering inclusive, accountable, and visionary leadership within the sporting sector.\nThe Board is expected to provide robust oversight and strategic guidance to the SRC in line with national aspirations for sport and recreation.\nIt will be chaired by Dr Nathaniel Madzivanyika, a seasoned professional with an extensive background in sports administration and governance.\nHe will be supported by a team of distinguished individuals with diverse expertise in sports management, law, finance, youth development, and infrastructure.",
            "time": "18:36",
            "date": "08 Jul 2025"
        },
        {
            "title": "Chevrons collapse, follow on after Mulder triple century",
            "href": "https://www.zbcnews.co.zw/chevrons-collapse-follow-on-after-mulder-triple-century/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE have it all to do in the second test after collapsing on the second day and being forced to follow-on at Queens Sports Club in Bulawayo this Monday.\nFollowing a defeat in the first encounter, the Chevrons were looking for a series leveling victory in the second Test, but with the direction they are heading  it looks a difficult task.\nZimbabwe were bowled out for 170 in their first innings and were forced to follow on, 456 runs behind, after Wiaan Mulder unbeaten on 367, declared South Africa’s first innings during the lunch interval on 626/5.\nAt the close of play, Zimbabwe were 51 for 1 in their Second Innings, trailing by 405 runs.\nMulder, captaining South Africa for the first time, was only 33 runs short of Brian Lara’s world Test record of 400 not out when he declared.",
            "time": "18:36",
            "date": "08 Jul 2025"
        }
    ]
}