{
    "news": [
        {
            "title": "Zim’s golf prodigy Keegan Shutt proves his prowess in the US",
            "href": "https://www.zbcnews.co.zw/zims-golf-prodigy-keegan-shutt-proves-his-prowess-in-the-us/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE golf prodigy Keegan Shutt underlined his status as one of the brightest golf prospects on the continent after a fourth-place finish at the prestigious Junior Orange Bowl International Championship in Florida, United States on Monday.\nShutt was tied for fourth on the leader board alongside Swiss Joshua Hess and American Joey Laciofano after four rounds of action at the Biltmore Golf Club in Coral Gables.\nThe Royal Harare golfer was five shots behind winner Lorenzo Rodriguez from USA who had an overall seven under par 277.",
            "time": "18:36",
            "date": "08 Jan 2025"
        },
        {
            "title": "Government to set up sports fund",
            "href": "https://www.zbcnews.co.zw/government-to-set-up-sports-fund/",
            "content": "Story by Lawrence Trusida, Sports Editor\nGovernment is on course to setting up a sports fund to support Zimbabwean athletes at international competitions.\nZimbabwean athletes have in some cases struggled to fulfill international commitments due to lack of funding.\nIn most cases, they have been restricted to just attending regional events which sometimes do not offer the best competition.\nThis is, however, set to change with government working on creating a sports fund to support athletes on international assignments.\nPermanent Secretary in the Ministry of Sport, Recreation, Arts and Culture Nicholas Moyo said, “We need to create a sustainable sports fund for mobility purposes. Our athletes need to be exposed to international competitions from young ones to the most senior athletes. They should be able to attend, meet, and compete with the best and prepare for major tournaments. So that one area we are working on this year is a sustainable sports fund to support athletes all year round and in their development processes.”\nGovernment in partnership with National Sport Associations is also embarking on an extensive talent identification programme.",
            "time": "18:36",
            "date": "08 Jan 2025"
        },
        {
            "title": "West Ham weighing up whether to sack Lopetegui",
            "href": "https://www.zbcnews.co.zw/west-ham-weighing-up-whether-to-sack-lopetegui/",
            "content": "\nWest Ham are considering whether to sack Julen Lopetegui and have held talks with Graham Potter about possibly replacing the Spaniard.\nHammers sources have denied Lopetegui has already been dismissed but accept the former Real Madrid and Spain coach is under huge pressure.\nLopetegui, 58, was on the brink of being sacked prior to last month’s home game with Wolves. But victory in that match triggered a four-game unbeaten run, West Ham’s best of the season.\nHowever, a humiliating 5-0 home defeat by Liverpool was followed by a 4-1 loss at Manchester City to leave West Ham 14th in the table, seven points above the relegation zone.\nWest Ham’s technical director Tim Steidten has been pictured talking to former Chelsea and Brighton boss Potter, who has previously been linked with the Hammers job.\nThe photograph has been circulated on social media. Sources have said it is a recent picture but this has not been independently verified.\nLopetegui was brought to West Ham in the summer to succeed David Moyes, who left at the end of his contract. However, the former Wolves boss has not been able to improve either the team’s performance or style, for which Moyes was heavily criticised.\nFormer Ostersund and Swansea boss Potter has not held a managerial role since he was sacked after less than seven months in charge of Chelsea in April 2023.\nPotter, who had been linked with succeeding Sir Gareth Southgate as England boss, said he was “ready” to return to club management in September.",
            "time": "18:36",
            "date": "08 Jan 2025"
        },
        {
            "title": "Murasiranwa launches soccer tournament in Chihota",
            "href": "https://www.zbcnews.co.zw/murasiranwa-launches-soccer-tournament-in-chihota/",
            "content": "Murasiranwa launches soccer tournament in Chihota\nStory by Jerold Sasa\nCANADA-based professional footballer Darlington Murasiranwa has launched a soccer tournament in his home area of Chihota in Marondera as part of giving back to the community which raised him.\nThe 23-year-old who turns out for Canadian Premier League side Valour FC and is on an off-season break.\nThe tournament, which also featured netball teams, saw four districts competing – Chitangazuva, Bumburwi, Marondera and Chizengeni.\nThe Valour FC first first-choice goalkeeper is keen on developing talents in his rural area.\n“Zimbabwe will always be my home and that is why I had to come and sponsor this tournament so that we develop football at the grassroots level,” he said.",
            "time": "18:36",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zimbabwe lose inaugural New Year’s test",
            "href": "https://www.zbcnews.co.zw/zimbabwe-lose-inaugural-new-years-test/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nAFGHANISTAN took only 10 minutes to wrap up victory by 72 runs on the final day of the inaugural New Year’s test against Zimbabwe at the Queens Sports Club this Monday.\nIt took just 15 deliveries on the final day for the visitors to take the last two wickets and wrap up the match, winning by 72 runs, thereby clinching the series one-nil.\nZimbabwe were dismissed for 205, failing to add to their overnight score and lost the remaining two wickets in just over 10 minutes.\nRichard Ngarava was run out in the second over of the day, while Captain Craig Ervine, who had been resolute was trapped leg before wicket by Rashid Khan the following over.\nAfghanistan came from behind to pull off a heist in Bulawayo to win their first-ever Test series against the Chevrons.\nHaving conceded a first-innings lead of 86 runs, things looked a bit tough for Afghanistan as they had a massive challenge to first overhaul the deficit and then set a target for Zimbabwe.\nRahmat Shah and debutant Ismat Alam’s centuries did the job for the visitors with the bat in the second innings before Rashid Khan worked his magic with the ball.\nRashid Khan registered his second seven-wicket haul after claiming 7 for 66 which was not only Rashid’s career-best figures but also the best bowling figures for Afghanistan.\nThe Chevrons once again faltered with history in sight and rather gave the visitors records, with the trend slowly becoming the norm for the national cricket team.\nThe 72-run victory is Afghanistan’s first Test win since 2021, their fourth overall Test win since they got the Test status in 2018.",
            "time": "18:36",
            "date": "08 Jan 2025"
        }
    ]
}