{
    "news": [
        {
            "title": "Warriors set sights on Nigeria after Benin stalemate",
            "href": "https://www.zbcnews.co.zw/warriors-set-sights-on-nigeria-after-benin-stalemate/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe senior men’s football team, the Warriors, are hoping to carry their second-half fine performance to their next assignment after a frustrating two-all share of spoils with Benin in South Africa this Thursday.\nThe odds were against the Warriors heading into the block buster encounter against Benin, as they were facing a side oozing with confidence in the World Cup qualifiers.\nIt was no fluke that Benin meant business as they managed to secure two early goals which unsettled the Warriors.\nThe Warriors managed to redeem themselves in the second half, but overturning the first-half deficit remained a pipe dream as they settled for a share of spoils.\nReturning former skipper Knowledge Musona justified his inclusion as he was on target to ensure the Warriors secured a point.\nDespite dropping two vital points to bring back their World Cup qualification hopes, Warriors head coach Michael Nees is refusing to throw in the towel, rallying his charges for the next match away to Nigeria on Tuesday.\n“We had a lot of thoughts and emotions on today’s game. I really would want to thank our fans for the carnival atmosphere, very good crowd. We could not have come back if we had no crowd. We really appreciate. Of course we wanted a better result but the opponent was strong. We did not start well but we had a better second half. We wanted to win, we tried everything and hopefully we will build on this in our next game,” Nees said.",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Manicaland and Harare dominate at NAPH games",
            "href": "https://www.zbcnews.co.zw/manicaland-and-harare-dominate-at-naph-games/",
            "content": "Story by Mhlomuli Ncube\nMANICALAND and Harare dominated proceedings at this year’s National Association of Primary Heads (NAPH) games, with the two provinces sharing spoils on the medals table as the contest ended this Thursday.\nManicaland and Harare provinces amassed a total 38 medals a piece.\nIn second place was Mashonaland West which harvested a total of 37 medals with 12 gold, 12 silver and 13 bronze, while Midlands came third with a total of 36 medals.\nMasvingo will, however, be the most disappointed province after failing to get a single medal.\nIt was a moment of reflection as the NAPH basked in the glory of a successful sporting festival held at the Hwange Colliery Stadium.\n“The organisation at this year’s edition was top-notch. There was order and stakeholders worked together in harmony,” NAPH National vice president, George Nkonde said.\n“As the host province, we are extremely happy. We worked well and even got support from our local Colliery Company,” Host Province Chairperson, Nkosinathi Moyo said.\nIt was also another historic moment when Chess made its debut in the games for the first time.",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Munetsi and Musona lead Warriors to hard-fought draw",
            "href": "https://www.zbcnews.co.zw/munetsi-and-musona-lead-warriors-to-hard-fought-draw/",
            "content": "Story by Mthokozisi Dube\nThe Zimbabwean Warriors staged a resilient comeback to secure a 2-2 draw against Benin in their Group C World Cup Qualifier in Durban, South Africa, this Thursday evening.\nDespite a shaky start that saw the Warriors concede two early goals, captain Marshall Munetsi and former skipper Knowledge Musona led the charge, with Munetsi scoring just before halftime and Musona equalising just before the hour mark.",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Kirsty Coventry elected IOC president",
            "href": "https://www.zbcnews.co.zw/kirsty-coventry-elected-ioc-president/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nZIMBABWEAN swimming legend Kirsty Coventry was elected as the new President of the International Olympic Committee (IOC) ) at the 144th IOC Session held in Costa, Greece this Thursday.\nCoventry, who is the Minister of Sports, Recreation, Arts and Culture, becomes the 10th President of the International Olympic Committee and also breaks new ground becoming the first woman and African to ever be elected to the influential position.\nThe seven-time Olympian, who is no stranger to records, will also be the youngest ever to assume the role.\nCoventry, who is Africa’s most decorated Olympian, came through a field of seven contenders in the seaside resort of Costa Navarino in Greece to land one of the most powerful jobs in world sport.",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Lady Sables training squad for Rugby Africa Division One Tournament announced",
            "href": "https://www.zbcnews.co.zw/lady-sables-training-squad-for-rugby-africa-division-one-tournament-announced/",
            "content": "Story by Vivian Bangamu\nAS preparations intensify for the Rugby Africa Division One Women’s Tournament, the newly appointed Zimbabwe Senior Women’s Rugby Head Coach, Nsikelelo “Sykes” Sibanda, has announced an extended training squad and technical team, ahead of the competition, set to take place in Ivory Coast from April 9 to April 20.\nSibanda who is working with limited time and resources, has emphasised the urgency of making every training session count.\n“We have very little time and resources to pull off an upset in this upcoming tournament, and the whole squad is taking every training opportunity and second on the field very seriously,” he said.\nLady Sables’ provisional squad includes a mix of seasoned players and eight Under-20 players, with four of them from Zimbiru Titans, who earned a call-up, the likes of Tariro Chinyengetere from Raiders, Mutsawashe Mwanyisa of Spartans, Mabel Murungweni and Natalia Nyabinde of Zimbiru Titans and Sisasenkosi Moyo of Highlanders are some of the new member of the training squad.\nThe Under-20 players are currently part of the Harare, Manicaland and Matabeleland Provincial Rugby Leagues, showcasing the depth of young talent available for selection.\n“This huge provisional squad includes Under-20 players who just came from the Provincial Tournaments going on and are raising their hands to play. But we will need anything close to a miracle to reach the standard we want in such a short period,” Sibanda said.\nBefore heading to Ivory Coast, the Lady Sables will have their last competitive test in the highly anticipated Nedbank Challenge Cup from March 29 to April 5, with the final squad selection expected soon after.",
            "time": "08:39",
            "date": "22 Mar 2025"
        }
    ]
}