{
    "news": [
        {
            "title": "Mighty Warriors gear up for crunch tie against Angola",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-gear-up-for-crunch-tie-against-angola/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nThe Zimbabwe senior women’s football team, the Mighty Warriors are set to face hosts Angola in the first leg of the 2026 CAF Women’s Africa Cup of Nations Qualifier this Thursday.\nThe team has been fine-tuning their skills having held a two-day training session in the Angolan capital, Luanda.\nThe Mighty Warriors will be looking to get past the hosts they have had difficulties overcoming after so many close battles.\nIn a rallying cry to the nation, Australia-based Mighty Warriors striker Yolanda Kanyai has rallied fans to come out in numbers and support the team as they take on Angola.",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Mighty Warriors begin training ahead of Angola clash",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-begin-training-ahead-of-angola-clash/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nThe Zimbabwe senior women’s football team, the Mighty Warriors, who are now in Angola, ahead of their Thursday CAF Women’s Africa Cup of Nations 2026 Qualifier against the hosts, began their two-day training this Tuesday.\nThe team, which departed Harare this Monday, began their two-day training session in the Angolan capital this Tuesday, fine-tuning their skills and strategies ahead of the crucial encounter set for Thursday.\nThe squad has been bolstered by the arrival of Australia-based forward Yolanda Kanyai, Israeli-based and Mighty Warriors captain Emmaculate Msipa and midfielder Danai Bhobho.\nA win against Angola on Thursday at the Estadio Joaquim Dinis will see the Mighty Warriors advance to the second round of the qualifiers, where they will face the winner between Malawi and Congo.",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Triangle United gear up for 2025 PSL season",
            "href": "https://www.zbcnews.co.zw/triangle-united-gear-up-for-2025-psl-season/",
            "content": "Story by Gay Matambo\nPremier Soccer League returnees Triangle United are not leaving anything to chance in preparation for the 2025 season after acquiring the services of 12 new players.\nWith two weeks left before the Premier Soccer League commences, the Sugar Sugar Boys are busy fine-tuning their squad and infrastructure to gain a competitive edge in the upcoming season.\nThe club retained 18 players from the team that took them to the topflight league and acquired 12 new players to beef up the squad.\nTriangle United Football Club chairman Mr Weston Jemwa said, “We have retained the services of our technical team being led by Luke Masomere. He will be our head coach for this season. We have also retained 18 players from our previous team that took us into the premier league, and we are busy beefing up with 12 players from other teams. We are doing friendly matches with several teams, and so far, we have played in Beitbridge where we managed to score 5 goals and won the two matches.\n“We also had practice matches vs Green Fuel and Manica Diamonds, and we won both matches. We are not excited about winning, but we are excited that we are scoring goals. Match day 1, we are facing Scottland and that’s the game of the week. With respect to Gibbo, renovations are underway to meet the required standards. We are looking at dressing rooms, ablution blocks, and bucket seats so that we meet the required standards. We should be able to play home games at Gibbo this coming season.”",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "U17 Champions League tourney launched",
            "href": "https://www.zbcnews.co.zw/u17-champions-league-tourney-launched/",
            "content": "U17 Champions League tourney launched to support grassroots football\nStory by Raynald Ngwarati\nThe country’s grassroots football has received a massive boost after a new tournament, the Gloria Under 17 Champions League, was launched at Greendale Sports Club.\nAs the country eyes rebuilding its junior football structures, the efforts have received a shot in the arm after some corporates jumped on board to play their part in the development of the country’s future football starlets.\nNational Foods in conjunction with other partners unveiled a crucial partnership at the weekend, tailored to developing grassroots football through the launch of the Gloria Under 17 Champions League.\nWith the league set to roar into life early next month, the landmark development caught the attention of the Zimbabwe Football Association who were represented by the technical director, Jethro Hunidzarira and national men’s senior team coach, Michael Nees, who were all excited at the prospect of nurturing talent from the grassroots.\nThe stakeholders involved promised exciting times for the country’s football.\n“So we thought that it was important for us to make sure that we take them all from the streets, and you give them a platform where they can develop their talent and spend more time playing football than going around or associating with guys that obviously are doing drugs,” said Gloria U17 Champions League chairman, Gift Mabvudza.",
            "time": "21:26",
            "date": "19 Feb 2025"
        },
        {
            "title": "Warriors on the rise as Chirewa, Antonio and Munetsi make waves in Europe",
            "href": "https://www.zbcnews.co.zw/warriors-on-the-rise-as-chirewa-antonio-and-munetsi-make-waves-in-europe/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nWarriors midfielder Tawanda Chirewa’s scintillating form continued at the weekend after the Zimbabwean winger picked up his second successive Man of the Match award for Huddersfield Town in the English League One.\nChirewa’s impressive display, which included a dominant performance in the 2-1 win over Barnsley, set the tone for a thrilling weekend of action from Zimbabwe’s national team players.\nHe’s not alone as other Warriors have been making waves in their respective overseas clubs, showcasing their skills and talent on the biggest stage.\nBill Antonio also made a significant impact for KV Mechelen in the Belgian Pro League, registering his first assist of the season in a 1-0 win over Royale Union Saint-Gilloise.\nAntonio started and played for 64 minutes, recording two chances, including a spectacular volley that the keeper denied.",
            "time": "21:26",
            "date": "19 Feb 2025"
        }
    ]
}