{
    "news": [
        {
            "title": "Harare Sports Club off to a winning start in Nedbank Challenge Cup",
            "href": "https://www.zbcnews.co.zw/harare-sports-club-off-to-a-winning-start-in-nedbank-challenge-cup/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nREIGNING champions Harare Sports Club began their title defense on a positive note, defeating the Nedbank HPC Grassroots to Greatness side 25-13 in the Nedbank Challenge Cup at the Harare Sports Club this Saturday.\nHarare Sports Club showcased their experience and composure, controlling the tempo of the game and limiting the opposition’s scoring opportunities.\nDespite the Nedbank HPC squad’s valiant efforts, Harare Sports Club’s superior skill and strategy ultimately paid off, securing a convincing 25-13 victory.\nThe win sets the tone for Harare Sports Club’s title defense, as they aim to replicate their success from previous seasons.\nThe day’s action was filled with thrilling matches, including a major upset, where the Nedbank Junior Sables stunned multiple-time national champions Old Georgians 33-22.\nIn another match exciting match Pitbulls overpowered Manicaland Province 36-7 while Old Hararians flexed their muscles with a 31-8 win over Matabeleland Province.",
            "time": "08:44",
            "date": "31 Mar 2025"
        },
        {
            "title": "Ngezi Platinum maintains winning streak, tops league standings",
            "href": "https://www.zbcnews.co.zw/ngezi-platinum-maintains-winning-streak-tops-league-standings/",
            "content": "Story by Anashe Murombedzi\nFORMER champions Ngezi Platinum Stars have extended their winning streak, defeating Triangle United 1-0 at Baobab Stadium this Saturday to solidify their position at the top of the Castle Lager Premier Soccer League standings.\nFarai Madhanhanga’s 73rd-minute strike proved to be the decisive goal, propelling Ngezi Platinum to 10 points from four matches.\nNgezi Platinum now holds a two-point advantage over second-placed MWOS, having maintained their winning momentum after beating Scottland 1-0 in their previous encounter.\nAnother match between Herentals and Manica Diamonds ended in a 1-all stalemate at Rufaro Stadium.\n“A very good game, though we took the lead and we lost that lead. I am impressed because the performance was top-notch. We will work on capitalising our chances going to the next match because we have been wasting chances that made us concede,” Herentals coach Paul Benza said.\nManica Diamonds’ coach Tafadzwa Mashiri acknowledged that his team’s failure to capitalize on scoring chances cost them the win.\n“We need to work on not conceding and then ride on the chances that we are getting,” Mashiri said.\nOther notable results saw TelOne edge out CAPS United 1-0, courtesy of Washington Navaya’s 52nd-minute goal.",
            "time": "08:44",
            "date": "31 Mar 2025"
        },
        {
            "title": "Golf tourney on the cards to boost mental health awareness",
            "href": "https://www.zbcnews.co.zw/golf-tourney-on-the-cards-to-boost-mental-health-awareness/",
            "content": "Story by Raynald Ngwarati\nTHE National Employment Council for Funeral Industry (NECFI) has incorporated the sport of golf in its quest to raise awareness on dealing with mental health concerns.\nEyeing to reduce the casualties of mental health issues like suicides and substance abuse, NECFI has resorted to golf to raise finances to establish mental health and wellness facilities.\nThe statutory body has set in motion a roadmap to curb the effects of mental health issues among funeral service providers and the country at large, with golf set to play an integral role in the achievement of such.\nThe golf tournament is expected to attract at least 25 teams from across the country to participate under the better ball stable format.",
            "time": "08:44",
            "date": "31 Mar 2025"
        },
        {
            "title": "Kabondo eyes three-peat at Mr Pace Post Insurance marathon",
            "href": "https://www.zbcnews.co.zw/kabondo-eyes-three-peat-at-mr-pace-post-insurance-marathon/",
            "content": "Story by Raynald Ngwarati\nLONG-distance athlete Wayne Kabondo has set his sights on retaining the Mr Pace Post Insurance half marathon title when this year’s edition takes centre stage at the National Sports Stadium B Arena on May 10.\nAfter reigning supreme in the previous two editions of the half marathon, Kabondo and the reigning women’s champion, Fortune Chidzivo, will go back in the hunt in about a month to conquer on a familiar track.\nWith the event scheduled for early May, 26-year-old Kabondo has outlined his ambitions having put in the work behind the scenes to dominate the circuit and better his times ahead of international events.\nKabondo will be eyeing not only a three-peat of the half marathon in as many years but also to capitalise on the recent certification of the race to grade the World Championships and the African Championships.\n“Last time I was the defending champion and this year again I am the defending champion. So, I am not only targeting to win the race but also to improve my times for international events. I would like to thank all the sponsors and the organisers of this tournament.\n“It is a bigger tournament now that it is under World Athletics and we have a chance to improve our times, and run faster so that we can qualify for the Olympics the World Championships and other races in Europe and other countries,” he said.\nMeanwhile, the marathon’s principal sponsors are thrilled with the growth of the marathon after receiving recognition from World Athletics ahead of the fourth edition.",
            "time": "08:44",
            "date": "31 Mar 2025"
        },
        {
            "title": "Vic Falls urged to leverage tourism heritage for sports and cultural growth",
            "href": "https://www.zbcnews.co.zw/vic-falls-urged-to-leverage-tourism-heritage-for-sports-and-cultural-growth/",
            "content": "Story by Mhlomuli Ncube\nTHE Parliamentary Portfolio Committee on Sports, Recreation, Arts, and Culture visited Victoria Falls on a fact-finding mission to assess the city’s cultural and sporting facilities.\nDuring the visit, the committee was informed about the challenges faced by the city in securing land for development, which has been hindering progress in sports, recreation, arts, and culture projects.\n“We are constrained by land due to several factors and this is a challenge to us considering boundaries set and the need to balance the preservation of Victoria Falls as a tourism and nature habitat,” Victoria Falls Housing and Community Services Director, Mr Brian Nyamande stated.",
            "time": "08:44",
            "date": "31 Mar 2025"
        }
    ]
}