{
    "news": [
        {
            "title": "Falcon, ZDF Queens dominate as PNL season kicks off",
            "href": "https://www.zbcnews.co.zw/falcon-zdf-queens-dominate-as-pnl-season-kicks-off/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe Premier Netball League (PNL) roared into action this weekend with thrilling encounters across different cities, marking the official start of the 2025 season.\nAt White City Stadium, the much-anticipated battle of the uniformed forces saw Falcon emerge victorious, overpowering Imbizo 42-31 before crushing Rhinos 61-30.\nImbizo salvaged some pride with a commanding 56-30 win over Tongogara, while Rhinos secured a 53-23 triumph over the same opponents\nIn Mutare, ZDF Queens player Thandekile Mahlangu was named player of the bubble after leading ZDF Queens to a goal harvest, which saw them thrash Mutasa Queens 117-10.\nThe Queens also ran amok beating Bikita Minerals 81-21 before winding their fairytale campaign with a 106-10 victory over Buffaloes.\nIn the capital, Platinum Stars Spiwe Dlamini was named the best player of the bubble despite her team failing to win.\nPlatinum stars got a 69-21 thorough hiding from Harare City before coming close to the contest against HD.\nPlatinum Stars lost 48-44 to HD.",
            "time": "20:39",
            "date": "23 Mar 2025"
        },
        {
            "title": "Zim Saints eye topflight return",
            "href": "https://www.zbcnews.co.zw/zim-saints-eye-topflight-return/",
            "content": "Story by Mthokozisi Dube\nZIMBABWE Saints Football Club is not looking back after finishing fourth in the Southern Region Division One League, with Chauya Chikwata targeting a return to the topflight after warring factions smoked a peace pipe.\nWhen the late Zex Manatsa featured Zimbabwe Saints in one of his football songs, it was a true testament that the oldest club belonged to the class of yesteryear football greats.\nChikwata, a club which used to give big guns a good run for their money, has had a difficult past with warring factions fighting for ownership and control of the club, something which has seen the club failing to sustain its stay in the top flight, with court cases being the order of the day.\nLast year, the club had a promising performance, finishing fourth in the Southern Region Division One League.\nA new order is now in place after the elevation of Tawanda Ruzive into the hot seat.\nRuzive, who is no stranger in football after leading the now-defunct Quelaton into the Premier League, says the focus is on bringing back glory days to a club which was ardently supported by his late father.\n“Zim Saints, Chauya Chikwata, I think the excitement is there now. We played well last season, and we ended up number four under very difficult circumstances, but we are not looking back,” he said.\n“I have the support of our two warring factions. We have decided to take lessons from last year’s campaign. Zimbabwe Saints is not a new club it is an old club. We just need to go for the Premiership now and have concluded the signing of our players.”\nThe club which boasts of vast infrastructure across the city has court investors from the diaspora to construct a Zimbabwe Saints Village at their clubhouse in Queens Park, Bulawayo, a project expected to generate revenue for the club.\n“We have come up with a plan to utilise our 14 hectares of land to construct a Saints Village which will be used while also accommodating visiting teams. We need a Zimbabwe Saints that generates revenue,” Ruzive said.",
            "time": "20:39",
            "date": "23 Mar 2025"
        },
        {
            "title": "Zim Footgolf Association trains officials to expand new sport nationwide",
            "href": "https://www.zbcnews.co.zw/zim-footgolf-association-trains-officials-to-expand-new-sport-nationwide/",
            "content": "Story by Mthokozisi Dube\nTHE Footgolf Association of Zimbabwe (FAZ) is making significant strides in raising awareness and fostering growth of the sport across the nation.\nThis Saturday, the association hosted a successful officiating and management clinic in Bulawayo, aimed at equipping officials with the necessary skills to further develop the emerging sport.\nFollowing the introduction of Footgolf in Zimbabwe, the association has been committed to ensuring proper training for officials and promoting an understanding of the sport’s rules and management.\nThe recent clinic marked another step in their mission to establish Footgolf as a mainstream sport in Zimbabwe as the sport found takers within the Nationals Association of Primary and Secondary Heads (NAPH and NASH), with participants optimistic of better days ahead for the sport.\n“After the introduction of the sport, we have seen a huge interest among our learners and we hope with the continuous development we can make inroads in developing the sport,” a participant said.\n“The sport has been widely received in the Midlands and capacitating officials will see the sport cascade and become a dominant sport,” another participant added.",
            "time": "20:39",
            "date": "23 Mar 2025"
        },
        {
            "title": "Warriors touch down in Lagos ahead of Nigeria clash",
            "href": "https://www.zbcnews.co.zw/warriors-touch-down-in-lagos-ahead-of-nigeria-clash/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe senior men’s football team, the Warriors, are in transit to Nigeria’s Uyo State for their away World Cup qualifying tie where they lock horns with the Super Eagles of Nigeria on Tuesday.",
            "time": "20:39",
            "date": "23 Mar 2025"
        },
        {
            "title": "NAAZ targets improved performance at Region Five youth games",
            "href": "https://www.zbcnews.co.zw/naaz-targets-improved-performance-at-region-five-youth-games/",
            "content": "Story by Mthokozisi Dube\nTHE National Athletics Association of Zimbabwe (NAAZ) is targeting improved performance at the African Union Sports Council (AUSC) Region Five Youth Games after holding a tournament to select athletes to represent team Zimbabwe in Namibia next month.\nWhite City was the venue for this year‘s NAAZ open field and track championships, an event used to select athletes for the Region Five Youth Games penciled for Namibia next month.\nAthletics coach, Manuel Mpofu believes staging more of these competitions will help athletes improve their qualification times for improved performance on the international stage.\n”As NAAZ we want to improve from our performance in Malawi in the last edition of Region Five, so we have decided to have preparatory competitions for our athletes to improve their times hence we have organised an event which has attracted clubs across the country,” he said.\nThe Bulawayo Athletics Board(BAB) is using the same competition to select athletes for inter-provincial championships set for June in the city.\n“As BAB we are happy to have hosted the NAAZ open championships. We have an action-packed calendar but we are using this competition to select our team for the inter-provincial which we will host here at White City,” BAB chairperson, Watson Madenyika said.",
            "time": "20:39",
            "date": "23 Mar 2025"
        }
    ]
}