{
    "news": [
        {
            "title": "PSL resumes as Highlanders clash with champions Simba Bhora",
            "href": "https://www.zbcnews.co.zw/41905-2/",
            "content": "Story by Mthokozisi Dube\nBULAWAYO – CASTLE Lager Premier Soccer League (PSL) action returns this weekend following the international break, with the spotlight firmly on the blockbuster encounter between Highlanders and defending champions Simba Bhora at Barbourfields Stadium this Sunday.\nThe much-anticipated clash carries emotional and professional significance for Simba Bhora head coach, Joel “Dubai” Luphahla, a former Highlanders player and coach, who is set to face his former paymasters on familiar turf.\nLuphahla, who began carving his coaching credentials away from home, was initially brought back into the Highlanders technical team by then-coach Mandla Mpofu to assist with the club’s attacking department.\nHowever, the union was short-lived, with the appointment of Portuguese gaffer Baltemar Brito reshuffling the technical bench.\nThough retained briefly as part of Brito’s backroom staff, Luphahla eventually exited Highlanders when Zambian expatriate Kelvin Kaindu took over the reins.\nHe later joined Dynamos as an assistant before being snapped up by the Shamva-based outfit Simba Bhora, where he was appointed head coach ahead of the 2024 season.\nDespite a slow start to life in the topflight, Luphahla has since stabilised the team, placing them among this season’s title contenders.\nHis return to Bulawayo has already set tongues wagging, as many see the fixture as an emotional reunion and a proving ground.\n“This is a coach with Highlanders blood in his veins, and this match is not just about three points it is about legacy and pride,” a local fan said.",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "ZIFA launches “Go Warriors Fans” initiative ahead of 2025 AFCON",
            "href": "https://www.zbcnews.co.zw/zifa-launches-go-warriors-fans-initiative-ahead-of-2025-afcon/",
            "content": "Story by Farai Gwaze\nHARARE-THE Zimbabwe Football Association (ZIFA) has launched an ambitious fan mobilisation initiative under the banner Go Warriors Fans, aimed at rallying nationwide support for the senior men’s football team, the Warriors, ahead of the 2025 Africa Cup of Nations (AFCON) tournament to be hosted in Morocco this December.\nThe initiative was officially unveiled on Tuesday in Harare by ZIFA president Mr Nqobile Magwizi during a public viewing event of Zimbabwe’s COSAFA Cup encounter against Mozambique.\nSpeaking at the launch, Mr Magwizi called on all Zimbabweans to stand behind the Warriors and take advantage of the platform to travel to Morocco as the team seeks to make history by progressing beyond the group stages for the first time.\n“We need as many Zimbabweans as possible in Morocco to support the Warriors. The 12th man plays a key role in our success. It is about unity and pride in our national identity. Rather than waiting until December, we are urging people to begin making arrangements now. The platform we have created as an association will assist those who wish to travel and witness Zimbabwe’s performance on the continental stage. I believe the Warriors are poised for a remarkable showing,” he said.\nZIFA also revealed that the initiative would not only focus on international travel but would extend domestically to ensure that support for the Warriors is inclusive and widespread.\nThe association plans to establish fan parks in rural communities, allowing fans from across the country to engage with the tournament in real time.\nZIFA General Secretary Mrs Yvonne Mapika Manwa emphasised the importance of grassroots involvement in building a robust support base.\n“One of the things we have prioritised is the creation of rural fan bases. Communities in rural areas form a significant part of our national support structure. It is imperative that they too have access to the AFCON experience through designated fan parks,” she said.\nVice Chairperson of the AFCON Committee, Ms Ruvheneko Parirenyatwa, highlighted the need for inclusivity and community engagement in the sport.",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Warriors fall short of COSAFA Cup semis despite 3-1 win",
            "href": "https://www.zbcnews.co.zw/warriors-fall-short-of-cosafa-cup-semis-despite-3-1-win/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHANDOLWENKOSI NGWENYA’S brace was not enough to send the Warriors to the semi-finals of the COSAFA Cup after the team finishing second in Group A behind South Africa on goal difference.\nZimbabwe thumped neighbours Mozambique 3-1 at the Toyota Stadium in South Africa this Tuesday afternoon to secure their first win of the tournament with FC Platinum striker, Thandolwenkosi Ngwenya scoring twice.",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Bulawayo pool set for revival as sponsorship returns",
            "href": "https://www.zbcnews.co.zw/bulawayo-pool-set-for-revival-as-sponsorship-returns/",
            "content": "Story by Mthokozisi Dube\nBULAWAYO – THE sport of pool is experiencing a resurgence in Bulawayo, following renewed sponsorship that is set to energise the local competitive scene.\nStaging monthly pool tournaments has long been the immediate target for the Bulawayo Pool Association, but lack of resources has left the local association to rely on the annual Queens tournament and the Carling Black Label.\nThis has seen pool players enduring a long layoff which has in turn affected their competition levels.\nThat is now a thing of the past after the Bulawayo Pool Association managed to lure back long-time sponsor, Mayez to the sport.\n“We are pleased that corporate sponsors are recognising the value of our sport. With several districts actively participating in the local league, we are confident that pool will continue to grow in the city,” the Association’s spokesperson, Ozzy Dziko said.\nMayez Tournament organiser, Mr Archie Scholtz, echoed the sentiment and called on other corporate entities to come on board.",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Chiredzi’s 54-year-old runner defies age with rigorous running routine",
            "href": "https://www.zbcnews.co.zw/chiredzis-54-year-old-runner-defies-age-with-rigorous-running-routine/",
            "content": "Story by Gay Matambo\nCHIREDZI – AT 54 years of age, long-distance runner Mr Lawrence Mahakwa continues to defy expectations, beginning each day with a rigorous 25-kilometre run along the Ngundu–Tanganda Highway, even in the biting cold of winter mornings.\nFor most, a new day begins with a warm beverage or quiet prayer. But for Mahakwa, who is also a successful entrepreneur in the transport sector, the day only truly begins after a run.\n“Running has become so deeply rooted in my life that I struggle without it. It is not just about fitness, it keeps me out of the hospital, sharpens my thinking, and brings me peace. The feeling of movement, the discipline, and the release of endorphins is an unmatched experience. I truly believe everyone should run,” he shared.\nThe runner, who started his career in sports in 2008, has made significant strides in recent years as he has competed in major marathons such as the Kilimanjaro marathon and achieved notable results, including coming 10th in the Two Oceans Marathon in April this year.\n“I have participated in several races over the years, both locally and abroad. The Two Oceans was particularly demanding, but I am proud I completed it. I am now preparing for this year’s local events, including the Tanganda Half Marathon and the Econet Victoria Falls Marathon next month,” he added.\nMahakwa’s love for running has motivated him to establish a non-profit runners fan club for Masvingo Province to raise awareness on depression, anxiety and drug and substance abuse, while encouraging people to run to boost their mental health.",
            "time": "20:40",
            "date": "12 Jun 2025"
        }
    ]
}