{
    "news": [
        {
            "title": "Simba Bhora soars to the top as the PSL title race heats up",
            "href": "https://www.zbcnews.co.zw/simba-bhora-soars-to-the-top-as-the-psl-title-race-heats-up/",
            "content": "Story by Mthokozisi Dube\nDEFENDING champions Simba Bhora delivered a statement of intent with a dramatic 3-2 comeback victory over Herentals in a pulsating Castle Lager Premier Soccer League encounter at Rufaro Stadium this Saturday.\nThe win propelled the Buju Boys to the summit of the league table, dislodging MWOS, who suffered a 1-0 defeat to Yadah at the Heart Stadium.\nWhile both sides are now tied on 40 points, Simba Bhora’s superior goal difference of 14, scoring 26 goals and conceding 12, gives them the edge at the top.\nThere was sweet revenge at Baobab Stadium where Scotland stunned hosts Ngezi Platinum with a spirited 2-1 comeback win, taking their points tally to 31 and moving them into fourth position.\nTheir final placement, however, remains subject to the outcome of their abandoned match against Chicken Inn.\nMeanwhile, Dynamos’ struggles continued, with the Glamour Boys falling 1-0 to TelOne at Ascot Stadium, compounding a disappointing campaign.\nFC Platinum edged Chicken Inn 1-0 at Mandava Stadium, tightening the competition in the top six.\nZPC Kariba and Manica Diamonds played out a goalless draw in a cagey affair.\nBikita Minerals handed Kwekwe United yet another blow in their fight against relegation, with a narrow 1-0 victory at Gibbo Stadium.\nMatch Day 20 action continues on Sunday with two critical fixtures:\nHighlanders host Greenfuel at Barbourfields Stadium in what is expected to be a tightly contested clash.\nCaps United welcome Triangle to Rufaro Stadium, hoping to bounce back from recent inconsistent performances.\nLog Standings Snapshot (Top 4)Simba Bhora – 40 pts (GD +14)",
            "time": "08:51",
            "date": "14 Jul 2025"
        },
        {
            "title": "Charamba impresses on Diamond League debut",
            "href": "https://www.zbcnews.co.zw/charamba-impresses-on-diamond-league-debut/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWEAN sprinter Makanakaishe Charamba made an impressive Diamond League debut following a third-place finish in the men’s 200m race at the Stade Louis-II in Monaco, France, this Friday.",
            "time": "08:51",
            "date": "14 Jul 2025"
        },
        {
            "title": "Black Rhinos’ Hove Claims Victory in Beitbridge Half Marathon",
            "href": "https://www.zbcnews.co.zw/black-rhinos-hove-claims-victory-in-beitbridge-half-marathon/",
            "content": "Story by Providence Maraneli\nTatenda Hove has emerged the winner of the Beitbridge Mayor’s Half Marathon, held along the Beitbridge–Masvingo highway.\nThe Black Rhinos athlete crossed the finish line in 1 hour, 2 minutes, and 55 seconds, narrowly beating Blanket Mine’s Mthokozisi Mhlanga, who came in at 1 hour and 3 minutes.",
            "time": "08:51",
            "date": "14 Jul 2025"
        },
        {
            "title": "Govt impressed by team Zimbabwe’s performance at AUSC Region V Games",
            "href": "https://www.zbcnews.co.zw/govt-impressed-by-team-zimbabwes-performance-at-ausc-region-v-games/",
            "content": "Story by Anashe Murombedzi\nTHE government is impressed by the performance of Team Zimbabwe at the ongoing African Union Sports Council (AUSC) Region V (five) Games in Namibia.\nIt was a grand evening in Windhoek this Thursday as Zimbabwe’s Envoy to Namibia, Ambassador Melody Chaurura, hosted a dinner in honour of Team Zimbabwe, currently participating in the Region 5 Youth Games.\nThe event, held at an upscale venue in the heart of the Namibian capital, celebrated the athletes’ hard work, resilience, and determination.\n“Your achievements are a testament to your passion, commitment, and discipline. You are not only representing Zimbabwe but also making us proud. Sports have provided a constructive outlet for you to stay away from drug and substance abuse, and it is incumbent upon us, as a country, to invest in sports development, not just for national recognition but also to ensure the safety and protection of our youth,” she said.",
            "time": "08:51",
            "date": "14 Jul 2025"
        },
        {
            "title": "Zimbabwe wows crowd at AUSC Region 5 Youth Games",
            "href": "https://www.zbcnews.co.zw/zimbabwe-wows-crowd-at-ausc-region-5-youth-games/",
            "content": "Story by Anashe Murombedzi\nTHE Africa Union Sports Council (AUSC) Region V Youth Games cultural night in Windhoek, Namibia, was a vibrant celebration of African heritage.\nAs the flags of the participating nations were raised high, each country proudly displayed its unique cultural attire and performances.\nTeam Zimbabwe was among 10 Southern African nations that showcased their rich cultural traditions.\nThe University of Namibia gym hall was transformed into a display of African colours as athletes traded their sports kits for traditional wear.\nThe AUSC Region 5 CEO, Stanley Mutoya, set the tone by performing the Borrowdale dance, demonstrating the significance of signature dances in representing each country’s identity.\nZimbabwe stole the show, going last but certainly not least, with an electrifying Muchongoyo performance that left the audience mesmerised.\nThe drums rolled, rattles shook and the atmosphere was just pulsating.\nZimbabwe’s exceptional performance earned applause and admiration.",
            "time": "08:51",
            "date": "14 Jul 2025"
        }
    ]
}