{
    "news": [
        {
            "title": "Three batsmen score centuries as Chevrons dominate Afghanistan",
            "href": "https://www.zbcnews.co.zw/three-batsmen-score-centuries-as-chevrons-dominate-afghanistan/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZimbabwe put up their highest ever test score as they maintained their grip on Afghanistan, ending the second day of the first Test leading by 491 runs at Queens Sports Club this Friday.\nThe Chevrons racked up 586 runs in 135.2 overs to set a record-breaking total in its first innings during the first Test against Afghanistan in Bulawayo.\nZimbabwe’s previous highest total came in 2001, when it racked up 563 for nine in 167 overs against West Indies in Harare.\nSean Williams was the innings’ top scorer with 154 from 174 balls, which included 10 fours and three sixes.\nCaptain Craig Ervine and youngster Brian Bennett also scored centuries.",
            "time": "09:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "53 candidates battle it out for 9 posts in Zifa polls",
            "href": "https://www.zbcnews.co.zw/53-candidates-battle-it-out-for-9-posts-in-zifa-polls/",
            "content": "Story by Lawrence Trusida, Sports Editor\nThe much-anticipated ZIFA Executive Committee elections set for the 25th of next month have attracted a lot of interest, with 53 candidates vying for the nine slots available as Zimbabwe seeks a fresh start.\nThe situation is nothing that had been seen before, with 53 candidates looking to occupy only nine slots on the board.\nAccording to the new constitution, the ZIFA Executive Committee will have 11 members, the President and two deputies, one of which should be a woman as well as eight board members, six that will be voted for, with the Premier Soccer League and the Women Premier Soccer League seconding a candidate each to make a total of 11 members.\nSix candidates are battling for the presidency while 10 are seeking the two Vice-presidency positions with 37 more squaring off for the six board members slots in the January 25th election.",
            "time": "09:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Man City in danger of missing Champions League, says Guardiola",
            "href": "https://www.zbcnews.co.zw/man-city-in-danger-of-missing-champions-league-says-guardiola/",
            "content": "Manchester City are at risk of missing out on next season’s Champions League due to their recent dip in form, manager Pep Guardiola said.\nCity, who are looking to qualify for Europe’s top club competition for a 15th straight season, have won just one of their last eight Premier League games and are seventh, 12 points behind leaders Liverpool.\nGuardiola’s side are four points behind Nottingham Forest, who occupy the fourth and final Champions League qualification berth.\n“When I said before, people laughed. They said, ‘qualifying for the Champions League is not a big success’. But I know it because it happens with clubs in this country,” Guardiola told reporters ahead of their home match against Everton.",
            "time": "09:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Chevrons shift focus to once off test match against Afghanistan",
            "href": "https://www.zbcnews.co.zw/chevrons-shift-focus-to-once-off-test-match-against-afghanistan/",
            "content": "Lawrence Trusida, Sports Editor\nThe Zimbabwe senior cricket team, the Chevrons, are seeking a change of fortunes when they face Afghanistan in a one-off test match, starting on Boxing Day.\nSmarting from back to back series defeats in T20s and One Day Internationals, the Chevrons have no time to rest as they shift focus to the test arena.\nZimbabwe lost the T20s 2-1 before being whitewashed two-nil in the ODIs.\nDespite a wretched recent record, the Chevrons believe they have what it takes to bounce back.",
            "time": "09:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Jere accepts ZIFA verdict",
            "href": "https://www.zbcnews.co.zw/jere-accepts-zifa-verdict/",
            "content": "Story by Lawrence Trusida, Sports Editor\nPremier Soccer League chairperson Farai Jere has decided to let football be the winner after accepting the decision of the ZIFA Ethics Committee to bar him from contesting the 25 January Executive Committee elections.\nHonourable Jere, former legislator Temba Mliswa, Prophet Walter Magaya and former Warriors captain Benjani Mwaruwari were excluded from contesting the ZIFA elections.\nFollowing his exclusion, Jere quickly sought explanation from ZIFA on why he was omitted from the contesting candidates and was furnished with the details this Tuesday morning.\n“I got the response this morning. ZIFA explained to me that I submitted my notice of name change late when FIFA governance had already concluded the vetting process. Before 2000, I used the name Farai Mutimbo and all my Ordinary and Advanced Level certificates bear that name. Then I officially changed to Farai Jere in 2000 and my tertiary qualifications have that name, so the clarity came, but I was disappointed that they could have requested the notice in time and I could also be contested, but remember, everything happens for a reason,” he said.\nQuizzed on why he is not exercising his right of appeal, Jere said he wants football to be the winner.\n“I am a leader so I have to make decisions not just for myself. I want football to be the winner, not Jere. So if I appeal it means that it’s an emergency interdict to stop the elections until my case is heard. My case is simple and I can easily win it, but the time that will take means I will delay the elections, so is that good for our football? I am a Parliamentary Portfolio Committee on Sports chairperson, so I can’t be seen delaying the elections Zimbabwean football needs to heal and move forward to start afresh with new leadership, so I am allowing that to happen because football must come first and football must be the winner.”\nOther candidates, including Benjani Mwaruwari, have also been demanding answers from ZIFA, but ZBC News understands that all the four candidates have since been furnished with explanations on why they have been barred from contesting.\nThe new ZIFA statutes allow an aggrieved party to appeal to a higher body.",
            "time": "09:27",
            "date": "28 Dec 2024"
        }
    ]
}