{
    "news": [
        {
            "title": "HILLSIDE Teacher’s college constructs a Beach Football Facility",
            "href": "https://www.zbcnews.co.zw/hillside-teachers-college-constructs-a-beach-football-facility/",
            "content": "Story by Mthokozisi Dube\n\nHILLSIDE Teachers College in Bulawayo has benefited from a Public-Private Partnership (PPP), which has enabled the institution to begin construction of a Beach Football facility.\n\nThe partnership is Hillside Teachers College, with Bulawayo City Council and Beach football has seen the construction of a facility at the institution of higher learning.\n\nBulawayo City Council held and indaba with stakeholders who urged the City fathers to engage more partners and tap on the low hanging fruits associated with running a sports economy.\n\nThe initiative has seen the city fathers taking on board synergies with sports associations for the construction of sporting facilities resulting in the start of works for the construction of a beach Football facility at Hillside.\n",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Gibbo stadium renovation works complete",
            "href": "https://www.zbcnews.co.zw/gibbo-stadium-renovation-works-complete/",
            "content": "\nStory by Gay Matambo\nZIMBABWE Football Association (ZIFA) president, Nqobile Magwizi has commended the corporate sector for partnering communities in sports infrastructure development following the conclusion in refurbishment works at Gibbo stadium in Chiredzi.\nFollowing the completion of renovation works at Gibbo stadium by Tongaat Hulett Zimbabwe, ZIFA President, Nqobile Magwizi, noted the importance of football infrastructure development initiatives in growing the country’s sports industry.\n“Very impressive work done by Triangle. This is what we speak to when we looking at building strong partnerships with the corporate sector where they come in and commit resources to building infrastructure that helps the community. We can already see that this whole community in Triangle as well as in Chiredzi is vibrant due to the work they are doing. We have five pillars that we are advancing as an executive committee of ZIFA and one is building strong partnerships and the other one is on infrastructure and technology any they have already two of them. We have a strong partnership with them as well as they have put in resources into the refurbishments of the stadium as we had recommended to meet the standards as required by CAF and FIFA. Within two months they have already built new changing rooms, new tunnel, ablution facilities and it’s impressive,” Magwizi said.",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Old Hararians crowned 2025 Nedbank Rugby Challenge winners",
            "href": "https://www.zbcnews.co.zw/old-hararians-dethrone-sportivo-as-they-were-crowned-the-2025-nedbank-rugby-challenge-winners/",
            "content": "Story by Raynald Ngwarati\nOLD Hararians have been crowned the 2025 Nedbank Rugby Challenge Cup champions this Saturday.\nThe Nedbank Rugby Challenge Cup will be shifting base from Harare Sports Club to Old Hararians after OH put in a dominant show to outclass the hosts in a thrilling final played at the Harare Sports 25-20.\nA try from substitute Munyaradzi Gwandu was the difference as Old Hararians bagged the 2025 Nedbank Rugby Challenge Cup in style outwitting last year’s champions Harare Sports Club to land the coveted silverware.\nHarare Sports Club who had won three consecutive Nedbank Rugby Challenge Cup finals could not find their usual trick as they failed hold on to their lead in the closing stages of the match.\nLeading 17-13 with five minutes left on the clock, Sportivo let loose their guard leaking two tries to hand over the title to Old Hararians.",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Defending champions Simba Bhora secure second win",
            "href": "https://www.zbcnews.co.zw/defending-champions-simba-bhora-secure-second-win/",
            "content": "Story by Raynald Ngwarati\nDEFENDING Castle Lager Premier Soccer League champions, Simba Bhora have picked up their second win of the season after edging TelOne by a goal to nil at Wadzanayi Stadium this Saturday.\nThe reigning champions are proving that they will not be pushovers this campaign, despite a slow start which saw them scoring a single goal in four matches.\nFacing off with a TelOne outfit that has barely let anything loose after four games, the Joel Luphahla coached outfit showed their determination and hunger outwitting the Wi-Fi boys by a single goal to nill.\nDespite falling to Dynamos last week, the defending champions are proving that Wadzanayi is indeed a fortress after picking up seven points so far from a possible nine and are yet to concede in Shamva.\nIn another interesting encounter, Dynamos suffered their first defeat of the season, choking on their trip to Mutare.\nDonald Teguru was the hitman responsible for the fall of the Glamour Boys in the 18th minute, giving Manica Diamonds three points and dine in glory at their arena, Sakubva Stadium.\nWhile, TelOne slumped, Lloyd Mutasa’s MWOS capitalised on the loss to ascend to the apex of the league by beating ZPC Kariba by a single goal.\nAmbitious side, Scottland FC were the biggest winners on the day, pummelling Bikita Minerals by three-goals to nil to move back into the top three.\nYadah found the going tough in Chisumbanje as they lost to Green Fuel by a single goal.\nIn the Midlands derby at Bata Stadium, Kwekwe United shared the spoils with FC Platinum after playing out to a goalless draw.",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Zim U23 Baseball team in camp ahead of Regional qualifiers",
            "href": "https://www.zbcnews.co.zw/zim-u23-baseball-team-in-camp-ahead-of-regional-qualifiers/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Under-23 Baseball Team has entered camp as it intensifies preparations for the World Baseball and Softball Confederation (WBSC) Regional Qualifier, scheduled for May at a yet-to-be-confirmed venue.\nThe national side has initiated training as it sets its sights on progressing to the African Championships, a crucial step that will also serve as the final qualifier for the Baseball World Cup.\nDespite the players’ enthusiasm and commitment, officials have raised concerns over Zimbabwe’s poor baseball infrastructure, which they fear may affect the team’s chances of qualifying.\nThe team is set to face stiff competition from regional powerhouses such as South Africa and Zambia, but morale remains high.\n“This is my first qualification tournament and as team Zimbabwe, we are very excited. We are preparing well, and I believe we have a real chance to qualify,” player Clayton Mpofu said.\n“This is our second camp. We have been doing team-building exercises, yesterday we had a game night as a team. We are growing stronger both on and off the field, and that is helping us become one mentally and spiritually united team,” another player, Panashe Kuwanda said.\nWhile preparations on the pitch are taking shape, the spotlight has shifted to the urgent need to upgrade baseball facilities in the country. The lack of proper infrastructure is viewed as a serious impediment to the team’s ambitions.\n“This is my first-year qualification tournament. And as Zimbabwe, it is a very, very good tournament, and we are very well preparing, and we are preparing very, very good, and I am hoping that we are going to qualify,” player, Clayton Mpofu said.\n“This is our second Camp, and we have been doing team building practices. Yesterday we went out for a game night as a team and played. We are also building as a team off the field as well as building it in the ground which is helping us to form one team that is fit mentally and spiritually,” another player, Panashe Kuwanda said.\nWhile, it is shaping up on the field of play, the need to spruce up baseball facilities in the country has come under the spotlight, posing a threat to the qualification campaign.",
            "time": "06:34",
            "date": "07 Apr 2025"
        }
    ]
}