{
    "news": [
        {
            "title": "Parliament Committee assesses sports facilities across the country",
            "href": "https://www.zbcnews.co.zw/parliament-committee-assesses-sports-facilities-across-the-country/",
            "content": "Story by Mthokozisi Dube\nTHE Parliamentary Portfolio Committee on Sports, Recreation, Arts and Culture has embarked on a countrywide tour to assess sports infrastructure, with a view to finding ways of improving the facilities.\nKhumalo Hockey Stadium was constructed in 1995 when the country hosted the All Africa Games in Harare, and Bulawayo remains one of the best facilities, after Namibia and South African facilities got certification to stage continental hockey stadiums.\nWith an oversight role, Parliament used to summon stakeholders to give oral evidence, and now a new approach has seen the Parliamentary Portfolio Committee embarking on an inaugural visit to assess sports infrastructure.\nThe committee came face to face with how bureaucratic tendencies and unclear ownership structures are hindering the maintenance of sports facilities.\nMatabeleland Hockey Board president David Small welcomed the Portfolio Committee visit.\n“We are happy with the visit, the facility has the potential to generate revenue if they iron out some sticking issues like the lease agreement,” he said.\nUnlike the other visited cities like Harare, Mutare, Masvingo, and Zvishavane, Bulawayo has enjoyed an infrastructure legacy having hosted big competitions, including the Region V Games.\n“During the Region V, we had renovations in various sports infrastructure, but since then, nothing has been done. Khumalo Hockey Stadium does not have flood lights and to buy those we are referred from one office to the other,” member of the Bulawayo sporting fraternity said.",
            "time": "20:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Lieutenant General (Rtd) Anselem Sanyatwe, takes over as Minister of Sport, Recreation, Arts, and Culture",
            "href": "https://www.zbcnews.co.zw/lieutenant-general-rtd-anselem-sanyatwe-takes-over-as-minister-of-sport-recreation-arts-and-culture/",
            "content": "Story by ZBC reporter\nPRESIDENT Emmerson Mnangagwa has appointed Lieutenant General (Retired) Anselem Nhamo Sanyatwe as the new Minister of Sport, Recreation, Arts and Culture, effective immediately.\nThis appointment follows the election of the former Minister, Kirsty Coventry, as the president of the International Olympic Committee (IOC) on March 20, 2025.",
            "time": "20:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Pool action heads to Binga as ZIPA unveils Gazaman Tournament",
            "href": "https://www.zbcnews.co.zw/pool-action-heads-to-binga-as-zipa-unveils-gazaman-tournament/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe Pool Association (ZIPA) is on a drive to take pool to disadvantaged communities, with a tournament set for Binga next month.\nThe Gazaman Pool Tournament returns to Binga’s Simatelele area bigger and better with a focus on unearthing idle local talent.\nThe stage has been set for the second tournament after a call to hold more games in the area.\nIn its inclusive development plan, ZIPA organised a six-team tournament set for April 5.\nBulawayo Pool Association spokesperson Ozzy Dziko says they have been tasked by the ZIPA to spread the game to all corners of the country.",
            "time": "20:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Harare Gears Up for the 4th Edition of the Nedbank Rugby Challenge Cup",
            "href": "https://www.zbcnews.co.zw/harare-gears-up-for-the-4th-edition-of-the-nedbank-rugby-challenge-cup/",
            "content": "HARARE, Zimbabwe March 25 2025 Zimbabwe Rugby Union is proud to announce the return of the highly anticipated Nedbank Rugby Challenge Cup, now in its 4th edition.\nThe tournament kicks off on March 29 2025 at the Machinery Exchange Harare Sports Club, with the final round and awards ceremony set for April 5 2025 at the same venue.\nThis year’s event promises to be bigger, bolder, and more inclusive than ever before, with a strong focus on women’s rugby, youth development, and club excellence.\nIn a landmark move underscoring the growth of the women’s game, both the Zimbabwe Sables Women’s and the Junior Sables U20 Women’s teams will feature prominently across both weekends.\nLady Sables will using the Nedbank Challenge Cup as the final preparatory event leading to their voyage to Ivory Coast for the Rugby Africa Division One quest in April.\nNedbank’s premier tournament opens with a historic clash between the Junior Women and the Senior Women at 10:40 AM on March 29, showcasing the depth and talent within Zimbabwe’s female rugby ranks.\nThe Women’s teams will also return for the second round on April 5, reinforcing the sport’s growing commitment to gender inclusion and visibility.\nThe Nedbank Challenge Cup continues to serve as a crucial platform for grooming future national talent.\nAmong the most anticipated fixtures is the involvement of the Nedbank Grassroots to Greatness U20 side, which faces host club Harare Sports Club in a thrilling Round one clash.\nThe developmental team is part of a broader initiative to nurture emerging players and offer a competitive pathway into elite rugby structures.\nThrough Nedbank Zimbabwe, young players such as Dion Khumalo and Takudzwa Musingwini have risen from Under-20 stardom to become African Champions as juniors and seniors.\nMeanwhile, all eyes will be on two-time defending champions Harare Sports Club return with a target on their backs as they aim for a third consecutive title.\nBacked by home support and a reputation for clinical execution, HSC will look to extend their dominance in what has become Zimbabwe’s premier club rugby showdown.\nTheir first test comes against the energetic Grassroots U20 squad in the final match of the opening round.",
            "time": "20:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Falcon, ZDF Queens dominate as PNL season kicks off",
            "href": "https://www.zbcnews.co.zw/falcon-zdf-queens-dominate-as-pnl-season-kicks-off/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe Premier Netball League (PNL) roared into action this weekend with thrilling encounters across different cities, marking the official start of the 2025 season.\nAt White City Stadium, the much-anticipated battle of the uniformed forces saw Falcon emerge victorious, overpowering Imbizo 42-31 before crushing Rhinos 61-30.\nImbizo salvaged some pride with a commanding 56-30 win over Tongogara, while Rhinos secured a 53-23 triumph over the same opponents\nIn Mutare, ZDF Queens player Thandekile Mahlangu was named player of the bubble after leading ZDF Queens to a goal harvest, which saw them thrash Mutasa Queens 117-10.\nThe Queens also ran amok beating Bikita Minerals 81-21 before winding their fairytale campaign with a 106-10 victory over Buffaloes.\nIn the capital, Platinum Stars Spiwe Dlamini was named the best player of the bubble despite her team failing to win.\nPlatinum stars got a 69-21 thorough hiding from Harare City before coming close to the contest against HD.\nPlatinum Stars lost 48-44 to HD.",
            "time": "20:42",
            "date": "26 Mar 2025"
        }
    ]
}