{
    "news": [
        {
            "title": "PSL Matchday 8 kicks off with Herentals College FC victory",
            "href": "https://www.zbcnews.co.zw/psl-matchday-8-kicks-off-with-herentals-college-fc-victory/",
            "content": "Story by Raynald Ngwarati\nMATCHDAY eight of the Castle Lager Premier Soccer League kicked off this Friday with bogey side Herentals College beating Green Fuel by a single goal at Rufaro Stadium.\nTino Benza was the hero for the students as they moved to nine points on the table to close in on the top ten.",
            "time": "18:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Zim names 40-man squad as Sables prepare to light up Zambezi Series",
            "href": "https://www.zbcnews.co.zw/zim-names-40-man-squad-as-sables-prepare-to-light-up-zambezi-series/",
            "content": "Story by ZBC Reporter\nTHE Zimbabwe Rugby Union has announced the 40-man squad selected for the Zambezi Series, which will see the Sables taking on regional rivals, Zambia and Botswana next month.\nThe spotlight has been given to local talent, with all selected players based in Zimbabwe and primed to carry the torch for the national team in front of the home crowd.\nThe campaign kicks off on May 4 when Zimbabwe faces Zambia at the Harare Sports Club, before clashing with Botswana on May 10 in the capital.\nIn a statement released by the ZRU this Saturday, team manager Takunda Chikofoyo expressed his confidence in the local-based players.\n“We took a short break from November last year after the international window and we were back at work in January. You can tell just from the commitment and work ethic that the boys want this more than ever.\n“Our locally based players have been working together and some great combinations have formed, we are pretty excited about Zambia and Botswana,” he said.\nThe team manager also called on the fans to throng the match venues in their numbers.",
            "time": "18:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Lady Chevrons beat USA Women to lead T20I series",
            "href": "https://www.zbcnews.co.zw/lady-chevrons-beat-usa-women-to-lead-t20i-series/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe national women’s cricket team, the Lady Chevrons have taken the lead in the three-match T20 International series against the United States, after winning the series opener by 28 runs at the Grand Prairie Cricket Stadium in Texas this Friday, to take a one-nil lead in the series.\nThe Lady Chevrons kicked off the T20 International series to perfection with 16-year-old Beloved Biza being the heroine for the Lady Chevrons as she produced a beautiful all-round display to steer the visitors to a thrilling victory in the first of three T20 Internationals on foreign soil.\nThe teenager led from the front with both the bat and ball, scoring crucial runs and bagging crucial wickets to put the Lady Chevrons in a good position to claim the series.\nThe rising sensation put on a handy 33 runs with the bat, with a strike rate of 97, before playing the destroyer in chief to plague the USA Women as she claimed three scalps for 18 runs.\nThe Lady Chevrons had found themselves in trouble earlier as a top order collapse left them reeling on 12 runs for the loss of two wickets as openers Kellis Ndlovu and Modester Mupachikwa failed to register much impact with the bat.\nChipo Mugeri-Tiripano then partnered Loreen Tshuma for a 31-run third wicket stand before. The former departed for just 15 runs, leaving the visitors in trouble at 43-three.",
            "time": "18:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Junior Sables, Chipu thriller to decide Barthes finale",
            "href": "https://www.zbcnews.co.zw/junior-sables-chipu-thriller-to-decide-barthes-finale/",
            "content": "Story by Raynald Ngwarati\nEPIC battles are expected this Sunday as the Zimbabwe, Namibia and Kenya Under 20 rugby national teams battle for supremacy in the Rugby Africa Barthes Cup at Old Hararians.\nThe showdown will gain some tempo this Sunday with a humdinger clash pitting the defending champions Kenya and last year’s runners-up Zimbabwe in battle of the titans to set up the finale.\nThe two teams have an identical record after playing two matches in the tournament, winning one and losing one, making Sunday’s tie a must-win battle for either team.\nZimbabwe’s Junior Sables will go into the tie full of confidence after beating Tunisia 78-20 on Wednesday to get back into the competition after a 41-22 defeat to Namibia in the opening match.",
            "time": "18:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "ZIFA hails diaspora engagement success in UK under ‘Roots and Dreams’ initiative",
            "href": "https://www.zbcnews.co.zw/zifa-hails-diaspora-engagement-success-in-uk-under-roots-and-dreams-initiative/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nTHE Zimbabwe Football Association (ZIFA) has expressed satisfaction with its ongoing engagement efforts with the diaspora community, particularly in the United Kingdom, under the ambitious Roots and Dreams initiative.\nZIFA President Nqobile Magwizi, Warriors head coach Michael Nees, and Diaspora Engagement Committee Chairperson Marshall Gore have been in Birmingham and London, meeting stakeholders and sharing their vision for Zimbabwean football.\n“We have had a wonderful time meeting with various stakeholders, so let me clarify, we started the stakeholders’ engagements in Zimbabwe and we went round the country sharing our vision and also getting input, so this is the same thing we are doing. We have a very huge community in England and we have been speaking to them and they are very enthusiastic to help in one way or the other. Zimbabwe is for every Zimbabwean living anywhere and there are opportunities to administer, coach, manage play, referee every aspect of football so this is what we are here for,” Magwizi said.\nMagwizi also confirmed they had separate engagements with professional players with head coach Micheal Nees leading the process while Warriors captains Marvelous Nakamba and Marshal Munetsi were also involved.\n“That process was led by the coach, remember Nees has been here for some time watching players and speaking to those that he feels can be part of the system and he has already spoken to Shumirai Zion Mheuka and Tivonge Rushesha among others and this is the same thing that he was doing when he was in Zimbabwe, he would go around watching matches all over the country and the players that would have been identified will be called for the June camp in Morocco,” he said.\n17-year-old Mheuka plays for English Premier League side Chelsea while 22-year-old Rushesha who has represented Wales at the youth level players for League One side Reading.\nThe Zimbabwe Embassy in England also confirmed they stand ready to assist any player willing to represent the country to have documents.",
            "time": "18:40",
            "date": "26 Apr 2025"
        }
    ]
}