{
    "news": [
        {
            "title": "Nkani Khoza elected new Highlanders treasurer",
            "href": "https://www.zbcnews.co.zw/nkani-khoza-elected-new-highlanders-treasurer/",
            "content": "Nkani Khoza elected new Highlanders treasure\nStory by ZBC News Reporter\nNkani Khoza has been elected as the new Highlanders Treasurer after elections held at the club house in Bulawayo this Sunday.",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Top netballers honoured at colourful ceremony",
            "href": "https://www.zbcnews.co.zw/top-netballers-honoured-at-colourful-ceremony/",
            "content": "Story by Raynald Ngwarati\nTop performers from the Rainbow Amateur Netball League 2024 campaign were this Saturday honoured at a colourful ceremony held at the High Achievers Coach International Academy to celebrate last year’s outstanding acts.\nHours after the ushering in of a new executive to be led by Chipo Chirenje, outstanding performers from the Rainbow Amateur Netball League (RANL) had a night to remember as their exploits were rewarded.\nThe biggest honour went to Flow Angel’s Anifa Luya, who won the Player of The Year accolade for her impressive showing during last year’s campaign.\nThe versatile mid-court player undoubtedly deserved the honour, having had 13 Player of The Match accolades to her name during the 2024 season to prove her worth as one of the best netball players in the country.\nNot to be outdone was Correctional Queens Goal Shooter, Tafadzwa Mawango who was honoured with a golden glove accolade for finishing as the top points scorer with an impressive 1802 goals in the calendar year.\nAlso honoured is Correctional Queens head coach, Naftali Nyangulu who was voted the Coach of the Year, taking the gong away from Glow Petroleum’s Perpetua Siyachitema who won it the previous two seasons.\nOther winners include Mtala Netball Club who won the Most Disciplined Team of the Year, Ashley James won the Rookie of The Year Award, Pamela Muchena bagged the People’s Choice Award and the Players’ Player of The Year went to Amanda Ncube.\nEarlier on, an Annual General Meeting was held where a new executive was elected to run RANL for the next four years after the expiration of the Melody Garikai-led committee’s tenure.",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Green Fuel FC embarks on squad overhaul ahead of new season",
            "href": "https://www.zbcnews.co.zw/green-fuel-fc-embarks-on-squad-overhaul-ahead-of-new-season/",
            "content": "Story by Kenias Chivuzhe\nChipinge-based Premier Soccer League club, Green Fuel have acquired ten new players after the departure of several of players to other clubs.\nAfter finishing 12th on the log last season, Green Fuel parted ways with ten players and have moved in swiftly to plug the gaps.\nThe new signings include winger Perfect Chikwende from Simba Bhora, attacking midfielder Ronald Chitiyo from Malawi’s Nyasa Big Bullets and Collin Mujuru who was also in Malawi.\nUnheralded midfielder Emmanuel Chikwende, defender Malon Mushonga, midfielder Robert Kwaramba as well as goalkeepers Frank Kuchinei and Ashley Reyners complete the list of the new recruits.\nGreen Fuel Head Coach Taurai Mangwiro believes his newly assembled team will mount a formidable challenge, describing the first two seasons in the premier league as a solid foundation for a successful campaign.\n“We are in our third week of preparations. Some of the players we let go had expired contracts. Key among the players are goal keepers Tapiwa Chilenga and Tendai Chirara and Defender Goliath. Bruno Mutigo was on loan and returned to his team and Learnmore Mlambo has joined Dynamos. We also have new faces including Perfect Chikwende, Ronald Chitiyo, Collen Mujuru and goal keeper Ashley Reyners. We have elevated from our juniors and brought in a few youngsters from the local community. We look formidable and we hope to be able to compete and make a good impression this season. We will soon be playing some practice matches and it’s going to be a seven week programme. We still have four weeks before the start of our campaign,” Mangwiro said.",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Mashaya honoured at ZCTA Awards",
            "href": "https://www.zbcnews.co.zw/mashaya-honoured-at-zcta-awards/",
            "content": "Story by ZBC News Reporter\nRevered martial arts master, Shihan Wilfred Mashaya, added another feather to his cap, joining several other individuals who received accolades at the Zimbabwe Community Trailblazers Awards (ZCTA) held on Friday at the Harare International Conference Centre.\nMashaya received the Distinguished Martial Artist Award, celebrating his lifelong passion for martial arts and tireless efforts to give back to the community.\nIt comes hot on the heels of his recent induction into the International Budo Bushi Hall of Fame in Poland.\nThe ZCTA event, which drew a diverse crowd of dignitaries, community leaders and sports enthusiasts, recognised Mashaya’s immense contributions to the sports and arts sector.\nThe Guest of Honour at the ceremony was the Minister of Information, Publicity, and Broadcasting Services, Dr Jenfan Muswere.\nMashaya’s recent Hall of Fame induction in Poland marks a crowning achievement in a career spanning over three decades.",
            "time": "20:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Football fans implore new ZIFA board to prioritise development",
            "href": "https://www.zbcnews.co.zw/football-fans-implore-new-zifa-board-to-prioritise-development/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nAS the new leadership of the Zimbabwe Football Association (ZIFA) led by president Nqobile Magwizi officially takes over the reins this Saturday, fans have implored the new leadership to prioritise football development.\nThe newly-elected board officially took office this Saturday after the expiration of the Normalisation Committee’s term on the 31st of January.\nFootball fans are eagerly anticipating a brighter future for the beautiful game and with the AFCON tournament on the horizon, fans are expecting the Warriors to be well-motivated and perform at their best in Morocco.\nThe football loving community is, however, cognisant of the need for improvement in several key areas.\nTop of the list is the refurbishment of facilities such as the National Sports Stadium to meet CAF standards, enabling Zimbabwe to host international matches.\n“We need a solid grassroots development programme to produce talented players for the future,” a fan said.",
            "time": "20:38",
            "date": "03 Feb 2025"
        }
    ]
}