{
    "news": [
        {
            "title": "Bulawayo hosts ANTUSA games as SADC educators unite through sport",
            "href": "https://www.zbcnews.co.zw/bulawayo-hosts-antusa-games-as-sadc-educators-unite-through-sport/",
            "content": "Story by Mthokozisi Dube\nEDUCATORS from the SADC region under the Non-Aligned Teachers Union (ANTUSA) are unwinding through sport at Hillside Teachers College in Bulawayo in a move aimed at exchanging ideas.\nInitiated in Kabwe, Zambia in 2007, the ANTUSA games have made a third-time return to Zimbabwe with previous editions having been held in Harare and Victoria Falls.\nMade up of eight unions from the SADC region, the games are used as a platform to unwind for educators, while also acting as a platform to cross-pollinate ideas to improve the education sector.\n“We are happy to be hosting the 15th edition of the games. Since the formation of the games, we have seen strides in the transfer of ideas to improve the education sector,” ANTUSA President, Mkhuseli Dube stated.\nANTUSA leaders also believe the games act as a unifier in the region as they are held on a rotational basis.\n“The union was formed in Zambia so we represent a bigger population. We have benefitted from these games as we use them to learn how other sister countries are doing it to improve the games,” Basic Education Teachers Union of Zambia’s President, Binstone Tembo said.",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "Zimbabwean NFL star, Thabani Maguranyanga champions Zim’s sports tourism agenda",
            "href": "https://www.zbcnews.co.zw/zimbabwean-nfl-star-thabani-maguranyanga-champions-zims-sports-tourism-agenda/",
            "content": "Story by Wellington Makonese\nZIMBABWEAN-born star, who plays in America’s National Football League (NFL), Thabani Maguranyanga is in the country and pushing Zimbabwe’s sports tourism agenda.\nThe Ministry of Tourism and Hospitality Industry this Wednesday evening hosted NFL’s new signing, Maguranyanga, who is now on the books of Washington Commanders.\nThe government appreciated Maguranyanga’s achievements and those of other sports personalities plying their trade abroad.\n“We want to work with other sports codes, but you are the first and we think you have done a great job. We want sports tourism to bring tourism into the country. What you have done is great and we are in full support. Leaders are not just government and church leaders, you are leaders and have the wisdom to lead,” Minister of Tourism and Hospitality Industry, Honourable Babra Rwodzi said.\nMaguranyanga views his recent transition to the NFL as an opportunity to inspire young Zimbabweans and elevate the Zimbabwe brand on the global stage.\n“I am honoured and excited to be here and do this country proud. I want Zimbabwean kids to be up there and have the next generation of our brothers be in EPL Formula One and be the greatest country in the world. I will try to ensure that my teammates get to know about what we have here,” he said.\nPrior to his NFL signing, Maguranyanga represented the Zimbabwe Rugby team and was named among the 13 players in the International Pathway Player programme for 2025 before joining the Washington Commanders.",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "A fluffed Panenka, controversy & ‘statement win’ for Arsenal",
            "href": "https://www.zbcnews.co.zw/a-fluffed-panenka-controversy-statement-win-for-arsenal/",
            "content": "A dramatic 2-1 win against Real Madrid in a hostile Bernabeu secured the Gunners just a third Champions League semi-final – and a first since 2009 – after an impressive first-leg 3-0 win.\nIt was a night Arsenal fans will never forget.\nBukayo Saka’s saved early Panenka penalty and Kylian Mbappe’s overruled spot-kick ensured the Gunners’ progress wasn’t without incident – but it was ultimately a win that will send a message to the rest of Europe.\nSaka made up for his indiscretion with a second-half opener and, despite William Saliba gifting Vinicius Junior an equaliser soon after, the Gunners never looked in trouble as Paris St-Germain await, with Gabriel Martinelli securing the win late on.\n“One of the best nights in my football career,” said manager Mikel Arteta.\n“We played against a team with the biggest history. It has been an inspiration for all of us on this competition.\n“The history we have in this competition is so short. The third time in our history of what we have just done and we have to build on that.\n“And now we have to continue to do that because I think we have some momentum now.”",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "Herentals, Black Rhinos Queens to make women’s football debut at Independence Celebrations",
            "href": "https://www.zbcnews.co.zw/herentals-black-rhinos-queens-to-make-womens-football-debut-at-independence-celebrations/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nFOR the first time in history, women’s football will take centre stage during this year’s Independence Day celebrations, with a highly anticipated showdown between Herentals Queens and Black Rhinos Queens scheduled for this Thursday in Gokwe Nembudziya.\nThe match will take place at the Gokwe Nembudziya Open Grounds after the Children’s Party, marking a major milestone in the growing recognition of women’s sport in the country.\nThe two powerhouse teams, reigning Zimbabwe Women’s Premier League champions Herentals Queens and last season’s runners-up Black Rhinos Queens, promise an exciting clash.",
            "time": "18:35",
            "date": "19 Apr 2025"
        },
        {
            "title": "Young Sables aim to reclaim title at Rugby Africa U20 Barthes Trophy",
            "href": "https://www.zbcnews.co.zw/young-sables-aim-to-reclaim-title-at-rugby-africa-u20-barthes-trophy/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE much-anticipated Rugby Africa U20 Barthes Trophy will kick off in Harare this Saturday, with Zimbabwe’s under-20 men’s rugby team, the Young Sables hoping to reclaim their title.\nThe tournament promises to be an exciting clash of young rugby talents from across Africa.\nThe reigning champions, Kenya, will be favourites to retain their title after a commanding 28-13 victory over Zimbabwe in Harare last year.\nHowever, the Young Sables will be determined to make a strong comeback on home ground and win back their title after losing it to Kenya last year.\nThe tournament schedule is packed with thrilling matches as the opening game will feature Kenya against Tunisia, followed by the hosts, Zimbabwe taking on Namibia.",
            "time": "18:35",
            "date": "19 Apr 2025"
        }
    ]
}