{
    "news": [
        {
            "title": "Selemani’s stunner secures a point for FC Platinum against Scottland",
            "href": "https://www.zbcnews.co.zw/selemanis-stunner-secures-a-point-for-fc-platinum-against-scottland/",
            "content": "Story by Lawrence Trusida, Sports Editor\nWINGER Jarison Selemani rescued a point for FC Platinum against Scottland in a highly entertaining Castle Lager Premier Soccer League encounter at Rufaro Stadium this Easter Monday.\nA lot was expected in the clash between Scottland and FC Platinum and true to script, the match lived up to the billing.\nIt was a battle between a pragmatic coach and an exuberant one and at the end, they could not be separated.\nMabvuku-based Scottland took the lead in the first half after Vassilli Kawe benefited from some good work from evergreen Khama Billiat.\nThe goal seemed to awaken the Zvishavane-based side but they could not find the keys to unlock a solid Scottish defence that was until the introduction of winger Jarison Selemani in the second half.\nThe former Dynamos player unleashed a thunderbolt that was good enough to win any match however this time it rescued a point.\nFC Platinum coach Norman Mapeza was content with the draw despite it being his team’s sixth of the season.\n“There are so many positives from today’s match. We could have won the match but then again this point is not disappointing and we will get it right next time,” Mapeza said.\nHis opposite number was also content.",
            "time": "08:44",
            "date": "22 Apr 2025"
        },
        {
            "title": "Zim sprinters gear up for World Athletics relay",
            "href": "https://www.zbcnews.co.zw/zim-sprinters-gear-up-for-world-athletics-relay/",
            "content": "Story by Providence Maraneli\nFOLLOWING Zimbabwe’s 4×400m relay team’s stellar performance in Botswana this past week, the team is carrying the nation’s hopes at the World Athletics Relay in Guangzhou, China.\nThe relays, which are scheduled for May 10 to May 11 will see the team comprising Leeford Zuze, Gerren Muwishi, Aldrin Mafa and Dennis Hove carrying the national flag.",
            "time": "08:44",
            "date": "22 Apr 2025"
        },
        {
            "title": "All set for today’s PSL fixtures",
            "href": "https://www.zbcnews.co.zw/all-set-for-todays-psl-fixtures/",
            "content": "MWOS, Dynamos, Highlanders, Chicken Inn, Simba Bhora, Scottland Line Ups:\nChicken Inn StartingXI: Donovan BenardAurthur Chinda, Mpumelelo Bhebhe, Joseph Tulani, Xolani Ndlovu, Dominic Jaricha, Itai Mabhunu, Michael Charamba, George Majika, Itayi Makopa, Brian Muza\nDynamosStartingXI: Simba Makoni, Emmanuel Jalai, Abel Gwatidzo, Nomore Chinyerere, Clive Mandivei, Tendaishe Magwaza, Shadreck Nyahwa, Jairos Kasondo, Ephraim Gwekerere, Ransom Chingwara\nMWOS Starting XI: Martin Mapisa, Tafadzwa Nyabunze, Valentine Katsande, Innocent Zambezi, Matthew Murambiwa, Tino Mutyambizi, Tafadzwa George, Billy Veremu, Claude Mapoka, Nigel Matinha\nSimba Bhora StartingXI: William Thole, Webster Tafa, Rowland Kangadzi, Blessing Moyo, Isheanesu Mauchi, Tafadzwa Ziocha, Isaskar Gurirab, Tinotenda Meke, Carlos Mavhurume, Junior Makunike\nScottland StartingXI: Nelson Chadya, Kingsley Mureremba, Walter Musona, Peter Muduhwa, Gareth Madhakale, Kevin Moyo, Khama Billiat, Albert Manenji, Mthokozisi Msebe, Vassilli Kawe, Ansa Botchway\nHighlanders Starting XI: Reward Muza, Talent Dube, Arthur Ndlovu, Melikhaya Ncube, Reason Sibanda, Malvern Hativagoni, Never Rauzhi, Hurbert Ncube, Luckmore Mutumbi\nChicken Inn 15:00 Simba BhoraLuveve Stadium\nMWOS 15:00 DynamosNgoni Stadium",
            "time": "08:44",
            "date": "22 Apr 2025"
        },
        {
            "title": "Liverpool one win away from title, Leicester relegated, Ipswich almost down",
            "href": "https://www.zbcnews.co.zw/liverpool-one-win-away-from-title-leicester-relegated-ipswich-almost-down/",
            "content": "LIVERPOOL will have to wait for a few more days to be crowned Premier League champions despite a 1-0 victory at Leicester City after Arsenal kept their slender hopes just about alive with a 4-0 romp at 10-man Ipswich Town on Sunday.\nTrent Alexander-Arnold came off the bench to score Liverpool’s winner in the 76th minute at the King Power Stadium to restore their 13-point lead at the top with five games left.\nWhile Liverpool can almost taste a record-equalling 20th English crown, Leicester’s defeat confirmed their relegation back to the Championship after just one season.\nThe Midlands club have now been relegated from England’s top flight a record 13 times.\nChelsea secured a massive win in their bid to qualify for the Champions League as they came from behind to beat Fulham 2-1 at Craven Cottage with Pedro Neto scoring in stoppage time.\nThe win pushed Chelsea above Nottingham Forest in to fifth place, the last spot for qualification to the Champions League, although Forest play at Tottenham Hotspur on Monday.\nChelsea have 57 points from 33 games, two behind third-placed Newcastle United and one behind Manchester City. Forest and Aston Villa are level with Chelsea on 57 points.\nWolverhampton Wanderers guaranteed their safety as they beat Manchester United 1-0 at Old Trafford. Pablo Sarabia’s stunning free kick wrapped up a fifth successive league win, the first time Wolves have achieved that in the top flight since 1970.\nLiverpool were wasteful at Leicester with numerous chances going begging and Mohamed Salah suffering a frustrating afternoon including hitting both posts with an early shot.\nSalah hit the woodwork again moments before the ball came out to Alexander-Arnold who fired a left-footed shot through the crowd to give his side the points — ripping off his shirt and celebrating wildly with the travelling fans.\n“We just keep going, mentally we’re really strong,” manager Arne Slot, whose side could be crowned champions if Arsenal lose at home to Crystal Palace on Wednesday, told Sky Sports.“They enjoy playing football and it helps when you are playing for something special. Today (Alexander-Arnold) knows when it matters most he can just bring a bit more which is something all the top, top players have.”\nDISTANT SECOND\nIf Arsenal avoid defeat by Palace, Slot’s side will seal the title if they beat Tottenham Hotspur at home next Sunday.\n“We will focus on Tottenham and looking forward again to a home game and I think the stadium will be full,” Slot, who can become the first Dutch manager to win the English title, said. “It’s a nice game to look forward to.”\nLiverpool have 79 points with Arsenal a distant second on 66. Arsenal may have their eyes now on a Champions League semi-final against Paris St Germain, but they showed against Ipswich they will not hand over the title to Liverpool.\nLeandro Trossard opened the scoring early on and Gabriel Martinelli made it 2-0 after a delightful flick by Mikel Merino.Ipswich were reduced to 10 men before halftime as Leif Davis crudely raked his studs down the back of Bukayo Saka’s calf and the second half was academic.\nTrossard grabbed his second in the 69th minute and Ethan Nwaneri added a late fourth to leave Ipswich stuck in 18th place on 21 points. They will be relegated if they drop points again or 17th-placed West Ham United pick up one more point from their remaining five games.\nChelsea were heading for a damaging defeat at neighbours Fulham as the hosts led with Alex Iwobi’s 20th-minute goal.",
            "time": "08:44",
            "date": "22 Apr 2025"
        },
        {
            "title": "Struggling CAPS register 5th loss in 7 games",
            "href": "https://www.zbcnews.co.zw/struggling-caps-register-5th-loss-in-7-games/",
            "content": "Story by Raynald Ngwarati\nTHE Green Machine’s poor start to the season continued again this weekend as the five-time Premier Soccer League champions were left licking wounds at home by Bikita Minerals.\nCAPS United succumbed to their fifth defeat of the season after losing to Bikita Minerals in a Castle Lager Premier Soccer Match played at Rufaro Stadium this Sunday.\nThe Green Machine currently lie in the drop zone with just a single win and a draw, have failed to collect points in their last four matches.\nPlaying at the home arena, Rufaro Stadium, the match was poorly attended, a sign that the fans are frustrated with the form of one of the big three clubs in the country.\nAfter a decent showing, the Lloyd Chitembwe-coached side, failed to find their touch in the final third, which cost them, as Innocent Masiiwa scored a last minute goal to punish the Green Machine.\nWhile, the Green Machine’s struggles continue, fellow strugglers Triangle United bagged their first victory of the season after beating Yadah by a single goal.\nThe victory took Triangle to four points, level with CAPS United, but they still anchor the standings due to an inferior goal difference.\nAt Sakubva Stadium, Herbert Maruwa-coached TelOne recorded a massive comeback, rising from two-nil down to force a two-all draw against Manica Diamonds.",
            "time": "08:44",
            "date": "22 Apr 2025"
        }
    ]
}