{
    "news": [
        {
            "title": "Simba Bhora, FC Platinum clash in top-of-the-table showdown",
            "href": "https://www.zbcnews.co.zw/platinum-simba-in-battle-for-supremacy-as-psl-enters-crucial-campaign-half/",
            "content": "Story by Raynald Ngwarati\nDEFENDING Castle Lager Premier Soccer League champions and log leaders Simba Bhora will invade Mandava Stadium to face FC Platinum this afternoon in the headline fixture of Saturday’s PSL Matchday 18 encounters.\nFC Platinum who have gone for 16 games unbeaten so far in this campaign, will face their toughest hurdle against the log leaders, Simba Mbira who have been in sublime form picking up maximum points in their last three encounters.",
            "time": "08:45",
            "date": "29 Jun 2025"
        },
        {
            "title": "Zim to host South Africa in test series at Queens Sports Club",
            "href": "https://www.zbcnews.co.zw/zim-to-host-south-africa-in-test-series-at-queens-sports-club/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE is set to host South Africa in a two test match series beginning this Saturday at Queens Sports Club in Bulawayo\nThe Chevrons and the newly crowned World Test Champions have not played a test match in Zimbabwe for a decade with the last meeting coming in 2014.\nCaptain Craig Ervine will once again lead the side that boasts of experienced campaigners in Sean Williams, Richard Ngarava and inform Blessing Muzarabani.\nAll-rounder, Sikander Raza has once again opted out of the longest format, while opener Ben Curran will miss the two match series due to a finger injury\nHowever, bowler Trevor Gwandu is back after sustaining an injury just  before the one-off test in England.",
            "time": "08:45",
            "date": "29 Jun 2025"
        },
        {
            "title": "Zimbabwe basketball captain inspires students at school court inauguration",
            "href": "https://www.zbcnews.co.zw/zimbabwe-basketball-captain-inspires-students-at-school-court-inauguration/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE basketball national team captain, Vitalis Chikoko, who plays professionally for SIG Strasbourg in France, has challenged youngsters to work hard if they want to play at the highest level.\nHe made these remarks as he officially opened two multi-purpose courts at a local school in Harare this Saturday.\nThe lanky centre has been playing professional basketball for the past 15 years, having started his career in Germany.\nHe is currently based in France at SIG Strasbourg, where he has won two league titles and was named the Most Valuable Player in those championship runs.\nChikoko was the guest of honour at Maranatha High School, where he opened the new courts.\n“I played soccer and basketball when I was young, but basketball was always number one, I had injuries when I was growing up. When I was in high school, I broke my hand twice, but I never gave up. I played in high school, I played at Churchill, I played at Prince Edward. Sport is all about hard work, I want to challenge you to work hard and shun drugs and you can achieve your dreams,” said Chikoko.",
            "time": "08:45",
            "date": "29 Jun 2025"
        },
        {
            "title": "Zim boxers gear up for AUSC Region V games",
            "href": "https://www.zbcnews.co.zw/zim-boxers-gear-up-for-ausc-region-v-games/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe Boxing Federation (ZBF) is leaving no stone unturned in its quest to adequately prepare boxers for the African Union Sports Council (AUSC) Region V Games set for Namibia next month.\nFemale boxer, Glorious Moyo(21) was part of Zimbabwe’s Region V contingent in Malawi in 2022 but had a dismal show due to shoddy preparations.\nWith age now not on her side, Moyo says she will use the Gwanda boxing meet to expose budding boxers to the kind of competition they will face in Namibia next month in the Region V Games.\n“I was young then, but I am happy the federation has realised a need to adequately prepare our young boxers.”\nWith a record 10 wins and two losses, upcoming boxer, Sibusiso Phakathi, is relishing the challenge of protecting his record.\n“I have a good record that I want to protect, hence I have been making serious preparations for the national tournament.”\nBankrolled by the Hwange Colliery club, the national tournament is expected to put a limelight in Gwanda.",
            "time": "08:45",
            "date": "29 Jun 2025"
        },
        {
            "title": "Turmoil at Bosso: Acting CEO steps down days after coach Kaindu sacking",
            "href": "https://www.zbcnews.co.zw/turmoil-at-bosso-acting-ceo-steps-down-days-after-coach-kaindu-sacking/",
            "content": "Story by Mthokozisi Dube\nBULAWAYO giants Highlanders Football Club have been plunged into further turmoil following the resignation of Acting Chief Executive Officer, Kindman Ndlovu, just days before a crucial Castle Lager Premier Soccer League encounter against high-flying debutants, MWOS.\nHis departure comes barely a week after the sacking of head coach Kelvin Kaindu, signalling mounting instability at the revered Bosso camp.\nNdlovu tendered his resignation on Wednesday, citing what he described as a toxic working environment.\nIn a letter addressed to club chairperson, Kenneth Mhlope, Ndlovu indicated that he has worked under difficult circumstances for the past 10 weeks, claiming that an executive member, Nkani Khoza has been interfering with his work and trying to divide the club.\nInterim coach, Try Ncube, who replaced Kaindu, has his work cut to save the situation at the Bulawayo giants.\n“This week’s events affected us, especially on the first day, morale was down but we managed to raise morale in the boys and we have seen an improvement. We expect a win come Sunday,” he said.\nHighlanders are set to host MWOS at Barbourfields Stadium this Sunday in a match that carries both competitive and symbolic weight.\nBosso are keen to exact revenge on the newcomers, who stunned them in the season opener.\nElsewhere in the Premier Soccer League, Matchday 18 fixtures kick off on Saturday:\nTelOne vs Herentals – Ascot Stadium\nZPC Kariba vs Dynamos – Nyamhunga\nFC Platinum vs Simba Bhora – Mandava Stadium\nYadah vs Manica Diamonds – Heart Stadium\nBikita Minerals vs Chicken Inn – Gibbo\nNgezi Platinum vs Kwekwe United – Baobab",
            "time": "08:45",
            "date": "29 Jun 2025"
        }
    ]
}