{
    "news": [
        {
            "title": "Bikers join fight against drug abuse",
            "href": "https://www.zbcnews.co.zw/bikers-join-fight-against-drug-abuse/",
            "content": "Story by Raynald Ngwarati\nTHISSunday, the Zim Free Riders Motor Cycling Club, in collaboration with the Harare City Council, took decisive action against drug and substance abuse by hosting an awareness campaign in the high-density suburb of Mbare.\nThe initiative was aimed at educating the local community about the dangers posed by this widespread pandemic of drug and substance abuse.\nResidents of Mbare weregiven an opportunityto engage with bike culture as motorcyclists from across the capital gathered at theStodartComplex for the event.\nAs part of their 2025 Ghetto Ride, the Zim Free Riders attracted significant attention from the crowd, who were captivated by the powerful sounds and exhilarating displays of skill by the riders.\nWith nearly 50 motorcyclists participating, the youth in attendance expressed their enthusiasm for the thrilling performance, which they regarded as an essential part of the fight against drug abuse.",
            "time": "18:37",
            "date": "23 Feb 2025"
        },
        {
            "title": "SLIZ hosts forum on early development for sports directors and PE teachers",
            "href": "https://www.zbcnews.co.zw/sliz-hosts-forum-on-early-development-for-sports-directors-and-pe-teachers/",
            "content": "Story by Tamuka Charakupa\nTHE Sports Leaders Institute of Zimbabwe(SLIZ) recently hosted a forum for sports directors and physical education teachers at Mazvikadei Resort, focusing on the importance of early sports development.\nThe two-day workshop was aimed at empowering sports directors, physical education instructors, and arts teachers with the knowledge and skills necessary for effective sports development in schools.\nThe initiative comes in response to concerns that the country is struggling to compete and perform well on regional and international levels due to a lack of foundational sports principles.\n“We have organised this event as part of efforts to capacitate sports directors, coaches, and physical education teachers on the fundamental principles of sports development as a backbone to revive the success and performance of sports disciplines in the country,” the president of the Sports Leaders Institute of Zimbabwe, Russell Mhiribidi said.\nParticipants who included sports science academics underscored the importance of the capacitation workshop.\n“We have to consider long-term athlete development as a critical investment in growing the sports sector in the country as we are still lagging due to not implementing the latest models which advanced countries have already adopted,” NUST’s Sports Science lecturer, Mrs Precious Masaga said.\n“We are also interrogating the symbiotic relationship between sports and economics, looking at how we can commercialise sports to its full potential, recognising its role in the economic development of the country,” business developer, Dr Lucy Chamba noted.",
            "time": "18:37",
            "date": "23 Feb 2025"
        },
        {
            "title": "Dynamos win the Castle Challenge Cup",
            "href": "https://www.zbcnews.co.zw/dynamos-win-the-castle-challenge-cup/",
            "content": "Story by Raynald Ngwarati\nDYNAMOS have lifted the first silverware of the 2025 domestic league calendar after registering a 5-3 penalty win over Simba Bhora in the Castle Challenge Cup at Rufaro Stadium this Saturday.\nNot even the rains could stop the celebrations in Mbare as Chibuku Super Cup holders Dynamos certified themselves as cup kings by beating Premiership champions Simba Bhora 5-3 in the dreaded penalty shootout after the match ended one all in regulation time.\nSimba Bhora thought they would get the bragging rights after drawing first blood a couple of minutes after halftime courtesy of Ishe Mauchi, but Dynamos refused to be hurried with just three minutes of regulation time left on the clock as Clive Mandiveyi levelled matters to force extra time.\nWhile the rains dominated extra time, there was nothing to separate the two champions from last campaign forcing spot kicks.\nPlaying in their home stadium, Dynamos had a show to deliver for their fans, converting all of their spot kicks while Ishmael Nyanhi was denied by Dynamos goalkeeper Prince Tafiremutsa to send fans into a frenzy and kick-off the 2025 domestic season laden with a US$30 000 cheque.",
            "time": "18:37",
            "date": "23 Feb 2025"
        },
        {
            "title": "Zimbabwe’s Emmanuel Academy qualifies for the Junior Golf World Cup",
            "href": "https://www.zbcnews.co.zw/zimbabwes-emmanuel-academy-qualifies-for-the-junior-golf-world-cup/",
            "content": "Story by Lawrence Trusida, Sport Editor\nEMMANUEL Golf Academy has qualified for the 2025 Junior Golf World Cup after an impressive performance at the annual Kids Golf World Cup Qualifiers held this week at Seasons Eco Golf Estate in South Africa.\nThe academy, which consists of golfers from Emmanuel College, won two gold medals, one silver medal, and two bronze medals.\nA total of 64 golfers from 10 countries participated in the qualifiers, including hosts South Africa, the United Kingdom, France, China, Tanzania, Kenya, Botswana, Uganda, Zambia, and Zimbabwe.\nZimbabwe dominated the competition, winning all the medals in the Under 14 Girls category and securing another gold in the Under 15-18 Girls category.\nHowever, the Under 15 Boys team finished with a wooden spoon.\nThe patron of the academy, who also serves as the coach, expressed great delight at the team’s qualification for the World Cup.",
            "time": "18:37",
            "date": "23 Feb 2025"
        },
        {
            "title": "Mighty Warriors lose to Angola",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-lose-to-angola/",
            "content": "Story by Lawrence Trusida, Sport Editor\nThe Mighty Warriors have all to do in the reverse encounter of the Women’s Africa Cup of Nations qualifiers after going down 2-1 to Angola in the first leg played in Luanda this Thursday.\nZimbabwe started off the match on a bad note after conceding within the first minute following poor communication at the back.\nThe Mighty Warriors however did not rest on their laurels, as they sprang into action and started dominating play and knitting some good passes.\nTheir efforts were rewarded in the 25th minute after some good work on the flank from Ethel Chinyerere before she crossed for debutant Ruvimbo Mucherera who made no mistake tapping in from close range.",
            "time": "18:37",
            "date": "23 Feb 2025"
        }
    ]
}