{
    "news": [
        {
            "title": "ZOC elects new board, targets continental and global sporting success",
            "href": "https://www.zbcnews.co.zw/zoc-elects-new-board-targets-continental-and-global-sporting-success/",
            "content": "Story by Raynald Ngwarati\nZIMBABWE Olympic Committee (ZOC) president Thabani Gonye has been re-elected to lead the country’s Olympic body for a second successive term after edging Ringisai Mapondera 15-12 in a tightly contested election at a local hotel in Harare this Sunday.\nAfter a successful election this Sunday, the new ZOC board has shifted attention to turning manifestos into reality so as to take the country’s sports industry to greater heights.\nWith a shared vision of athlete development and support, the board has promised to put strategic frameworks in place to harness support for sport from the social and corporate sectors.\nIncumbent president Thabani Gonye who has been leading the Olympic body for the past four years, will continue implementing his vision after garnering the majority of the votes.\nSpeaking upon re-election, Gonye outlined the importance of collaboration with the losing candidates in a bid to foster the ultimate environment for sports growth in the country.\n“We need to embrace the diversity to embrace that, which will make us better and stronger. I want to appreciate and say, the vision is to start winning at the levels that we should be winning, we should be winning at the continental and world levels. We should be winning in the World Olympics,” he said.\nMeanwhile, former Head of ZBC’s Television Productions, Merit Munzwembiri was voted the second vice president of ZOC, serving alongside Fredrick Ndlovu, who was re-elected first vice president.\n“I have been serving as a board member in the gender office. From there I have seen and noticed a lot of things, which has prompted me to run for the vice president post in order to uplift women. The focus is not just on females in sport but also the female stakeholders for example the journalists also need to be empowered,” she said.",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Young Zimbabwean Golfers make country proud in Tunisia",
            "href": "https://www.zbcnews.co.zw/young-zimbabwean-golfers-make-country-proud-in-tunisia/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Under-18 Golf teams had an excellent outing at the All Africa Junior Team Championships in Tunisia with both the boys and girls achieving respectable finishes.",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "PSL Matchday 8 kicks off with Herentals College FC victory",
            "href": "https://www.zbcnews.co.zw/psl-matchday-8-kicks-off-with-herentals-college-fc-victory/",
            "content": "Story by Raynald Ngwarati\nMATCHDAY eight of the Castle Lager Premier Soccer League kicked off this Friday with bogey side Herentals College beating Green Fuel by a single goal at Rufaro Stadium.\nTino Benza was the hero for the students as they moved to nine points on the table to close in on the top ten.",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Zim names 40-man squad as Sables prepare to light up Zambezi Series",
            "href": "https://www.zbcnews.co.zw/zim-names-40-man-squad-as-sables-prepare-to-light-up-zambezi-series/",
            "content": "Story by ZBC Reporter\nTHE Zimbabwe Rugby Union has announced the 40-man squad selected for the Zambezi Series, which will see the Sables taking on regional rivals, Zambia and Botswana next month.\nThe spotlight has been given to local talent, with all selected players based in Zimbabwe and primed to carry the torch for the national team in front of the home crowd.\nThe campaign kicks off on May 4 when Zimbabwe faces Zambia at the Harare Sports Club, before clashing with Botswana on May 10 in the capital.\nIn a statement released by the ZRU this Saturday, team manager Takunda Chikofoyo expressed his confidence in the local-based players.\n“We took a short break from November last year after the international window and we were back at work in January. You can tell just from the commitment and work ethic that the boys want this more than ever.\n“Our locally based players have been working together and some great combinations have formed, we are pretty excited about Zambia and Botswana,” he said.\nThe team manager also called on the fans to throng the match venues in their numbers.",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Wellington Varevi clinches fourth consecutive Four-Minute Mile Challenge Title",
            "href": "https://www.zbcnews.co.zw/wellington-varevi-clinches-fourth-consecutive-four-minute-mile-challenge-title/",
            "content": "\nStory by Mthokozisi Dube\nREIGNING champion and Black Rhinos athlete Wellington Varevi successfully defended his title after winning the Four-Minute Mile Challenge for the fourth consecutive time in Bulawayo this Saturday.\nForty-two years on, the longstanding record set by United States-based Gray Mavhera remains unbroken. Varevi came close last year, finishing in 4 minutes and 11 seconds, just shy of the mark.\nThis year, Varevi crossed the line nine seconds slower than his previousattempt,but still managed to secure his fourth straight title.\nSpeaking after the race, he expressed confidence in achieving his personal goal of winning the challenge five timesin succession.\n“The race is losing competitionsoto break the recordweneed more competitions,” Varevi said.\nHe pocketed US$800 for the triumphwhilerunner-up Elihamabhunuwas ecstatic after a long layoff owing to injury.\n“I represent ZRPandcoming second is an achievement since I have missed this due to injury. I want to thank our CGP for allowing us to participate,” Mabhunu said.\nThe Bulawayo Athletics Board Chairperson, WatsonMadenyikasaid the four-minute mile challenge is a preparatory platform for upcoming events.\n“We want to thank Coca-Cola for sponsoring this race.Ourathletes had an opportunity to prepare for the inter-provincial championships coming to Bulawayo,” he said.\nThe four-minute mile challenge remains a permanent event on the athletics calendar.",
            "time": "06:38",
            "date": "28 Apr 2025"
        }
    ]
}