{
    "news": [
        {
            "title": "NASH athletes in camp ahead of competitions",
            "href": "https://www.zbcnews.co.zw/nash-athletes-in-camp-ahead-of-competitions/",
            "content": "Story by Tapiwa Machemedze\nALL is set for the National Association of Secondary Heads (NASH) track and field national championships which begin in Chipadze, Bindura this Wednesday.\nThe best secondary school athletes from every province in Zimbabwe have trooped into camp ahead of the competition.\n“I am competing in high jump, and I am very confident that I am going to bring medals for Harare province,” an athlete said.\n“I am a learner at Allan Wilson High School and I will be contesting in triple jump. My target is to bring medals home,” another athlete said.\nMashonaland Central Provincial Schools Inspector for Sports, Arts and Culture, Mr Tonderai Mushore said necessary infrastructure has been put in place to ensure successful hosting of the event.\n“As Mashonaland Central province, the hosts we are very ready, we are 100 % ready as you can see we have just completed putting markings on the tracks, pitching the tents. We are positive that all our athletes will be comfortable come rain or sunshine,” Mr Mushore said.",
            "time": "08:43",
            "date": "02 Apr 2025"
        },
        {
            "title": "Fading giants CAPS United host early pace-setters Ngezi Platinum Stars on Sunday",
            "href": "https://www.zbcnews.co.zw/fading-giants-caps-united-host-early-pace-setters-ngezi-platinum-stars-on-sunday/",
            "content": "Story by Lawrence Trusida, Sports Editor\nEARLY pace-setters, Ngezi Platinum Stars will have a test of their pedigree when they travel to Harare for a date against fading giants CAPS United in a Premier Soccer League match set for Rufaro Stadium this Sunday.\nHarare giants, Makepekepe have started the season slowly after winning just one of their four matches so far this season.\nThe Green Machine drew with Green Fuel and lost to Scottland and TelOne however they have managed a solitary victory against weeping boys, Triangle who have lost all of their matches this season.\nIn recent seasons, the club famously known as the Cup Kings, has been a pale shadow of itself, in the last five seasons they have only managed to finish in the top four once in 2019 when they secured the bronze medals.\nBaring that the Lloyd Chitembwe coached side has been consistently hovering around mid to lower table positions.\nTheir quest to re-asset their pedigree and a second win of the season does not get any better as they face former champions Ngezi Platinum Stars who have started the season strongly, securing three wins and a draw.\nThe two teams square off at Rufaro Stadium this Sunday in the peak of the weekend’s fixtures.\nAction however starts on Saturday with stuttering defending champions Simba Bhora hosting a buoyant TelOne at Wadzanayi, struggling Chicken Inn host Herentals at Luveve, while FC Platinum travel to Bata Stadium for a date against Kwekwe United.",
            "time": "08:43",
            "date": "02 Apr 2025"
        },
        {
            "title": "Women’s Premier Soccer League delayed by a week amid preparatory delays",
            "href": "https://www.zbcnews.co.zw/womens-premier-soccer-league-delayed-by-a-week-amid-preparatory-delays/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE start of the 2025 Women’s Premier Soccer League season has been delayed by a week due to the clubs’ lack of readiness, the league’s administrators have said.\nThe highly anticipated season was scheduled to kick off this weekend, with many looking forward to witnessing the country’s top female footballers in action.\nHowever, the games will only start a week as clubs get more time to prepare and also pay affiliation fees.\n“We have now prioritised giving them the necessary support to ensure a successful league,” Women Premier Soccer League spokesperson, Arthur Gurajena said.",
            "time": "08:43",
            "date": "02 Apr 2025"
        },
        {
            "title": "Kwekwe Chahwanda Stadium construction on track for completion",
            "href": "https://www.zbcnews.co.zw/kwekwe-chahwanda-stadium-construction-on-track-for-completion/",
            "content": "Story by Tafara Chikumira, Midlands Bureau Chief\nCONSTRUCTION works at Chahwanda Stadium in Kwekwe are progressing well, with contractors confident that all works will be completed by the end of this month.\nContractors are aiming to meet all the requirements of the Confederation of African Football (CAF) to be able to host international matches, and they are confident that the plans to officially open the facility with a match pitting Zimbabwean legends against African legends next month will take place.\n“What I can assure the nation is that 35 days from now, this stadium will be operational,” Project Spokesperson, Prophet Walter Magaya said.\n“We are very excited that the ZIFA president and his team have graced this place and have given us assurances that he will be bringing in some officials from CAF to come and inspect this stadium for considerations on international matches.”\n“We now have all the materials on-site and we are already at around 60 to 70% completion. Major works like foundations and steel works are already done, and we are good to go.”\nThe Kwekwe community is excited by the prospect of watching professional football in the city, while others are already benefiting from the job opportunities that have been created by the project.\n“I foresee this place poised for massive transformation as this facility will certainly change the game. I heard them asking for an airport; consider it done,” traditional leader, Chief Gwasela said.\n“I am very happy with this development, now we are going to be watching the Premier League locally. We used to travel to Bulawayo and Harare for such matches, but now we have just been remembered,” a football fan said.\n“This project has brought us the much-needed jobs. We are now working here and we look forward to more opportunities,” a beneficiary from the project said.\nMeanwhile, the government commended the investors for assisting in national development.",
            "time": "08:43",
            "date": "02 Apr 2025"
        },
        {
            "title": "PSL new-boys MWOS, SCOTTLAND mean business",
            "href": "https://www.zbcnews.co.zw/psl-new-boys-mwos-scottland-mean-business/",
            "content": "Story by Mthokozisi Dube\nDEBUTANTS, Scottland, and MWOS are holding their fort in the Castle Lager Premier Soccer League after finding themselves within the top four bracket after four rounds of matches.\nThe evolution of Scottland and MWOS has remained a topical subject in football circles with the two sides taking the Premier Soccer League by storm.\nIt might still be early days but the two sides really mean business and on Sunday, Scottland held Highlanders to a one-all draw at Barbourfields Stadium a day after MWOS had forced a scoreless draw at FC Platinum.\nThe results saw MWOS holding onto second position with eight points, two behind leaders Ngezi Platinum Stars, while Scottland are fourth with seven points.\nIt has also not just been about the results with Mabvuku-based Scottland offering a new dimension to the beautiful game.\nMabvirabvira continue to attract big crowds and Sunday’s away blockbuster to Bulawayo giants, Highlanders was no exception as Barbourfields stadium was packed to the brim.\nThe usual sea of black and white was there, so was the blue of Scottland.\n“As Scotland, we are here for the good of the game. We had to travel all the way from Victoria Falls to cheer our team. It was a good game of football and we are happy both sets of fans behaved well. This is what we want in football,” a soccer fan said.\n“Football should unite us. We want stadiums to be packed not necessarily for games involving Scottland. We want our game to improve,” another soccer fan said.\nScottland savaged a point to cancel what looked like three points in the bag for Bosso and club Secretary General Fortune Bgwoni says they mean business in their debut season.\n“The match had a lot of tension but we are happy to note the maturity by football fans. they now understand that football is business players come and go. As Scotland we are happy we have changed the football terrain . as you saw our matches are drawing big crowds but our passionate plea is to have those numbers in all PSL matches,” he said.\n“The atmosphere was electric, our boys played well and you could understand the pain of a stalemate for a player like Arthur who was exceptional the entire 90 minutes,” Highlanders, former vice chairperson, Mordern Ngwenya.\nWhile the new boys are enjoying life in top-flight returnees, Triangle are having a torrid time.\nLuke Masomere’s side, who anchor the log, the Sugar-Sugar boys have received a baptism of fire, becoming a punching bag for all, losing all their four outings so far.\nBikita Minerals, Chicken Inn, and debutants Kwekwe United occupy the other bottom four positions.",
            "time": "08:43",
            "date": "02 Apr 2025"
        }
    ]
}