{
    "news": [
        {
            "title": "Zim hosts African Handball leader as Zone Six championship begins",
            "href": "https://www.zbcnews.co.zw/zim-hosts-african-handball-leader-as-zone-six-championship-begins/",
            "content": "\nStory by Lawrence Trusida, Sports Editors\nTHE president of the African Handball Confederation, Dr Mansourou Aremou is in Harare for the Zone Six Handball championship which started this Thursday at the Chitungwiza Aquatic Complex.\nDr Aremou arrived in the capital this Thursday for a series of meetings as well as attending the Zone Six Handball championship.\n“We are fighting to have a good place for Handball on the continent, the starting point is to develop the sport in schools then we also go for the Youth Handball and these are some of the talks I am expecting to have with the federations,” he said.",
            "time": "08:44",
            "date": "02 May 2025"
        },
        {
            "title": "Machope heads Scottland to victory",
            "href": "https://www.zbcnews.co.zw/machope-heads-scottland-to-victory/",
            "content": "Story by Lawrence Trusida, Sports Editor\nSCOTTLAND returned to winning ways after edging Herentals one-nil in a low-key Harare Derby played at Rufaro Stadium this Thursday.\nThe Mabvuku-based side had endured a three-match winless streak, settling for draws in each fixture. However, they finally secured a hard-fought victory, albeit under pressure from a spirited Herentals outfit.\nHerentals were pumped up and wanted the victory and created clear cut chances in the first half, but Tino Benza was not at his best to utilise the opportunities.\nScottland quickly made the changes early in the second half which paid dividend after Tymon Machope found the back of the net in the 57th minute.\nThe goal sealed the points for Scottland even though Herentals got some chances later.\n“Good display especially in the second half and we manged to get the goal and the victory after a spate of draws,” Scottland coach Tonderai Ndiraya said.",
            "time": "08:44",
            "date": "02 May 2025"
        },
        {
            "title": "Sports, health and solidarity mark Workers’ Day in Masvingo",
            "href": "https://www.zbcnews.co.zw/sports-health-and-solidarity-mark-workers-day-in-masvingo/",
            "content": "Story by Mercy Bofu-Matinha\nAS the country joined the rest of the world in marking May Day, workers around the country celebrated the day in style through sports tournaments.\nIn Masvingo, it was a day marked with various sporting activities including marathon, walking competition, soccer, basketball, netball, aerobics, darts and pool games as Bikita Minerals employees commemorated Workers Day.\nWorkers say the tournament dubbed, “Bikita Minerals Sports Gala” gave them an opportunity to interact and prioritise health issues.\n“Today is an important day not only to workers at Bikita Minerals, but to workers all over the world. It is a day to recognise the many contributions workers have made in various sectors of the economy. As Bikita Minerals workers, we recognise the effort that has been done by our employer to organise a sporting tournament for us. We have had a chance to interact, play games, and check on our health through having access to different healthcare practitioners,” Zimbabwe Diamond and Allied Minerals Workers Union, Mr Rodrick Tavarwisa said.",
            "time": "08:44",
            "date": "02 May 2025"
        },
        {
            "title": "Rugby development gains ground in Manicaland Province",
            "href": "https://www.zbcnews.co.zw/rugby-development-gains-ground-in-manicaland-province/",
            "content": "Story by Kenias Chivuzhe\nRUGBY continues to grow in Manicaland province following years of disturbances especially due to the COVID-19 pandemic.\nWith Mutare Sports Club having been the only recognised franchise in Manicaland Province before the COVID-19 era, a lot of interest generated during the past few years has widened the growth potential for the sport code which for a long time was considered an elitist sport.\nManicaland Rugby Board Chairperson, Mos Kaphuma spoke on the strides made in the province starting with the launch of the Senior Rugby League for men and women before the introduction of under-20 rugby tournaments last year.\n“Rugby is gradually developing in Manicaland and last year we started under 20 provincial leagues without any sponsorship. We are in our second edition and we managed to get sponsorship covering ambulance, medicals, referees’ fees and price money at the end of the season,” he said.\n“We have been trying to spread our net wide so that we help with the development of the game at the under-20 level. We are hoping to increase the number of teams next year. The senior league is starting on May 17 and it has both men and women. In the under-20 league, we have five boys’ teams and four girls teams. Next year we are targeting to increase the teams to 14, meaning we will have a team in every district in the province.\n“In the senior’s league, we currently have six teams for men and five teams for women. The senior league starts in May and ends in September. The senior league started in 2023 and in a space of few years we managed to grow the clubs from one to nine,” Kapumha said.\nBoth the rugby board and teams have a shared belief in the bright prospects of the sport.",
            "time": "08:44",
            "date": "02 May 2025"
        },
        {
            "title": "Ideal View headlines this year’s Castle Tankard",
            "href": "https://www.zbcnews.co.zw/ideal-view-headlines-this-years-castle-tankard/",
            "content": "Story by Lawrence Trusida, Sports Editor\nIDEAL View headlines the pack at this year’s Castle Tankard set to take centre stage on 10 May, after the unveiling of the event held this Tuesday at Borrowdale Park in Harare.\nA total of 16 horses will compete for the US$50 000 prize in the 65th edition of the Castle Tankard after the final acceptance held this Wednesday.\nThe Castle Tankard stands as Africa’s oldest sponsored horse race and is the country’s only Grade One competition run over two thousand metres.\nIdeal View of the Debra Swanson stable is the odds-on favourite for the race, but Bridget Stidolph who produced last year’s winner is looking to shock the park.\n“I have two horses this time, last year we had Waffles, which was on top of her game and the plan worked. This year I do not have the favourites for this race, but we are preparing well enough and my horses this time have no weight and they are now experienced over the distance, so we could surprise one or two people,” Stidolph said.\nStidolph has Wantage, which finished third last year and Citrusdal for this year’s race, which is heavily tipped to go in the direction of Ideal View, while Jaeger Moon, Abayyaan and Majestic Warrior are expected to pose a threat.",
            "time": "08:44",
            "date": "02 May 2025"
        }
    ]
}