{
    "news": [
        {
            "title": "UEFA Champions League Trophy Tour reaches Victoria Falls with Schweinsteiger",
            "href": "https://www.zbcnews.co.zw/uefa-champions-league-trophy-tour-reaches-victoria-falls-with-schweinsteiger/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Union of European Football Associations (UEFA) Champions League Trophy Tour has arrived in Victoria Falls, accompanied by legendary former Bayern Munich midfielder Bastian Schweinsteiger.",
            "time": "06:09",
            "date": "03 May 2025"
        },
        {
            "title": "Zimbabwe through to the final of the IHF Zone Six",
            "href": "https://www.zbcnews.co.zw/zimbabwe-through-to-the-final-of-the-ihf-zone-six/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE Under-18 girls’ handball team has qualified for the final of the International Handball Federation (IHF) Zone Six Trophy after a thrilling 33–27 victory over neighbours South Africa at the Chitungwiza Aquatic Complex on Friday.\nIn a tightly contested match, the Zimbabwean side displayed remarkable composure and tactical discipline to overcome a formidable South African team.\nThe hosts made a commanding start, surging into an early lead and maintaining control throughout the match. Despite late pressure and signs of nervousness in the closing minutes, Zimbabwe’s girls held firm to seal their place in the final.",
            "time": "06:09",
            "date": "03 May 2025"
        },
        {
            "title": "Platinum Royals target fourth consecutive win as they lock horns with Red Buffalos Academy",
            "href": "https://www.zbcnews.co.zw/platinum-royals-target-fourth-consecutive-win-as-they-lock-horns-with-red-buffalos-academy/",
            "content": "Story by Courage Bushe\nPLATINUM Royals are leaving nothing to chance in their quest to win their fourth consecutive game in the Women Premier Soccer League.\nDubbed the David versus Goliath affair this Saturday, Vengere Stadium will be the centre of attraction as in-form Platinum Royals lock horns with Red Buffalos Academy.\nThe Pure Platinum Play Ladies who are having a good start to the season are yet to taste defeat and concede.\n“In the past three games, we have been doing well, and it is boosting our confidence every passing day, and we are hoping for a better outing this Saturday. Everyone is there, no injuries to talk about, and we are raring to go. We know the challenges we will face over the weekend, but we are very prepared for anything. This is a game of football and we want maximum points,” Platinum Royals Assistant Coach, Blessing Govati said.",
            "time": "06:09",
            "date": "03 May 2025"
        },
        {
            "title": "Ndiraya shows respect for DeMbare",
            "href": "https://www.zbcnews.co.zw/ndiraya-shows-respect-for-dembare/",
            "content": "\nSCOTTLAND FC coach Tonderayi Ndiraya has shown some measure of respect for Dynamos ahead of the two sides clash in matchday 10 of the 2025 Castle Lager Premier Soccer League at Rufaro Stadium on Sunday.\nDespite their dismal form since the start of the season, which has seen the “Glamour Boys” firing blanks – registering just one win in as many matches – Stanza as Ndiraya is affectionately known says he is not reading into that hence the need for his charges to approach the Sunday duel with respect.\nStanza’s sentiments came in the aftermath of his side’s narrow 1-0 win over Herentals at Rufaro Stadium on Worker’s Day.\n“Dynamos will always be Dynamos despite how and who will be playing there at that particular period. We have to remain focused and be at our best if we are to grind the desired dent.\n“The club remains big and their history speaks volumes of the magnitude of the club hence the need for us to keep our heads down. Look Dynamos managed to get a point from Greenfuel after the long journey and that means they are not as bad as people think,” said Ndiraya.\nThe Scottland FC gaffer also highlighted that the huge fan base that DeMbare enjoys plays a critical role in pushing the team especially during these trying times for the club.",
            "time": "06:09",
            "date": "03 May 2025"
        },
        {
            "title": "Zim hosts African Handball leader as Zone Six championship begins",
            "href": "https://www.zbcnews.co.zw/zim-hosts-african-handball-leader-as-zone-six-championship-begins/",
            "content": "\nStory by Lawrence Trusida, Sports Editors\nTHE president of the African Handball Confederation, Dr Mansourou Aremou is in Harare for the Zone Six Handball championship which started this Thursday at the Chitungwiza Aquatic Complex.\nDr Aremou arrived in the capital this Thursday for a series of meetings as well as attending the Zone Six Handball championship.\n“We are fighting to have a good place for Handball on the continent, the starting point is to develop the sport in schools then we also go for the Youth Handball and these are some of the talks I am expecting to have with the federations,” he said.",
            "time": "06:09",
            "date": "03 May 2025"
        }
    ]
}