{
    "news": [
        {
            "title": "ICC Chairperson arrives in Zim for high-level meetings",
            "href": "https://www.zbcnews.co.zw/icc-chairperson-arrives-in-zim-for-high-level-meetings/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nTHE International Cricket Council (ICC) Chairperson Jay Shah has arrived in Zimbabwe for a series of ICC meetings beginning this Thursday in Harare.\nZimbabwe is set to host a series of ICC meetings in Harare and Victoria Falls beginning this Thursday.\nApart from the ICC Chairperson, all the leaders of all cricket-playing nations are in Zimbabwe for a series of meetings in the capital, which will culminate in a full board meeting set for Victoria Falls.\n“I am pleased to be in Zimbabwe, we are looking forward to fruitful engagements with Zimbabwe after our ICC meetings. We want Zimbabwe to be back to where it was and producing big talents like the Flower brothers,” Shah said.\nZimbabwe has hosted international events like the World Cup Qualifiers and co-hosted the 2003 World Cup, however, this is the first time the country is hosting the full ICC board meeting since attaining test status in 1992 and Zimbabwe Cricket views this as an endorsement of the country as a safe sporting destination.",
            "time": "06:10",
            "date": "11 Apr 2025"
        },
        {
            "title": "Jere rallies CAPS United ahead of Highlanders clash",
            "href": "https://www.zbcnews.co.zw/jere-rallies-caps-united-ahead-of-highlanders-clash/",
            "content": "Story by Lawrence Trusida, Sports Editor\nCAPS United president, Farai Jere believes his team will rise to the occasion when they face Highlanders in the first edition of the Battle of the Cities slated for Barbourfields Stadium on Sunday.\nThe Battle of the Cities looms with the two main actors Highlanders and CAPS United not at their imperious best.\nMakepekepe are in the bottom three with a mere four points from five matches, Bosso are not much better either as they have six points ahead of the eagerly anticipated match.\nCAPS United go into the match with their back against the wall after a mini-protest by their fans after the defeat to Ngezi Platinum Stars last Sunday, but club president Jere believes their time is now.\n“This is the time when you will see the true CAPS United starting with the Highlanders match, yes we have not started well but we will rise in matches like these and I believe that will spur us onto good things, we have one of the best squads and we are still holding onto our targets,” Jere said.",
            "time": "06:10",
            "date": "11 Apr 2025"
        },
        {
            "title": "WPSL set to kick-off with Bulawayo derby between Highlanders Royals and MPOSA",
            "href": "https://www.zbcnews.co.zw/wpsl-set-to-kick-off-with-bulawayo-derby-between-highlanders-royals-and-mposa/",
            "content": "Story by Mthokozisi Dube\nTHE Women’s Premier Soccer League (WPSL) is set to commence this Saturday, with one of the most anticipated fixtures being the Bulawayo derby between Highlanders Royals and newly promoted Mpopoma Sports Academy (MPOSA).\nMPOSA, an ambitious side, is aiming for a strong start in their inaugural season.\nThis fixture, while traditionally viewed as a standard encounter, takes on added significance as MPOSA has seen a number of players return to their parent clubs following their loan spells.\nNotably, former loan player Patience Ndlovu, a Mighty Warriors forward, made her return to Highlanders last season and will be missing from MPOSA’s ranks.\nNdlovu remains optimistic about her former side’s prospects.\n“It is a big game, derbies are unpredictable but the girls are raring for the challenge. I have been advising them that it is a normal game,” Ndlovu said.\nMPOSA roped in Evans Neta who had a successful stint with the now defunct Bulawayo Queens as their head coach.\n“We respect Highlanders. They are a good side but we remain hopeful. We will come out with a positive result. We have had preparations to polish the side and the girls are raring to go,” Neta said.",
            "time": "06:10",
            "date": "11 Apr 2025"
        },
        {
            "title": "BUZ empowers local referees through FIBA level-one course",
            "href": "https://www.zbcnews.co.zw/buz-empowers-local-referees-through-fiba-level-one-course/",
            "content": "Story by Mthokozisi Dube\nTHE Basketball Union of Zimbabwe has moved in to capacitate local referees after organising a four-day Federation of International Basketball Associations (FIBA) sanctioned level-one officiating clinic in Bulawayo.\nJunior referees from across the six basketball-playing provinces are attending the course meant to equip them with the revolving laws of the game.\nThe facilitator of the clinic, Tanzania’s Zulfikar Karim said the enthusiasm displayed by officials in attendance will aid in the development of the game.\n“It is a big week here in Zimbabwe. The officials are keen to learn and we hope this will improve the game. The officials are grasping new laws of the game and we hope this will spread to the lower levels,” Karim said.",
            "time": "06:10",
            "date": "11 Apr 2025"
        },
        {
            "title": "Battle of the cities, Highlanders set to clash with CAPS United at Barbourfields Stadium",
            "href": "https://www.zbcnews.co.zw/battle-of-the-cities-highlanders-set-to-clash-with-caps-united-at-barbourfields-stadium/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Battle of the Cities has for so long been a platform for beautiful football, with the clash between Highlanders and CAPS United erupting at Barbourfields Stadium on Sunday.\nNever mind the two teams’ waning fortunes in recent years, the match is still one of the most anticipated in the land and never disappoints.\nThe clash produces heroes and villains and over the years, it has written many memories in the minds of spectators.\nThe back-to-back league clashes of 2004 stand out when the two teams played an exciting three-all draw at Barbourfields before Bosso edged Makepekepe 4-3 at the National Sports Stadium in the reverse encounter.\nEven though the Green Machine went on to win the league that year, on the fateful day, Tapuwa Kapini was the hero while Witness Munkuli was the villain.\nMany such encounters have happened over the years and this Sunday more of the same is expected as the two age-old giants clash, even though they seem to be fading, they usually save the best when they meet.",
            "time": "06:10",
            "date": "11 Apr 2025"
        }
    ]
}