{
    "news": [
        {
            "title": "Aspiring ZIFA Committee member Sharif Mussa calls for integrity",
            "href": "https://www.zbcnews.co.zw/aspiring-zifa-committee-member-sharif-mussa-calls-for-integrity/",
            "content": "Story by Lawrence Trusida, Sports Editor\nLONG-serving football administrator Sharif Mussa, who aspires to be on the ZIFA Executive committee, believes integrity is key to driving Zimbabwean Football forward.\nMussa has been in the game for close to to thirty years, starting off as a volunteer at the 1995 All Africa Games before having a long distinguished stint as Warriors manager.\nNow, he is a CAF match coordinator.\nMussa who is vying for a position in the ZIFA Executive committee believes integrity is key in driving football forward.\n“We can have integrity in the association, which I stand for, we can have good facilities and everything else in place, but if you are not winning, then the value ceases to be seen. At the end of the day, what we all want to see is a corrupt-free system that protects the integrity of the game.\n“I think we need a sound dispute resolution set-up to avoid letting football issues be taken elsewhere. That removes credibility and damages the game’s reputation, so to say, and obviously, sponsors do not want to be associated with something that has got a tainted image for obvious reasons,” he said.\nMussa also believes his experience as a servant of the game is key in helping the new board.",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Harare’s Mufakose Area A hosts anti-drug abuse event, honours luminaries",
            "href": "https://www.zbcnews.co.zw/harares-mufakose-area-a-hosts-anti-drug-abuse-event-honours-luminaries/",
            "content": "Story by ZBC Reporter\nThe Mufakose community in Harare came alive with the Mufakose Lodza Challenge Match, Fun Day, and Award Ceremony held this weekend to honour past and present sports personalities who hail from the area.\nZimbabwe soccer star Khama Billiat alongside Zimbabwe multi-award winning martial artist Shihan Wilfred Mashaya, a.k.a Zim Ninja, graced the event as Guest of Honor and Special guest respectively.\nThe event was organised by Lloyd Muchaka alongside Charles Thole as the coordinator/convenor and the Mufakose Area A Technical/organising team.\nKhama and Mashaya were selected by the organisers as role models and achievers par-excellence who grew up in Mufakose so that they would inspire the community that nurtured them, especially imparting critical life lessons to the youths.\nBoth Mufakose Area A locals and diasporans played an important role in contributing to the success of the event united by one common goal of spreading Love, unity, and oneness. It was also a day of appreciating the Mufakose Area A legends as well as encouraging and inspiring the ghetto youths to live exemplary lives as inspired by guests Billiat and Mashaya.\nIt was indeed a fun day for the community, with Area A soccer legends like Lloyd Muchaka, Edgar Tapera, and other greats participating. The main match was dubbed the Lodza Challenge Match, pioneered by Lloyd Muchaka with the help of the organising team.\nIt ran under the theme, ‘No to drugs and substance abuse, No to child marriages, Respect the girl child; Promotion of good morals and talent, Promotion of health and wellness’.\nTendai Primary School provided the first session of entertainment, as co-hosts of the Lodza Challenge Matches. The first match was between the runners-up and the winners of the Charles Kaseke Tournament. Tendai Strikers won 17 -16 on penalties after the teams had drawn 1-all during regulation time.\nThe second challenge match was between hosts Area A Football Club and Friends of Lodza yesteryear select. It included former premier soccer league players the likes of Silver Bhebhe, Dominic Kampira, Saba Black and Brain “Nyozo” Munyani, and Siriro a.k.a. Sidza, among others. The select emerged 3-2 winners after a gruesome encounter.\nThe second round of proceedings was held at Chamimuka Community Centre (Area A). Security personnel were kept busy as the crowd blocked the pathway when Guest of honour Khama Billiat and special guest Wilfred Mashaya arrived. All wanted to have a selfie or photo with the two superstars. Khama’s parents also graced the occasion and were part of the invited guests.\nSpectators were also treated to breathtaking entertainment by Special guest Zim Ninja as he gave a glimpse of world-class martial arts displays to the cheering multitude ululating and embracing their child.\nIt was a homecoming celebration as Zim Ninja was raised a stone’s throw away from the venue.\nThe main event was the AREA A AWARDS, where the community honoured their sons and daughters, past and present, who have put Mufakose Area A on the map and have done exceptionally well in different fields ranging from sport, arts, academics, and business.\nKhama Billiat had the honour of presenting the awards to the Mufakose Area A winners, as Mashaya and Peter Nyamande walked away winners in the sports category as Current Sportsperson and Yesteryear Sportsperson respectively.\nThe Arts Award went to Charles “Akoma” Thole, while the late Josephat Masters and Mudiwa Nyamuswa were honoured in the business category. Professor Oliver Mutapuri scooped the academics award.",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Zim referee Brighton Chimene elevated to FIFA Elite B class",
            "href": "https://www.zbcnews.co.zw/zim-referee-brighton-chimene-elevated-to-fifa-elite-b-class/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZimbabwe’s top referee, Brighton Chimene has been elevated to the ‘Elite B’ class on the FIFA panel after a stellar season on the local and regional front.\nThe Rusape-based match official was busy on the international front last year, overseeing the 2026 FIFA World Cup Qualifier between Libya and Mauritius, 2025 AFCON Qualifier featuring Tanzania and Guinea as well as the CHAN Qualifier between Angola and Lesotho.\nApart from national team assignments, Chimene was also in charge of a CAF Champions League match pitting Arta Solar of Djibout and Dekadaha of Somalia.\nChimene also officiated at the COSAFA senior men tournament as well as the COSAFA U20 and U17 championships and the Four Nations tournament in Malawi.\nThe reigning Zimbabwean referee of the year has now been elevated to the Elite B class on the FIFA panel.\nZIFA Referees Manager Joshua Tigere said, “This is a significant rise, this means that he is one level below referees who officiate at the World Cup. He is now eligible to officiate at AFCON and CHAN tournaments effectively he can now take charge of any international match but for logistics sake, CAF just limits them to officiating in Africa.”\nThe four-time referee of the year’s elevation, however, comes a little bit late as the list of officials set to take charge at the upcoming CHAN tournament has already been released.",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Basketball legend Ngoni Mukukula laid to rest",
            "href": "https://www.zbcnews.co.zw/basketball-legend-ngoni-mukukula-laid-to-rest/",
            "content": "Story by Lawrence Trusida, Sports Editor\nBasketball legend Ngoni Mukukula who died Sunday has been laid to rest at Glen Forest Memorial Park in Harare.\nThe heavens have opened, and the rains have been pounding but that did not deter multitudes from mourning the departed basketball legend Ngoni Mukukula.\nThey say your works follow you to the grave and that has been proven to be true as a cross-section of sporting personalities gathered at Glen Forest Memorial Park to pay their last respects.\nGovernment officials, sports administrators and professionals descended at the graveside of a man who contributed so much to the development of basketball in Zimbabwe.\nHis works prompted the government to accord a state-assisted funeral for Mukukula who passed away on Sunday.\nSpeaking at the church service that was held earlier in the day, the Deputy Minister of Sport, Recreation, Arts & Culture Honourable Emily Jesaya challenged the basketball community to emulate Mukukula.\n“Look at the people who are in this church, all respected people some of whom have never been to Dzivaresekwa, but they all decided to be here to honour someone who worked hard to take basketball to the masses and he did not end there, he made sure it was continuously played. This is a fest that we should all strive to follow and build our country,” said the Deputy Minister.\nHoops 4 Hope Founder, Mark Crandal who worked closely with Mukukula on various programmes flew from New York, United States to pay his last respects.\nHe said, “You are mourning and I can tell you that you are not alone the whole of Africa and the world over are mourning the loss of Ngoni. 30 years ago, I met him and he only wanted to make sure that all the kids have access to play basketball and he also made sure they have equipment. He changed the face of basketball in Zimbabwe.”\nMukukula played a stellar role in the development of basketball in the country especially in high-density suburbs.",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "PSL season set to kick off end of February",
            "href": "https://www.zbcnews.co.zw/psl-season-set-to-kick-off-end-of-february/",
            "content": "Story by Muthokozisi Dube\nTHE 2025 Premier Soccer League season is expected to start at the end of February with the Castle Challenge Cup pitting PSL Champions Simba Bhora and Dynamos who won the Chibuku Super Cup.\nPSL spokesperson Kudzai Bare revealed in a telephone interview that a proposal was sent to the PSL Board of Directors at the last meeting for ratification.",
            "time": "06:27",
            "date": "14 Jan 2025"
        }
    ]
}