{
    "news": [
        {
            "title": "Mauchi itching to make his debut ahead of Warriors WC qualifiers",
            "href": "https://www.zbcnews.co.zw/mauchi-itching-to-make-his-debut-ahead-of-warriors-wc-qualifiers/",
            "content": "Story by Mthokozisi Dube\nTHE Warriors are settling in well in Durban, South Africa, as they prepare for Thursday’s crucial World Cup qualifier against Benin at Moses Mabhida Stadium.\nOn Monday, the team began their preparations with a light training session in the coastal city, focusing on acclimatising to the conditions ahead of the high-stakes match.\nSimba Bhora defender Isheanesu Mauchi, is eager to make an impact after earning his call-up to the Zimbabwe national team.\nThe young defender, who has impressed in the local league, is relishing the opportunity to play alongside some of Africa’s finest talents.\n“It is an exciting feeling to be surrounded by exceptional players, both local and international players. The team is a bunch of cool guys, pretty calm, and pretty welcoming, there is no feeling like I am the new guy, it is just a whole family, a brotherhood. I am hoping to put my best foot forward,” he said.\nWarriors forward Prince Dube, who has asserted himself as a gunslinger in Tanzania, is optimistic Thursday’s hunt will rekindle prospects of World Cup qualification.\n“For today, it was most light training after a long journey. I think the way we finished we need to continue from where we left and make the nation proud. Our team is made up of quality players and we have more experienced players, if we believe in ourselves we can do well,” he said.",
            "time": "18:43",
            "date": "18 Mar 2025"
        },
        {
            "title": "Sables sharpen skills in South Korea ahead of Rugby Africa Cup showdown",
            "href": "https://www.zbcnews.co.zw/sables-sharpen-skills-in-south-korea-ahead-of-rugby-africa-cup-showdown/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE Zimbabwe national rugby team, the Sables, are using their tour of South Korea to prepare for the upcoming Rugby Africa Cup in Uganda.\nThe team’s exposure to top-level competition in South Korea has been further enhanced by the inclusion of Brendon Mudzekenyedzi and Dylan Utete in the match-day squad for Okman Rugby Club, a rising force in the Korea Super Rugby League.",
            "time": "18:43",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mount Darwin’s Agama FC targets Division One tittle and Premier League spot",
            "href": "https://www.zbcnews.co.zw/mount-darwins-agama-fc-targets-division-one-tittle-and-premier-league-spot/",
            "content": "Story by Tapiwa Machemedze\nMOUNT Darwin-based side, Agama Football Club is targeting to win the Northern Region Division One League and gain promotion into the Premier Soccer League after enlisting the services of experienced coach, Arthur Tutani.\nThe club’s players have expressed optimism about clinching this year’s Northern Region Division One League to ascend to the premiership.\n“Last year, we came in Division One and we were underdogs, we surprised a lot of people. We worked tirelessly and have been training hard in the pre-season,” the team’s captain, Cain Mashonganyika said.\nTutani a renowned coach is, however, being cautious in his ambitious plans.\n“I joined them late last year, the team was in the top five and they slipped one place below. It is a bit early to plan for the championship but it’s work in progress.  The realistic objective is to finish in the top three, but winning the championship will be a bonus,” he said.\nThe club held a fundraising dinner at the weekend, targeting to raise over US$100 000 to beef up their war chest as they chase victory.\n“Currently, the team has no sponsor, we are surviving by mercy and little funds from the founder and club president, Malvin Moyo. The community has been chipping in here and there. As you know, football is an expensive business, that is why we have hosted the fundraising dinner and player unveiling ceremony to mobilise funds,” the team’s Secretary General, Entrodge Usayi said.",
            "time": "18:43",
            "date": "18 Mar 2025"
        },
        {
            "title": "Hwange set to host NAPH national athletics finals, paving the way for COSSASA selection",
            "href": "https://www.zbcnews.co.zw/hwange-set-to-host-naph-national-athletics-finals-paving-the-way-for-cossasa-selection/",
            "content": "Story by Mthokozisi Dube\nBATTLE lines have been drawn for the National Association of Primary Heads (NAPH) athletics finals, which begin in Hwange this Tuesday.\nThe journey to select athletes to represent team Zimbabwe at the upcoming Confederation of Schools Sports Association Games (COSSASA) games set for April in Eswatini begins with the three-day NAPH national athletics meet.\nTen provinces will fight for honours at the competitions pencilled for Colliery Stadium.",
            "time": "18:43",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mutudza earns CAPS United’s first victory of 2025 Castle Lager Premier Soccer League season",
            "href": "https://www.zbcnews.co.zw/mutudza-earns-caps-uniteds-first-victory-of-2025-castle-lager-premier-soccer-league-season/",
            "content": "Story by Raynald Ngwarati\nHARARE giants CAPS United secured their first victory of the 2025 Castle Lager Premier Soccer League season after beating Triangle by two-goals to nil at the Green Fuel Arena this Sunday.\nNew signing Juan Mutudza, starting for the first time, was in sublime form for CAPS United, getting off the mark in style with a brace against Triangle.\nMutudza scored his double in a space of eight minutes in the first half and was enough to settle the match for the Green Machine.",
            "time": "18:43",
            "date": "18 Mar 2025"
        }
    ]
}