{
    "news": [
        {
            "title": "Warriors fans celebrate Musona’s return",
            "href": "https://www.zbcnews.co.zw/warriors-fans-celebrate-musonas-return/",
            "content": "Story by Anashe Murombedzi\nLOCAL football fans are excited following the return of former captain Knowledge Musona into the Warriors fold and are eagerly anticipating his impact on the team.\nMusona’s return to the Warriors is a dream come true for fans who were left heartbroken when he announced his retirement from international football in 2022.\nThe news of his comeback has brought back smiles to the faces of his adoring fans, who are eagerly anticipating his impact on the team.\n“We are thrilled to have Knowledge back in the team,” a soccer fan said.\n“He is a game-changer, and his combination with Khama Billiat is pure magic,” another added.\n“We can not wait to see him in action again.”",
            "time": "08:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "FIFA lifts Highlanders transfer ban after debt settlement",
            "href": "https://www.zbcnews.co.zw/fifa-lifts-highlanders-transfer-ban-after-debt-settlement/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nHIGHLANDERS Football Club has been given a lifeline after the world football governing body, FIFA, lifted a ban that restricted the club from registering new players.\nThe ban was imposed after the club failed to pay former coaches Baltemar Brito and Antonio Torres, who were owed around US$27 000.\nFollowing the intervention of businessman Wicknell Chivayo, who paid off the debt, FIFA lifted the ban this Tuesday.\nThe ban prevented the Bulawayo giants from registering new players, severely impacting the club that lost some key players during the off-season.\nHighlanders coach Kelvin Kaindu has already identified potential new signings, including striker Never Rauzhi who was on loan in the second half of last season, defender Malvern Hativagoni, winger Tendai Muvuti, as well as midfielders Hubert Ncube and Mafious Chiweta.\nThe new players could be part of the squad for the upcoming match against Green Fuel this Saturday.\nThe lifting of the transfer ban is a major boost for Highlanders, who have been struggling with a depleted squad.\nThe club was only able to pick from 18 players for their last two matches, but can now strengthen their team ahead of the transfer window closing on the 31st of March.\nIn contrast, Yadah FC is still reeling from FIFA sanctions after failing to honour contracts with three former players.",
            "time": "08:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Warriors 23 men squad named",
            "href": "https://www.zbcnews.co.zw/warriors-23-men-squad-named/",
            "content": "Story by Vivian Bangamu\nFORMER captain Knowledge Musona has bounced back to the Warriors squad for the upcoming World Cup Qualifiers against Benin and Nigeria in the coming weeks.\nWashington Arubi of Marumo Gallants, joins Marley Tavaziva of Brentford, and Martin Mapisa of MWOS FC as the goalkeepers for the national team.\nWhile, Jordan Zemura of Udinese is joined by Divine Lunga of Sundowns, Gerald Takwara of Al Minaa SC, Munashe Garananga of FC Copenhagen, ISheanes Mauchi of Simba Bhora, Peter Muduhwa of Scottland, Godknows Murwira of Scottland, and Emmanuel Jalai of Dynamos to be part of the Warriors defence team.",
            "time": "08:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Wise Owl Group of Schools triumphs in inaugural Midlands girls cricket tournament",
            "href": "https://www.zbcnews.co.zw/wise-owl-group-of-schools-triumphs-in-inaugural-midlands-girls-cricket-tournament/",
            "content": "Story by Tafara Chikumira\nMARONDERA’s Wise Owl Group of Schools emerged as the overall winners of the inaugural Midlands Girls Cricket Tournament, held in Gweru over the weekend.\nThe tournament, hosted at Midlands Christian College, was a celebration of young female talent, as cricket enthusiasts enjoyed some exciting moments while the girl child showcased her skills in a thrilling cricket extravaganza.\nIn a captivating final, Wise Owl proved their prowess by defeating Gweru’s Chaplin High School to claim the championship.\nZimbabwe Cricket’s Under-19 Women’s Cricket Team Head Coach, Trevor Garwe, expressed his satisfaction with the level of competition, commending the teams for their impressive performances.\n“It is good to see girls undertaking cricket and schools supporting this development programme. I am impressed by the number of girls playing and the standard of cricket being displayed,” he said.\n“I think these are good signs for us as Zimbabwe Cricket and it is a platform for me and my technical team to scout for the next group of players to represent Zimbabwe. I think cricket is in good hands and its growing fast so I would encourage parents and other schools to keep on supporting us as it can give the children a bright future.”\nStakeholders chipped in heaping praises on Zimbabwe Cricket for coming up with a junior policy that guarantees posterity.",
            "time": "08:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Refurbishment of the National Sports Stadium resumes as Minister assesses progress",
            "href": "https://www.zbcnews.co.zw/refurbishment-of-the-national-sports-stadium-resumes-as-minister-assesses-progress/",
            "content": "Story by Lawrence Trusida, Sport Editor\nTHE National Sports Stadium has remained closed since last year, following a ban on hosting international matches due to several infrastructural issues.\nAmong the primary concerns raised were the absence of bucket seats, the lack of electronic turnstiles, and deficiencies in the water reticulation system.\nOn Tuesday, the Minister of Sports, Recreation and Arts, Dr Kirsty Coventry, conducted a tour of the stadium to assess the situation firsthand.\n“I am happy there is progress, yes the process was delayed and we were all equally concerned but we are back on track, bucket seats are being installed, the water works are in progress.\n“We encountered some challenges dealing with an old stadium, but this also gave us a proper appreciation of everything, and we get to fix all the areas. We are working with ZIFA, CAF and FIFA and we are expecting them soon to come, they have already given us guidance on what we are doing now so very soon we should he hearing from them again,” Minister Coventry said.\nThe refurbishment of the stadium is a joint effort between the government and Sakunda Holdings that has purchased the bucket seats, while the government is taking care of the rest of the areas.\n“The delays were basically due to the slow release of funds from treasury but they have always communicated when there were delays and we are now moving smoothly and we do not anticipate any hiccups,” Minister Coventry said.\nEngineer Nicholas Mutengu, who is leading the refurbishment gave an update on the scope of works.\n“We are working on the turnstiles, bucket seats, water reticulation for the stadium and the ablution facilities, we are also working on the lights, we are removing the ones here and putting in LEDs that save power and we are also installing back-up generators for the facility,” he said.",
            "time": "08:41",
            "date": "14 Mar 2025"
        }
    ]
}