{
    "news": [
        {
            "title": "Simba Bhora in South Africa for PSL pre-season preparations",
            "href": "https://www.zbcnews.co.zw/simba-bhora-in-sa-for-psl-pre-season-preparations/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nReigning Premier Soccer League champions, Simba Bhora have set up camp in Polokwane, South Africa as they intensify their 2025 season preparations.\nThe Go Buju Boys will spend two weeks in Polokwane preparing for their title defence.\nCoach Joel Lupahla is overseeing the training sessions and has taken advantage of the preseason camp to also prepare for the CAF Champions League, which gets underway in August.\n“We are not just preparing for the Premier Soccer League season, we’re also focused on making a strong impression in the CAF Champions League. We know it’s going to be a tough competition, but we’re confident in our team’s abilities and we’re working hard to ensure we are ready for the challenge,” Lupahla said.",
            "time": "06:28",
            "date": "05 Feb 2025"
        },
        {
            "title": "Newly-elected ZIFA president tackles player welfare",
            "href": "https://www.zbcnews.co.zw/newly-elected-zifa-president-tackles-player-welfare/",
            "content": "Story by Lawrence Trusida, Sports Editor\nThe new ZIFA board has hit the ground running after paying a courtesy visit to the senior women football team, the Mighty Warriors, as they prepare for the Women’s Africa Cup of Nations (WAFCON) qualifiers.\nZIFA President Nqobile Magwizi, accompanied by board member Kudzai Kadzombe, highlighted that during his tenure, player welfare issues will be at the fore front and for the first time, the Mighty Warriors will get camping allowances as they previously used to get match and travelling allowances.\n“We saw it prudent to come out here and speak to you directly and to tell you how much we value you as a team. You are no longer going to be treated inferior to the men, you are all representing Zimbabwe and you deserve equal respect. We are going to make sure that you get tour camping allowances from the day you are called into camp,” said Magwizi.\nKadzombe further highlighted the thrust the new ZIFA board is taking.\n“Gone are the days of coming to camp and there is nothing. We are going to prepare you better for competitions. You have already reached the highest level (2016 Olympics) and with the right support, we believe you can reach those heights again, so we are here for you,” said Kadzombe\nHead coach Sithethelelwe ‘Kwinji 15’ Sibanda, who has been in the Mighty Warriors setup for more than 20 years since her days as a player, was elated.",
            "time": "06:28",
            "date": "05 Feb 2025"
        },
        {
            "title": "Record breaking Munetsi seals move to EPL",
            "href": "https://www.zbcnews.co.zw/record-breaking-munetsi-seals-move-to-epl/",
            "content": "Story by Raynald Ngwarati\nZimbabwe Warriors vice captain Marshall Munetsi has sealed a move to the English Premier League after completing a three-and-a-half-year deal with Wolverhampton Wanderers on deadline day.\nDubbed the world’s best football league, the EPL has welcomed yet another Zimbabwean starlet in the former Orlando Pirates and Baroka FC midfielder who joins the Wolves ranks, switching base from Stade Reims.\nMunetsi, who was with Reims in the French Ligue 1 for the past three and a half seasons, becomes the most expensive Zimbabwean footballer after sealing a move rumoured to be around 16 million pounds plus add ons, with sources suggesting an overall 20 million pounds.\nMunetsi thus beat the 11 million pounds plus add-ons record held by Marvelous Nakamba when he moved to Aston Villa in 2019.\nMunetsi has hit his prime since sealing a move to Europe earning the arm band for both club and country and his 21 caps this season are testament to his exploits.\nAfter sealing a move to Europe, the 28-year-old turned out to be a regular starter for Reims, making 159 caps, recording 21 goal contributions in that stint.\nCommenting on the record-breaking move, Wolves Chairman Jeff Shi was thrilled with the move, appreciating Munetsi’s experience in European top tier football.\n“Our staff travelled to France to ensure this deal was done on deadline day, as it was important for the club, and we’re pleased to bring an experienced player into the group at an important time of the season,” said Shi.\nShi also hinted at the former Ali Sundowns player getting first team starts at the Molineux.\n“We’re excited to have Marshall on board, and I hope he can help us achieve our aims. He’ll have the full support of all of us at Compton Park and I hope he will have a long and successful time as part of the Wolves family,” Shi added.",
            "time": "06:28",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mighty Warriors begin 2026 WAFCON qualifiers preps",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-begin-2026-wafcon-qualifiers-preps/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nThe Zimbabwe women’s national team, the Mighty Warriors, have regrouped ahead of preparations for the 2026 Women’s Africa Cup of Nations (WAFCON) qualifiers, after a 29-member squad trooped into camp this Sunday.\nThe Mighty Warriors are set to face regional rivals Angola on the 20th in Luanda before clashing again a week later at the Lucas Moripe Stadium in South Africa.\nAs they gear up, coach Sithethelelwe Sibanda expressed her satisfaction with the players’ commitment and passion.\n“We are excited to start our preparations for the AFCON qualifiers, and we are confident that with the talent and dedication of our players, we can achieve great things,” Sibanda said in a statement released by ZIFA.",
            "time": "06:28",
            "date": "05 Feb 2025"
        },
        {
            "title": "Bulawayo dominate Darts Champion of Champions tourney",
            "href": "https://www.zbcnews.co.zw/bulawayo-dominate-darts-champion-of-champions-tourney/",
            "content": "Story by Mthokozisi Dube\nBulawayo teams stole the limelight at the Darts Champions of Champions tournament held in Honde Valley, Manicaland, at the weekend.\nIt was an action-packed weekend in Honde Valley as the National Darts Association of Zimbabwe held the champion of champions tournament which marks the commencement of the darts season.\nAfter a long layoff, darts players who last tasted competitive action at the Eswatini Region Five games did not disappoint.\nEleven teams converged in Honde Valley with RBZ Bulawayo and Wisewaters dominating.\nIt was a Bulawayo finale as RBZ beat Wisewaters 19-15.",
            "time": "06:28",
            "date": "05 Feb 2025"
        }
    ]
}