{
    "news": [
        {
            "title": "2024 in review: Zim’s sporting highs and lows",
            "href": "https://www.zbcnews.co.zw/2024-in-review-zims-sporting-highs-and-lows/",
            "content": "2024 in review: Zim’s sporting highs and low\nStory by Anashe Murombedzi, Sports Reporter\n2024 has been a year of highs and lows for Zimbabwean sport but the positives far outweigh the negatives.\nFrom the rugby pitch to the athletics track, 2024 was a year of triumph and heartbreak for Zimbabwe’s sports stars.\nThe national rugby team, the Sables stole the show with an unbeaten season, culminating in their Africa Cup victory.\nThe historic achievement was their best since 2012 and propelled the Sables to a nine-year high of number 28 in the World Rugby rankings.\nOn the netball front, the Zimbabwe senior women team, the Gems performed well at the Africa Netball Championships.\nTheir impressive run saw them beating Uganda and Malawi, ultimately claiming bronze with a convincing 48-42 win over Malawi.\nThe Gems’ fairytale run was almost derailed when they lost to South Africa in the semi-finals, but they regrouped and showed great determination to claim third place.\nThe Zimbabwe golf team also did well after a third-place finish at the All-Africa Golf Championship, behind Zambia and winners South Africa.\nIn athletics, Zimbabwean sprinters Tapiwanashe Makarau and Makanakaishe Charamba made history after reaching the 200 metres final at the Paris Olympics.\nAlthough they did not get any medals, their impressive performance marked a milestone for Zimbabwean athletics.\nIn cricket, the Zimbabwe Chevrons had a tough season in which they faced stiff competition from Afghanistan and Pakistan.\nOne of the highlights was a thrilling Test match against Afghanistan at Queens Sports Club, where the Chevrons posted a record-breaking 586 runs.",
            "time": "20:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "2024 football reflections: Warriors shine against all odds",
            "href": "https://www.zbcnews.co.zw/2024-football-reflections-warriors-shine-against-all-odds/",
            "content": "Story by Mthokozisi Dube\n2024 will go down memory lane as a year of mixed fortunes in the beautiful game with the biggest positive being the Warriors’ qualification for the prestigious continental showpiece set for Morocco next year.\nLack of CAF certified stadia was the biggest challenge for the Warriors and the country’s representatives in the CAF Champions League, Ngezi platinum and CAF Confederation Cup, Dynamos as they played all their matches away from home.\nIt ended in a disastrous campaign as Ngezi Platinum and Dynamos were booted out before the mini league phase of their respective competitions.\nThat was, however, not the case with the Warriors who qualified for the 2025 Africa Cup of Nations and went through the World Cup qualifiers playing in Rwanda, Uganda and South Africa.\nFormer ZIFA board member Samukeliso Silengane said, “We had a good year in football. We rallied behind our warriors in Polokwane and we showed the world that we can play at any venue.”\nOn the domestic scene, Simba Bhora shocked all and sundry after wrestling the Premier Soccer League title in only their second season in the topflight.\nSimba Bhora put the icing on the cake after dominating the the soccer stars selection with five of their players making it to the best 11, while Coach Tonderayi Ndiraya was voted as the best among his peers.\nFour clubs; debutants Arenel movers, Chegutu Pirates, Bulawayo Chiefs and Hwange kissed goodbye to topflight football and were replaced by ZPC Hwange, Kwekwe united, Triangle and Scottland FC.\nZPC Hwange went on to win the inaugural champions of champions trophy held in the Midlands capital of Gweru.\nIn women football, new sponsorship was unveiled resulting in the league rebranding to the Heart Women Super League, with Herentals Queens retaining their crown.\nChapungu were crowned champions of the Heart tournament which saw participating teams getting playing kits.",
            "time": "20:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "ZIFA presidency; Twine Phiri pledges to focus on junior development",
            "href": "https://www.zbcnews.co.zw/zifa-presidency-twine-phiri-pledges-to-focus-on-junior-development/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nZimbabwe Football Association (ZIFA) presidential candidate, Twine Phiri has promised to transform Zimbabwean football if elected to the top post next month.\nPhiri is not a new name to Zimbabwean football, having been the first individual to own CAPS United after the club was weaned off by CAPS Holdings.\nHaving led CAPS United in a dominant era in which they won back-to-back league titles in 2004 and 2005, Phiri cemented his reputation as a shrewd and visionary leader.\nHe was also the chairperson of the Premier Soccer League (PSL), where he played a pivotal role in securing sponsorship deals that propelled the topflight to new heights.\nPhiri’s greatest achievement was bringing Castle Lager to the fold in 2011, a move that injected the much-needed sponsorship into the domestic league.",
            "time": "20:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Johannes Ngodzo football tournament enters second edition",
            "href": "https://www.zbcnews.co.zw/johannes-ngodzo-football-tournament-enters-second-edition/",
            "content": "Story by Mthokozisi Dube\nFootball coaches have implored football stakeholders to craft a database for junior development, which will help in tracking budding footballers.\nThe second edition of the Johannes Ngodzo football tournament roared into life in Bulawayo this Saturday, with the tournament having been split based on various age groups.\nThe tournament unearthed budding football talent which caught the eye of football coaches who were quick to point to the need of having a database to monitor the development of budding footballers.\nFootball coach, Mandla Lulu Mpofu said, “The southern region is better known to be a hub for junior football talent as it has produced great names for big team as well as the national team. But the question is what happens to these young stars. We need a data base which will help us track the development of these players because there is good talent from what we have seen in this tournament.”\nFormer Warriors midfielder, Johannes Ngodzo has also implored other former footballers to cast the net wider by staging similar tournaments in their respective communities.\n“If we can have former footballers staging these tournament sin their respective areas, that can take us somewhere in growing the game,” he said.\nNow in its second edition, the annual Johannes Ngodzo football tournament has been a way of  educating the youths on the dangers of drug and substance abuse and one of the founder members, Irvin Khumalo believes plans to set up a development side are now at an advanced stage.\n“We formed the foundation in 2023 and we have had one tournament meaning this is the second edition. We realised that a lot of our young stars were involved in drug and substance abuse hence we came up with this initiative. Our aim is to see to it that we have a development side mainly for Under 19 competing in the lower leagues acting as a feeder to big teams. We have had talks on that with our partner in the US, UK and they have committed resources for the initiative,” Khumalo noted.",
            "time": "20:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Gore aspires to transform Zimbabwean football",
            "href": "https://www.zbcnews.co.zw/gore-aspires-to-transform-zimbabwean-football/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nSeasoned football administrator, Marshall Gore is confident that he has what it takes to transform Zimbabwean football and restore its former glory if elected president of the Zimbabwe Football Association (ZIFA) in the upcoming elections scheduled for next month\nWith 25 years of experience, Gore has a vision to transform the face of Zimbabwean football and restore its former glory.\nHis grassroots football background has seen him spending many years setting up and supporting local leagues, including the Goromonzi Area Zone League in the 90s and the recently revived Rusike Area Zone League.\nGore’s impact has not been limited to Zimbabwe’s borders, and it is through his organization, Team Zimbabwe UK that he has resourced hundreds of community football clubs across the country with vital equipment and kits.\nAhead of the ZIFA elections set for next month the aspiring ZIFA president is determined than ever to leave a lasting legacy is elected to the helm of the local football governing body.",
            "time": "20:33",
            "date": "31 Dec 2024"
        }
    ]
}