{
    "news": [
        {
            "title": "Dynamos and Herentals play out to a goalless draw",
            "href": "https://www.zbcnews.co.zw/dynamos-and-herentals-play-out-to-a-goalless-draw/",
            "content": "Story by Lawrence Trusida, Sport Editor\nGIANTS Dynamos failed to scoreonceagain as they were held to a goallessby Herentalsin a Castle Lager Premier Soccer Leagueplayed atRufaro Stadium this Saturday.\nDynamos’ lack of a cutting edge wasonceagain exposed as they fired blanks against a jittery Herentals.\nDembare started on the front foot posing a lot of questions for theHerentalsrear guardunfortunatelythe killer instinct was not there and at moments they missed chances that were unimaginable.\nUnlike in the previous match, this time the Glamour Boys created a glut of chances, especially through the right side where captain Emmanuel Jalai was playing as an inverted fullback.\nUnfortunately, his teammates were not on the same wavelength as the pint-sized player who was also on the receiving on of some nasty tackles, however, the referee was too lenient much to the disappointment of the fans who braved the rains.\nHerentals had chances of their own but just like their opponents, they lacked the cutting edge.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "ZIFA & Royal Moroccan Football Federation sign two-year agreement to boost football development",
            "href": "https://www.zbcnews.co.zw/zifa-royal-moroccan-football-federation-sign-two-year-agreement-to-boost-football-development/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Zimbabwe Football Association(ZIFA) and the Royal Moroccan Football Federation (FRMF) have signed a two-year agreement aimed at strengthening football development in both nations.\nThe partnership that was signed this Saturday by ZIFA president, Nqobile Magwizi and his Moroccan counterpart, Fouzi Lekjaa will see Zimbabwe getting the same training programmes for coaches, referees, and administrators as their counterparts as well as youth and women’s football development programmes.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Wolves 1-1 Everton: Munetsi edges Wolves closer to safety",
            "href": "https://www.zbcnews.co.zw/wolves-1-1-everton-munetsi-edges-wolves-closer-to-safety/",
            "content": "It wasn’t pretty, but it didn’t need to be.\nAfter Ipswich’s defeat at Crystal Palace, Wolves knew a result, any result would push them closer to Premier League safety.\nAs it happened, even a draw was enough to put a positive end to the day as Wolves moved six points clear of the drop zone.\nVitor Pereira’s side fell behind when Jack Harrison gave the Toffees the lead, but Zimbabwe international Marshall Munetsi equalised five minutes before the break to score his first goal for the club.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Resilient Yadah hold Chicken Inn to goalless draw",
            "href": "https://www.zbcnews.co.zw/resilient-yadah-hold-chicken-inn-to-goalless-draw/",
            "content": "Story by Lawrence Trusida, Sports Editor\nYADAH held former champions Chicken Inn to a nil-all draw in a Castle Lager Premier Soccer league match played at the Heart Stadium this Friday.\nReeling under the FIFA ban, Yadah only had one substitute on the bench for their match against Chicken Inn this Friday.\nThe Miracle Boys are banned from signing players until they pay the amount they owe three Brazilians who were on their books last year.\nWith some out-of-contract players having moved on, Yadah only has 13 players registered for this season and to make matters worse, Anotodaishe Gwatidzo was shown a red card on Match Day one making him ineligible for this week’s assignment.\nBe that as it may, Yadah fought tooth and nail and held fancied Chicken Inn and with a hit of luck they could have snatched the victory.\n“I am happy for my boys, they worked hard and under such circumstances, I am more than happy because we can’t refresh the team,” Yadah Coach Ikabort Masocha said.",
            "time": "18:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "All set for the 2025 Bonaqua Triathlon Cup",
            "href": "https://www.zbcnews.co.zw/all-set-for-the-2025-bonaqua-triathlon-cup/",
            "content": "Story by Raynald Ngwarati\nTRIATHLETES are geared for the 2025 Bonaqua Africa Triathlon set for Troutbeck resort in Nyanga this Saturday.\nWith the 2025 edition of the Bonaqua Africa Triathlon Cup set to roar into life this Saturday, athletes are relinquishing the prospect of showcasing their prowess at one of the top triathlon events in the world.\nMissing the evergreen Andie Kuipers due to an achilles injury, Zimbabwe has shifted focus towards development as the country will not be represented in the elite category, but will enjoy a sizeable representation in the Africa Junior Cup featuring participants from South Africa and Namibia.\nNicole Madya returns to the Troutbeck Course after missing last year’s edition, to bring the number of Zimbabweans in the Africa Junior Cup to four, alongside boys Stanley Chasakara, Callum Smith and Mandlenkosi Mthethwa.\n“I feel like two years has been a lot, but I did come up here over half term for a training camp, so I feel like I have a good view of what to expect tomorrow. There is a lot of pressure from a lot of people with regards to that, but I have been putting a lot of work into my training, and I am just trusting in that, and hopefully it will work out tomorrow,” Madya said.\nInternational participants are also optimistic of conquering the terrain.",
            "time": "18:28",
            "date": "09 Mar 2025"
        }
    ]
}