{
    "news": [
        {
            "title": "Mash Central braces for NASH tourney",
            "href": "https://www.zbcnews.co.zw/mash-central-braces-for-nash-tourney/",
            "content": "Story by Tapiwa Machemedze\nMASHONALAND Central Province is preparing to host the National Association of Secondary Heads (NASH) competitions, with the construction of the main stadium for the event near completion.\nNASH competitions is one of the biggest events on the schools’ calendar running from the 1st to the 4th of April and Chipadze High School will host the games with preparations already advanced.",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Newly elected ZIFA board challenged to prioritise player welfare",
            "href": "https://www.zbcnews.co.zw/newly-elected-zifa-board-challenged-to-prioritise-player-welfare/",
            "content": "Story by Lawrence Trusida, Sport Editor\nTHE newly-elected Zimbabwe Football Association (ZIFA) Executive committee has pledged to uphold integrity and turnaround the sport in the country.\nThe new football leadership led by Nqobile Magwizi met with the Sport and Recreation Commission (SRC) in Harare this Thursday to share their vision and appraise them on the direction they are taking the country’s most followed sport.\nThe board, which was elected a fortnight ago, wasted no time in highlighting that they are committed to make the sport an envy for everyone, with upholding corporate governance set to be prioritised.\n“We want to set up an institution that is transparent, accountable and open for everyone,” Magwizi said.\n“Our hope is to create an institution that will last beyond our tenure and when anyone comes in they can continue and it shouldn’t be a shock that there is a new president and an institution that is judged on results on the pitch we need to make sure that we create a platform for our players to thrive from junior level up till the highest level.”\nThe SRC challenged the new board to prioritise player welfare.\n“I know you are new and you still need to be known but very soon we want to see the players, the captains and the coaches, sport is about the athletes and they should be put at the front and your role is to make sure you provide a good platform for them to showcase their talents,” SRC chairperson, Gerald Mlotshwa said.",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Chevrons brace for Irish test",
            "href": "https://www.zbcnews.co.zw/chevrons-brace-for-irish-test/",
            "content": "Story by Lawrence Trusida, Sport Editor\nZIMBABWE will be seeking to win their first test match against Ireland when the two teams clash in the only test match slated for Queen Sports Club starting this Thursday.\nThe Chevrons smarting from a test series loss to Afghanistan will be seeking to win their first test of this year when they face Ireland.\nIt is easier said than done especially with the way the Chevrons’ performances fluctuate.\nOn the odd day, they can be special but then sometimes they tend to be awful.\nThis Thursday they step onto the Queens Sports Club pitch in Bulawayo looking to beat the Irish in a test match for the first time.\nThe two sides met only once in the longest format and Ireland won that meeting last year.\nThe hosts go into the match seeking their first win in the last six tests, while Ireland have won two in the same period, and Zimbabwe also anchor the 12-team International Cricket Council test rankings.\nThe return to full fitness for veteran Sean Williams is a major boost to the Chevrons’ ambitions of winning their first test this year.\nThe all-rounder was an injury scare for the Chevrons after he struggled with back pains in the New Year’s Day Test match against Afghanistan.",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Fulham F.C signs Zimbabwean youngster from Man City",
            "href": "https://www.zbcnews.co.zw/fulham-f-c-signs-zimbabwean-youngster-from-man-city/",
            "content": "EPL club Fulham Football Club has signed Zimbabwean youngster Seth Chingwaro from Manchester City Academy.\nThe London-based side reportedly paid around £750,000 as a transfer fee for Chingwaro.\nThe midfielder had spent the last six years at City, progressing through the age groups. He made four appearances in the Under-18s Premier League North this season.\nFulham said on his signing, “The Club is delighted to announce the signing of young midfielder Seth Chingwaro from Manchester City”.\n“Seth, who turned 17 in December, is a midfielder capable of performing in multiple different roles, whether that’s as a deeper player or one looking to impact games in the final third.”\n“It is a great feeling to join Fulham,” said Seth to Fulhamfc.com.",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Simba Bhora in South Africa for PSL pre-season preparations",
            "href": "https://www.zbcnews.co.zw/simba-bhora-in-sa-for-psl-pre-season-preparations/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nReigning Premier Soccer League champions, Simba Bhora have set up camp in Polokwane, South Africa as they intensify their 2025 season preparations.\nThe Go Buju Boys will spend two weeks in Polokwane preparing for their title defence.\nCoach Joel Lupahla is overseeing the training sessions and has taken advantage of the preseason camp to also prepare for the CAF Champions League, which gets underway in August.\n“We are not just preparing for the Premier Soccer League season, we’re also focused on making a strong impression in the CAF Champions League. We know it’s going to be a tough competition, but we’re confident in our team’s abilities and we’re working hard to ensure we are ready for the challenge,” Lupahla said.",
            "time": "20:39",
            "date": "06 Feb 2025"
        }
    ]
}