{
    "news": [
        {
            "title": "Chevrons shift focus to once off test match against Afghanistan",
            "href": "https://www.zbcnews.co.zw/chevrons-shift-focus-to-once-off-test-match-against-afghanistan/",
            "content": "Lawrence Trusida, Sports Editor\nThe Zimbabwe senior cricket team, the Chevrons, are seeking a change of fortunes when they face Afghanistan in a one-off test match, starting on Boxing Day.\nSmarting from back to back series defeats in T20s and One Day Internationals, the Chevrons have no time to rest as they shift focus to the test arena.\nZimbabwe lost the T20s 2-1 before being whitewashed two-nil in the ODIs.\nDespite a wretched recent record, the Chevrons believe they have what it takes to bounce back.",
            "time": "06:28",
            "date": "25 Dec 2024"
        },
        {
            "title": "Jere accepts ZIFA verdict",
            "href": "https://www.zbcnews.co.zw/jere-accepts-zifa-verdict/",
            "content": "Story by Lawrence Trusida, Sports Editor\nPremier Soccer League chairperson Farai Jere has decided to let football be the winner after accepting the decision of the ZIFA Ethics Committee to bar him from contesting the 25 January Executive Committee elections.\nHonourable Jere, former legislator Temba Mliswa, Prophet Walter Magaya and former Warriors captain Benjani Mwaruwari were excluded from contesting the ZIFA elections.\nFollowing his exclusion, Jere quickly sought explanation from ZIFA on why he was omitted from the contesting candidates and was furnished with the details this Tuesday morning.\n“I got the response this morning. ZIFA explained to me that I submitted my notice of name change late when FIFA governance had already concluded the vetting process. Before 2000, I used the name Farai Mutimbo and all my Ordinary and Advanced Level certificates bear that name. Then I officially changed to Farai Jere in 2000 and my tertiary qualifications have that name, so the clarity came, but I was disappointed that they could have requested the notice in time and I could also be contested, but remember, everything happens for a reason,” he said.\nQuizzed on why he is not exercising his right of appeal, Jere said he wants football to be the winner.\n“I am a leader so I have to make decisions not just for myself. I want football to be the winner, not Jere. So if I appeal it means that it’s an emergency interdict to stop the elections until my case is heard. My case is simple and I can easily win it, but the time that will take means I will delay the elections, so is that good for our football? I am a Parliamentary Portfolio Committee on Sports chairperson, so I can’t be seen delaying the elections Zimbabwean football needs to heal and move forward to start afresh with new leadership, so I am allowing that to happen because football must come first and football must be the winner.”\nOther candidates, including Benjani Mwaruwari, have also been demanding answers from ZIFA, but ZBC News understands that all the four candidates have since been furnished with explanations on why they have been barred from contesting.\nThe new ZIFA statutes allow an aggrieved party to appeal to a higher body.",
            "time": "06:28",
            "date": "25 Dec 2024"
        },
        {
            "title": "Six candidates to contest ZIFA presidency",
            "href": "https://www.zbcnews.co.zw/six-candidates-to-contest-zifa-presidency/",
            "content": "The ZIFA Normalisation Committee has announced the names of the six candidates who will battle it out for the association’s top job next month.\nA statrment released this Monday by the committee reads:\n“The ZIFA Normalisation Committee acting as the ZIFA Electoral Committee in accordance with Article 85(9) is pleased to announce the names of all the candidates who have met the eligibility criteria stipulated in the ZIFA Statutes, 2024.\n“The list of successful candidates is as follows:Presidential Candidates:Marshall GorePhilemon MachanaNqobile MagwiziMartin KwezaTwine PhiriMakwinje Phiri\nVice President Candidates:Mavis GumboPatience MutumwaWinnet MurotaJoyce R KapotaLoveness MukuraKennedy NdebeleOmega SibandaPeter DubeFrancis NyamutsambaSimbarashe J Takava",
            "time": "06:28",
            "date": "25 Dec 2024"
        },
        {
            "title": "ZIFA candidates to be annouced today",
            "href": "https://www.zbcnews.co.zw/zifa-candidates-to-be-annouced-today/",
            "content": "Candidates for the ZIFA elections set for the 25th of next month are expected to be announced today.",
            "time": "06:28",
            "date": "25 Dec 2024"
        },
        {
            "title": "Norman Maroto honoured with legends cup",
            "href": "https://www.zbcnews.co.zw/norman-maroto-honoured-with-legends-cup/",
            "content": "Story by Wellington Makonese\nFOOTBALL enthusiasts thronged Dzivarasekwa Stadium this Sunday for a four-team tournament in memory of former Dynamos striker Norman Maroto, who left a rich legacy beyond the football pitch.\nThe Norman Maroto Legends Cup brought together former professionals, local stars and rising talent in a display of skill and sportsmanship.",
            "time": "06:28",
            "date": "25 Dec 2024"
        }
    ]
}