{
    "news": [
        {
            "title": "Tarakinyu triumphs in Beitbridge half marathon as nation rallies behind drug-free society agenda",
            "href": "https://www.zbcnews.co.zw/tarakinyu-triumphs-in-beitbridge-half-marathon-as-nation-rallies-behind-drug-free-society-agenda/",
            "content": "Story by Providence Maraneli\nBEITBRIDGE – VERERAN long-distance runner Moses Tarakinyu emerged victorious at the Run for Hope Half Marathon, an event held in honour of Vice President Colonel (Retired) Kembo Mohadi in Beitbridge this Saturday.\nRepresenting Black Rhinos, Tarakinyu completed the 21-kilometre race in an impressive 1 hour, 7 minutes, and 45 seconds, narrowly fending off competition from his teammate Tatenda Hove, who crossed the finish line one second later.\nJonathan Chinyoka of ZPCS secured third position with a time of 1 hour and 48 seconds.\n“I am delighted to have won this marathon. It forms an important part of my training for upcoming competitions. I’m grateful to the organisers for such opportunities which keep us focused and prepared,” Tarakinyu said.\nThe event attracted participants from across the country, with various categories including people with disabilities, the elderly, youth, and children.\nParticipants described the race as more than just a sporting event, but a powerful message in the fight against drug and substance abuse.\n“This event is a reminder to us as the youth that we must take a stand against drug and substance abuse,” said one participant.\n“We are so thankful to the Vice President for thinking of people with disabilities. I travelled from afar to participate, and I am proud to have come first in my category,” another added.\nThe event forms part of a broader national campaign to promote healthy lifestyles, unity, and social transformation.",
            "time": "18:32",
            "date": "21 Jun 2025"
        },
        {
            "title": "ZPCS’ Commissioner General Goodwill Trust Fund golf tournament tees off in Vic Falls",
            "href": "https://www.zbcnews.co.zw/zpcs-commissioner-general-goodwill-trust-fund-golf-tournament-tees-off-in-vic-falls/",
            "content": "Story by Tichaona Kurewa\nVICTORIA FALLS – THE 2025 Zimbabwe Prisons and Correctional Services (ZPCS) Commissioner General Goodwill Trust Fund Matabeleland North Golf Tournament teed off this Saturday morning at the Elephant Hills Golf Course in Victoria Falls.\nEstablished in 2011, the Trust Fund aims to support the welfare of families of deceased officers as well as other vulnerable members of the community.",
            "time": "18:32",
            "date": "21 Jun 2025"
        },
        {
            "title": "FC Platinum faces stern test against Dynamos",
            "href": "https://www.zbcnews.co.zw/fc-platinum-faces-stern-test-against-dynamos/",
            "content": "Story by Courage Bushe\nFORMER champions, FC Platinum will face a stern test of character when they host fading giants Dynamos at Mandava Stadium this Sunday.\nThe Norman Mapeza-coached side have been solid at the back but have lacked goals upfront.\nDespite the lack of goals, the Zvishavane-based side are undefeated ahead of the final match of the first half of the season against Dynamos, who are in high spirits after finally bagging a win in almost three months.",
            "time": "18:32",
            "date": "21 Jun 2025"
        },
        {
            "title": "Zimbabwean ex-Sable Tapuwa Chabata concludes world record rugby marathon",
            "href": "https://www.zbcnews.co.zw/zimbabwean-ex-sable-tapuwa-chabata-concludes-world-record-rugby-marathon/",
            "content": "Story by Lawrence Trusida, Sports Editor\nFORMER professional rugby player, Tapuwa Chabata has concluded his participation in the attempt to break the Guinness World Record for the longest rugby match, held at Mullingar RFC in Ireland.\nThe 53-year-old former Sables player clocked around 30 hours but the official time is still yet to be made public by Guinness.",
            "time": "18:32",
            "date": "21 Jun 2025"
        },
        {
            "title": "Bosso seek change of fortunes against Chicken Inn",
            "href": "https://www.zbcnews.co.zw/bosso-seek-change-of-fortunes-against-chicken-inn/",
            "content": "Story by Buhlebenkosi Makwelo\nBULAWAYO giants, Highlanders, are hoping for a change of fortune against bitter city rivals, Chicken Inn when the two teams clash in the Castle Lager Premier Soccer League set for Barbourfields Stadium this Sunday.\nHighlanders have not beaten Chicken Inn at Barbourfields Stadium in five years, and during that period they have managed to draw away at Luveve.\nBosso are coming from an away win, but Barbourfields is no longer the fortress after losing 3-2 to Simba Bhora in their last home encounter.\nBosso have not won at home in their last three encounters losing two and also managing a draw ahead of the match against bitter city rivals that just know how to beat them in their backyard.",
            "time": "18:32",
            "date": "21 Jun 2025"
        }
    ]
}