{
    "news": [
        {
            "title": "Former Man U boss, Sir Alex Ferguson explores Vic Falls",
            "href": "https://www.zbcnews.co.zw/former-man-u-boss-sir-alex-ferguson-explores-vic-falls/",
            "content": "Story by Tichaona Kurewa\nVICTORIA Falls welcomed prominent figure, former Manchester United Manager, Sir Alex Ferguson who arrived in the resort town at the weekend.",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "ZIFA partners Kyros Sports and PD House to boost local football",
            "href": "https://www.zbcnews.co.zw/zifa-partners-kyros-sports-and-pd-house-to-boost-local-football/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Zimbabwe Football Association (ZIFA) has signed two Memoranda of Understanding with two local firms to help in talent identification and marketing of the local game.\nZIFA has started the process of addressing the challenges in monitoring and tracking athletes from a tender age after partnering Kyros Sports in Harare this Monday.\nKyros Sports has a big imprint in talent identification and athletes tracking and has been working with the Zimbabwe Rugby Union to build a solid player base.\nUnder the MOU with ZIFA, Kyros will be working with schools to create a clear pathway for young athletes, ensuring the next generation of football stars get opportunities.\nZIFA president Nqobile Magwizi said, “I think you all know what they have done in rugby and we want such kind of services. So we are also going to be working so much with the NAPH and NASH. The goal is to have a solid player base and be able to qualify for major tournaments consistently.”\n“We are more into data collection and latest scientific technologies through our collaborations and we hope we can help ZIFA achieve their goals,” Kyros Sports’ director Nyasha Muchochomi said.\nZIFA also joined hands with a digital marketing company, PD House that is set to push their projects online.\nPD House’s director Martin Mukaro noted, “We are more than just a company of websites, we also do applications and market content digitally and we will help ZIFA to push their content and spread the message of Zimbabwe Football.”",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "New boys Scottland, MWOS steal the show as giants stumble",
            "href": "https://www.zbcnews.co.zw/new-boys-scottland-mwos-steal-the-show-as-giants-stumble/",
            "content": "Story by Lawrence Trusida, Sports Editor\nPREMIER Soccer League new-boys Scottland and MWOS had a perfect start to their campaign in the top flight after registering wins in their debut matches at the weekend.\nScottland FC showed their intent after recruiting marquee players ahead of the start of the Premier Soccer League (PSL).\nThe Mabvuku-based side were duly rewarded in their debut match in the league after edging Triangle one-nil at Rufaro Stadium in the season opener.\nThe new boys were not at the level that everyone expected but the three points were sweeter in a debut match.\nThe own goal gave them victory and their first set of three points.\nOn Sunday, fellow newcomers, MWOS also needed lady luck to beat Highlanders at Baobab stadium after a mistake from Bosso goalkeeper Raphael Pitisi.\nThe Norton-based side caused Bosso further problems and could have gone away with a wide margin.",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "Bonaqua Africa Triathlon Cup set for March 8th",
            "href": "https://www.zbcnews.co.zw/bonaqua-africa-triathlon-cup-set-for-march-8th/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Bonaqua Africa Triathlon Cup is set to be held on March 8, at its usual venue, the Troutbeck Resort in Nyanga.\nThe event draws elite triathletes from across the world who will be vying for ranking points to qualify for other global events and the upcoming 2028 Olympic Games.\nYoungsters will also be battling to be continental champions in the Junior Africa Cup.\nZimbabwe has predominantly featured athletes in the Junior Africa Cup but they have struggled for representation in the Elite categories.",
            "time": "06:33",
            "date": "04 Mar 2025"
        },
        {
            "title": "Former Champions FC Platinum date reigning Champs Simba Bhora",
            "href": "https://www.zbcnews.co.zw/former-champions-fc-platinum-date-reigning-champs-simba-bhora/",
            "content": "Story by Courage Bushe\nFC Platinum are banking on history in their quest to claim their first win of the 2025 Castle Lager Premiership season when they face Simba Bhora at Wadzanayi Stadium this Saturday.\nIt will be a dog-eat-dog affair when two titans, FC Platinum and defending champions, Simba Bhora clash at Wadzanayi Stadium in Shamva this Saturday.\nThe Zvishavane-based side was the only team to come out with three points at Wadzanayi Stadium last season and is eager to repeat the feat.",
            "time": "06:33",
            "date": "04 Mar 2025"
        }
    ]
}