{
    "news": [
        {
            "title": "ZIFA presidential aspirant Temba Mliswa withdraws appeal",
            "href": "https://www.zbcnews.co.zw/zifa-presidential-aspirant-temba-mliswa-withdraws-appeal/",
            "content": "Story by Fungai Jachi\nDisqualified ZIFA presidential aspirant Temba Mliswa has withdrawn his application to stop elections set for this Saturday.\nMliswa and the respondents concurred that the application was ill-timed.",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "High Court to hear aspiring ZIFA presidential candidate Mliswa’s application",
            "href": "https://www.zbcnews.co.zw/high-court-to-hear-aspiring-zifa-presidential-candidate-mliswas-application/",
            "content": "\nStory by Fungai Jachi\nTHE High Court is set to hear an application made by aspiring ZIFA presidential candidate Temba Mliswa this Tuesday.\nMliswa is among the five candidates who were disqualified by the ZIFA Electoral Committee after falling short of the association’s eligibility criteria.",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Gidiza appointed Dynamos team manager",
            "href": "https://www.zbcnews.co.zw/gidiza-appointed-dynamos-team-manager/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nFormer Warriors midfielder, Ronald ‘Gidiza’ Sibanda has been appointed Dynamos team manager for the 2025 season.\nSibanda who made his name at Zimbabwe Saints, turned out for Dembare between 1998 and 1999, before taking his talents elsewhere.",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Harbin 2025 Asian Winter Games torch lit",
            "href": "https://www.zbcnews.co.zw/harbin-2025-asian-winter-games-torch-lit/",
            "content": "Story by Vivian Bangamu\nThis Monday, the flame for the Harbin 2025 Asian Winter Games was lit at the Sun Island Scenic Area in Harbin City, northeast China’s Heilongjiang Province, with 0nly 18 days to go before the opening of the Games.\nNine flame collectors guarded the torch, symbolizing the ninth edition of the Games, before it was collected.\nThe flame, which was ignited by the sun’s rays through an artificial ice lens, was then presented to the public by Xu Qin, head of the Heilongjiang Provincial Committee of the Communist Party of China.\nAfter the display, Xu handed over the torch to flame guards who transferred the flame to a flame lantern, which represents that the torch relay is about to start in the coming days.\nAn online torch relay was also launched during the flame collection event.\nHarbin last hosted the games in 1996, making this year the second timed they will host the Games.",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "DeMbare confirms MaBlanyo",
            "href": "https://www.zbcnews.co.zw/dembare-confirms-mablanyo/",
            "content": "\nStory by Lawrence Trusida, Sports Editor",
            "time": "18:41",
            "date": "21 Jan 2025"
        }
    ]
}