{
    "news": [
        {
            "title": "Kalisto Pasuwa appointed Malawi national team coach",
            "href": "https://www.zbcnews.co.zw/kalisto-pasuwa-appointed-malawi-national-team-coach/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nFormer Dynamos and Warriors coach Kalisto Pasuwa has been confirmed as the substantive head coach of the Malawi national team.\nPasuwa who had a successful stint with Nyasa Big Bullets was recommended by the Football Association of Malawi’s Technical Sub-Committee.\nThe successful coach who won five consecutive league titles with Nyasa Big Bullets and was in charge of the Flames on an interim basis, will now lead the team on a permanent basis.\nBefore his latest appointment, Pasuwa led Malawi to a draw against Burundi and a three-nil win over Burkina Faso in the 2025 Africa Cup of Nations qualifiers.",
            "time": "18:34",
            "date": "30 Jan 2025"
        },
        {
            "title": "Warriors face stern AFCON test",
            "href": "https://www.zbcnews.co.zw/warriors-face-stern-afcon-test-2/",
            "content": "Story by Anashe Murombedzi\nThe Zimbabwe men’s football team, the Warriors will face seven time champions Egypt and two Southern African opponents in the 2025 Africa Cup of Nations (AFCON) set for Morocco in December.\nThe Warriors will be making their sixth appearance at the continental showpiece, but face a daunting task in the group stages after being drawn in Group B that features giants Egypt, neighbours South Africa and another Southern African opponent Angola.\nZimbabwe have faced Egypt before including during their maiden appearance at the AFCON 2004, when they lost 2-1 in Tunisia.\nThe Warriors also face South Africa, with the teams in the same group for the 2026 FIFA World Cup qualifiers.\nThere are six groups with four teams each and two top teams from each group will automatically qualify for the knockout stage, while four best third placed teams will also advance to the round of 16.",
            "time": "18:34",
            "date": "30 Jan 2025"
        },
        {
            "title": "Chevrons face Ireland in three ODIs, T20Is",
            "href": "https://www.zbcnews.co.zw/chevrons-face-ireland-in-three-odis-t20is/",
            "content": "Story by Lawrence Trusida\nLeg spinner, Vincent Masekesa and batsman Nicholas Welch have been rewarded for their good form on the domestic scene after being named in the Chevrons squad set to face Ireland in a Test match early next month.\nZimbabwe is set to face Ireland in multi-format series that will commence with a one-off test match set for 6th to the 10th of February at Queens Sports Club in Bulawayo.\nThe action will then move to Harare Sports Club for the white-ball leg, featuring three One-Day Internationals (ODIs) followed by three Twenty20 Internationals (T20Is).\nFresh from a disappointing series against Afghanistan, the Chevrons selectors have rewarded on form players on the domestic circuit after including two new faces, 27-year-old leg-spinner Vincent Masekesa and 26-year-old top-order batter Nicholas Welch.\nMasekesa is the fourth highest wicket taker on the domestic scene with 51 wickets just behind established internationals Blessing Muzarabani and Brandon Mavuta.\nWelch on the other hand is the second highest run getter this season, averaging 41 runs in 33 innings having scored over 1375 runs.\nThe duo take the places of struggling all-rounder, Dion Myers and Tadiwanashe Marumani, who is struggling to impose himself in cricket’s longest format.\nVeteran all-rounder, Sikandar Raza has been omitted from the test squad, as he had already committed to franchise cricket before the tour schedule was confirmed.\nSeasoned all-rounder Sean Williams, who was struggling with a back injury during the recent Test series against Afghanistan, is back to give the Chevrons a major boost.",
            "time": "18:34",
            "date": "30 Jan 2025"
        },
        {
            "title": "Warriors face stern AFCON test",
            "href": "https://www.zbcnews.co.zw/warriors-face-stern-afcon-test/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE Zimbabwe men’s football team the Warriors have been drawn in Group B for the 2025 Africa Cup of Nations (AFCON), alongside seven-time champions Egypt, neighbours South Africa, and Southern Africa rivals Angola.",
            "time": "18:34",
            "date": "30 Jan 2025"
        },
        {
            "title": "JADEL China clinch U13 Invitational Football tournament",
            "href": "https://www.zbcnews.co.zw/jadel-china-clinch-u13-invitational-football-tournament/",
            "content": "Story by Raynald Ngwarati\nJADEL China have been crowned the winners of the JADEL U13 Invitational Football Tournament after beating Scottland Academy two-nil at Belgravia Sports Club this weekend.\nUnder 13 footballers this Saturday had a chance to showcase their skills in front of top scouts as the JADEL U13 Football Tournament took centre stage at Belgravia Sports Club in Harare.\nThe invitational tournament eyed to spread the wings of the grassroots football development project to different academies, with a goal of collaborating to change the face of Zimbabwean football and restore the country’s former glory.\nWith a project tailored to boost Zimbabwe’s chances of qualifying for the 2034 FIFA World Cup, the JADEL Football Academy has adopted a stance to partner other academies in the project to develop the country’s football.\nJADEL Football Academy Official Nyasha Kadenge said, “We want any talent from any part of the country to get a chance to play and be seen. The hope is that talent is developed all over Zimbabwe. So we are happy to draw teams from all over the country.”",
            "time": "18:34",
            "date": "30 Jan 2025"
        }
    ]
}