{
    "news": [
        {
            "title": "UZ to host CAA Southern Region Senior Championships later this month",
            "href": "https://www.zbcnews.co.zw/uz-to-host-caa-southern-region-senior-championships-later-this-month/",
            "content": "Story by Lawrence Trusida, Sports Editor\nHARARE-ZIMBABWE is set to host the 2025 Confederation of African Athletics (CAA) Southern Region Senior Championships from July 26 to 27, at the University of Zimbabwe in Harare.\nThe high-profile event will bring together elite athletes from across the region, with nine countries already confirming their participation. Among them are Zambia, Malawi, Seychelles, Lesotho, Angola, Mozambique, Mauritius, Eswatini and host Zimbabwe.\n“Zimbabwe is ready. As SADC Chair and host, we are proud to open our doors to the region. Every detail from logistics to competition is being finalised. The nation stands behind our athletes, and we look forward to hosting a successful and inspiring championship,” NAAZ president, Tendai Tagara said.\nThe championship, which runs under the theme “One Track. One Region. One Dream,” serves as a key platform for athletes to qualify for international competitions, including the upcoming World Senior Championships scheduled for Tokyo in September.\n“Zimbabwe is ready. As SADC Chair and host, we are proud to open our doors to the region. Every detail, from logistics to competition, is being finalised. The nation stands behind our athletes, and we look forward to hosting a successful and inspiring championship,” said National Athletics Association of Zimbabwe (NAAZ) president, Mr Tendai Tagara.\n“We are currently preparing for the Southern Region SADC track and field championships set for Harare from the 25th to the 27th of July. Team Zimbabwe has a large contingent and we are expecting stiff competition from our neighbours, especially Botswana, Zambia, and Malawi. Our athletes are spread across the country, training with their individual clubs and coaches. They will assemble in camp a few days before the competition to gel for relays and final preparations. As a nation, we are aiming for a strong performance, more gold medals than our competitors, and improved times for World Championships qualification. We expect national and personal records to be set,” said Zimbabwe Senior Athletics Head Coach, Mr Phakamile Lisimathi.",
            "time": "09:11",
            "date": "03 Jul 2025"
        },
        {
            "title": "FC Platinum fixtures postponed as club mourns Brian Banda",
            "href": "https://www.zbcnews.co.zw/fc-platinum-fixtures-postponed-as-club-mourns-brian-banda/",
            "content": "Story by Mthokozisi Dube\nFC Platinum have successfully secured the postponement of their men’s and women’s fixtures this week, citing their hectic schedule after the death of midfielder Brian Banda on Sunday.",
            "time": "09:11",
            "date": "03 Jul 2025"
        },
        {
            "title": "Brian Banda to be laid to rest on Thursday in Bulawayo",
            "href": "https://www.zbcnews.co.zw/brian-banda-to-be-laid-to-rest-on-thursday-in-bulawayo/",
            "content": "Story by Mthokozisi Dube\nTHE late FC Platinum midfielder Brian Banda, who died in a horrific car accident along the Zvishavane–Bulawayo highway on Sunday, will be buried at West Park Cemetery in Bulawayo this Thursday.\nDespite the fierceness of football rivalries, players have a strong relationship off the field and this was evident when footballers converged in Cowdray Park, Bulawayo, this Tuesday to pay their last respects to Banda.\nThe players, who had a strong bond with the late Banda, are still struggling to come to terms with the reality that one of their own is no more.\n“I had a call with him on Saturday, and he had agreed to meet me on Sunday in Bulawayo, and little did I know it was the last call. I am in pain. I regarded him as a brother,” said Genius Mutungamiri.",
            "time": "09:11",
            "date": "03 Jul 2025"
        },
        {
            "title": "Three referees suspended as ZIFA cracks down on poor officiating",
            "href": "https://www.zbcnews.co.zw/three-referees-suspended-as-zifa-cracks-down-on-poor-officiating/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe Football Association (ZIFA) has suspended three referees for poor officiating.\nReferees Lloyd Mapanje and Grace Gimo, alongside assistant referee Claris Simango, will each be suspended for four matches.\nIn a statement, ZIFA said Mapanje and Simango could not meet expected standards when they officiated a match between Dynamos and Yadah on the 19th of June, while Gimo’s performance during the Green Fuel and TelOne match played on June 14 was judged to be below expected standards.\nZIFA has emphasised the critical role that match officials play in maintaining the credibility of the game, hence the association’s continuous monitoring of their performance.\nMeanwhile, Premier Soccer League action enters Week 19 this weekend, with log leaders MWOS involved in a tricky home tie against Bikita Minerals on Saturday.\nAfter shooting back to the top, the debutants believe pole position comes with a lot of pressure, noting the need for the team to remain focused.\n“It is good to be back on top. Our next assignment is not an easy game, but we will prepare. My boys should keep their heads down, keep focused. Our target remains to survive relegation. We can talk about the race after the 40-mark point,” said Mutasa.\nMatch Day 19 action begins with Green Fuel hosting Ngezi Platinum in Chisumbanje on Saturday.\nOn the same day, Chicken Inn play Yadah at Luveve, Manica Diamonds entertain FC Platinum at Sakubva, Simba Bhora date ZPC Kariba at Wadzanayi, and Dynamos lock horns with Herentals.\nOn Sunday, Triangle host TelOne at Gibbo, as Scottland and CAPS United face off at the ceremonial home of football, Rufaro.\nThe game between Kwekwe United and Highlanders, set for Bata Stadium, concludes Match Day 19 fixtures.\nThe match comes at a time the Bulawayo giants have re-appointed committee member Kindman Ndlovu as Acting Chief Executive Officer until further notice.",
            "time": "09:11",
            "date": "03 Jul 2025"
        },
        {
            "title": "Zimbabwe names Sables squad to defend Rugby Africa Cup crown",
            "href": "https://www.zbcnews.co.zw/zimbabwe-names-sables-squad-to-defend-rugby-africa-cup-crown/",
            "content": "Story by Thembinkosi Mangena\nTHE Zimbabwe Rugby Union (ZRU) has announced the Sables squad for the 2025 Rugby Africa Cup, scheduled to be hosted by Uganda from July 8 to July 19.\nZimbabwe’s senior rugby team will be aiming to defend the continental title when they take to the field at Mandela National Stadium in Kampala, Uganda.\nThe squad retains the core of last year’s championship-winning side, while introducing key additions to strengthen the team.\nAmong those making a return are pacey winger Matthew McNab, resilient flanker Jason Fraser, and reliable kicker Lenience Tambwera, who all bring valuable experience as the Sables gear up for what could be a historic campaign.\nSpeaking ahead of the team’s departure, captain Hilton Mudariki emphasised the need for focus and discipline.",
            "time": "09:11",
            "date": "03 Jul 2025"
        }
    ]
}