{
    "news": [
        {
            "title": "Sprinter Makanakaishe Charamba breaks national 200m record",
            "href": "https://www.zbcnews.co.zw/sprinter-makanakaishe-charamba-breaks-national-200m-record/",
            "content": "\nStory by Raynald Ngwarati\nZimbabwean athletes continue to show their mettle among the world’s best in sport after three Zimbabweans shone on the international stage held at the united States of America’s Clemson University Indoor Track and Field Complex, in South Carolina this Saturday.\nOn the athletics front it was sprinter, Makanakaishe Charamba, won the Tiger Paw Invitational 200 meter indoor race in a national record of 20.16 seconds.\nHis time was enough to break the national 200 metres record and becomes the worlds eight fastest indoor time.\nFellow Zimbabwean Tapiwa Makarawu who finished second in the race got his personal best time of 20 point three one seconds, the second fastest time at the event.\nIn rugby, national team flanker Tinotenda Mavesere was named the Man of the Match after a stellar individual performance that helped Sharks to a 29-19 win over Bulls in the United Rugby Championship in Pretoria, South Africa this Saturday night.",
            "time": "18:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Zim U-21 hockey teams gear up for Junior Africa Cup",
            "href": "https://www.zbcnews.co.zw/zim-u-21-hockey-teams-gear-up-for-junior-africa-cup/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE Zimbabwe Under-21 hockey teams have started preparations for the Junior Africa Cup set to be held in Namibia within the next two months.\nThe tournament, which was initially set for December last year, will see junior teams competing for the African title and earn a slot for the International Hockey Federation (FIH) Junior World Cups.\nZimbabwe is fielding both men’s and women’s teams at the continental event with the ultimate goal to secure a podium finish and qualify for the FIH Junior World Cups.\nThe tournament will feature 24 teams in both men’s and women’s competitions for the first time.\nCoach, Prince Mwale, has retained most of the players from the squads announced last year in October, with a few additions and adjustments.",
            "time": "18:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Tag rugby gains momentum in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/tag-rugby-gains-momentum-in-zimbabwe-2/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTag Rugby Trust has launched a senior tag tournament, a non-contact version of traditional rugby, which got underway at Harare Sports Club this Friday.\nThe sport was introduced in the country three years ago, to develop a national team to represent Zimbabwe in international competitions.\nTag Rugby was not solely driven by the prospect of participating in the 2026 World Cup, but rather to promote the sport in communities, clubs, and high schools.\nThe focus has been on high-density areas, with the aim of providing exposure and opportunities for young people to travel and compete internationally.\nThe response has been encouraging, with five clubs and seven schools participating in the sport.",
            "time": "18:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Tag rugby gains momentum in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/tag-rugby-gains-momentum-in-zimbabwe/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTag Rugby Trust has launched a senior tag tournament, a non-contact version of traditional rugby, which got underway at Harare Sports Club this Friday.\nThe sport was introduced in the country three years ago, to develop a national team to represent Zimbabwe in international competitions.\nTag Rugby was not solely driven by the prospect of participating in the 2026 World Cup, but rather to promote the sport in communities, clubs, and high schools.\nThe focus has been on high-density areas, with the aim of providing exposure and opportunities for young people to travel and compete internationally.\nThe response has been encouraging, with five clubs and seven schools participating in the sport.",
            "time": "18:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Courtney Lock and Indian partner through to semi-finals of 2025 Delhi Open",
            "href": "https://www.zbcnews.co.zw/courtney-lock-and-indian-partner-through-to-semi-finals-of-2025-delhi-open/",
            "content": "\nStory by Patience Nyagato\nZimbabwe’s top tennis player Courtney Lock and his Indian partner Niki Poonacha made the semi-finals in doubles at the 2025 Delhi Open 2025 tennis tournament this Thursday.\nZimbabwe’s doubles specialist Courtney Lock and his partner Poonacha are through to the last four after a hard-fought victory over Japan’s Shintaro Mochizuki and Kaito Uesugi in the quarter-finals at the DLTA Complex, in Delhi.\nThe pair won the three-set thriller 6-3, 2-6, 10-5 to move to the semi-finals of the Delhi Open.\nThe two were ecstatic about their progress.",
            "time": "18:27",
            "date": "16 Feb 2025"
        }
    ]
}