{
    "news": [
        {
            "title": "MWOS, Scottland pick wins in PSL Match-day 10",
            "href": "https://www.zbcnews.co.zw/mwos-scottland-pick-wins-in-psl-match-day-10/",
            "content": "Story by Raynald Ngwarati\nMWOS FC have opened up a three-point lead at the summit of the Castle Lager Premier Soccer League after beating Chicken Inn by a single goal to nil on their first visit to Luveve Stadium this Sunday.\nFortune continues to smile on the Premier Soccer League new-boys MWOS and Scottland after the two recent PSL recruits clinched wins again in their respective matchday 10 encounters to present what can be perceived as a shift in the balance of power.\nThe log leaders took advantage of Simba Bhora’s draw on Saturday to open breathing space at the summit, courtesy of Nigel Matinha’s 37th minute thunderous strike into the roof of the net.\nScottland FC who were competing with MWOS in the Northern Region Soccer League last year also registered a perfect outing moving into third on the standings as they outshone fading giants Dynamos.",
            "time": "20:35",
            "date": "04 May 2025"
        },
        {
            "title": "Musabvunda half marathon eyes grooming future long-distance athletes",
            "href": "https://www.zbcnews.co.zw/musabvunda-half-marathon-eyes-grooming-future-long-distance-athletes/",
            "content": "Story by Raynald Ngwarati\nPREPARATIONS are in full swing for the third edition of the Musabvunda Half Marathon slated for Blackistone Primary School on May 11, with special emphasis on grooming future long-distance athletes.\nWith an existing gap in the long-distance athletics grooming base, the organisers of the marathon are eyeing to attract younger audiences in order to set the platform for the country’s excellence on the international scene.\nSpeaking to ZBC News at the venue, Musabvunda Chief Executive Officer Kudzai Pasipanodya outlined the initiatives in motion to make this year’s edition bigger and better as well as the future of the marathon.\n“This is our third edition and next year, we are going to make this a full marathon. It will be a qualifier for the Olympics, for Comrades and the Two Oceans. We want to groom the young people so that they can achieve their God-given talents and we try to promote sport through that.”",
            "time": "20:35",
            "date": "04 May 2025"
        },
        {
            "title": "Sables win Battle of the Zambezi",
            "href": "https://www.zbcnews.co.zw/sables-win-battle-of-the-zambezi/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Sables have won the first edition of this year’s Battle of the Zambezi after walloping Zambia 70-15 at Harare Sports Club this Sunday to mark an emphatic start to the 2025 rugby season.\nIt was a perfect return to action for the Sables this Sunday as the reigning African champions made a statement of intent by emphatically thumping Zambia in their season opener.\nThe Pieter Benade-coached side showed their hunger from the get-go, putting in a valiant display to break the Zambian wall earlier into the match to take a 28-10 lead at halftime.\nWith the 18-point advantage, the largely locally assembled arsenal turned even deadlier with precise attack and a solid backline to restrict Zambia from adding to the scoreboard.\nIt was a one-sided affair in the second half as Zambia could only manage to score one try in the last 40 minutes, while Zimbabwe’s 28 was translated to 70.\nTyrone Gombe completed the rout for the home team, scoring his first try to punish Zambia who conceded a score of 70 to sum up the dominance of the local-based Sables.",
            "time": "20:35",
            "date": "04 May 2025"
        },
        {
            "title": "Bournemouth stun Arsenal, Aston Villa improve Champions League",
            "href": "https://www.zbcnews.co.zw/bournemouth-stun-arsenal-aston-villa-improve-champions-league/",
            "content": "BOURNEMOUTH won away at Arsenal for the first time in the Premier League on Saturday, and completed a memorable double to boost their chances of playing in Europe next season, thanks to a second-half fightback en route to a thrilling 2-1 win.\nAston Villa beat Fulham 1-0 to improve their hopes of finishing in the league’s top five and qualifying for the Champions League, while Leicester City defeated fellow relegated side Southampton 2-0 to end their nine-game drought without a goal at King Power Stadium.\nEverton’s emotional farewell to Goodison Park continued with an entertaining 2-2 draw against Ipswich Town as the relegated visitors came from two goals down to rescue a point.\nAt Emirates, Arsenal’s preparations for their huge Champions League second leg against Paris St Germain on Wednesday took a huge blow after Bournemouth’s Evanilson and Dean Huijsen scored in quick succession.\nDeclan Rice gave the Gunners the lead in the 34th minute, rounding goalkeeper Kepa Arrizabalaga and producing an accomplished finish on his 100th Arsenal appearance.\nArsenal had chances to extend their lead, but Dean Huijsen gave Bournemouth a deserved equaliser in the 67th minute before Evanilson bundled home eight minutes later to complete the turnaround.“Massive disappointment,” Gunners captain Martin Odegaard told Sky Sports. “It is too chaotic and too sloppy from us. The second half is not acceptable.\n“It is a massive game on Wednesday, but we have to use today to be ready and beat PSG on Wednesday.”\nBournemouth move up to eighth in the table, which could be enough for European football next season, with 53 points, while Arsenal, who have just two league wins from six games, stay second with 67 points, three points above third-placed Manchester City.\n“First of all we knew that we have never got a point here and that motivated us more. We’re a team that always give our all,” Huijsen told Sky Sports. “It’s a really important three points for us.”\nAt Villa Park, Belgian midfielder Youri Tielemans headed home John McGinn’s 12th-minute corner.",
            "time": "20:35",
            "date": "04 May 2025"
        },
        {
            "title": "Zim’s U-18 girls’ handball team clinch silver at Zone VI Games",
            "href": "https://www.zbcnews.co.zw/zims-u-18-girls-handball-team-clinch-silver-at-zone-vi-games/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Under 18 girl’s handball team settled for silver at the 2025 International Handball Federation Zone VI games after losing 22-30 to Zambia this Saturday.\nThe team narrowly missed out on a ticket to the IHF continental championships after falling prey to neighbours Zambia in an action-packed match played at Chitungwiza’s Aquatic Complex.\nThe hosts who had outclassed South Africa 33-27 on Friday found a tougher task against the Zambians who put on a show to clinch the sole ticket to the Under 18s continental finals.\nPlaying in front of their home crowd, the Zimbabwe Under 18 girls tried every trick in their book to upset the Zambian side, but yet again, they were victims to a recurrence of history.\nPlaying against the ZONE VI powerhouses was expected not to be an easy task for Zimbabwe considering Zambia’s recent dominance across the men and women’s categories, however there was optimism within the camp that odds could be beaten.",
            "time": "20:35",
            "date": "04 May 2025"
        }
    ]
}