{
    "news": [
        {
            "title": "Mighty Warriors bow out of the AWCON qualifiers",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-bow-out-of-the-awcon-qualifiers/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE are out of the Africa Women Cup of Nations qualifiers after losing 5-4 on penalties to Angola at the Lucas Moripe Stadium in South Africa this Wednesday.\nThe Mighty Warriors went into the match needing to overturn a 2- 1 defeat in the first leg.\nZimbabwe started strongly and went into the lead courtesy of Ethel Chinyerere’s strike from close range to give her side the lead.\nThe Mighty Warriors continued to push and were duly rewarded at the stroke of halftime after speedy winger Christabel Katona tapped the ball home.\nZimbabwe went into the breather leading 2-nil but failed to manage the game in the second half, especially after the withdrawal of captain Emmaculate Msipa who was controlling play.\nAngola pounced and scored in the 75th minute, to force a 3-all aggregate score and eventually a penalty shootout.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Former Zimbabwe Rugby Union president Aaron Jani passes away after long illness",
            "href": "https://www.zbcnews.co.zw/former-zimbabwe-rugby-union-president-aaron-jani-passes-away-after-long-illness/",
            "content": "Story by Lawrence Trusida, Sports Editor\nFORMER Zimbabwe Rugby Union (ZRU) President, Aaron Jani has died.\nHe was 54.\nJani, who was also Rugby Africa Treasurer, passed on Wednesday morning in Harare after a long illness, ZRU confirmed.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Ngodzo joins Gwanda Pirates as head coach",
            "href": "https://www.zbcnews.co.zw/ngodzo-joins-gwanda-pirates-as-head-coach/",
            "content": "Story by Providence Maraneli\nGWANDA Pirates fans are bubbling with confidence after the club unveiled former Highlanders midfielder Johannes Ngodzo as their new head coach.\nAfter securing the services of the yesteryear midfield maestro, Johannes ‘Signature’ Ngodzo as Gwanda Pirates coach, the mining town is excited and hopeful of finally bringing Premier Soccer League football back to Phelandaba stadium.\nNgodzo, who has coaching experience with Adachi FC and Bantu Rivers has already hit the ground running with a stellar performance against Highlanders in a friendly match on Saturday has priced away the hearts of the black and white fans.\n“The new coach has the experience as a player and we hope he is going to bring it to the team,” a fan said.\nThe new gaffer is confident of turning around the fortunes of Gwanda football.\n“From the performances I am getting from the boys, I am confident that if we are united and we can build a formidable team. A team that can compete at the top,” said Ngodzo.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "Mighty Warriors eye comeback against Angola in crucial 2026 WAFCON qualifier",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-eye-comeback-against-angola-in-crucial-2026-wafcon-qualifier/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Mighty Warriors are seeking to overturn a 2-1 deficit when they take on Angola in the reverse encounter of the first round of the 2026 CAF Women Africa Cup of Nations qualifier set for Lucas Moripe stadium in South Africa this Wednesday.\nZimbabwe have their backs against the wall as they must overturn the deficit to progress to the second round of the WAFCON qualifiers.\nThe Mighty Warriors lost in Luanda and they believe they are ready to wrestle back the momentum after close to a week with the whole team in camp.\nDespite the hard task at hand the Mighty Warriors are determined to get a positive result.\n“The girls are happy, the weather is great, and we are having positive conversations about the game on Wednesday, the team bonding is super, and our preparations are going well. We are working on the areas where we lacked in the previous match.\n“My message to the girls is that the marathon continues, the race is not yet over. We still have 90 minutes plus to win, and that means we have a chance,” Mighty Warriors captain, Emmaculate Msipa said.\nMeanwhile, the Mighty Warriors joined former Warriors captain Peter Ndlovu in celebrating the legend’s 52nd birthday in South Africa this Tuesday.\nSpeaking at a breakfast meeting organised by South African-based funeral services company, Zororo-Phumulani, Ndlovu challenged the new ZIFA leadership to continue supporting the Mighty Warriors.",
            "time": "08:41",
            "date": "27 Feb 2025"
        },
        {
            "title": "ZIFA Referees Committee tightens grip",
            "href": "https://www.zbcnews.co.zw/zifa-referees-committee-tightens-grip/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE newly appointed ZIFA referees committee has come up with a number of new measures meant to improve the officiating of matches in the country.\nWith the Premier Soccer League set to kick off this Friday, the newly appointed ZIFA Referees Committee led by Faith Mloyi moved in swiftly to put their house in order.\nThe committee hosted a training workshop facilitated by the respected former referee and former SRC Chairperson Anthony Mandiwanza, with ZIFA vice-chairperson Kennedy Ndebele representing the football mother body.\nThe workshop culminated in key resolutions being passed to try and improve the officiating of matches in the country following a year that saw officials hogging the spotlight for the wrong reasons.\nSome of the landmark resolutions include that all financial transactions related to refereeing will be handled exclusively by ZIFA, and no payments will be processed outside the association’s structures.\nAs a way of maintaining integrity and eliminating conflicts of interest, committee members will no longer serve as match officials in any capacity, including as assessors or match commissioners.",
            "time": "08:41",
            "date": "27 Feb 2025"
        }
    ]
}