{
    "news": [
        {
            "title": "Triangle United eye first win at renovated Gibbo",
            "href": "https://www.zbcnews.co.zw/triangle-united-eye-first-win-at-renovated-gibbo/",
            "content": "Story by Gay Matambo\nSTRUGGLING Triangle United are banking on home advantage comfort as they seek a change of fortunes when they host Highlanders at Gibbo Stadium this Sunday in a Premier Soccer League encounter.\nThe Sugar Sugar boys started the season at a very slow pace after failing to win any match so far this season.\nTheir problems have been compounded by playing away from home as Gibbo Stadium was undergoing renovations.",
            "time": "08:40",
            "date": "05 Apr 2025"
        },
        {
            "title": "Ngezi Platinum seek to extend lead against struggling CAPS United",
            "href": "https://www.zbcnews.co.zw/ngezi-platinum-seek-to-extend-lead-against-struggling-caps-united/",
            "content": "Story by Mthokozisi Dube\nHARARE giants, CAPS United are hoping to raise the bar when they clash with former champions and current log leaders, Ngezi Platinum at Rufaro stadium this Sunday.\nThe Green Machine are 14th on the log with four points from four matches, with one of the two defeats this season being inflicted by TelOne at Bata Stadium in Gweru.\nMadamburo are oozing with confidence, enjoying a purple patch which saw them collect maximum points over Triangle in their last outing to occupy pole position.\nThe two sides are separated by six points and CAPS United Assistant Coach, Tonderai Marime says Sunday’s blockbuster game is a must-win for the Harare giants to restore lost pride.\n“After the weekend’s game, we sat and had an analysis of how we have played so far from the beginning of the season up to now. What we concluded was that we feel we are punching below our weight and of course, we are disappointed after the weekend’s result. The result is not a true reflection of the game.\n“I think we gave it our all. We got into very good positions to score and we did everything and the result does not match the performance of the team but this is CAPS United, expectations are always to perform and we are all aware of that,” Marime said.\nOnce touted as the Cup Kings in the past, Harare giants, CAPS United have travelled the success path under different coaches with their most decorated campaign coming under Charles Mhlauri in 2004 they won the league with just one loss.\nLloyd Chitembwe also wrote the success story with the team in 2016 but he has had a fair share of challenging campaigns later on.\nMeanwhile, match-day five fixtures begin this Saturday with Manica Diamonds hosting Dynamos at Sakubva, while Chicken Inn will be hunting for a first win in a home clash with Herentals.",
            "time": "08:40",
            "date": "05 Apr 2025"
        },
        {
            "title": "National Chess Championship set for the second week of April",
            "href": "https://www.zbcnews.co.zw/national-chess-championship-set-for-the-second-week-of-april/",
            "content": "Story by Lawrence Trusida, Sports Editor\nDEFENDING women’s champion, Christine Makwena is excited about the return of the CBZ National Chess championship after the principal sponsors committed for another year.\nThe CBZ National Chess championship is the pinnacle of all tournaments in the country where all the top players will showcase their craft and it is also a selection platform for the national team.\nIt is set for Harare from April 7 to 12.\n“I am excited that everything is confirmed and we also have big companies coming on board to support our sport, I want to defend my title I have been preparing well and I hope I will be on top of my game,” Makwena said.\nShe had a stellar 2024 season winning both the national and the Easter Open titles.\nMeanwhile, the sponsors are delighted to be helping athletes achieve their dreams.\n“We are happy to be doing our part as a corporate, Chess is a sport of the mind and we want healthy minds in the country and we also want to help these players to achieve their dreams,” CBZ Group Marketing Officer, Matilda Nyathi said.",
            "time": "08:40",
            "date": "05 Apr 2025"
        },
        {
            "title": "ZIFA Committee set to engage foreign-based players",
            "href": "https://www.zbcnews.co.zw/zifa-committee-set-to-engage-foreign-based-players/",
            "content": "Story by Mthokozisi Dube\nTHE newly established Zimbabwe Football Association (ZIFA)’s Global and Diaspora Committee is ready to court footballers plying their trade outside the country to come back and represent Zimbabwe.\nElections are done and dusted and the induction of newly established ZIFA committees has set the tone for execution of a new vision.\nWith hands on deck, the Global and Diaspora Committee is ready for the challenge to bring the global flair to the national team.\nChairperson of the committee, Marshal Gore, believes they are ready to woe players with Zimbabwean birth to don the national colours.\n“We had our inductions as a committee, first I would like to thank the executive for inviting me to take up the challenge and the journey to improve our local football. Ours is a continuation of what we have been doing. We have a huge database of players in the UK and we want to convince them to come and represent the country,” Gore said.",
            "time": "08:40",
            "date": "05 Apr 2025"
        },
        {
            "title": "Gilbert Sengwe joins elite list of Zimbabweans licensed by the English FA",
            "href": "https://www.zbcnews.co.zw/gilbert-sengwe-joins-elite-list-of-zimbabweans-licensed-by-the-english-fa/",
            "content": "Story by Zbc reporter\nZIMBABWEAN football agent, Gilbert Sengwe has officially received his license from the English Football Association (FA), a significant achievement that enhances his capacity to work within the English football sector.\n“I am very pleased to have this recognition from the English FA as it gives me an opportunity to work with clubs in Europe. This will help our local talented players have opportunities to try their luck in the European leagues,” Sengwe said.\nThis development is expected to widen opportunities for Zimbabwean footballers aspiring to break into the lucrative English leagues.\nSengwe, a registered FIFA intermediary, has already proven his expertise in talent management by facilitating the moves of Cameroonian players Christian Epoupa and Albert Eonde to Zimbabwe.\nHe also manages, Raphael Pitisi, Archford Faira, Mason and McKinnon Mushore, including Leeroy Mavhunga, Tendai Magwaza, and Stanley Ngala.\nSengwe’s vision is to provide Zimbabwean players with international exposure, particularly through trials in Europe.",
            "time": "08:40",
            "date": "05 Apr 2025"
        }
    ]
}