{
    "news": [
        {
            "title": "Six candidates to contest ZIFA presidency",
            "href": "https://www.zbcnews.co.zw/six-candidates-to-contest-zifa-presidency/",
            "content": "The ZIFA Normalisation Committee has announced the names of the six candidates who will battle it out for the association’s top job next month.\nA statrment released this Monday by the committee reads:\n“The ZIFA Normalisation Committee acting as the ZIFA Electoral Committee in accordance with Article 85(9) is pleased to announce the names of all the candidates who have met the eligibility criteria stipulated in the ZIFA Statutes, 2024.\n“The list of successful candidates is as follows:Presidential Candidates:Marshall GorePhilemon MachanaNqobile MagwiziMartin KwezaTwine PhiriMakwinje Phiri\nVice President Candidates:Mavis GumboPatience MutumwaWinnet MurotaJoyce R KapotaLoveness MukuraKennedy NdebeleOmega SibandaPeter DubeFrancis NyamutsambaSimbarashe J Takava",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "ZIFA candidates to be annouced today",
            "href": "https://www.zbcnews.co.zw/zifa-candidates-to-be-annouced-today/",
            "content": "Candidates for the ZIFA elections set for the 25th of next month are expected to be announced today.",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Norman Maroto honoured with legends cup",
            "href": "https://www.zbcnews.co.zw/norman-maroto-honoured-with-legends-cup/",
            "content": "Story by Wellington Makonese\nFOOTBALL enthusiasts thronged Dzivarasekwa Stadium this Sunday for a four-team tournament in memory of former Dynamos striker Norman Maroto, who left a rich legacy beyond the football pitch.\nThe Norman Maroto Legends Cup brought together former professionals, local stars and rising talent in a display of skill and sportsmanship.",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Pazani to become first African rugby referee in Europe’s Six Nations tournament",
            "href": "https://www.zbcnews.co.zw/pazani-to-become-first-african-rugby-referee-in-europes-six-nations-tournament/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZimbabwe’s top rugby referee Precious Pazani continues to break records as she is set to become the first African referee outside of South Africa to officiate in the Europe’s Six Nations tournament next year.\nThe trailblazing Pazani is set to take charge of England’s clash with Italy in York on the 23rd of March next year in the Women’s Six Nations tournament.\nThe Six Nations Championship known as the Guinness Six Nations is an annual international rugby competition between European nations England, France, Ireland, Italy, Scotland and Wales.\nThe officiating team for the 2025 Women’s Six Nations was announced this Friday in what will be the final window of internationals for those hoping to make the 22-strong refereeing team for next year’s World Cup.\nThe former basketball player Pazani took a massive leap in her quest to become the first Zimbabwean to officiate at the Rugby World Cup after her appointment for the upcoming Women’s Six Nations.",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Installation of bucket seats at National Sports Stadium commences",
            "href": "https://www.zbcnews.co.zw/installation-of-bucket-seats-at-national-sports-stadium-commences/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE upgrade of the National Sports Stadium (NSS) to meet international standards is progressing well, with the installation of buckets seat having commenced.\nThe NSS has been closed for a while, however, fans might not wait much longer to catch a glimpse of action in the country’s biggest stadium as renovations are progressing.\nThe Warriors, the Mighty Warriors and clubs participating in the inter club competitions have had to host matches outside the country due to a lack of CAF approved venue in the country.\nThat could soon be a problem of the past as one of the key challenges at the venue is now being addressed, the issue of bucket seats.\nEngineers on-site are busy installing bucket seats at the facility to ensure it meets international standards.\nCurrently, they are working on the VIP area which is Bays 15-18 before they also focus on the VVIP section which is housed inside Bay 17.\nBay 19 which is part of the rest of ground has already been fitted with the bucket seats.\nThe engineers on site have already invited the ZIFA First Instance Board (FIB) which is in charge of implementing the CAF stadium requirements.\nThe FIB was satisfied with the way the seats are being installed and went on to invite CAF inspectors who are expected in the country early January to assess progress and give recommendations if any, before moving onto the rest of the facility.\nThe seats were purchased through a Public Private Partnership (PPP) between government and Sakunda Holdings.",
            "time": "20:33",
            "date": "23 Dec 2024"
        }
    ]
}