{
    "news": [
        {
            "title": "Ngoni Stadium to host inaugural top-flight match",
            "href": "https://www.zbcnews.co.zw/ngoni-stadium-to-host-inaugural-top-flight-match/",
            "content": "Story by Tamuka Charakupa\nPREMIERE League debutants MWOS, are set to host giants Dynamos in their first home league fixture at their newly approved Ngoni Stadium in Norton this Monday.\nMWOS, who are riding high at the top of the table, are confident of beating the country’s most decorated club, Dynamos next week.\nThe team has had a dream start to life in the big league our wins and two draws from their opening six matches, collecting 14 out of a possible 18 points.\nDynamos on the other hand are struggling with just six points from six games hovering dangerously close to the relegation zone.\nMWOS head coach Lloyd Mutasa said his team is here to stay, promising improved form following the approval of Ngoni Stadium as its home ground.\n“The team is highly motivated following our positive run since we joined the top flight league. Dynamos, just like any other premiership side, are not any easy game but we are promising our best effort to prove a point. We now have our own home ground in Norton and obviously it’s always a positive atmosphere to play in front of our fans,” Mutasa said.\nThe local community is upbeat the establishment of the Ngoni Stadium will attract downstream benefits.\n“This stadium now has a capacity of around 7 000 up from just 500. In terms of renovations we are at 98 %. However, we have plans to construct our own stadium that is AFCON approved as we are currently renting Ngoni from Norton Town Council,” MWOS Chairperson, Clayton Arimoso said.\n“This is a partnership that is a step towards our goal of attaining a municipal status. Our vendors have also benefitted in the process through the construction of modern vending tables,” Norton Town Council, Mayor, Councillor Action Mataruse said.\n“This means our community now has access to entertainment activities which goes a long way in fighting drug and substance abuse,” Norton town Council, Councillor Tinashe Machemedze said.",
            "time": "18:07",
            "date": "20 Apr 2025"
        },
        {
            "title": "Zim students set for elite sports training in France",
            "href": "https://www.zbcnews.co.zw/zim-students-set-for-elite-sports-training-in-france/",
            "content": "Story by Wellington Makonese\nTHE pursuit of sporting excellence continues to gather momentum within Zimbabwean schools, with Samuel Centenary Academy set to embark on a transformative week-long sports tour at the prestigious FMC Academy in France.\nThe tour will expose talented students to high-level training in rugby, basketball, and football, under the guidance of expert coaches in the French capital.\nThe initiative forms part of an international exchange programme, designed to enhance both physical development and professional exposure for Zimbabwean learners.\n“As a school, we are embarking on this tour as part of an exchange programme, so that our learners get expert training in basketball, rugby and soccer in France. This aligns with the heritage curriculum and is critical in terms of having the physical well-being of our students coupled with expertise in sports. It gives them more options,” a representative from Samuel Centenary Academy, Yeukai Matsikarima said.\nFor the participating students, this tour represents more than just a training opportunity; it is a significant platform and a potential stepping stone to greater heights.\n“I am really excited about this opportunity which affords me an opportunity to get scholarships and even further training in my field,” a student said.",
            "time": "18:07",
            "date": "20 Apr 2025"
        },
        {
            "title": "Jam West target Premier League promotion in debut central region season",
            "href": "https://www.zbcnews.co.zw/jam-west-target-premier-league-promotion-in-debut-central-region-season/",
            "content": "Story by Courage Bushe\nNEW entrants to the Central Region Soccer League, Jam West, have declared their intentions loud and clear, securing promotion to the Premier Soccer League (PSL) in their maiden campaign.\nOriginally formed four years ago as a social team to provide entertainment for miners in Mberengwa District, Jam West transitioned into professional football after registering in Division Two last year, where they went on to win the league title.\nNow competing in the Central Region Soccer League, the Mberengwa-based side is determined to make history by becoming the first team to bring top-flight football to the district.\nFollowing their impressive 1–0 away victory against Dinson FC in Mvuma last weekend, the “Yellow Boys” are brimming with confidence ahead of their next fixture, a clash with former Premier Soccer League giants Shabani Mine FC at Maglas Stadium this Sunday.\n“Last weekend we won against Dinson at their own backyard which was a perfect start for us. We do not fear anyone in the league and we are here to leave a mark. We have been training well this week in preparation of our highly anticipated clash with Shabani Mine fc. All I can say is we are ready for them and we will win,” Jam West Coach, Ashell Gutu said.",
            "time": "18:07",
            "date": "20 Apr 2025"
        },
        {
            "title": "Bulawayo hosts ANTUSA games as SADC educators unite through sport",
            "href": "https://www.zbcnews.co.zw/bulawayo-hosts-antusa-games-as-sadc-educators-unite-through-sport/",
            "content": "Story by Mthokozisi Dube\nEDUCATORS from the SADC region under the Non-Aligned Teachers Union (ANTUSA) are unwinding through sport at Hillside Teachers College in Bulawayo in a move aimed at exchanging ideas.\nInitiated in Kabwe, Zambia in 2007, the ANTUSA games have made a third-time return to Zimbabwe with previous editions having been held in Harare and Victoria Falls.\nMade up of eight unions from the SADC region, the games are used as a platform to unwind for educators, while also acting as a platform to cross-pollinate ideas to improve the education sector.\n“We are happy to be hosting the 15th edition of the games. Since the formation of the games, we have seen strides in the transfer of ideas to improve the education sector,” ANTUSA President, Mkhuseli Dube stated.\nANTUSA leaders also believe the games act as a unifier in the region as they are held on a rotational basis.\n“The union was formed in Zambia so we represent a bigger population. We have benefitted from these games as we use them to learn how other sister countries are doing it to improve the games,” Basic Education Teachers Union of Zambia’s President, Binstone Tembo said.",
            "time": "18:07",
            "date": "20 Apr 2025"
        },
        {
            "title": "Zimbabwean NFL star, Thabani Maguranyanga champions Zim’s sports tourism agenda",
            "href": "https://www.zbcnews.co.zw/zimbabwean-nfl-star-thabani-maguranyanga-champions-zims-sports-tourism-agenda/",
            "content": "Story by Wellington Makonese\nZIMBABWEAN-born star, who plays in America’s National Football League (NFL), Thabani Maguranyanga is in the country and pushing Zimbabwe’s sports tourism agenda.\nThe Ministry of Tourism and Hospitality Industry this Wednesday evening hosted NFL’s new signing, Maguranyanga, who is now on the books of Washington Commanders.\nThe government appreciated Maguranyanga’s achievements and those of other sports personalities plying their trade abroad.\n“We want to work with other sports codes, but you are the first and we think you have done a great job. We want sports tourism to bring tourism into the country. What you have done is great and we are in full support. Leaders are not just government and church leaders, you are leaders and have the wisdom to lead,” Minister of Tourism and Hospitality Industry, Honourable Babra Rwodzi said.\nMaguranyanga views his recent transition to the NFL as an opportunity to inspire young Zimbabweans and elevate the Zimbabwe brand on the global stage.\n“I am honoured and excited to be here and do this country proud. I want Zimbabwean kids to be up there and have the next generation of our brothers be in EPL Formula One and be the greatest country in the world. I will try to ensure that my teammates get to know about what we have here,” he said.\nPrior to his NFL signing, Maguranyanga represented the Zimbabwe Rugby team and was named among the 13 players in the International Pathway Player programme for 2025 before joining the Washington Commanders.",
            "time": "18:07",
            "date": "20 Apr 2025"
        }
    ]
}