{
    "news": [
        {
            "title": "ZIFA asked to take appropriate steps to bring European brigade to the Warriors",
            "href": "https://www.zbcnews.co.zw/zifa-asked-to-take-appropriate-steps-to-bring-european-brigade-to-the-warriors/",
            "content": "Story by Raynald Ngwarati\nThe incoming Zimbabwe Football Association (ZIFA) board has a tough assignment ahead to take Zimbabwe to the next heights in football by tapping into the country’s abundant football talent based in Europe and other continents.\nFrom the days of Peter Ndlovu who became the first African export in the modern English Premier League era and former Liverpool goal minder Bruce Grobelaar, Zimbabwe has always produced exciting football talent.\nThe older generations always reminisce the ‘Dream Team’ under German coach Reinhard Fabisch which was arguably the best ever Warriors squad, however about two-decades later in the era of another German gaffer, Michael Nees the best days for Zimbabwean football seem to be knocking on the door yet again if the appropriate steps are taken.\nWhile it has always been a dream to have a squad dominated by players playing at the highest level in Europe, Zimbabwe is now at its peak in terms of football talent with the likes of Trey Nyoni, Isaac Mabaya, Shumhaira Mheuka, Leon Chiwome and Michael Ndiweni featuring in England topflight senior teams.\nAlthough promising to be a powerhouse if the young talent pledges allegiance to represent Zimbabwe, most of the talent has not been formally approached although others have highlighted their interest in donning the country’s colors.\nFormer footballer and analyst, Justice Majabvi told the ZBC News, “We used to wish this when it was happening to the West Africans and maybe North Africa as well when they had all players with vast experience and also exposure in Europe. So now it’s our turn as we have youngsters some of whom were born in Europe and some in Zimbabwe, but moved to Europe when they were young.”\nMajabvi believes these youngsters can agree to play for the Warriors if approached by the football governing body in the country.",
            "main_image_link": null,
            "time": "01:22",
            "date": "15 Dec 2024"
        },
        {
            "title": "Gems finish 3rd best in Africa Netball Cup",
            "href": "https://www.zbcnews.co.zw/gems-finish-3rd-best-in-africa-netball-cup/",
            "content": "Story by Raynald Ngwarati\n\nThe Zimbabwe senior women’s netball team have clinched bronze at the Africa Netball Cup in Namibia after beating Malawi 48-42 in a third-place play off this Saturday.\n\nAfter missing out on the final this Friday, the Gems re-grouped and found their tempo this Saturday as they outclassed Malawi to seal third spot finish at the 2024 Africa Netball Cup.\n\nThe Zimbabwean outfit were greedy to bring a medal back home, but in their way stood an equally hungry Malawian side they’ve never beaten before.\n\nWith both sides seeking for the bragging rights to clinch the single medal on offer, Zimbabwe were the first to put the foot on the pedal of aggression, showing intent from the get go.\n\nAt the halfway stage of the match, Zimbabwe were leading 25-19, holding on to a six goal cushion which gave the ladies a boost in their confidence.\n",
            "main_image_link": null,
            "time": "01:22",
            "date": "15 Dec 2024"
        },
        {
            "title": "ZKU Champ of Champs returns in style",
            "href": "https://www.zbcnews.co.zw/zku-champ-of-champs-returns-in-style/",
            "content": "Story by Raynald Ngwarati\n\nThe Zimbabwe Karate Union Champion of Champions tournament has marked its return on the ZKU calendar this Saturday attracting the attention of more than 18 karate styles to the Glamis Arena.\n\nAfter a four-year absence, the tournament made an emphatic return this Saturday drawing karetekas from different parts of the country, with nearly one hundred karatekas from across 18 different karate styles united under one roof to celebrate karate excellence and proffer a platform for talent identification.\n\n“Our young men and young women are here to participate. Our main aim is to educate them on discipline. It’s not about fighting people but fighting their weaknesses and fighting their challenges in life,” said karateka, Shihan Rodwell Njerere.\n\nZKU Secretary General Precious Garikai said, “We’re trying to unite karate as a whole, we have different styles but in the differences we have to be one to be a force to reckon with.”\n",
            "main_image_link": null,
            "time": "01:22",
            "date": "15 Dec 2024"
        },
        {
            "title": "Simba Bhora celebrates historic PSL win",
            "href": "https://www.zbcnews.co.zw/simba-bhora-celebrates-historic-psl-win/",
            "content": "Story by Tapiwa Machemedze\n\nA carnival atmosphere engulfed Shamva on Friday as Premier Soccer League winners Simba Bhora football club finally took the coveted trophy to their home fans at Wadzanai Stadium.\n\nThe Premier soccer league carnival to announce the historic arrival of the PSL trophy began in Mazowe, passed through Bindura and ended in Shamva where delighted soccer fans embraced the PSL trophy won by a Mashonaland Central team for the first time.\n\nA supporter said, “We are happy, we want to thank Simba Ndoro, the vice president, his wife, because this thing had never happened in Mashonaland Central. We are very happy because of Simba Bhora.”\n\n“As the Brass Band, we are happy because we started in Division One. Brass band we have never missed a game. We started in Division One and now we are in the premier league,” another said.\n\nSimba Bhora players expressed joy at being part of the history making team.\n\n“It’s pleasing from the people of Mashonaland central, it’s what we wished for since we joined this team. I want to thank our supporters as we go to the CAF championships we need your support,” one of the players said.\n\nAnother noted, “I am very happy because we took the league, we took it on our second year. I want to thank all Mashonaland Central supporters they came in numbers. I come from this side, so I am honoured and I am happy.”\n\nMashonaland Central Minister of State for Provincial Affairs and Devolution, Honourable Christopher Magomo joined in the celebrations officially opening Wadzanai Stadium re-built by Simba Bhora president, Simba Ndoro and ceremonially handing over the PSL trophy to the team.\n",
            "main_image_link": null,
            "time": "01:22",
            "date": "15 Dec 2024"
        },
        {
            "title": "Gwanda treated to free professional boxing",
            "href": "https://www.zbcnews.co.zw/gwanda-treated-to-free-professional-boxing/",
            "content": "Story by Providence Maraneli\n\nBoxing fans in Gwanda were treated to a free professional boxing match as the mining town organised the event to honour, its boxing sensation Monica Mkandla this weekend at Phelandaba Stadium.\n\nArmature boxers drawn from different boxing clubs in Bulawayo and Gwanda battled it out, and their movements and ability to throw punches drew the attention of a South African, Jack Khangelani, a professional boxing coach who says he is impressed by the talent being groomed in the mining town.\n\n“I am really impressed by the level of professionalism and how the junior coaches are grooming these boxers. These boys are poised for greater heights,” Khangelani said.\n\n“I am so happy that you are coaching Monica and we are so grateful to the heights that you have taken her to and I promise you Gwanda that I will keep on grooming boxers for you,” said boxing coach, Clinton Walderman.\n\nThe mining town had opportunity to watch ABU champion Monica Mkandla train.\n\n“I am so happy to be back home to where it all started. I want all the girls to know that we can do it no-matter the odds. They should believe in themselves,” she said.\n\nThe annual mayors boxing tournament was meant to honour those who excelled including Mkandla, who won the ABU SADC Banterweight champion.\n\nThe Mayor of Gwanda Municipality, Councillor Thulani Moyo stated, “We have noted that Gwanda is doing well in boxing and we decided to hold this tournament so that we inspire the young ones. We want to keep on supporting our own.”\n",
            "main_image_link": null,
            "time": "01:22",
            "date": "15 Dec 2024"
        }
    ]
}