{
    "news": [
        {
            "title": "Football legends roll back the years at Gwanzura Stadium",
            "href": "https://www.zbcnews.co.zw/football-legends-roll-back-the-years-at-gwanzura-stadium/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nLocal football legends converged at Gwanzura Stadium in Harare this Saturday for a tournament that served to also inspire young players.\nThe event was a nostalgic trip back in time, reminiscent of the good old days when household teams like CAPS United, Dynamos, Black Aces, and Black Rhinos clashed for many year at the football stadium.\nThe tournament was designed to give the youngsters a glimpse of the past, showcasing the skills and passion of the legends who paved the way for the growth of Zimbabwean football.\nThe likes of Tatenda Sharara, Maronga Nyangela, Ephraim Mazarura, Robson Masauso, Brito Gwere, Moses Chunga, Lloyd Chitembwe, Lloyd Mutasa, Alois Bunjira, Stanford Stix Mutizwa and Mike Temwanjera were all there to inspire the next generation of Zimbabwean footballers.\nFormer Black Rhinos striker Stanford Stix Mutizwa said, “This tournament is a great way to give back to the community and inspire the next generation of footballers. As legends, we’ve been fortunate enough to have had our time in the spotlight, and now it’s time for us to pass on our knowledge and experience to the youngsters.”\nHis sentiments were echoed by former Black Aces midfielder Davies Mbidzo.\n“I am thrilled to see so many young faces here today. This tournament is a fantastic opportunity for them to learn from us, but also for us to learn from them. The energy and enthusiasm of the youngsters is infectious, and it’s a reminder that football is a game that can bring people together across generations,” Mbidzo said.\nThe event also provided a platform for the young players to interact with their role models, learn from their experiences and draw inspiration from their stories.\n“As a legend, it’s heart-warming to see the youngsters looking up to us as role models. This tournament is a chance for us to share our stories, our experiences, and our passion for the game with the next generation,” stated former Black Aces and CAPS United goalkeeper, Brenna Msiska.\nFormer Dynamos defender Henry Chari noted, “This tournament is a celebration of Zimbabwean football, and it’s a testament to the power of the game to unite us all. As legends, we’re proud to have played a part in shaping the history of Zimbabwean football.”\nAs the legends took to the pitch, it was clear that they still had the spark that made them household names during their playing days.",
            "time": "06:37",
            "date": "29 Dec 2024"
        },
        {
            "title": "ZIFA elections: a battlefied of experience and money bags",
            "href": "https://www.zbcnews.co.zw/zifa-elections-a-battlefied-of-experience-and-money-bags/",
            "content": "Story by Mthokozisi Dube\nFormer football referee and CAF referees instructor, Sabelo Maphosa, who is vying for the ZIFA board member position is relishing to contribute her more than two decades football experience if given a  chance to serve in the ZIFA board.\nMaphosa believes she has what it takes to contribute to the growth of Zimbabwean football having been in the officiating trenches for more than 20 years.\n“I started refereeing in 1986 and rose through the ranks to become match commissioner and now I am a CAF referees’ instructor. I have learnt a lot in football, hence I believe I can contribute to the development of the game,” he said.",
            "time": "06:37",
            "date": "29 Dec 2024"
        },
        {
            "title": "Three batsmen score centuries as Chevrons dominate Afghanistan",
            "href": "https://www.zbcnews.co.zw/three-batsmen-score-centuries-as-chevrons-dominate-afghanistan/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZimbabwe put up their highest ever test score as they maintained their grip on Afghanistan, ending the second day of the first Test leading by 491 runs at Queens Sports Club this Friday.\nThe Chevrons racked up 586 runs in 135.2 overs to set a record-breaking total in its first innings during the first Test against Afghanistan in Bulawayo.\nZimbabwe’s previous highest total came in 2001, when it racked up 563 for nine in 167 overs against West Indies in Harare.\nSean Williams was the innings’ top scorer with 154 from 174 balls, which included 10 fours and three sixes.\nCaptain Craig Ervine and youngster Brian Bennett also scored centuries.",
            "time": "06:37",
            "date": "29 Dec 2024"
        },
        {
            "title": "53 candidates battle it out for 9 posts in Zifa polls",
            "href": "https://www.zbcnews.co.zw/53-candidates-battle-it-out-for-9-posts-in-zifa-polls/",
            "content": "Story by Lawrence Trusida, Sports Editor\nThe much-anticipated ZIFA Executive Committee elections set for the 25th of next month have attracted a lot of interest, with 53 candidates vying for the nine slots available as Zimbabwe seeks a fresh start.\nThe situation is nothing that had been seen before, with 53 candidates looking to occupy only nine slots on the board.\nAccording to the new constitution, the ZIFA Executive Committee will have 11 members, the President and two deputies, one of which should be a woman as well as eight board members, six that will be voted for, with the Premier Soccer League and the Women Premier Soccer League seconding a candidate each to make a total of 11 members.\nSix candidates are battling for the presidency while 10 are seeking the two Vice-presidency positions with 37 more squaring off for the six board members slots in the January 25th election.",
            "time": "06:37",
            "date": "29 Dec 2024"
        },
        {
            "title": "Man City in danger of missing Champions League, says Guardiola",
            "href": "https://www.zbcnews.co.zw/man-city-in-danger-of-missing-champions-league-says-guardiola/",
            "content": "Manchester City are at risk of missing out on next season’s Champions League due to their recent dip in form, manager Pep Guardiola said.\nCity, who are looking to qualify for Europe’s top club competition for a 15th straight season, have won just one of their last eight Premier League games and are seventh, 12 points behind leaders Liverpool.\nGuardiola’s side are four points behind Nottingham Forest, who occupy the fourth and final Champions League qualification berth.\n“When I said before, people laughed. They said, ‘qualifying for the Champions League is not a big success’. But I know it because it happens with clubs in this country,” Guardiola told reporters ahead of their home match against Everton.",
            "time": "06:37",
            "date": "29 Dec 2024"
        }
    ]
}