{
    "news": [
        {
            "title": "Former Dynamos manager Richard Chihoro dies",
            "href": "https://www.zbcnews.co.zw/former-dynamos-manager-richard-chihoro-dies/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nThe Zimbabwean football community has been plunged into mourning following the death of former Dynamos manager, Richard Chihoro.",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Khama Billiat joins Scottland FC",
            "href": "https://www.zbcnews.co.zw/khama-billiat-joins-scottland-fc/",
            "content": "Story by Tafadzwa Mavhangira\nWarriors star forward, Khama Billiat has joined Castle Lager Premier Soccer League debutants Scottland FC on a free transfer after the expiry of his contract with Yadah FC.\nThe club confirmed the development through their official X handle this Thursday.\nThe 34-year-old Billiat becomes yet another strong addition to the Scottland FC squad after the new boys signed off Soccer Star of the Year Walter Musona who captained Simba Bhora to their maiden premiership title last year.\nThe league debutants have also lured soccer star of the year finalist, Kingsley Mureremba from CAPS United and Coach of the year Tonderai Ndiraya from Simba Bhora.\nMeanwhile, Simba Bhora are reportedly working behind the scenes to strengthen their squad after losing Musona.\nAlthough the club is yet to make any announcement, there are indications Dynamos midfielder, Donald Mudadi and CAPS United goal-minder, Tonderai Mateyaunga are heading to Shamva.\nMudadi and Mateyaunga took to their Facebook pages to announce their departure from the capital to Simba Bhora.",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Lulu hunts for new club as he returns back home",
            "href": "https://www.zbcnews.co.zw/lulu-hunts-for-new-club-as-he-returns-back-home/",
            "content": "Story by Mthokozisi Dube\nFormer Highlanders head coach, Mandla Mpofu has opened up on his stint in the Botswana Premier League after being relieved of his duties a few days before the festive season break.\nCompared to his two fellow countrymen, Madinda Ndlovu and the late Rahman Gumbo who left an indelible mark in the Botswana Premier League, Mpofu has found the going tough.\nLulu was released by Sua Flamingoes before the festive season break following a string of poor results which saw the club slump to fourth position with 13 points from 12 games.",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "Zimbabwe to host Women’s Handball Tournament",
            "href": "https://www.zbcnews.co.zw/zimbabwe-to-host-womens-handball-tournament/",
            "content": "Story by Anashe Murombedzi\nZimbabwe is set to make its mark on the international handball scene as the country prepares to host the International Handball Federation (IHF) Trophy Zone VI women’s junior and youth tournament in April.\nThe country’s successful bid to host the event has been described as testament to its growing reputation as a hub for handball in Africa.\nThe tournament, scheduled to take place in Harare from the 28th of April to the 4th of May, will bring together top teams from the region, all vying for a spot in the continental phase.\nSecretary of the Zimbabwe Handball Federation Edison Chirowodza said, “This tournament is set to be hosted in Harare and winners will take part in the continental championship which will be held later and ultimately the continental winners will proceed to the world youth and juniors qualifiers.”",
            "time": "20:39",
            "date": "03 Jan 2025"
        },
        {
            "title": "2024 in review: Zim’s sporting highs and lows",
            "href": "https://www.zbcnews.co.zw/2024-in-review-zims-sporting-highs-and-lows/",
            "content": "2024 in review: Zim’s sporting highs and low\nStory by Anashe Murombedzi, Sports Reporter\n2024 has been a year of highs and lows for Zimbabwean sport but the positives far outweigh the negatives.\nFrom the rugby pitch to the athletics track, 2024 was a year of triumph and heartbreak for Zimbabwe’s sports stars.\nThe national rugby team, the Sables stole the show with an unbeaten season, culminating in their Africa Cup victory.\nThe historic achievement was their best since 2012 and propelled the Sables to a nine-year high of number 28 in the World Rugby rankings.\nOn the netball front, the Zimbabwe senior women team, the Gems performed well at the Africa Netball Championships.\nTheir impressive run saw them beating Uganda and Malawi, ultimately claiming bronze with a convincing 48-42 win over Malawi.\nThe Gems’ fairytale run was almost derailed when they lost to South Africa in the semi-finals, but they regrouped and showed great determination to claim third place.\nThe Zimbabwe golf team also did well after a third-place finish at the All-Africa Golf Championship, behind Zambia and winners South Africa.\nIn athletics, Zimbabwean sprinters Tapiwanashe Makarau and Makanakaishe Charamba made history after reaching the 200 metres final at the Paris Olympics.\nAlthough they did not get any medals, their impressive performance marked a milestone for Zimbabwean athletics.\nIn cricket, the Zimbabwe Chevrons had a tough season in which they faced stiff competition from Afghanistan and Pakistan.\nOne of the highlights was a thrilling Test match against Afghanistan at Queens Sports Club, where the Chevrons posted a record-breaking 586 runs.",
            "time": "20:39",
            "date": "03 Jan 2025"
        }
    ]
}