{
    "news": [
        {
            "title": "Four teams battle in para-volleyball selection tourney",
            "href": "https://www.zbcnews.co.zw/four-teams-battle-in-para-volleyball-selection-tourney/",
            "content": "Story by Mthokozisi Dube\nFOUR teams are participating in a two-day sitting volleyball tournament organised by the Zimbabwe Para-Volleyball Association at King George VI School in Bulawayo.\nSitting volleyball is a variation of traditional volleyball for athletes with disabilities, where players compete in a seated position, using both their arms and legs to manoeuvre across the court. The sport employs the same skills and techniques as standing volleyball, with a few key rule adaptations to accommodate seated play.\nThe Zimbabwe Para-Volleyball Association has organised this selection tournament to scout and prepare players to represent the country at an upcoming invitational event in Kenya,\n“It is interesting to have these tournaments. We think by having more of these, our sport is headed somewhere,” a player said.\n“It is my first time to play but I felt at home today,” another player added.\nMidlands Province youth representative for people with disabilities, Honourable Nyashadzashe Shonhe implored other sporting institutions to take a leaf from the association to accommodate people living with disabilities.\n“We are happy to be mingling in this tournament, but we want this initiative to spread to other sporting disciplines,” Honourable Shonhe said.",
            "time": "06:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "Bulawayo Chiefs on track for PSL return after maintaining winning streak",
            "href": "https://www.zbcnews.co.zw/bulawayo-chiefs-on-track-for-psl-return-after-maintaining-winning-streak/",
            "content": "Story by Mthokozisi Dube\nFORMER Premier Soccer League side, Bulawayo Chiefs are looking for an early return to the top-flight league after maintaining a 100 % winning record in the ZIFA Southern Region Division One league.\nThe Twitter Boys are leaving nothing to chance in their quest to make an imminent return to the top flight.\nAmakhosi have posted three victories in their first three matches, with their latest triumph being a 1-nil victory over Bosso 90 in a city derby.\nAnother former PSL side, Hwange are also within striking distance after thrashing Zebra Revolution to take second spot with seven points.\nLast year’s runners-up Casymn also had a decent start to the season with two victories in three matches after beating new-boys Megawatt 2-nil.\nIn the Central region, former PSL side Sheasham are at the apex with nine points, while money bags Hardrock are second with an inferior goal difference but the same number of points.",
            "time": "06:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "ZOC elects new board, targets continental and global sporting success",
            "href": "https://www.zbcnews.co.zw/zoc-elects-new-board-targets-continental-and-global-sporting-success/",
            "content": "Story by Raynald Ngwarati\nZIMBABWE Olympic Committee (ZOC) president Thabani Gonye has been re-elected to lead the country’s Olympic body for a second successive term after edging Ringisai Mapondera 15-12 in a tightly contested election at a local hotel in Harare this Sunday.\nAfter a successful election this Sunday, the new ZOC board has shifted attention to turning manifestos into reality so as to take the country’s sports industry to greater heights.\nWith a shared vision of athlete development and support, the board has promised to put strategic frameworks in place to harness support for sport from the social and corporate sectors.\nIncumbent president Thabani Gonye who has been leading the Olympic body for the past four years, will continue implementing his vision after garnering the majority of the votes.\nSpeaking upon re-election, Gonye outlined the importance of collaboration with the losing candidates in a bid to foster the ultimate environment for sports growth in the country.\n“We need to embrace the diversity to embrace that, which will make us better and stronger. I want to appreciate and say, the vision is to start winning at the levels that we should be winning, we should be winning at the continental and world levels. We should be winning in the World Olympics,” he said.\nMeanwhile, former Head of ZBC’s Television Productions, Merit Munzwembiri was voted the second vice president of ZOC, serving alongside Fredrick Ndlovu, who was re-elected first vice president.\n“I have been serving as a board member in the gender office. From there I have seen and noticed a lot of things, which has prompted me to run for the vice president post in order to uplift women. The focus is not just on females in sport but also the female stakeholders for example the journalists also need to be empowered,” she said.",
            "time": "06:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "Young Zimbabwean Golfers make country proud in Tunisia",
            "href": "https://www.zbcnews.co.zw/young-zimbabwean-golfers-make-country-proud-in-tunisia/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Under-18 Golf teams had an excellent outing at the All Africa Junior Team Championships in Tunisia with both the boys and girls achieving respectable finishes.",
            "time": "06:40",
            "date": "29 Apr 2025"
        },
        {
            "title": "PSL Matchday 8 kicks off with Herentals College FC victory",
            "href": "https://www.zbcnews.co.zw/psl-matchday-8-kicks-off-with-herentals-college-fc-victory/",
            "content": "Story by Raynald Ngwarati\nMATCHDAY eight of the Castle Lager Premier Soccer League kicked off this Friday with bogey side Herentals College beating Green Fuel by a single goal at Rufaro Stadium.\nTino Benza was the hero for the students as they moved to nine points on the table to close in on the top ten.",
            "time": "06:40",
            "date": "29 Apr 2025"
        }
    ]
}