{
    "news": [
        {
            "title": "PSL first half ends with thrilling surprises",
            "href": "https://www.zbcnews.co.zw/psl-first-half-ends-with-thrilling-surprises/",
            "content": "Story by Mthokozisi Dube\nTHE first half of the 2025 Castle Lager Premier Soccer League season had its fair share of thrills and spills, but it is done and dusted, and the focus is now on the second half.\nBig guns have failed to punch above their weight, finding themselves occupying the bottom half of the PSL ladder.\nOnly FC Platinum has managed to protect its unbeaten run, while debutants MWOS surrendered their record on the last day of the first half, also getting dislodged from the top by defending champions, Simba Bhora.\nFootball stakeholders believe the first half has brought the beauty associated with the beautiful game.\n“It has been quite an exciting first half of the season. Look at the traditional perennial campaigners like Dynamos, Highlanders, and CAPS United. They are not really performing to expectations. But for the newcomers, if you look at Scottland and MWOS, these are division one teams that are doing well, save for Kwekwe United, whose performance is compromised due to financial challenges. Overall, I think it has been a good and exciting season,” Football Coach, Dalubuhle Bhebhe said.\nThe sports journalist, Praise Dhlakama says, It is exciting that teams coming from division one, playing for the first time in the Premier League, are part of the leading pack, and you have got MWOS in second place.",
            "time": "08:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "Sables gear up for Rugby Africa Cup title defence",
            "href": "https://www.zbcnews.co.zw/sables-gear-up-for-rugby-africa-cup-title-defence/",
            "content": "Story by Anashe Murombedzi\nHARARE – THE Zimbabwe national rugby team, the Sables, are intensifying preparations ahead of the 2025 Rugby Africa Cup, scheduled to run from July 8 to July 19 in Kampala, Uganda.\nThe prestigious tournament, which brings together eight of the continent’s top sides, will not only determine the continental champions but also serve as a qualifier for the 2027 Men’s Rugby World Cup to be hosted in Australia.\nAs defending champions, the Sables enter the competition with high expectations and renewed determination.\nTheir campaign will begin with a fixture against Morocco, as they aim to replicate last year’s triumphant performance.",
            "time": "08:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "Unbeaten FC Platinum eye major upset over log leaders Simba Bhora",
            "href": "https://www.zbcnews.co.zw/unbeaten-fc-platinum-eye-major-upset-over-log-leaders-simba-bhora/",
            "content": "Story by Anashe Murombedzi\nZVISHAVANE – THE Castle Lager Premier Soccer League enters its second half with a blockbuster clash between defending champions Simba Bhora and four-time winners FC Platinum at Mandava Stadium this Saturday.\nSimba Bhora, who concluded the first round atop the log with 35 points, face a stern test in Zvishavane.\nThe reigning champions are aiming to consolidate their lead over closest challengers MWOS, who trail by just one point.\nHowever, hosts FC Platinum will be no pushovers, sitting sixth on the table with 24 points, the Pure Platinum Play outfit have gone the entire first round unbeaten, registering four victories and an unprecedented 12 draws.\nA win against Simba Bhora would not only enhance their top-four ambitions but also disrupt Simba Bhora’s title defence plans.\nThe two sides have a competitive head-to-head record, having met five times in the league. FC Platinum boast three wins, Simba Bhora have secured one, and their most recent encounter in the first round ended goalless.",
            "time": "08:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "Chaos at Manica Diamonds as Coach Sent on Forced Leave",
            "href": "https://www.zbcnews.co.zw/chaos-at-manica-diamonds-as-coach-sent-on-forced-leave/",
            "content": "Story by ZBC staff reporter\nManica Diamonds coach, Jairos Tapera, has been sent on an indefinite forced leave, with the club citing poor results.",
            "time": "08:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "ZTISU games kick off with focus on talent development",
            "href": "https://www.zbcnews.co.zw/ztisu-games-kick-off-with-focus-on-talent-development/",
            "content": "Story by Mthokozisi Dube\nBULAWAYO – A call has been made for the Zimbabwe Tertiary Sports Union Games to bridge a gap between tertiary and professional sport.\nThis comes as the Zimbabwe Tertiary Institutions Sports Union (ZTISU) Games officially kicked off in Bulawayo this Tuesday, attracting athletes from across the country for four days of competition in over ten sporting disciplines.\nSRC Director General, Eltah Nengomasha, who officiated the opening ceremony, underscored the importance of tertiary institutions in the national sports development ecosystem.\n“These games represent more than mere competitions. They are a celebration of sporting choice, discipline, talent and potential. Our tertiary institutions are not just centers of academic excellence, they are a bridge between school sport and the elite professional stage. Over the years we have lost so many athletes as they progressed to tertiary institutions. It is our duty as SRC to harness the available talent. We have a plan to work with ZTISU to harness our talent,” she said.\nNengomasha encouraged ZTISU to adopt best-practice models from countries like South Africa, where tertiary sport systems have successfully fed athletes into national teams and professional leagues.\nZTISU President, Edward Chekure, welcomed the SRC’s commitment to elevate sport within tertiary institutions.",
            "time": "08:47",
            "date": "26 Jun 2025"
        }
    ]
}