{
    "news": [
        {
            "title": "Govt commends Nedbank for supporting sport development",
            "href": "https://www.zbcnews.co.zw/govt-commends-nedbank-for-supporting-sport-development/",
            "content": "Story by Lawrence Trusida, Sports Editor\nNAMIBIA – GOVERNMENT has hailed Nedbank for supporting sport development in the country after the local financial institution received a medal of honour at the recently held African Union Sports Council Region Five Youth Games in Namibia.\nNedbank has been actively involved in sport through supporting various disciplines, including rugby, netball, and tennis, among other sports codes and national teams.\nFor their commendable contribution to sport development, the local financial institution was honoured by the African Union Sports Council at the recently ended Region Five Youth Games in Namibia.\nPresenting the medal, Permanent Secretary for Sport, Recreation, Arts and Culture, Mr Nicholas Moyo, commended Nedbank for its continued support to the sports sector.\n“Your support is not in vain, you have taken the lead in support sport through various initiatives, and you have changed lives by giving an opportunity to all. Other corporations are invited to come and join the support of sport, which is one of the ways to fight drug and substance abuse,” he said.\nNedbank Executive Head Marketing and Communications, Latifa Kassim, reiterated their commitment to sport development.\n“We thank you so much, the recognition is a big honour recently, the government honoured us, and to have the region also appreciate your efforts means a lot, we are committed to changing lives, and we will continue to do what we can to make sure the future is secured,” she said.",
            "time": "09:52",
            "date": "18 Jul 2025"
        },
        {
            "title": "AFZ takes to the track to fight drug abuse",
            "href": "https://www.zbcnews.co.zw/afz-takes-to-the-track-to-fight-drug-abuse/",
            "content": "Story by Peter Chivhima\nThe Air Force of Zimbabwe (AFZ) is strengthening its role in national development, with the organisation embracing the recently launched national resource mobilisation drive to capacitate the fight against drug and substance abuse.\nVoice: Last week, President Emmerson Mnangagwa launched the national drug and substance abuse resources mobilisation campaign, an initiative which has so far received support from Cabinet ministers, prominent business people, community and faith leaders.\nIt is in the same spirit that the Air Force of Zimbabwe (AFZ) will stage a half marathon at Falcon Golf Club in Harare this Sunday to raise awareness on the dangers of drug and substance abuse, while promoting physical fitness, discipline, and national pride among youths.\nThe race is being held under the auspices of the Commander Air Force of Zimbabwe (AFZ) Charity Fund.\n“This is more than a race; it is a call to action. We want to remind our communities, especially the youth, that a healthy mind and body are critical for national development. Through sport, we are building resilience against drug abuse. We are also complementing the government in the fight against drug and substance abuse,” said AFZ Public Relations Officer, Wing Commander Donovan Muroyiwa.\nThe event is expected to draw participants from the defence forces, schools, civic society and the public, united under the theme centred on building future generations.",
            "time": "09:52",
            "date": "18 Jul 2025"
        },
        {
            "title": "Local football academy seeks global glory",
            "href": "https://www.zbcnews.co.zw/local-football-academy-seeks-global-glory/",
            "content": "Story by Elroi Ngara\nYOUNG footballers from a local football academy are relishing the chance of exposure on the international stage, with the team set to participate in a tournament in China next month.\nIt was all excitement at the Robert Mugabe International Airport as the boys from Jadel Football Academy departed for China with a target to defend the Hundred Cup, which they won last year.\n“I am so excited to go to China to play football, and I want to thank Mr Walter for giving us a chance like this,\n“I am so excited that I will be on a plane to China, and I  want to be a professional footballer that will play for big teams.”\nFor Jadel Football Academy coaches, young talent exposure on the international stage is key for football development in the country.\n“I am happy about the exposure. Our kids from Zimbabwe are getting it at such an early age. It’s our project. It is not for Jadel FA only. We are targeting the whole nation. That is why we have kids from as far as Mutare, whom we got through playing tournaments around the country,” noted coach Henry Garikai Mukangairwa.",
            "time": "09:52",
            "date": "18 Jul 2025"
        },
        {
            "title": "African Chess Youth Championships a boost for sport tourism",
            "href": "https://www.zbcnews.co.zw/african-chess-youth-championships-a-boost-for-sport-tourism/",
            "content": "Story by Tichaona Kurewa\nZIMBABWE’S bid to position Victoria Falls as a prime sports tourism destination has received a major boost following an announcement that the resort city will host the 16th edition of the African Youth Chess Championship this December.\nTitled “Song Unburied”, the production confronts the colonial-era looting of sacred artefacts and ancestral remains.\n“The African Chess Confederation is thrilled to announce that Zimbabwe has been confirmed as the host nation for the 2025 African Youth Chess Championships. The event will take place from December 5 to 13, in the beautiful city of Victoria Falls, one of Africa’s most iconic destinations. We look forward to welcoming eager players from across the continent,” African Chess Confederation president, Ms Tshepiso Lopang said.\n“Our mother body is in favour of Victoria Falls due to its proximity to many countries within SADC. Remember, it shares a border with Zambia and Namibia, and Botswana. So its centrality actually gives an advantage to all these countries that they will be almost travelling within home. So a few distance away from Victoria Falls,” Zimbabwe Chess Federation president, Todd Mapingire added.",
            "time": "09:52",
            "date": "18 Jul 2025"
        },
        {
            "title": "Justice Mutyoramwendo set for kickboxing debut in South Africa",
            "href": "https://www.zbcnews.co.zw/justice-mutyoramwendo-set-for-kickboxing-debut-in-south-africa/",
            "content": "Story by Farai Gwaze\nZIMBABWEAN karateka, Justice Mutyoramwendo, is hoping to fly the country’s flag high once more when he faces South Africa’s Frank Cato in the “Clash of the Warriors II” bout in South Africa this Saturday.\nThe promising martial artist is leaving no stone unturned in his preparations for the highly anticipated kickboxing debut.\nMutyoramwendo, who is under the guidance of decorated Mixed Martial Artist Lewis Mataya, is confident of a strong performance as he transitions from karate to kickboxing.",
            "time": "09:52",
            "date": "18 Jul 2025"
        }
    ]
}