{
    "news": [
        {
            "title": "Herentals College expands talent search through zonal tournament",
            "href": "https://www.zbcnews.co.zw/herentals-college-expands-talent-search-through-zonal-tournament/",
            "content": "Story by Mthokozisi Dube\nHERENTALS College has cast the net wider after conducting a zonal tournament to tap into talent that can feed into the college’s football.\nThe College owns Premier Soccer League outfit, Herentals, a B team in the Division One league and a ladies team in the Zimbabwe Women’s Premier League, Herentals Queens.\nWith the teams relying largely on the talent within their parent owners’ colleges, efforts are being made to decentralise talent identification.\nThe college held its inaugural Southern Region Zonal tournament in Bulawayo this Friday, with players from Matebeleland North, Matabeleland South and Bulawayo participating.\nThe college held its inaugural Southern Region Zonal tournament in Bulawayo this Friday, with players from Matebeleland North, Matabeleland South and Bulawayo participating.\n“It is the first of its kind. We normally have a national tournament, but this time around, we had to start at the zones where we will select teams for the national finals. We are going to be selecting talent for our teams. We are happy Focus has also included the girl child.\n“Our tournament this time includes girls’ soccer. The whole idea is to give these learners an opportunity to graduate to our senior team. We are not only focusing on academic excellence, but we need those with sporting excellence to carve a path,” one of the Herentals college team members said.",
            "time": "06:49",
            "date": "20 Jul 2025"
        },
        {
            "title": "Simba Bhora deepen Dynamos’ woes with narrow victory",
            "href": "https://www.zbcnews.co.zw/simba-bhora-deepen-dynamos-woes-with-narrow-victory/",
            "content": "Story by Anashe Murombedzi\nDEFENDING champions, Simba Bhora, have piled more misery on the relegation-threatened Dynamos, beating them 1-nil and in the process asserting their credentials in defence of the Castle Lager Premier Soccer League title.\nAn 84th-minute strike from Namibian Isaskar Gurirab was the difference, as Simba Bhora inflicted yet another blow on the country’s most decorated club, Dynamos.\nIn a match of contrasting fortunes, the Castle Lager Premier Soccer League defending champions asserted themselves as a team capable of reclaiming the coveted title, while Dynamos, with 22 titles under their belt, sank further in the relegation zone.\nThe Go Buju Boys are now on 43 points, three above debutants, MWOS, who dropped points after losing 2-0 to unbeaten FC Platinum.\nIn other matches, CAPS United and TelOne played out a goalless draw, Triangle United suffered a 1-0 defeat to Ngezi Platinum, while Green Fuel secured a 2-0 win over Bikita Minerals.\nChicken Inn beat ZPC Kariba 1-0, Manica Diamonds lost 1-0 to Herentals, and Kwekwe United were defeated 1-0 by Yadah.\nMeanwhile, Scottland had a road show in the capital hyping their match against Highlanders at Rufaro Stadium this Sunday.\n“I know we are going to win,” we are in great form and Highlanders can not stop us. We are the better team, and we will prove it on Sunday. I am confident we’ll take the win we are expecting mabviravira,” Scottland team players noted.",
            "time": "06:49",
            "date": "20 Jul 2025"
        },
        {
            "title": "Sables clinch historic Rugby World Cup spot",
            "href": "https://www.zbcnews.co.zw/sables-clinch-historic-rugby-world-cup-spot/",
            "content": "Story by ZBC Reporter\nTHE Sables have qualified for the 2027 Rugby World Cup after defeating Namibia 30–28 in the final of the Rugby Africa Cup in Uganda.\nIn one of the most pulsating finals in African rugby history, Zimbabwe’s Sables showed nerves of steel to dramatically sweep aside their long-standing rivals, Namibia, who had not missed the Rugby World Cup since their maiden appearance in 1999.\nIn the process, the Sables ended a three-decade qualification drought, with their last World Cup appearance being in 1991.\nIn a match played at a packed Nelson Mandela National Stadium in Kampala this Saturday, Namibia drew first blood, but the Sables clawed back, with the teams going to the break tied at 16–16.\nThe Sables went on to dominate the greater part of the second half and at one point led 30–21.\nA late rally by Namibia ensured a nail-biting finish, but the Sables held on to win 30–28.\nCaptain Hilton Mudariki was on cloud nine after the team broke a generation barrier, dedicating the victory to all Zimbabweans.“This is for the over 15 million people back home and around the world. It is a lot to take in at the moment, but I am very happy that we remained focused and treated each game like it was our last. Tonight, we celebrate bringing the trophy back home and never lose sight of a bigger calling ahead, he said.",
            "time": "06:49",
            "date": "20 Jul 2025"
        },
        {
            "title": "Sugar Boys bolster ranks in bid to avoid relegation",
            "href": "https://www.zbcnews.co.zw/sugar-boys-bolster-ranks-in-bid-to-avoid-relegation/",
            "content": "Story by Gay Matambo\nTROUBLED Lowveld side, Triangle United face a daunting task when they host Ngezi Platinum Stars at Gibbo stadium this Saturday.\nThe Genesis Mangombe-coached side is in the relegation matrix alongside Dynamos and Kwekwe United, hence this Saturday’s match will be crucial in their survival bid.",
            "time": "06:49",
            "date": "20 Jul 2025"
        },
        {
            "title": "Sables one win away from Rugby World Cup qualification",
            "href": "https://www.zbcnews.co.zw/sables-one-win-away-from-rugby-world-cup-qualification/",
            "content": "Story by Anashe Murombedzi\nTHE Zimbabwe Rugby men’s national team, the Sables, are at the cusp of making African history as they face Namibia in the Rugby Africa Cup final at the Nelson Mandela National Stadium in Kampala, Uganda, this Saturday.\nAfter 34 long years, Zimbabwe’s senior men’s rugby team is one game away from returning to the Rugby World Cup.\nNamibia, a familiar titan of African rugby, stand between the Sables and their dream.\nHowever, ahead of the Rugby Africa Cup final this Saturday, the defending champions are not intimidated by the Namibians’ World Cup qualification history, which is untainted since their maiden appearance in 1999.\n“We know Namibia is a tough opponent, and history shows they have had it over Zimbabwe. It’s up to us to step up and challenge a team that has been to the World Cup,” Sables head coach, Pieter Benade said.\nCaptain Hilton Mudariki emphasised the team’s unity and focus.\n”We have focused on ourselves, our minds, our bodies, and making sure we are in the right headspace. Namibia is a quality side, but we’ve always said from the start of the tournament that we will treat each game as a final.”",
            "time": "06:49",
            "date": "20 Jul 2025"
        }
    ]
}