{
    "news": [
        {
            "title": "Battle of the cities, Highlanders set to clash with CAPS United at Barbourfields Stadium",
            "href": "https://www.zbcnews.co.zw/battle-of-the-cities-highlanders-set-to-clash-with-caps-united-at-barbourfields-stadium/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Battle of the Cities has for so long been a platform for beautiful football, with the clash between Highlanders and CAPS United erupting at Barbourfields Stadium on Sunday.\nNever mind the two teams’ waning fortunes in recent years, the match is still one of the most anticipated in the land and never disappoints.\nThe clash produces heroes and villains and over the years, it has written many memories in the minds of spectators.\nThe back-to-back league clashes of 2004 stand out when the two teams played an exciting three-all draw at Barbourfields before Bosso edged Makepekepe 4-3 at the National Sports Stadium in the reverse encounter.\nEven though the Green Machine went on to win the league that year, on the fateful day, Tapuwa Kapini was the hero while Witness Munkuli was the villain.\nMany such encounters have happened over the years and this Sunday more of the same is expected as the two age-old giants clash, even though they seem to be fading, they usually save the best when they meet.",
            "time": "06:35",
            "date": "09 Apr 2025"
        },
        {
            "title": "ERSL secures first major sponsor in over 20 years",
            "href": "https://www.zbcnews.co.zw/ersl-secures-first-major-sponsor-in-over-20-years/",
            "content": "Story by Mercy Bofu-Matinha\nZIFA Eastern Region Division One soccer league has received a lifeline after securing a sponsorship deal with cigarette manufacturer, Pacific Storm.\nThe league has not had a title sponsor for more than two decades, hence the excitement following the official launch of the deal over the weekend at Mucheke Stadium in Masvingo.\n“We are excited as players that for the first time we have a sponsor, it is our hope that the deal will ensure improvement in terms of our matches. We had a lot of challenges and many times it would then demotivate us as players, but with this development, we are looking forward to exciting times,” Tenax Player, Jambo Joseph Tatenda said.\n“The coming in of Pacific Storm as a sponsor has motivated us a lot as players. For me, it is been six years playing in ERSL and we did not have a sponsor, now all teams will put in more effort and for players, we now know that in the end, if you play well, definitely there will be rewards,” Wangu Mazodze Captain, Lucky Itimu said.\nThe League’s Chairperson, Wisdom Simba and ZIFA Chief Executive Officer, Yvonne Mapika Manwa concurred that the deal will go a long way in improving competition in the league.\n“This is a huge step for us as the Eastern Region Soccer League and the deal will focus, beyond the core package, on branding and marketing of the league. This will also motivate our players because now they know we have a sponsor. In terms of value, currently, I am not able to share the exact details of its worth but we are happy as the executive,” Simba said.\n“This partnership is a testament of what ERSL is doing as a league and it is also a reflection of what the ZIFA itself is, I think more than anything we appreciate that Pacific Storm has come in as a pioneer to sponsor this league. This is a partnership where we as the football industry are bringing in something to the corporate world while they are also bringing something very important for us,” Mapika Manwa said.",
            "time": "06:35",
            "date": "09 Apr 2025"
        },
        {
            "title": "Triumphant return, Kuipers wins Gold at Africa Triathlon Championships",
            "href": "https://www.zbcnews.co.zw/triumphant-return-kuipers-wins-gold-at-africa-triathlon-championships/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE’S top Triathlon, Andie Kuipers returned from a long injury layoff to win gold in the Under 23 Women’s category at the 2025 Africa Triathlon Championships held at Nelson Mandela Bay in South Africa on Saturday.\nKuipers has been struggling with injuries for the past two seasons and recently missed the Troutbeck leg of the Africa Triathlon Cup.\nHowever, once she recovered, she made her way to South Africa and showed her class after winning gold at the Africa Triathlon Cup in South Africa.\nThe United States of America-based athlete is happy with her triumph on the track.\n“I am really happy to be back and to win recently I have struggling with an injury and recently my mother was diagnosed with stage four cancer so it has been a very tough period but this win showed me that I can still compete at the top level,” Kuipers said.\nHer goal is now to prepare for the 2028 Olympic Games.\n“The goal definitely is to qualify for the Olympics and I will be competing in more tournaments and the African Games again to gain more points for the LA Games.,” she said.",
            "time": "06:35",
            "date": "09 Apr 2025"
        },
        {
            "title": "Ngezi reclaim PSL top spot",
            "href": "https://www.zbcnews.co.zw/ngezi-reclaim-psl-top-spot/",
            "content": "Story by Raynald Ngwarati\nNGEZI Platinum has reclaimed top spot in the Castle Lager Premier Soccer League after edging fading Harare giants CAPS United by two goals to one at Rufaro Stadium this Sunday.\nPlatinum Stars sublime form seems to be on an upward trajectory.\nThe Harare giants who had already lost two matches prior to the Matchday five encounter, played second best to Ngezi as Richard Hachiro and company controlled the middle of the park to oust the Green Machine.\nGreen Machine defenders had to resort to the offside trap to trick lethal striker Obriel Chirinda, a tactic that worked until the 41st minute, as the striker showed his class to give Ngezi the advantage before the break.\nHowever, CAPS United came back rejuvenated after the break with Phineas Bamusi and Junior Bunjira making crucial runs on the wing, but their crosses found no takers.\nThe pressure from the hosts finally paid off after Gomezgani Chirwa failed to deal with Eric Manokore’s well taken free kick, resulting in an own goal.\nThe match was far from being decided as youngster Ashwin Karengesha had a moment of brilliance as he rifled one into the top corner to settle the match with 18 minutes left on the clock.\nWith all the drama at Rufaro Stadium, Highlanders handed Triangle their first point of the season after a one all draw at Gibbo stadium.",
            "time": "06:35",
            "date": "09 Apr 2025"
        },
        {
            "title": "HILLSIDE Teacher’s college constructs a Beach Football Facility",
            "href": "https://www.zbcnews.co.zw/hillside-teachers-college-constructs-a-beach-football-facility/",
            "content": "Story by Mthokozisi Dube\n\nHILLSIDE Teachers College in Bulawayo has benefited from a Public-Private Partnership (PPP), which has enabled the institution to begin construction of a Beach Football facility.\n\nThe partnership is Hillside Teachers College, with Bulawayo City Council and Beach football has seen the construction of a facility at the institution of higher learning.\n\nBulawayo City Council held and indaba with stakeholders who urged the City fathers to engage more partners and tap on the low hanging fruits associated with running a sports economy.\n\nThe initiative has seen the city fathers taking on board synergies with sports associations for the construction of sporting facilities resulting in the start of works for the construction of a beach Football facility at Hillside.\n",
            "time": "06:35",
            "date": "09 Apr 2025"
        }
    ]
}