{
    "news": [
        {
            "title": "Tapuwa Chabata set for Guinness World Record rugby challenge",
            "href": "https://www.zbcnews.co.zw/tapuwa-chabata-set-for-guinness-world-record-rugby-challenge/",
            "content": "Story by ZBC staff reporter\nIRELAND – ZIMBABWEAN-born rugby player, Tapuwa Chabata, is set to make history this week as he participates in a Guinness World Record attempt for the Longest Rugby Game ever played, a demanding 36-hour match, scheduled to take place at Mullingar RFC in Ireland, beginning this Wednesday.\nThe 53-year-old former Sables player is taking on the endurance test with a greater purpose to raise funds for three charitable organisations based in Ireland.\nBorn in Mount Darwin, Chabata’s rugby journey began during his school years at Chaplin High School in Gweru, where he developed a passion for the sport.\nHe later went on to make history by becoming the first captain of the Zimbabwe Universities and Colleges rugby team.\nBetween 1993 and 2000, Chabata served in the Zimbabwe National Army, after which he relocated to the United Kingdom, where he has been based ever since.",
            "time": "06:17",
            "date": "18 Jun 2025"
        },
        {
            "title": "Chicken Inn aim to end Luveve Stadium jinx",
            "href": "https://www.zbcnews.co.zw/chicken-inn-aim-to-end-luveve-stadium-jinx/",
            "content": "Story by Mthokozisi Dube\nBULAWAYO based Premier Soccer League side, Chicken Inn are hoping to exorcise the Luveve ghost which has seen the Gamecocks go for seven games without a win at home.\nThe 2015 Castle Lager Premier Soccer League champions are hoping to banish the Luveve Stadium jinx. To compound their woes, Chicken Inn have only found the net once at Luveve this season, a statistic that paints a grim picture of their struggles.\nHowever, there is renewed optimism in camp as they prepare to host Ngezi Platinum Stars this Wednesday, with hopes of finally securing maximum points at home.\n“It has not been easy for us, especially when you look at our home record. We are yet to win at home but we have prepared well this time around,” Chicken Inn defender, Arthur Chinda said.\nFellow defender Xolani Ndlovu echoed similar sentiments.\n“We have had a bad patch, but as a team, we have resolved to stay focused. This phase shall soon pass,” he said.\nAs Chicken Inn search for a turnaround, several other fixtures are lined up midweek in what promises to be an exciting round of Premier League football.\nTelOne will be looking to maintain their impressive form when they host ZPC Kariba, while Herentals take on FC Platinum at Rufaro Stadium.\nDefending champions Simba Bhora are at home to Bikita Minerals, while Manica Diamonds face Highlanders at Sakubva.",
            "time": "06:17",
            "date": "18 Jun 2025"
        },
        {
            "title": "All 17 teachers’ colleges equipped in landmark PE initiative",
            "href": "https://www.zbcnews.co.zw/all-17-teachers-colleges-equipped-in-landmark-pe-initiative/",
            "content": "Story by Lawrence Trusida, Sports Editor\nHARARE – ZIMBABWE’s efforts to strengthen sports development from the grassroots received a major boost this Monday after all 17 teachers’ colleges in the country received physical education and sports equipment, in a ceremony held at Belvedere Technical Teachers’ College in Harare.\nThe handover is part of a tripartite partnership involving the Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development, the Sports Leaders Institute of Zimbabwe (SLIZ), and Finland’s Liike University of Applied Sciences.\nThe collaboration, formalised through a Memorandum of Understanding signed two years ago, seeks to enhance the quality of physical education training across Zimbabwe.\nUnder the agreement, the Sports Leaders Institute of Zimbabwe sourced a wide array of sporting equipment, including footballs, sportswear, training shoes, and tools for match officials.\nThe equipment has now been distributed across all teachers’ colleges nationwide, as these institutions play a critical role in laying the foundation for sports development.\nPrincipal of Belvedere Technical Teachers’ College, Dr Juliana Mbofana, welcomed the initiative, emphasising the strategic importance of equipping teachers with the necessary tools.\n“We are very happy. As teachers’ colleges, we are the foundation for sports development in Zimbabwe. With the right equipment, our student teachers will gain hands-on experience, which they will pass on to learners across the country,” she said.\nRepresenting Mkoba Teachers’ College, Head of Technical Education Department Mr Collen Daramachi echoed similar sentiments, calling the investment “a step in the right direction” towards nurturing the country’s next generation of sports stars.\n“We are very happy this will help a lot in training teachers who are the unsung heroes when I t comes to developing stars,” he said.\nPresident of the Sports Leaders Institute of Zimbabwe, Mr Russel Mhiribidi, described the partnership as a long-term investment in the nation’s sporting future.\n“This four-year partnership will enable our soon to be teachers to learn with the best equipment and the success of this initiative means that we the best physical education and sports teachers in the country,” he noted.\nThe Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development has also developed a policy to ensure that all tertiary institutions are adequately equipped with quality sports facilities.",
            "time": "06:17",
            "date": "18 Jun 2025"
        },
        {
            "title": "Zim golfers with disabilities set for Macau Golf Masters",
            "href": "https://www.zbcnews.co.zw/zim-golfers-with-disabilities-set-for-macau-golf-masters/",
            "content": "Story by Lawrence Trusida, Sports Editor\nHARARE-THREE Zimbabwean golfers with intellectual disabilities are set to represent the nation at the prestigious Macau Golf Masters tournament, thanks to timely sponsorship support from local investment firm Bard Santner.\nThe trio, Emmanuel Gutu, Simbarashe Mushayi, and Selassi Chiwisa, will participate in the annual event, scheduled to run from June 21 to 28 in Macau, China.\nThe tournament is widely regarded as the “Champions League” of golf for athletes with intellectual disabilities, drawing participation from over 50 countries.\nIn a major boost to their preparations, the athletes received golf kits and logistical support from Bard Santner during a handover ceremony held at Royal Harare Golf Club, where the team has been training under the guidance of their coach and head of delegation, Simon Murungweni.\n“Here at Royal Harare, we host the team every Monday. Our philosophy is centred on inclusion and recognising talent. Those heading to Macau are treated like kings,” he said.\nThe support from Bard Santner goes beyond equipment, as the company aims to transform lives by instilling confidence in athletes through sport.",
            "time": "06:17",
            "date": "18 Jun 2025"
        },
        {
            "title": "Shihan Mashaya wins five gold medals at IMAC English Open Tournament",
            "href": "https://www.zbcnews.co.zw/shihan-mashaya-wins-five-gold-medals-at-imac-english-open-tournament/",
            "content": "Story by ZBC Reporter\nMULTI-award-winning martial artist, Shihan Wilfred Mashaya, affectionately known as the “Zim Ninja”, once again flew the Zimbabwean flag high, clinching five gold medals at the International Martial Arts Corporation (IMAC) English Open Tournament held at the York Leisure Centre last Sunday.\nShihan Mashaya dominated all five categories in which he competed, excelling in traditional and freestyle martial arts weaponry. His gold medals were earned in the Black Belt Traditional Weapon, Black Belt Freestyle Weapon, Black Belt Creative Weapon, Musical Weapons, and Advanced Weapon divisions.\nDemonstrating his mastery of ancient Okinawan and Japanese weapons, including swords, nunchaku, tonfa, sai, and kama, Mashaya showcased his superior skills, discipline, and experience honed over years of dedication to martial arts.\nHe holds multiple black belts, including a Sixth Dan in disciplines such as Kyokushin Karate, Bujinkan Ninjutsu, Kobudo (Weapons), and Self-Defence.\nThe prestigious international tournament featured competitors from England, Wales, Scotland, India, Nepal, Zimbabwe, Romania, and Poland, among others. Shihan Mashaya’s clean sweep not only affirmed his global standing but also served as a major confidence booster ahead of the World Championships scheduled for October in Wales.\nIn recognition of his outstanding performance, IMAC organisers honoured Mashaya with the Athlete of the Tournament Award Trophy.\nAs the founder of the Zim Ninja Academy in Harare, Mashaya continues to train martial artists of all ages, from children as young as four to adult practitioners, instilling discipline, skill, and the spirit of sportsmanship.\nHe is currently preparing to lead a team of 15 or more athletes, comprising both men and women, to the upcoming World Championships, pendingsponsorshipand logistical support.\n“I’m proud of what we’ve achieved and I believe with the right support, our Zimbabwean team can shine even brighter on the global stage,” he said.",
            "time": "06:17",
            "date": "18 Jun 2025"
        }
    ]
}