{
    "news": [
        {
            "title": "Sables eye 2027 World Cup qualification glory",
            "href": "https://www.zbcnews.co.zw/sables-eye-2027-world-cup-qualification-glory/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe senior fifteens rugby team, the Sables, have arrived in Uganda ahead of their Africa Cup title defence in the East African country which kicks off on the 8th of this month.\nThe reigning African champions touched down on Ugandan soil this Saturday, with their sights firmly set on replicating last year’s exploits to earn an automatic qualification ticket to the 2027 Rugby World Cup.\nFacing stiff competition from eight other countries on the continental stage, Zimbabwe will open their campaign against Morocco on July 8and have retained most of the players who won the cup last year.\nSpeaking upon arrival in Uganda, Sables head coach Pieter Benade emphasised the importance of existing player chemistry in securing qualification for the World Cup for the first time since 1991.\n“We are grateful to have the majority of the players from last year. So, we are hoping for continuity, and hopefully, the good memories from last year will keep the spirits high,” he said.\nZimbabwe has qualified for the global stage twice, first in 1987 and then in 1991.\nThe current squad, which broke a 12-year drought by winning the Rugby Africa Cup in 2024, is aiming to end a World Cup qualification jinx that has persisted for over three decades.",
            "time": "06:50",
            "date": "06 Jul 2025"
        },
        {
            "title": "Chevrons seek historic test win against Proteas",
            "href": "https://www.zbcnews.co.zw/chevrons-seek-historic-test-win-against-proteas/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe senior men’s cricket team, the Chevrons, have a daunting task to level the two-match Test series against South Africa when the two nations face off in the second Test match beginning this Sunday at Queens Sports Club in Bulawayo.\nEying a historic win, the Chevrons need to be at their best to defeat the World Test champions in the second and final test match of the bilateral series.\nAfter suffering a 328-run defeat in the first Test, Zimbabwe will need to overcome a bullish South African side that has gone for eleven test matches without tasting defeat since skipper Temba Bavuma took the reins.\nThe Proteas look sharper than ever with an ambitious young squad that is disciplined in all aspects of the game and ready to hunt at any given time.\nThe Chevrons will need to bring their A-game against the world champions if they are to break South Africa’s winning streak in Test Cricket.",
            "time": "06:50",
            "date": "06 Jul 2025"
        },
        {
            "title": "Dynamos fall again as Herentals claim victory",
            "href": "https://www.zbcnews.co.zw/dynamos-fall-again-as-herentals-claim-victory/",
            "content": "Story by Raynald Ngwarati\nFADING Castle Lager Premier Soccer League giants Dynamos have succumbed to their seventh defeat of the season after losing to Herentals 2-nil in a Match Day 19 encounter.\nDynamos continue to struggle for form this season, remaining rooted in 17th place in the 18-team log standings after losing a home match to Herentals.\nDynamos, who have scored just six times in 18 outings so far this season, failed to get onto the scoresheet in the first half, despite coming close on many occasions.\nHerentals capitalised on Dynamos’ poor finishing in front of goal, with Tino Benza scoring in the 27th minute to give his side the advantage in the first half.\nTrailing by a goal to nil after the hour mark, Dynamos’ Shadreck Nyahwa finally found the back of the net, but only to score an own goal, giving Herentals a two-goal cushion with less than 30 minutes left on the clock.\nThe win moved Herentals to 28 points on the standings, leapfrogging ZPC Kariba and inactive FC Platinum.\nAt the top of the standings, MWOS FC solidified their stay at the summit with a 1-0 victory over Bikita Minerals, moving to 40 points on the standings, three better than second-placed Simba Bhora, who dropped points in a 1-1 stalemate with ZPC Kariba.\nNgezi Platinum Stars had a successful trip to Chisumbanje, earning maximum points courtesy of a 1-0 victory, while Chicken Inn eased relegation pressure by beating relegation threatened Yadah 2-1.",
            "time": "06:50",
            "date": "06 Jul 2025"
        },
        {
            "title": "Colourful ceremony marks start of African youth games in Windhoek",
            "href": "https://www.zbcnews.co.zw/colourful-ceremony-marks-start-of-african-youth-games-in-windhoek/",
            "content": "Story by Anashe Murombedzi\nTHE 11th edition of the African Union Sports Council Region 5 Youth Games kicked off in style with an official opening ceremony at the Independence Stadium in Windhoek, Namibia, this Friday.\nTen member countries proudly marched with their flag bearers, showcasing their national spirit.\nThe event was attended by prominent guests, including the Permanent Secretary for the Ministry of Sport, Recreation, Arts and Culture, Mr Nicholas Moyo, and the Director of Sport and Recreation, Eugenia Chidhakwa.\nThe ceremony was graced by Her Excellency the President of Namibia, Dr Netumbo Nandi-Ndaitwa, who handed a medal of honour to Dr Chidhakwa.",
            "time": "06:50",
            "date": "06 Jul 2025"
        },
        {
            "title": "Zimbabwe’s young athletes shine as volleyball teams secure semi-final spots",
            "href": "https://www.zbcnews.co.zw/zimbabwes-young-athletes-shine-as-volleyball-teams-secure-semi-final-spots/",
            "content": "Story by Anashe Murombedzi\nWINDHOEK, NAMIBIA -ZIMBABWE’S under-17 Beach Volleyball teams have made a splash at the African Union Sports Council Region 5 Youth Games in Windhoek, Namibia, after qualifying for the semi-finals set for Saturday.\nThe men’s team dominated their group, winning 2-0 against both South Africa and Botswana, after an impressive preliminary stage where they beat Malawi and host Namibia.\nNow, they will put everything on the line against Malawi this Saturday.\nThe women’s team showed resilience despite losing to Angola, securing wins against Namibia and South Africa that were enough to take them to the last four stages as well.\nZimbabwe’s young athletes will face Lesotho, while Mozambique takes on Angola.\nAway from beach volleyball, Zimbabwe’s Under-20 football teams had a false start.\nThe men’s team lost 2-1 to Malawi in their opening match but will look to bounce back against Namibia on Sunday.",
            "time": "06:50",
            "date": "06 Jul 2025"
        }
    ]
}