{
    "news": [
        {
            "title": "Johannes Ngodzo football tournament enters second edition",
            "href": "https://www.zbcnews.co.zw/johannes-ngodzo-football-tournament-enters-second-edition/",
            "content": "Story by Mthokozisi Dube\nFootball coaches have implored football stakeholders to craft a database for junior development, which will help in tracking budding footballers.\nThe second edition of the Johannes Ngodzo football tournament roared into life in Bulawayo this Saturday, with the tournament having been split based on various age groups.\nThe tournament unearthed budding football talent which caught the eye of football coaches who were quick to point to the need of having a database to monitor the development of budding footballers.\nFootball coach, Mandla Lulu Mpofu said, “The southern region is better known to be a hub for junior football talent as it has produced great names for big team as well as the national team. But the question is what happens to these young stars. We need a data base which will help us track the development of these players because there is good talent from what we have seen in this tournament.”\nFormer Warriors midfielder, Johannes Ngodzo has also implored other former footballers to cast the net wider by staging similar tournaments in their respective communities.\n“If we can have former footballers staging these tournament sin their respective areas, that can take us somewhere in growing the game,” he said.\nNow in its second edition, the annual Johannes Ngodzo football tournament has been a way of  educating the youths on the dangers of drug and substance abuse and one of the founder members, Irvin Khumalo believes plans to set up a development side are now at an advanced stage.\n“We formed the foundation in 2023 and we have had one tournament meaning this is the second edition. We realised that a lot of our young stars were involved in drug and substance abuse hence we came up with this initiative. Our aim is to see to it that we have a development side mainly for Under 19 competing in the lower leagues acting as a feeder to big teams. We have had talks on that with our partner in the US, UK and they have committed resources for the initiative,” Khumalo noted.",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Gore aspires to transform Zimbabwean football",
            "href": "https://www.zbcnews.co.zw/gore-aspires-to-transform-zimbabwean-football/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nSeasoned football administrator, Marshall Gore is confident that he has what it takes to transform Zimbabwean football and restore its former glory if elected president of the Zimbabwe Football Association (ZIFA) in the upcoming elections scheduled for next month\nWith 25 years of experience, Gore has a vision to transform the face of Zimbabwean football and restore its former glory.\nHis grassroots football background has seen him spending many years setting up and supporting local leagues, including the Goromonzi Area Zone League in the 90s and the recently revived Rusike Area Zone League.\nGore’s impact has not been limited to Zimbabwe’s borders, and it is through his organization, Team Zimbabwe UK that he has resourced hundreds of community football clubs across the country with vital equipment and kits.\nAhead of the ZIFA elections set for next month the aspiring ZIFA president is determined than ever to leave a lasting legacy is elected to the helm of the local football governing body.",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Football legends roll back the years at Gwanzura Stadium",
            "href": "https://www.zbcnews.co.zw/football-legends-roll-back-the-years-at-gwanzura-stadium/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nLocal football legends converged at Gwanzura Stadium in Harare this Saturday for a tournament that served to also inspire young players.\nThe event was a nostalgic trip back in time, reminiscent of the good old days when household teams like CAPS United, Dynamos, Black Aces, and Black Rhinos clashed for many year at the football stadium.\nThe tournament was designed to give the youngsters a glimpse of the past, showcasing the skills and passion of the legends who paved the way for the growth of Zimbabwean football.\nThe likes of Tatenda Sharara, Maronga Nyangela, Ephraim Mazarura, Robson Masauso, Brito Gwere, Moses Chunga, Lloyd Chitembwe, Lloyd Mutasa, Alois Bunjira, Stanford Stix Mutizwa and Mike Temwanjera were all there to inspire the next generation of Zimbabwean footballers.\nFormer Black Rhinos striker Stanford Stix Mutizwa said, “This tournament is a great way to give back to the community and inspire the next generation of footballers. As legends, we’ve been fortunate enough to have had our time in the spotlight, and now it’s time for us to pass on our knowledge and experience to the youngsters.”\nHis sentiments were echoed by former Black Aces midfielder Davies Mbidzo.\n“I am thrilled to see so many young faces here today. This tournament is a fantastic opportunity for them to learn from us, but also for us to learn from them. The energy and enthusiasm of the youngsters is infectious, and it’s a reminder that football is a game that can bring people together across generations,” Mbidzo said.\nThe event also provided a platform for the young players to interact with their role models, learn from their experiences and draw inspiration from their stories.\n“As a legend, it’s heart-warming to see the youngsters looking up to us as role models. This tournament is a chance for us to share our stories, our experiences, and our passion for the game with the next generation,” stated former Black Aces and CAPS United goalkeeper, Brenna Msiska.\nFormer Dynamos defender Henry Chari noted, “This tournament is a celebration of Zimbabwean football, and it’s a testament to the power of the game to unite us all. As legends, we’re proud to have played a part in shaping the history of Zimbabwean football.”\nAs the legends took to the pitch, it was clear that they still had the spark that made them household names during their playing days.",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "ZIFA elections: a battlefied of experience and money bags",
            "href": "https://www.zbcnews.co.zw/zifa-elections-a-battlefied-of-experience-and-money-bags/",
            "content": "Story by Mthokozisi Dube\nFormer football referee and CAF referees instructor, Sabelo Maphosa, who is vying for the ZIFA board member position is relishing to contribute her more than two decades football experience if given a  chance to serve in the ZIFA board.\nMaphosa believes she has what it takes to contribute to the growth of Zimbabwean football having been in the officiating trenches for more than 20 years.\n“I started refereeing in 1986 and rose through the ranks to become match commissioner and now I am a CAF referees’ instructor. I have learnt a lot in football, hence I believe I can contribute to the development of the game,” he said.",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Three batsmen score centuries as Chevrons dominate Afghanistan",
            "href": "https://www.zbcnews.co.zw/three-batsmen-score-centuries-as-chevrons-dominate-afghanistan/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZimbabwe put up their highest ever test score as they maintained their grip on Afghanistan, ending the second day of the first Test leading by 491 runs at Queens Sports Club this Friday.\nThe Chevrons racked up 586 runs in 135.2 overs to set a record-breaking total in its first innings during the first Test against Afghanistan in Bulawayo.\nZimbabwe’s previous highest total came in 2001, when it racked up 563 for nine in 167 overs against West Indies in Harare.\nSean Williams was the innings’ top scorer with 154 from 174 balls, which included 10 fours and three sixes.\nCaptain Craig Ervine and youngster Brian Bennett also scored centuries.",
            "time": "06:38",
            "date": "30 Dec 2024"
        }
    ]
}