{
    "news": [
        {
            "title": "Chicken Inn hunt for first win of the season",
            "href": "https://www.zbcnews.co.zw/chicken-inn-hunt-for-first-win-of-the-season/",
            "content": "Story by Mthokozisi Dube\nFORMER Premier Soccer League champions, Chicken Inn are targeting to collect their first set of maximum points when they tackle a tricky Herentals side at Luveve on Saturday.\nThe Gamecocks are winless after four rounds of matches and find themselves in unfamiliar territory, at the tail end of the log standings.\nChicken Inn have drawn thrice and lost their last away encounter to ZPC Kariba.\nWhile the target for maximum points is reasonable given they will be playing at home, Saturday’s opponents are a tricky customer for the Gamecocks.",
            "time": "06:36",
            "date": "03 Apr 2025"
        },
        {
            "title": "National Sports Stadium refurbishment programme to be complete by year-end",
            "href": "https://www.zbcnews.co.zw/national-sports-stadium-refurbishment-programme-to-be-complete-by-year-end/",
            "content": "Story by ZBC reporter",
            "time": "06:37",
            "date": "03 Apr 2025"
        },
        {
            "title": "NASH athletes in camp ahead of competitions",
            "href": "https://www.zbcnews.co.zw/nash-athletes-in-camp-ahead-of-competitions/",
            "content": "Story by Tapiwa Machemedze\nALL is set for the National Association of Secondary Heads (NASH) track and field national championships which begin in Chipadze, Bindura this Wednesday.\nThe best secondary school athletes from every province in Zimbabwe have trooped into camp ahead of the competition.\n“I am competing in high jump, and I am very confident that I am going to bring medals for Harare province,” an athlete said.\n“I am a learner at Allan Wilson High School and I will be contesting in triple jump. My target is to bring medals home,” another athlete said.\nMashonaland Central Provincial Schools Inspector for Sports, Arts and Culture, Mr Tonderai Mushore said necessary infrastructure has been put in place to ensure successful hosting of the event.\n“As Mashonaland Central province, the hosts we are very ready, we are 100 % ready as you can see we have just completed putting markings on the tracks, pitching the tents. We are positive that all our athletes will be comfortable come rain or sunshine,” Mr Mushore said.",
            "time": "06:37",
            "date": "03 Apr 2025"
        },
        {
            "title": "Fading giants CAPS United host early pace-setters Ngezi Platinum Stars on Sunday",
            "href": "https://www.zbcnews.co.zw/fading-giants-caps-united-host-early-pace-setters-ngezi-platinum-stars-on-sunday/",
            "content": "Story by Lawrence Trusida, Sports Editor\nEARLY pace-setters, Ngezi Platinum Stars will have a test of their pedigree when they travel to Harare for a date against fading giants CAPS United in a Premier Soccer League match set for Rufaro Stadium this Sunday.\nHarare giants, Makepekepe have started the season slowly after winning just one of their four matches so far this season.\nThe Green Machine drew with Green Fuel and lost to Scottland and TelOne however they have managed a solitary victory against weeping boys, Triangle who have lost all of their matches this season.\nIn recent seasons, the club famously known as the Cup Kings, has been a pale shadow of itself, in the last five seasons they have only managed to finish in the top four once in 2019 when they secured the bronze medals.\nBaring that the Lloyd Chitembwe coached side has been consistently hovering around mid to lower table positions.\nTheir quest to re-asset their pedigree and a second win of the season does not get any better as they face former champions Ngezi Platinum Stars who have started the season strongly, securing three wins and a draw.\nThe two teams square off at Rufaro Stadium this Sunday in the peak of the weekend’s fixtures.\nAction however starts on Saturday with stuttering defending champions Simba Bhora hosting a buoyant TelOne at Wadzanayi, struggling Chicken Inn host Herentals at Luveve, while FC Platinum travel to Bata Stadium for a date against Kwekwe United.",
            "time": "06:37",
            "date": "03 Apr 2025"
        },
        {
            "title": "Women’s Premier Soccer League delayed by a week amid preparatory delays",
            "href": "https://www.zbcnews.co.zw/womens-premier-soccer-league-delayed-by-a-week-amid-preparatory-delays/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE start of the 2025 Women’s Premier Soccer League season has been delayed by a week due to the clubs’ lack of readiness, the league’s administrators have said.\nThe highly anticipated season was scheduled to kick off this weekend, with many looking forward to witnessing the country’s top female footballers in action.\nHowever, the games will only start a week as clubs get more time to prepare and also pay affiliation fees.\n“We have now prioritised giving them the necessary support to ensure a successful league,” Women Premier Soccer League spokesperson, Arthur Gurajena said.",
            "time": "06:37",
            "date": "03 Apr 2025"
        }
    ]
}