{
    "news": [
        {
            "title": "Norman Maroto honoured with legends cup",
            "href": "https://www.zbcnews.co.zw/norman-maroto-honoured-with-legends-cup/",
            "content": "Story by Wellington Makonese\nFOOTBALL enthusiasts thronged Dzivarasekwa Stadium this Sunday for a four-team tournament in memory of former Dynamos striker Norman Maroto, who left a rich legacy beyond the football pitch.\nThe Norman Maroto Legends Cup brought together former professionals, local stars and rising talent in a display of skill and sportsmanship.",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Pazani to become first African rugby referee in Europe’s Six Nations tournament",
            "href": "https://www.zbcnews.co.zw/pazani-to-become-first-african-rugby-referee-in-europes-six-nations-tournament/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZimbabwe’s top rugby referee Precious Pazani continues to break records as she is set to become the first African referee outside of South Africa to officiate in the Europe’s Six Nations tournament next year.\nThe trailblazing Pazani is set to take charge of England’s clash with Italy in York on the 23rd of March next year in the Women’s Six Nations tournament.\nThe Six Nations Championship known as the Guinness Six Nations is an annual international rugby competition between European nations England, France, Ireland, Italy, Scotland and Wales.\nThe officiating team for the 2025 Women’s Six Nations was announced this Friday in what will be the final window of internationals for those hoping to make the 22-strong refereeing team for next year’s World Cup.\nThe former basketball player Pazani took a massive leap in her quest to become the first Zimbabwean to officiate at the Rugby World Cup after her appointment for the upcoming Women’s Six Nations.",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Installation of bucket seats at National Sports Stadium commences",
            "href": "https://www.zbcnews.co.zw/installation-of-bucket-seats-at-national-sports-stadium-commences/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE upgrade of the National Sports Stadium (NSS) to meet international standards is progressing well, with the installation of buckets seat having commenced.\nThe NSS has been closed for a while, however, fans might not wait much longer to catch a glimpse of action in the country’s biggest stadium as renovations are progressing.\nThe Warriors, the Mighty Warriors and clubs participating in the inter club competitions have had to host matches outside the country due to a lack of CAF approved venue in the country.\nThat could soon be a problem of the past as one of the key challenges at the venue is now being addressed, the issue of bucket seats.\nEngineers on-site are busy installing bucket seats at the facility to ensure it meets international standards.\nCurrently, they are working on the VIP area which is Bays 15-18 before they also focus on the VVIP section which is housed inside Bay 17.\nBay 19 which is part of the rest of ground has already been fitted with the bucket seats.\nThe engineers on site have already invited the ZIFA First Instance Board (FIB) which is in charge of implementing the CAF stadium requirements.\nThe FIB was satisfied with the way the seats are being installed and went on to invite CAF inspectors who are expected in the country early January to assess progress and give recommendations if any, before moving onto the rest of the facility.\nThe seats were purchased through a Public Private Partnership (PPP) between government and Sakunda Holdings.",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Scottland FC continue to attract more sponsorship",
            "href": "https://www.zbcnews.co.zw/scottland-fc-continue-to-attract-more-sponsorship/",
            "content": "Story by Lawrence Trusida, Sports Editor\nPremier Soccer League new-boys Scottland FC continue to attract more sponsorship after inking a US$1 million deal with IMC Communications this Friday.\nJust a day after sealing the biggest sponsorship in Zimbabwean football, a five-year deal with energy giants Sakunda Holdings, the Mabvuku-based side are showing they are an attractive brand after unveiling another sponsorship with IMC Communications.\nThe sponsorship will be used for both football operations and construction of the club’s home ground in Mabvuku.\nRepresenting IMC Communications, Ecobank Senior Executive, Mike Dengwane emphasised their commitment.\nHe said, “We saw them as an attractive prospect, this sponsorship is for this year, but we are already working on modalities for future cooperation.”",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "ZPC Hwange recounts journey to glory, still hungry for more success",
            "href": "https://www.zbcnews.co.zw/zpc-hwange-recounts-journey-to-glory-still-hungry-for-more-success/",
            "content": "There was jubilation and a revisitation of an over three decades journey when ZPC Hwange celebrated its promotion to the Premier Soccer League at its Annual Awards Ceremony this Friday night in the coal mining town.\nStriker Israel Mukahanana was given the Player of the Year Award. Others who celebrated include Morgan “Okocha” Nyoni, who got Most Loyal Player after enduring many years at ZPC and Beloved Mutambisi, who was awarded Most Improved Player award.\nAdmire Banda was recognised asMost Consistent Player, with Gerald Choto walking away with the Most Disciplined Player accolade.\nBudding Brandon Nyathi managed to bag the team’s Young Player of the Year Award as Justin Kaunda, who scored 14 goals, got theGolden Boot Award.\nFor excelling not only in the campaign for Premiership but at the Champion of Champons Tournament, Harmony Nare got the Goalkeepr of the Year and Golden Glove awards.\nJustin Kaundah again bagged the Supporters Player of the Year Award.\nBeyond the awards night, there was more to reflect on.\nIt was not only about players and the coaching staff being given accolades for a crown that finally came home after 34 years of trying, but a reflection of what the new entails.\nAn executive driven by a passionate chairman, Farai Mahachi, his deputy Ndabezinhle Ncube and club Patron ZPC Hwange Managing Director Shepard Mukundu never gave up on the dream to one day play top flight football.\nWhen the dream manifested, it was a moment to savour.\n“We are on cloud nine. We just want to thank the Almighty for achieving this. It has not been an easy feat, actually it has been years, more than three decades of trial and at times we would fall in the last minute, but one thing that I noticed is the need to strategise, and also, soccer is teamwork.\n“As the executive what we then arranged was to be closer to the team, but most importantly, the technical team, so after every match we would sacrifice a day where we would have a postmortem and share ideas on where we would have faltered and try and assist each other in terms of areas of improvement,” said Mahachi.\nThe success recipe complemented by the humble yet strategic, ZPC coach Mebelo Njekwa, is choosing to be modesty in victory.\nAs always, the down-to-earth Njekwa still maintains his optimism. He plans to carry on with the formula that took him to glory in Division One and overcome the giants of the premiership.\nIn his own words, he said, “Indeed it was a good season for us because of so many factors. The first one is teamwork. Wwe work together on the field of play as players and the technical on the bench. This spilt over into the executive and into our management. And for now I started rating this success at a time when we are celebrating Christmas.”\nA beautiful Christmas moment it will be for a team whose hunger and thirst for success has seen its legion of fans continue to grow over the years.\nThe club’s supporters are upbeat that while their counterparts, Chipangano, won’t be playing top flight after relegation, all is not lost as ZPC will carry the banner.\nZPC Supporters chairman Hardlife Gutu is in an exuberant mood.",
            "time": "09:29",
            "date": "23 Dec 2024"
        }
    ]
}