{
    "news": [
        {
            "title": "Develop soccer from grassroots – Musanhu",
            "href": "https://www.zbcnews.co.zw/develop-soccer-from-grassroots-musanhu/",
            "content": "Story by Jonathan Marerwa in Beijing, China\nSoccer, just like any other sporting code, needs to be developed from grassroots level in order to derive maximum benefits.\nThese sentiments were made by renowned China-based youth soccer coach, Walter Musanhu, during the recently-held Jadel Football Academy 6th year awards ceremony in Beijing.\nMusanhu, who is the founder and chief funder of the academy, said it gives him great pleasure helping in the grooming of young players.\nHe said the academy, which has a branch in Harare, is helping in creating a better future for children, with 278 children being members of the academy.\nThe former Motor Action Football Club player said he is targeting children from high density areas and other disadvantaged communities, and is paying school fees while also providing accommodation for others.\nHe urged business people to partner with his academy since he has been solely funding it from his savings.\nMusanhu said it is his wish to have land to construct soccer facilities so as to have a fully-fledged academy modelled like those found in developed countries.",
            "time": "18:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "Scottland FC to build 15 000-seater stadium in Mabvuku",
            "href": "https://www.zbcnews.co.zw/scottland-fc-to-build-15-000-seater-stadium-in-mabvuku/",
            "content": "Story by Lawrence Trusida, Sports Editor\nScottland FC have set in motion the construction of a 15 000-seater stadium following a ground-breaking ceremony held at the Number One Grounds in Mabvuku this Wednesday.\nThis is a ground that shaped careers of many athletes – the legendary Warriors goalkeeper Brenna Msiska, the Mugeyi brothers William and Wilfred as well as Daniel Jakiel, a cricketer who is now turning out for Malawi.\n\nMarshall Munetsi, the Mabvuku-born Warriors vice-captain would have loved to showcase his skills at the ground, but, unfortunately, it wasn’t to be as the community sports centre was not developed, but his dream will now be lived by many youths in Mabvuku and surrounding areas following the ground breaking ceremony held this Wednesday.\nScottland FC, owned by Mabvuku legislator Honourable Scott Sakupwanya, have secured a 30-year lease for Mabvuku Number One Grounds.\nThe club aims to build a 15 000-seater multi-purpose stadium, swimming pool, cricket pitch, construct new courts for basketball and tennis as well as build a club house for Scottland FC.\n\n\nThe project will be done in phases, with the first phase earmarked to be ready by April next year.\n\n“It’s going to be a multi-purpose sports complex with swimming pools, stadiums and shops. If you know the history of Mabvuku, Number One Ground used to have some of these things and we are just revamping it into a modern facility. We are going to do things in phases and phase one will be the construction of a club house, main pitch as well as practice pitch for Scottland FC,” said Scottland FC chairperson, Tonderai Sakupwanya.",
            "time": "18:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "Aspiring ZIFA presidential candidates face uncertain future",
            "href": "https://www.zbcnews.co.zw/aspiring-zifa-presidential-candidates-face-uncertain-future/",
            "content": "Story by Lawrence Trusida, Sports Editor\nThe stage is set for the Zimbabwe Football Association (ZIFA) executive committee elections, scheduled for the 25th of January next year, with three aspiring presidential election candidates, Martin Kweza, Philemon Machana and Prophet Walter Magaya facing an uncertain future after their candidature was challenged on a matter of law.\nThe Ethics Committee is currently reviewing the nominations, with a list of successful candidates expected to be announced on the 23rd of December.\nSeveral high-profile candidates have thrown their names into the hat, including Northern Region chairperson Martin Kweza, PSL chairperson Farai Jere, and his predecessor Twine Phiri.\nBusinessman Nqobile Magwizi, former ZIFA executive committee member Philemon Machana, Prophet Walter Magaya, former Warriors captain Benjani Mwaruwari and former legislator Themba Msliwa, are also vying for the top spot.\nIt has, however, emerged that not all candidates are having a smooth ride with Prophet Magaya, Kweza, and Machana’s candidature being challenged on a matter of law.\nSports lawyer Allan Murimirwa gave an insight into the prevailing situation.\n“There is nothing that precludes individuals from bringing to the attention of the chairman of the Ethics Committee, allegations of violations or attempted violations of the Ethics Code. However, it is the duty of the Ethics Committee to determine if individuals can stand for office after careful evaluation based on the ZIFA statutes,” he explained.\nWith various individuals raising allegations and concerns over pending court cases, Murimirwa said the Ethics Committee will carefully evaluate the evidence and make a judgment based on the ZIFA statutes.",
            "time": "18:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "2024 Eastern Region Soccer League Awards held in Triangle",
            "href": "https://www.zbcnews.co.zw/2024-eastern-region-soccer-league-awards-held-in-triangle/",
            "content": "Story by Gay Matambo\n\nThe Eastern Region Soccer League held its 2024 annual awards ceremony this weekend, where outstanding players, coaches and referees for the just ended soccer season were awarded for their sterling performance.\n\nThe awards ceremony, which took place this Saturday at Triangle Country Club, saw players who include Ali Sadiki from Triangle United Football Club, Junior Peter Mushure from FC Wangu Mazodze and Tawanda Chatuluka from FC Hunters scooping medals for being part of the 11 best players of the past season.\n\n“I promise our supporters that we are going to do better in the PSL. I have never led a team that got relegated, and I’m confident that TUFC will never be relegated,” said Triangle United Football Club coach, Luke Masomere.\n\nMidfielder, Ali Sadiki said, “I want to thank God for this award and this is a motivation to the youngsters when they see someone like me winning this award and it also motivates my age mates to say that age is just a number they only have to work hard.”\n\nZIFA Easter Region chairperson, Mr Davison Muchena said they are targeting to promote more teams into the top tier of Zimbabwean Football as Triangle United Football Club joins Manica Diamonds, Bikita Minerals and Green Fuel, bringing the total number of teams from the Eastern Region Soccer League to four.\n\n“Our season was successful, and today we came to Triangle to celebrate the success of the youngsters who managed to play from day 1 up to the end of the season. We also want to give under 19s a chance because we want them to grow. The year was ok, and competition was also top class in the Eastern region,” he said.\n\nZIFA chief executive officer, Ms Yvonne Manwa, who was one of the high profile guests at the event, cited the importance of unity in the development of football in Zimbabwe.\n\nShe said, “For football to be successful we should join hands, support and sponsor it. We all have a mandate to make football successful in our country. If we work together, you will find out that we will all be successful in promoting soccer in Zimbabwe.”\n\nFC Hunters Football Club scooped the most improved team award while Surrey FC went home with most disciplined team award.\n\nThe Golden boot winner award went to Tadiwa Mambudzi of Mutare City after scoring 15 goals in the just ended season with Munyaradzi Bakayawo scooping the referee of the year award.\n\nBest 11 Eastern Region Soccer League players\nAli Sadiki, Triangle United Football Club\nJunior Peter Mushure, FC Wangu Mazodze\nTawanda Chatuluka, FC Hunters\nDavid Chirandu, Destiny Stars\nBennedict Musana, Chiredzi Stars\nClive Madande, Rusitu Tigers\nLeon Ngwenya, Renco Mine, Theophilous Musiye, Huku F.C\nMalvin Dumbura, Tenax F.C\nAldridge Mubango, Buffaloes F.C\nEddy Kanyangu\nTadiwa Mambudzi, Mutare City\n\nOther individual winners are:\nMost improved team – FC Hunters\nMost Disciplined team – Surrey F.C\nBest Adminstrator – Buffaloes F.C\nChairman of the season – Tenax FC\n\nSpecial Awards\nMost promising player – Eddie Kanyangu (18), Manica Diamond\nGolden Glove – Junior Mushure, F.C Wangu Mazodze\nGolden Boot winner:  Tadiwa Mambudzi (15 goals), Mutare City\nCoach of the year – Luke Masomere, Triangle United\nMost Promising coach – Hebron Makukutu Manica Diamonds Juniors\n\nReferees",
            "time": "18:34",
            "date": "19 Dec 2024"
        },
        {
            "title": "ZIFA asked to take appropriate steps to bring European brigade to the Warriors",
            "href": "https://www.zbcnews.co.zw/zifa-asked-to-take-appropriate-steps-to-bring-european-brigade-to-the-warriors/",
            "content": "Story by Raynald Ngwarati\nThe incoming Zimbabwe Football Association (ZIFA) board has a tough assignment ahead to take Zimbabwe to the next heights in football by tapping into the country’s abundant football talent based in Europe and other continents.\nFrom the days of Peter Ndlovu who became the first African export in the modern English Premier League era and former Liverpool goal minder Bruce Grobelaar, Zimbabwe has always produced exciting football talent.\nThe older generations always reminisce the ‘Dream Team’ under German coach Reinhard Fabisch which was arguably the best ever Warriors squad, however about two-decades later in the era of another German gaffer, Michael Nees the best days for Zimbabwean football seem to be knocking on the door yet again if the appropriate steps are taken.\nWhile it has always been a dream to have a squad dominated by players playing at the highest level in Europe, Zimbabwe is now at its peak in terms of football talent with the likes of Trey Nyoni, Isaac Mabaya, Shumhaira Mheuka, Leon Chiwome and Michael Ndiweni featuring in England topflight senior teams.\nAlthough promising to be a powerhouse if the young talent pledges allegiance to represent Zimbabwe, most of the talent has not been formally approached although others have highlighted their interest in donning the country’s colors.\nFormer footballer and analyst, Justice Majabvi told the ZBC News, “We used to wish this when it was happening to the West Africans and maybe North Africa as well when they had all players with vast experience and also exposure in Europe. So now it’s our turn as we have youngsters some of whom were born in Europe and some in Zimbabwe, but moved to Europe when they were young.”\nMajabvi believes these youngsters can agree to play for the Warriors if approached by the football governing body in the country.",
            "time": "18:34",
            "date": "19 Dec 2024"
        }
    ]
}