{
    "news": [
        {
            "title": "Warriors touch down in Lagos ahead of Nigeria clash",
            "href": "https://www.zbcnews.co.zw/warriors-touch-down-in-lagos-ahead-of-nigeria-clash/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe senior men’s football team, the Warriors, are in transit to Nigeria’s Uyo State for their away World Cup qualifying tie where they lock horns with the Super Eagles of Nigeria on Tuesday.",
            "time": "21:26",
            "date": "22 Mar 2025"
        },
        {
            "title": "NAAZ targets improved performance at Region Five youth games",
            "href": "https://www.zbcnews.co.zw/naaz-targets-improved-performance-at-region-five-youth-games/",
            "content": "Story by Mthokozisi Dube\nTHE National Athletics Association of Zimbabwe (NAAZ) is targeting improved performance at the African Union Sports Council (AUSC) Region Five Youth Games after holding a tournament to select athletes to represent team Zimbabwe in Namibia next month.\nWhite City was the venue for this year‘s NAAZ open field and track championships, an event used to select athletes for the Region Five Youth Games penciled for Namibia next month.\nAthletics coach, Manuel Mpofu believes staging more of these competitions will help athletes improve their qualification times for improved performance on the international stage.\n”As NAAZ we want to improve from our performance in Malawi in the last edition of Region Five, so we have decided to have preparatory competitions for our athletes to improve their times hence we have organised an event which has attracted clubs across the country,” he said.\nThe Bulawayo Athletics Board(BAB) is using the same competition to select athletes for inter-provincial championships set for June in the city.\n“As BAB we are happy to have hosted the NAAZ open championships. We have an action-packed calendar but we are using this competition to select our team for the inter-provincial which we will host here at White City,” BAB chairperson, Watson Madenyika said.",
            "time": "21:26",
            "date": "22 Mar 2025"
        },
        {
            "title": "Warriors set sights on Nigeria after Benin stalemate",
            "href": "https://www.zbcnews.co.zw/warriors-set-sights-on-nigeria-after-benin-stalemate/",
            "content": "Story by Mthokozisi Dube\nTHE Zimbabwe senior men’s football team, the Warriors, are hoping to carry their second-half fine performance to their next assignment after a frustrating two-all share of spoils with Benin in South Africa this Thursday.\nThe odds were against the Warriors heading into the block buster encounter against Benin, as they were facing a side oozing with confidence in the World Cup qualifiers.\nIt was no fluke that Benin meant business as they managed to secure two early goals which unsettled the Warriors.\nThe Warriors managed to redeem themselves in the second half, but overturning the first-half deficit remained a pipe dream as they settled for a share of spoils.\nReturning former skipper Knowledge Musona justified his inclusion as he was on target to ensure the Warriors secured a point.\nDespite dropping two vital points to bring back their World Cup qualification hopes, Warriors head coach Michael Nees is refusing to throw in the towel, rallying his charges for the next match away to Nigeria on Tuesday.\n“We had a lot of thoughts and emotions on today’s game. I really would want to thank our fans for the carnival atmosphere, very good crowd. We could not have come back if we had no crowd. We really appreciate. Of course we wanted a better result but the opponent was strong. We did not start well but we had a better second half. We wanted to win, we tried everything and hopefully we will build on this in our next game,” Nees said.",
            "time": "21:26",
            "date": "22 Mar 2025"
        },
        {
            "title": "Manicaland and Harare dominate at NAPH games",
            "href": "https://www.zbcnews.co.zw/manicaland-and-harare-dominate-at-naph-games/",
            "content": "Story by Mhlomuli Ncube\nMANICALAND and Harare dominated proceedings at this year’s National Association of Primary Heads (NAPH) games, with the two provinces sharing spoils on the medals table as the contest ended this Thursday.\nManicaland and Harare provinces amassed a total 38 medals a piece.\nIn second place was Mashonaland West which harvested a total of 37 medals with 12 gold, 12 silver and 13 bronze, while Midlands came third with a total of 36 medals.\nMasvingo will, however, be the most disappointed province after failing to get a single medal.\nIt was a moment of reflection as the NAPH basked in the glory of a successful sporting festival held at the Hwange Colliery Stadium.\n“The organisation at this year’s edition was top-notch. There was order and stakeholders worked together in harmony,” NAPH National vice president, George Nkonde said.\n“As the host province, we are extremely happy. We worked well and even got support from our local Colliery Company,” Host Province Chairperson, Nkosinathi Moyo said.\nIt was also another historic moment when Chess made its debut in the games for the first time.",
            "time": "21:26",
            "date": "22 Mar 2025"
        },
        {
            "title": "Munetsi and Musona lead Warriors to hard-fought draw",
            "href": "https://www.zbcnews.co.zw/munetsi-and-musona-lead-warriors-to-hard-fought-draw/",
            "content": "Story by Mthokozisi Dube\nThe Zimbabwean Warriors staged a resilient comeback to secure a 2-2 draw against Benin in their Group C World Cup Qualifier in Durban, South Africa, this Thursday evening.\nDespite a shaky start that saw the Warriors concede two early goals, captain Marshall Munetsi and former skipper Knowledge Musona led the charge, with Munetsi scoring just before halftime and Musona equalising just before the hour mark.",
            "time": "21:26",
            "date": "22 Mar 2025"
        }
    ]
}