{
    "news": [
        {
            "title": "Over 900 young athletes participate in NAPH games",
            "href": "https://www.zbcnews.co.zw/over-900-young-athletes-participate-in-naph-games/",
            "content": "Story by Mhlomuli Ncube\nOVER 900 athletes are taking part in the National Association of Primary Heads (NAPH) games underway in the mining town of Hwange.\nWith each of the country’s ten provinces contributing 91 athletes, there is excitement at the field and track competitions.\nThe young athletes are equally grateful for the opportunity to shine at the annual tournament.\n“I trained hard before I came here, this is important for me as a young person,” an athlete said.",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Warriors Eye Victory against Benin in 2026 World Cup Qualifier",
            "href": "https://www.zbcnews.co.zw/warriors-eye-victory-against-benin-in-2026-world-cup-qualifier/",
            "content": "Story byAnashe Murombedzi\nZIMBABWE’S senior men’s football team, the Warriors, face a daunting task when they take on Benin in a 2026 FIFA World Cup qualifier at the Moses Mabhida Stadium in Durban, South Africa, this Thursday.\nThey are in dire need of a win, having failed to secure a victory in their opening four matches of the campaign.\nWarriors quest for a maiden World Cup appearance has been further complicated by a pair of draws against Rwanda and Nigeria, followed by disappointing defeats at the hands of Lesotho and South Africa.\nZimbabwe’s struggles in the qualifiers have left them rooted at the bottom of Group C with just two points, six behind leaders South Africa.\nIn stark contrast, Benin has made a promising start, accumulating seven points from their four matches to sit third on the standings.\nThey are tied with Rwanda and South Africa, but trail on goal difference.",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "IOC elections set for Greece this Thursday",
            "href": "https://www.zbcnews.co.zw/ioc-elections-set-for-greece-this-thursday/",
            "content": "Story by Anashe Murombedzi\nSPORTS, Recreation, Arts & Culture Minister Honourable Kirsty Coventry is poised to make history as the first woman and first African to lead the International Olympic Committee (IOC) as its president if elected this Thursday.\nA total of seven candidates will compete in the election for the presidency of the International Olympic Committee (IOC) at the 144th IOC Session in Greece.\nCoventry’s remarkable journey, which has taken her from the swimming pools of Zimbabwe to the pinnacle of international sports administration, is a testament to her unwavering dedication and unrelenting passion.\nWith seven Olympic medals, including two golds, Coventry is Africa’s most successful female Olympian, and her achievements have inspired a generation of athletes across the continent.\nAs a member of the IOC Executive Board and former chairperson of the IOC Athletes’ Commission, Coventry has demonstrated her ability to navigate the complex world of international sports politics.\nHer vision for the IOC is built on a foundation of inclusivity, sustainability, and innovation, and she is committed to ensuring the Olympic Movement remains relevant and vibrant in an ever-changing world.\nCoventry’s election would not only be a historic moment for the IOC but also a powerful symbol of the growing influence and recognition of African sports leaders on the global stage.",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Mauchi itching to make his debut ahead of Warriors WC qualifiers",
            "href": "https://www.zbcnews.co.zw/mauchi-itching-to-make-his-debut-ahead-of-warriors-wc-qualifiers/",
            "content": "Story by Mthokozisi Dube\nTHE Warriors are settling in well in Durban, South Africa, as they prepare for Thursday’s crucial World Cup qualifier against Benin at Moses Mabhida Stadium.\nOn Monday, the team began their preparations with a light training session in the coastal city, focusing on acclimatising to the conditions ahead of the high-stakes match.\nSimba Bhora defender Isheanesu Mauchi, is eager to make an impact after earning his call-up to the Zimbabwe national team.\nThe young defender, who has impressed in the local league, is relishing the opportunity to play alongside some of Africa’s finest talents.\n“It is an exciting feeling to be surrounded by exceptional players, both local and international players. The team is a bunch of cool guys, pretty calm, and pretty welcoming, there is no feeling like I am the new guy, it is just a whole family, a brotherhood. I am hoping to put my best foot forward,” he said.\nWarriors forward Prince Dube, who has asserted himself as a gunslinger in Tanzania, is optimistic Thursday’s hunt will rekindle prospects of World Cup qualification.\n“For today, it was most light training after a long journey. I think the way we finished we need to continue from where we left and make the nation proud. Our team is made up of quality players and we have more experienced players, if we believe in ourselves we can do well,” he said.",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Sables sharpen skills in South Korea ahead of Rugby Africa Cup showdown",
            "href": "https://www.zbcnews.co.zw/sables-sharpen-skills-in-south-korea-ahead-of-rugby-africa-cup-showdown/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE Zimbabwe national rugby team, the Sables, are using their tour of South Korea to prepare for the upcoming Rugby Africa Cup in Uganda.\nThe team’s exposure to top-level competition in South Korea has been further enhanced by the inclusion of Brendon Mudzekenyedzi and Dylan Utete in the match-day squad for Okman Rugby Club, a rising force in the Korea Super Rugby League.",
            "time": "06:40",
            "date": "20 Mar 2025"
        }
    ]
}