{
    "news": [
        {
            "title": "Mutyoramwendo stuns in kickboxing debut, eyes gold medal",
            "href": "https://www.zbcnews.co.zw/mutyoramwendo-stuns-in-kickboxing-debut-eyes-gold-medal/",
            "content": "Story by Farai Gwaze\nZIMBABWEAN combat sports athlete, Justice Mutyoramwendo, made an electrifying kickboxing debut at Saturday’s Clash of Warriors II event in Johannesburg, scoring a stunning first-round technical knockout over South Africa’s Frank Cato.\nThe 26-year-old, a former African karate champion, executed his team’s precise strategy to dominate Cato in under three minutes, delivering powerful, decisive strikes.",
            "time": "09:43",
            "date": "21 Jul 2025"
        },
        {
            "title": "Scottland stun Highlanders, Dzvukamanja scores match-winning brace",
            "href": "https://www.zbcnews.co.zw/scottland-stun-highlanders-dzvukamanja-scores-match-winning-brace/",
            "content": "Story by Anashe Murombedzi\nAMBITIOUS Mabvuku-based side, Scottland came from behind to edge Bulawayo giants, Highlanders 2-1in a pulsating Castle Lager Premier Soccer League match day 21 encounter at Rufaro Stadium this Sunday.\nAfter being awarded three points for their abandoned match against Chicken Inn a few weeks ago, Scottland did not waste the opportunity to move closer to the leading pack, thanks to Terrence Dzvukamanja’s brace.\nThe atmosphere at Rufaro Stadium was electric, and Highlanders took an early lead in the 16th minute through Mafious Chihweta, but Dzvukamanja, a mid-season signing from the South African top flight, levelled matters six minutes later.\nHighlanders had a chance to score the second after being awarded a penalty, but could not convert, only for Dzvukamanja to punish them in the 69th minute.",
            "time": "09:43",
            "date": "21 Jul 2025"
        },
        {
            "title": "Kabondo and Sibanda shine in AFZ half marathon",
            "href": "https://www.zbcnews.co.zw/kabondo-and-sibanda-shine-in-afz-half-marathon/",
            "content": "Story by Peter Chivhima\nWAYNE Kabondo of Mr Pace Athletics Club has won the men’s 21km race of the Air Force of Zimbabwe’s Half Marathon held in Harare.\nKabondo crossed the finish line in 1 hour, 6 minutes, and 52 seconds, just one second ahead of Slowly Owen from the Zimbabwe Republic Police.\nIn the women’s 21km category, Kabondo’s teammate, Mirriam Sibanda, continued the club’s dominance with a time of 1 hour, 18 minutes, and 49 seconds.\n“Through training, I have managed to make it. I want to thank my coach for this,” Kabondo said.\n“The race was good, the terrain and the weather were encouraging,” Sibanda noted.\nIn the wheelchair 10km races, Munyaradzi Katiyo of Tsvaira Cycling led the men’s category in 24 minutes and 59 seconds, while Stella Jongwe topped the women’s category with a time of 30 minutes.\n” I am so excited to participate in this year’s edition. I am so happy that the AFZ is including us,” Katiyo said.\n“It was tough, but I managed to make it, I am excited,” Jongwe added.\nThe 8km race saw Black Rhinos’ Moses Tarakinyu finish first in 23 minutes, closely followed by Martin Mutsapata.",
            "time": "09:43",
            "date": "21 Jul 2025"
        },
        {
            "title": "Herentals College expands talent search through zonal tournament",
            "href": "https://www.zbcnews.co.zw/herentals-college-expands-talent-search-through-zonal-tournament/",
            "content": "Story by Mthokozisi Dube\nHERENTALS College has cast the net wider after conducting a zonal tournament to tap into talent that can feed into the college’s football.\nThe College owns Premier Soccer League outfit, Herentals, a B team in the Division One league and a ladies team in the Zimbabwe Women’s Premier League, Herentals Queens.\nWith the teams relying largely on the talent within their parent owners’ colleges, efforts are being made to decentralise talent identification.\nThe college held its inaugural Southern Region Zonal tournament in Bulawayo this Friday, with players from Matebeleland North, Matabeleland South and Bulawayo participating.\nThe college held its inaugural Southern Region Zonal tournament in Bulawayo this Friday, with players from Matebeleland North, Matabeleland South and Bulawayo participating.\n“It is the first of its kind. We normally have a national tournament, but this time around, we had to start at the zones where we will select teams for the national finals. We are going to be selecting talent for our teams. We are happy Focus has also included the girl child.\n“Our tournament this time includes girls’ soccer. The whole idea is to give these learners an opportunity to graduate to our senior team. We are not only focusing on academic excellence, but we need those with sporting excellence to carve a path,” one of the Herentals college team members said.",
            "time": "09:43",
            "date": "21 Jul 2025"
        },
        {
            "title": "Simba Bhora deepen Dynamos’ woes with narrow victory",
            "href": "https://www.zbcnews.co.zw/simba-bhora-deepen-dynamos-woes-with-narrow-victory/",
            "content": "Story by Anashe Murombedzi\nDEFENDING champions, Simba Bhora, have piled more misery on the relegation-threatened Dynamos, beating them 1-nil and in the process asserting their credentials in defence of the Castle Lager Premier Soccer League title.\nAn 84th-minute strike from Namibian Isaskar Gurirab was the difference, as Simba Bhora inflicted yet another blow on the country’s most decorated club, Dynamos.\nIn a match of contrasting fortunes, the Castle Lager Premier Soccer League defending champions asserted themselves as a team capable of reclaiming the coveted title, while Dynamos, with 22 titles under their belt, sank further in the relegation zone.\nThe Go Buju Boys are now on 43 points, three above debutants, MWOS, who dropped points after losing 2-0 to unbeaten FC Platinum.\nIn other matches, CAPS United and TelOne played out a goalless draw, Triangle United suffered a 1-0 defeat to Ngezi Platinum, while Green Fuel secured a 2-0 win over Bikita Minerals.\nChicken Inn beat ZPC Kariba 1-0, Manica Diamonds lost 1-0 to Herentals, and Kwekwe United were defeated 1-0 by Yadah.\nMeanwhile, Scottland had a road show in the capital hyping their match against Highlanders at Rufaro Stadium this Sunday.\n“I know we are going to win,” we are in great form and Highlanders can not stop us. We are the better team, and we will prove it on Sunday. I am confident we’ll take the win we are expecting mabviravira,” Scottland team players noted.",
            "time": "09:43",
            "date": "21 Jul 2025"
        }
    ]
}