{
    "news": [
        {
            "title": "ZIFA elections: Former footballers speak out",
            "href": "https://www.zbcnews.co.zw/zifa-elections-former-footballers-speak-out/",
            "content": "Story by Mthokozisi Dube\nFORMER Zimbabwe Football Association (ZIFA) vice president and seasoned administrator, Peter Dube, has set his sights on completing the task he left prematurely ten years ago.\nDube is one of the candidates vying for the ZIFA Vice Presidency.\nDube believes he has what it takes to contribute to the development of local football.\n“I was at ZIFA 10 years back, and you know what happened. Now is the time for us to complete the task we left. We want to improve the football ecosystem where everyone feels part of the journey to transform Zimbabwean football,” Dube said.\n“We are happy the secretariat has been put in place. We are not inventing anything new. Football has its governing statutes. What we need is to follow those principles and guidelines.\n“We are confident with the available secretariat, we can bring back the lost glamour in our game.”\nMeanwhile, former footballers have added their voice on the impending ZIFA polls.\nSouth Africa-based former Highlanders Defender, Alexander Maseko who has been at the forefront of assisting Zimbabwean teams on assignment across the Limpopo, and CAPS United legend, Stanford ‘Stix’ Mutizwa said football should be the winner after the ZIFA elections.\n“I have a message for the guys nominated for the ZIFA elections, they",
            "time": "21:26",
            "date": "06 Jan 2025"
        },
        {
            "title": "Murasiranwa launches soccer tournament in Chihota",
            "href": "https://www.zbcnews.co.zw/murasiranwa-launches-soccer-tournament-in-chihota/",
            "content": "Murasiranwa launches soccer tournament in Chihota\nStory by Jerold Sasa\nCANADA-based professional footballer Darlington Murasiranwa has launched a soccer tournament in his home area of Chihota in Marondera as part of giving back to the community which raised him.\nThe 23-year-old who turns out for Canadian Premier League side Valour FC and is on an off-season break.\nThe tournament, which also featured netball teams, saw four districts competing – Chitangazuva, Bumburwi, Marondera and Chizengeni.\nThe Valour FC first first-choice goalkeeper is keen on developing talents in his rural area.\n“Zimbabwe will always be my home and that is why I had to come and sponsor this tournament so that we develop football at the grassroots level,” he said.",
            "time": "21:26",
            "date": "06 Jan 2025"
        },
        {
            "title": "Zimbabwe lose inaugural New Year’s test",
            "href": "https://www.zbcnews.co.zw/zimbabwe-lose-inaugural-new-years-test/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nAFGHANISTAN took only 10 minutes to wrap up victory by 72 runs on the final day of the inaugural New Year’s test against Zimbabwe at the Queens Sports Club this Monday.\nIt took just 15 deliveries on the final day for the visitors to take the last two wickets and wrap up the match, winning by 72 runs, thereby clinching the series one-nil.\nZimbabwe were dismissed for 205, failing to add to their overnight score and lost the remaining two wickets in just over 10 minutes.\nRichard Ngarava was run out in the second over of the day, while Captain Craig Ervine, who had been resolute was trapped leg before wicket by Rashid Khan the following over.\nAfghanistan came from behind to pull off a heist in Bulawayo to win their first-ever Test series against the Chevrons.\nHaving conceded a first-innings lead of 86 runs, things looked a bit tough for Afghanistan as they had a massive challenge to first overhaul the deficit and then set a target for Zimbabwe.\nRahmat Shah and debutant Ismat Alam’s centuries did the job for the visitors with the bat in the second innings before Rashid Khan worked his magic with the ball.\nRashid Khan registered his second seven-wicket haul after claiming 7 for 66 which was not only Rashid’s career-best figures but also the best bowling figures for Afghanistan.\nThe Chevrons once again faltered with history in sight and rather gave the visitors records, with the trend slowly becoming the norm for the national cricket team.\nThe 72-run victory is Afghanistan’s first Test win since 2021, their fourth overall Test win since they got the Test status in 2018.",
            "time": "21:26",
            "date": "06 Jan 2025"
        },
        {
            "title": "Basketball legend Mukukula dies",
            "href": "https://www.zbcnews.co.zw/basketball-legend-mukukula-dies/",
            "content": "\nStory by Anashe Murombedzi\nTHE Harare basketball community has been plunged into mourning after the death of legendary basketball figure, Ngoni Mukukula, this Sunday.\nIn a statement, the Harare Basketball Association (HBA) described Mukukula as a great basketball player, coach, administrator, team manager, and a huge advocate for the underprivileged beyond the basketball courts.",
            "time": "21:26",
            "date": "06 Jan 2025"
        },
        {
            "title": "Athletes gear up for Harare cross-country opener",
            "href": "https://www.zbcnews.co.zw/athletes-gear-up-for-harare-cross-country-opener/",
            "content": "\nStory by Anashe Murombedzi, Sports Reporter\nTHE Harare athletics season kicks off with a cross-country opener at David Livingstone School in Harare this Sunday.\nAthletes of all ages and levels are expected to flock to the event, which provides a perfect platform for young runners to gauge their fitness levels before the new school term begins.\nCoaches will also use the opportunity to evaluate their athletes’ preparedness for the season.\nThe event targets athletes from Under-10 to senior categories.\nThe competition will feature various distance categories, including 8km for senior men and women, 6km for Under-18 boys, Under-20 girls and Under-20 boys, and shorter distances for younger age groups.",
            "time": "21:26",
            "date": "06 Jan 2025"
        }
    ]
}