{
    "news": [
        {
            "title": "All set for ZIFA elections",
            "href": "https://www.zbcnews.co.zw/all-set-for-zifa-elections/",
            "content": "Story by Lawrence, Trusida Sports Editor\nThe stage is set for the Zimbabwe Football Association (ZIFA) executive committee elections which will be held in Harare this Saturday.\nThe candidates will battle it out for nine out of the 11 positions, including the presidency.\nOthers are vying for the vice-presidency, one of which should be a woman.",
            "time": "20:33",
            "date": "24 Jan 2025"
        },
        {
            "title": "TelOne FC ups preparations ahead of 2025 PSL season",
            "href": "https://www.zbcnews.co.zw/telone-fc-ups-preparations-ahead-of-2025-psl-season/",
            "content": "Story by Tafara Chikumira\nGweru-based Premier Soccer League side Telone FC are looking at blending experience with new talent as they aim for a top-four finish in the 2025 season.\nThe Wifi boys who finished at 10th in the PSL last season after a dramatic comeback are hoping to maintain their fine form in the 2025 season.\nTelOne FC, who were facing relegation mid-season had to secure the services of then Harare City coach Herbert Maruwa who changed the fortunes of the team following the sacking of Tendai Chikuni.\nThough TelOne FC have not officially availed their new signings for the upcoming season, ZBC News has it on authority that the Wifi Boys are eying the services of former Dynamos captain Frank Makarati, while they have already snapped up former Green Fuel and Ngezi Platinum Stars Midfielder Brunl Mutigo, Manica Diamonds attacking duo of Gerald Bhero and Tawanda Macheke.",
            "time": "20:33",
            "date": "24 Jan 2025"
        },
        {
            "title": "Dynamos bolster squad with two new signings",
            "href": "https://www.zbcnews.co.zw/dynamos-bolster-squad-with-two-new-signings/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nHarare giants, Dynamos are strengthening their squad ahead of the 2025 Premier Soccer League season after signing midfielders Learnmore Muyambo and Tellmore Pio.\nMuyambo, a 27-year-old dynamic midfielder, has signed a two-year deal, joining Dynamos from Green Fuel.\n29-year-old holding midfielder, Pio has also penned a two-year contract with DeMbare after spending the last two seasons with ZPC Kariba.\nThe new signings are expected to bolster Dynamos’ midfield while also adding depth and quality to the team’s lineup.\nMeanwhile, goalkeeper Martin Mapisa has parted ways with Dynamos, after a short stint with the club.",
            "time": "20:33",
            "date": "24 Jan 2025"
        },
        {
            "title": "ZIFA presidential aspirant Temba Mliswa withdraws appeal",
            "href": "https://www.zbcnews.co.zw/zifa-presidential-aspirant-temba-mliswa-withdraws-appeal/",
            "content": "Story by Fungai Jachi\nDisqualified ZIFA presidential aspirant Temba Mliswa has withdrawn his application to stop elections set for this Saturday.\nMliswa and the respondents concurred that the application was ill-timed.",
            "time": "20:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "High Court to hear aspiring ZIFA presidential candidate Mliswa’s application",
            "href": "https://www.zbcnews.co.zw/high-court-to-hear-aspiring-zifa-presidential-candidate-mliswas-application/",
            "content": "\nStory by Fungai Jachi\nTHE High Court is set to hear an application made by aspiring ZIFA presidential candidate Temba Mliswa this Tuesday.\nMliswa is among the five candidates who were disqualified by the ZIFA Electoral Committee after falling short of the association’s eligibility criteria.",
            "time": "20:34",
            "date": "24 Jan 2025"
        }
    ]
}