{
    "news": [
        {
            "title": "Thousands join 2025 Ezekiel Guti Walkathon to champion fitness and fight drug abuse among youth",
            "href": "https://www.zbcnews.co.zw/thousands-join-2025-ezekiel-guti-walkathon-to-champion-fitness-and-fight-drug-abuse-among-youth/",
            "content": "Story by Raynald Ngwarati\nTHE 2025 edition of the Ezekiel Guti Walkathon has been hailed as a platform that fosters healthy living habits in Christian youth while fighting drug and substance abuse.\nNow in its second installment, the Ezekiel Guti Walkathon which attracted close to 2 000 participants at the Grange Christian School in Harare this Saturday continues to preach the importance of fitness and exercise.\nPremised on the life of the late centenarian, Dr Ezekiel Guti, the marathon is designed to foster a sporty culture that is key to a longer lifespan.\nSpeaking to the media at the event, the organisers were pleased with the number of youths who participated in the walkathon, highlighting its role in shaping holistic believers.\n“As part of celebrating his legacy, we follow his pattern. The church has adopted the programme of the Walkathon to celebrate the lifestyle, and we take Baba Guti as our role model. It is also important for the youth as it keeps them busy from drugs, substance abuse and cyberbullying,” ZAOGA FIF’s Presiding Bishop Dr Joseph Guti said.\n“The youth have come in their numbers to partake in activities that prolong their lives. These are initiatives the youth must value and adopt to emulate the century that Baba was alive for,” Professor Euna Guti added.",
            "time": "06:32",
            "date": "04 May 2025"
        },
        {
            "title": "Sable, Zambia, Botswana brace for Battle of Zambezi showdown",
            "href": "https://www.zbcnews.co.zw/sable-zambia-botswana-brace-for-battle-of-zambezi-showdown/",
            "content": "Story by Raynald Ngwarati\nALL is set for the epic Battle of Zambezi as the Zimbabwe senior men’s rugby team, the Sables clash with their Zambian counterparts at Harare Sports Club this Sunday.\nAs the reigning African champions, the Sables prepare for their title defence in the Rugby Africa Cup slated for Uganda, they face regional foes, Zambia in a blockbuster Test match set for Harare Sports Club.\nWith the match set to mark the team’s return to action, the Sables have a tough task on their home turf as they entertain their competitive neighbours to renew an iconic rivalry dubbed the Battle of the Zambezi.\nNicknamed the Siamese twins, the two countries who share many things in common including relations that span beyond the Federation of Rhodesia and Nyasaland, continue to be evenly tied on the pitch, playing out to close matches every time they have battled against each other on the rugby pitch.\nThis Sunday will serve another thrilling instalment of the battle, with the home team opting for local stars, granting caps to former U20 starlets Benoni Nhekairo and Dion Khumalo who make up the 40-men squad named to participate in the raging affair.\nKhumalo has been entrusted with leadership duties, after being named one of the vice captains.\nThe two teams always dish out edge-of-the-seat blockbusters with the Sables boasting of a better head-to-head record in the Battle.",
            "time": "06:32",
            "date": "04 May 2025"
        },
        {
            "title": "UEFA Champions League Trophy Tour reaches Victoria Falls with Schweinsteiger",
            "href": "https://www.zbcnews.co.zw/uefa-champions-league-trophy-tour-reaches-victoria-falls-with-schweinsteiger/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Union of European Football Associations (UEFA) Champions League Trophy Tour has arrived in Victoria Falls, accompanied by legendary former Bayern Munich midfielder Bastian Schweinsteiger.",
            "time": "06:32",
            "date": "04 May 2025"
        },
        {
            "title": "Zimbabwe through to the final of the IHF Zone Six",
            "href": "https://www.zbcnews.co.zw/zimbabwe-through-to-the-final-of-the-ihf-zone-six/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE Under-18 girls’ handball team has qualified for the final of the International Handball Federation (IHF) Zone Six Trophy after a thrilling 33–27 victory over neighbours South Africa at the Chitungwiza Aquatic Complex on Friday.\nIn a tightly contested match, the Zimbabwean side displayed remarkable composure and tactical discipline to overcome a formidable South African team.\nThe hosts made a commanding start, surging into an early lead and maintaining control throughout the match. Despite late pressure and signs of nervousness in the closing minutes, Zimbabwe’s girls held firm to seal their place in the final.",
            "time": "06:32",
            "date": "04 May 2025"
        },
        {
            "title": "Platinum Royals target fourth consecutive win as they lock horns with Red Buffalos Academy",
            "href": "https://www.zbcnews.co.zw/platinum-royals-target-fourth-consecutive-win-as-they-lock-horns-with-red-buffalos-academy/",
            "content": "Story by Courage Bushe\nPLATINUM Royals are leaving nothing to chance in their quest to win their fourth consecutive game in the Women Premier Soccer League.\nDubbed the David versus Goliath affair this Saturday, Vengere Stadium will be the centre of attraction as in-form Platinum Royals lock horns with Red Buffalos Academy.\nThe Pure Platinum Play Ladies who are having a good start to the season are yet to taste defeat and concede.\n“In the past three games, we have been doing well, and it is boosting our confidence every passing day, and we are hoping for a better outing this Saturday. Everyone is there, no injuries to talk about, and we are raring to go. We know the challenges we will face over the weekend, but we are very prepared for anything. This is a game of football and we want maximum points,” Platinum Royals Assistant Coach, Blessing Govati said.",
            "time": "06:32",
            "date": "04 May 2025"
        }
    ]
}