{
    "news": [
        {
            "title": "Musabvunda half marathon eyes grooming future long-distance athletes",
            "href": "https://www.zbcnews.co.zw/musabvunda-half-marathon-eyes-grooming-future-long-distance-athletes/",
            "content": "Story by Raynald Ngwarati\nPREPARATIONS are in full swing for the third edition of the Musabvunda Half Marathon slated for Blackistone Primary School on May 11, with special emphasis on grooming future long-distance athletes.\nWith an existing gap in the long-distance athletics grooming base, the organisers of the marathon are eyeing to attract younger audiences in order to set the platform for the country’s excellence on the international scene.\nSpeaking to ZBC News at the venue, Musabvunda Chief Executive Officer Kudzai Pasipanodya outlined the initiatives in motion to make this year’s edition bigger and better as well as the future of the marathon.\n“This is our third edition and next year, we are going to make this a full marathon. It will be a qualifier for the Olympics, for Comrades and the Two Oceans. We want to groom the young people so that they can achieve their God-given talents and we try to promote sport through that.”",
            "time": "18:41",
            "date": "04 May 2025"
        },
        {
            "title": "Bournemouth stun Arsenal, Aston Villa improve Champions League",
            "href": "https://www.zbcnews.co.zw/bournemouth-stun-arsenal-aston-villa-improve-champions-league/",
            "content": "BOURNEMOUTH won away at Arsenal for the first time in the Premier League on Saturday, and completed a memorable double to boost their chances of playing in Europe next season, thanks to a second-half fightback en route to a thrilling 2-1 win.\nAston Villa beat Fulham 1-0 to improve their hopes of finishing in the league’s top five and qualifying for the Champions League, while Leicester City defeated fellow relegated side Southampton 2-0 to end their nine-game drought without a goal at King Power Stadium.\nEverton’s emotional farewell to Goodison Park continued with an entertaining 2-2 draw against Ipswich Town as the relegated visitors came from two goals down to rescue a point.\nAt Emirates, Arsenal’s preparations for their huge Champions League second leg against Paris St Germain on Wednesday took a huge blow after Bournemouth’s Evanilson and Dean Huijsen scored in quick succession.\nDeclan Rice gave the Gunners the lead in the 34th minute, rounding goalkeeper Kepa Arrizabalaga and producing an accomplished finish on his 100th Arsenal appearance.\nArsenal had chances to extend their lead, but Dean Huijsen gave Bournemouth a deserved equaliser in the 67th minute before Evanilson bundled home eight minutes later to complete the turnaround.“Massive disappointment,” Gunners captain Martin Odegaard told Sky Sports. “It is too chaotic and too sloppy from us. The second half is not acceptable.\n“It is a massive game on Wednesday, but we have to use today to be ready and beat PSG on Wednesday.”\nBournemouth move up to eighth in the table, which could be enough for European football next season, with 53 points, while Arsenal, who have just two league wins from six games, stay second with 67 points, three points above third-placed Manchester City.\n“First of all we knew that we have never got a point here and that motivated us more. We’re a team that always give our all,” Huijsen told Sky Sports. “It’s a really important three points for us.”\nAt Villa Park, Belgian midfielder Youri Tielemans headed home John McGinn’s 12th-minute corner.",
            "time": "18:41",
            "date": "04 May 2025"
        },
        {
            "title": "Zim’s U-18 girls’ handball team clinch silver at Zone VI Games",
            "href": "https://www.zbcnews.co.zw/zims-u-18-girls-handball-team-clinch-silver-at-zone-vi-games/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Under 18 girl’s handball team settled for silver at the 2025 International Handball Federation Zone VI games after losing 22-30 to Zambia this Saturday.\nThe team narrowly missed out on a ticket to the IHF continental championships after falling prey to neighbours Zambia in an action-packed match played at Chitungwiza’s Aquatic Complex.\nThe hosts who had outclassed South Africa 33-27 on Friday found a tougher task against the Zambians who put on a show to clinch the sole ticket to the Under 18s continental finals.\nPlaying in front of their home crowd, the Zimbabwe Under 18 girls tried every trick in their book to upset the Zambian side, but yet again, they were victims to a recurrence of history.\nPlaying against the ZONE VI powerhouses was expected not to be an easy task for Zimbabwe considering Zambia’s recent dominance across the men and women’s categories, however there was optimism within the camp that odds could be beaten.",
            "time": "18:41",
            "date": "04 May 2025"
        },
        {
            "title": "Thousands join 2025 Ezekiel Guti Walkathon to champion fitness and fight drug abuse among youth",
            "href": "https://www.zbcnews.co.zw/thousands-join-2025-ezekiel-guti-walkathon-to-champion-fitness-and-fight-drug-abuse-among-youth/",
            "content": "Story by Raynald Ngwarati\nTHE 2025 edition of the Ezekiel Guti Walkathon has been hailed as a platform that fosters healthy living habits in Christian youth while fighting drug and substance abuse.\nNow in its second installment, the Ezekiel Guti Walkathon which attracted close to 2 000 participants at the Grange Christian School in Harare this Saturday continues to preach the importance of fitness and exercise.\nPremised on the life of the late centenarian, Dr Ezekiel Guti, the marathon is designed to foster a sporty culture that is key to a longer lifespan.\nSpeaking to the media at the event, the organisers were pleased with the number of youths who participated in the walkathon, highlighting its role in shaping holistic believers.\n“As part of celebrating his legacy, we follow his pattern. The church has adopted the programme of the Walkathon to celebrate the lifestyle, and we take Baba Guti as our role model. It is also important for the youth as it keeps them busy from drugs, substance abuse and cyberbullying,” ZAOGA FIF’s Presiding Bishop Dr Joseph Guti said.\n“The youth have come in their numbers to partake in activities that prolong their lives. These are initiatives the youth must value and adopt to emulate the century that Baba was alive for,” Professor Euna Guti added.",
            "time": "18:41",
            "date": "04 May 2025"
        },
        {
            "title": "Sable, Zambia, Botswana brace for Battle of Zambezi showdown",
            "href": "https://www.zbcnews.co.zw/sable-zambia-botswana-brace-for-battle-of-zambezi-showdown/",
            "content": "Story by Raynald Ngwarati\nALL is set for the epic Battle of Zambezi as the Zimbabwe senior men’s rugby team, the Sables clash with their Zambian counterparts at Harare Sports Club this Sunday.\nAs the reigning African champions, the Sables prepare for their title defence in the Rugby Africa Cup slated for Uganda, they face regional foes, Zambia in a blockbuster Test match set for Harare Sports Club.\nWith the match set to mark the team’s return to action, the Sables have a tough task on their home turf as they entertain their competitive neighbours to renew an iconic rivalry dubbed the Battle of the Zambezi.\nNicknamed the Siamese twins, the two countries who share many things in common including relations that span beyond the Federation of Rhodesia and Nyasaland, continue to be evenly tied on the pitch, playing out to close matches every time they have battled against each other on the rugby pitch.\nThis Sunday will serve another thrilling instalment of the battle, with the home team opting for local stars, granting caps to former U20 starlets Benoni Nhekairo and Dion Khumalo who make up the 40-men squad named to participate in the raging affair.\nKhumalo has been entrusted with leadership duties, after being named one of the vice captains.\nThe two teams always dish out edge-of-the-seat blockbusters with the Sables boasting of a better head-to-head record in the Battle.",
            "time": "18:41",
            "date": "04 May 2025"
        }
    ]
}