{
    "news": [
        {
            "title": "Zim U19 thrash Ireland 4-1 in World Cup preparatory series",
            "href": "https://www.zbcnews.co.zw/zim-u19-thrash-ireland-4-1-in-world-cup-preparatory-series/",
            "content": "Story by Raynald Ngwarati\nTHE Ireland under-19cricket team secured a consolidation win after beating Zimbabwe by four wickets in the final Youth One Day International at Takashinga Cricket ground to end the series four-one .\nAfter playing second fiddle in the first four matches of the Youth One Day International series, the Irish Under 19 men’s cricket team finally found a way to avoid a humiliating series whitewash by the hosts.\nAdam Leckey put in a spirited performance with an unbeaten 91 runs from a hundred deliveries to guide his side to a much-needed consolation win over the home team.\nDespite losing wickets around him, the top order batsman stood firm at the crease to preserve his priced wicket.\nA consolation victory looked in sight for the visitors when Ethan Marshall partnered Leckey with a knock of 41 runs before he was sent packing by Kian Blignaut nine runs short of a half ton.\nOliver Riley then hit two consecutive fours in the 43rd over to propel the Irish to 205 runs for six in 42 overs, a score that was enough to save his side from the face of a humiliating series drubbing.\nEarlier on, Dhruv Patel had starred with the bat for the young Chevrons putting 79 runs on the board as Zimbabwe scored a lowly 203 runs all out in 42.1 overs.\nThe opener found support from Takudzwa Makoni who narrowly missed on a priced half ton by just two runs, how his efforts were not enough to put on a formidable score as six other batsmen failed to reach double figures.",
            "time": "21:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "WPSL secures new US$10k sponsorship",
            "href": "https://www.zbcnews.co.zw/wpsl-secures-new-us10k-sponsorship/",
            "content": "Story by Anashe Murombedzi\nTHE Women’s Premier Soccer League (ZWPSL) has sealed a US$10 000 sponsorship deal, with a local firm Ponera Construction Company.\nThe development comes ahead of the commencement of the 2025 season this weekend.\nThings were not looking good for the Zimbabwe Women’s Premier Soccer League after last season’s sponsor, The Heart Group, did not renew their deal, but just before the commencement of the new season, the league has sealed a new deal with a local firm, Ponera Constitution Company.\nZIFA President, Nqobile Magwizi and WPSL Chairperson, Theresa Maguraushe expressed their gratitude for the new sponsorship, highlighting its potential to elevate the league and promote the development of the sport.\n“This partnership will help us take a significant step forward in promoting women’s football in Zimbabwe, this is the support we need to produce continental and global stars and we are eager to collaborate with others to make it happen,” ZIFA President, Nqobile Magwizi said.\n“We are grateful for the support from Ponera Constitution Company. This sponsorship will enable us to provide a better platform for our teams and players to showcase their talents for growth and development of women’s football in Zimbabwe,” Maguraushe said.\nMeanwhile, the highly anticipated return of the Women’s Premier Soccer League is finally here, with a thrilling season-opening clash between former champions, Black Rhinos Queens and reigning champions Herentals Queens at One Commando Stadium this Saturday.\nThe match promises to be an electrifying encounter, as these two powerhouses of Zimbabwean women’s football collide in a battle for supremacy.\nOther thrilling matches are scheduled for the weekend, including the Bulawayo derby between Mpopoma Sports Academy and Highlanders Royals.",
            "time": "21:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "Defending champs Simba Bhora face off against high-flying Manica Diamonds",
            "href": "https://www.zbcnews.co.zw/defending-champs-simba-bhora-face-off-against-high-flying-manica-diamonds/",
            "content": "Story by Anashe Murombedzi\nDEFENDING champions Simba Bhora are set to face off against Manica Diamonds at Wadzanai Stadium this Saturday in a highly anticipated match in the Castle Lager Premier Soccer League match-day six encounter.\nThe Go Buju Boys are looking to build on their current form, which has seen them accumulate eight points from five matches, with two wins, two draws and one loss.\nSimba Bhora are coming off a hard-fought 1-0 win over TelOne, which has given them a boost of confidence and momentum ahead of the next challenge against Ngoda Boys in a match promising to be an intense and closely fought encounter.\nManica Diamonds, on the other hand, are a strong run which has seen them claiming 10 points from five matches and sitting fourth on the log.\nThey are also riding high after a 1-0 win over Dynamos, which has shown that they are a force to be reckoned with in the league.\nSimba Bhora will be eager to defend their title and prove themselves as one of the top teams in the league, while Manica Diamonds will be looking to upset the defending champions and make a push for the top spot.",
            "time": "21:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "ICC Chairperson arrives in Zim for high-level meetings",
            "href": "https://www.zbcnews.co.zw/icc-chairperson-arrives-in-zim-for-high-level-meetings/",
            "content": "\nStory by Lawrence Trusida, Sports Editor\nTHE International Cricket Council (ICC) Chairperson Jay Shah has arrived in Zimbabwe for a series of ICC meetings beginning this Thursday in Harare.\nZimbabwe is set to host a series of ICC meetings in Harare and Victoria Falls beginning this Thursday.\nApart from the ICC Chairperson, all the leaders of all cricket-playing nations are in Zimbabwe for a series of meetings in the capital, which will culminate in a full board meeting set for Victoria Falls.\n“I am pleased to be in Zimbabwe, we are looking forward to fruitful engagements with Zimbabwe after our ICC meetings. We want Zimbabwe to be back to where it was and producing big talents like the Flower brothers,” Shah said.\nZimbabwe has hosted international events like the World Cup Qualifiers and co-hosted the 2003 World Cup, however, this is the first time the country is hosting the full ICC board meeting since attaining test status in 1992 and Zimbabwe Cricket views this as an endorsement of the country as a safe sporting destination.",
            "time": "21:26",
            "date": "13 Apr 2025"
        },
        {
            "title": "Jere rallies CAPS United ahead of Highlanders clash",
            "href": "https://www.zbcnews.co.zw/jere-rallies-caps-united-ahead-of-highlanders-clash/",
            "content": "Story by Lawrence Trusida, Sports Editor\nCAPS United president, Farai Jere believes his team will rise to the occasion when they face Highlanders in the first edition of the Battle of the Cities slated for Barbourfields Stadium on Sunday.\nThe Battle of the Cities looms with the two main actors Highlanders and CAPS United not at their imperious best.\nMakepekepe are in the bottom three with a mere four points from five matches, Bosso are not much better either as they have six points ahead of the eagerly anticipated match.\nCAPS United go into the match with their back against the wall after a mini-protest by their fans after the defeat to Ngezi Platinum Stars last Sunday, but club president Jere believes their time is now.\n“This is the time when you will see the true CAPS United starting with the Highlanders match, yes we have not started well but we will rise in matches like these and I believe that will spur us onto good things, we have one of the best squads and we are still holding onto our targets,” Jere said.",
            "time": "21:26",
            "date": "13 Apr 2025"
        }
    ]
}