{
    "news": [
        {
            "title": "Rugby development gains ground in Manicaland Province",
            "href": "https://www.zbcnews.co.zw/rugby-development-gains-ground-in-manicaland-province/",
            "content": "Story by Kenias Chivuzhe\nRUGBY continues to grow in Manicaland province following years of disturbances especially due to the COVID-19 pandemic.\nWith Mutare Sports Club having been the only recognised franchise in Manicaland Province before the COVID-19 era, a lot of interest generated during the past few years has widened the growth potential for the sport code which for a long time was considered an elitist sport.\nManicaland Rugby Board Chairperson, Mos Kaphuma spoke on the strides made in the province starting with the launch of the Senior Rugby League for men and women before the introduction of under-20 rugby tournaments last year.\n“Rugby is gradually developing in Manicaland and last year we started under 20 provincial leagues without any sponsorship. We are in our second edition and we managed to get sponsorship covering ambulance, medicals, referees’ fees and price money at the end of the season,” he said.\n“We have been trying to spread our net wide so that we help with the development of the game at the under-20 level. We are hoping to increase the number of teams next year. The senior league is starting on May 17 and it has both men and women. In the under-20 league, we have five boys’ teams and four girls teams. Next year we are targeting to increase the teams to 14, meaning we will have a team in every district in the province.\n“In the senior’s league, we currently have six teams for men and five teams for women. The senior league starts in May and ends in September. The senior league started in 2023 and in a space of few years we managed to grow the clubs from one to nine,” Kapumha said.\nBoth the rugby board and teams have a shared belief in the bright prospects of the sport.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "Ideal View headlines this year’s Castle Tankard",
            "href": "https://www.zbcnews.co.zw/ideal-view-headlines-this-years-castle-tankard/",
            "content": "Story by Lawrence Trusida, Sports Editor\nIDEAL View headlines the pack at this year’s Castle Tankard set to take centre stage on 10 May, after the unveiling of the event held this Tuesday at Borrowdale Park in Harare.\nA total of 16 horses will compete for the US$50 000 prize in the 65th edition of the Castle Tankard after the final acceptance held this Wednesday.\nThe Castle Tankard stands as Africa’s oldest sponsored horse race and is the country’s only Grade One competition run over two thousand metres.\nIdeal View of the Debra Swanson stable is the odds-on favourite for the race, but Bridget Stidolph who produced last year’s winner is looking to shock the park.\n“I have two horses this time, last year we had Waffles, which was on top of her game and the plan worked. This year I do not have the favourites for this race, but we are preparing well enough and my horses this time have no weight and they are now experienced over the distance, so we could surprise one or two people,” Stidolph said.\nStidolph has Wantage, which finished third last year and Citrusdal for this year’s race, which is heavily tipped to go in the direction of Ideal View, while Jaeger Moon, Abayyaan and Majestic Warrior are expected to pose a threat.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "MWOS coach Lloyd Mutasa savours unbeaten start in debut PSL campaign",
            "href": "https://www.zbcnews.co.zw/mwos-coach-lloyd-mutasa-savours-unbeaten-start-in-debut-psl-campaign/",
            "content": "Story by Mthokozisi Dube\nMWOS head coach Lloyd Mutasa is enjoying a new lease of life after setting the pace in their debut Castle Lager Premier Soccer League season after eight rounds of matches.\nA prolific midfielder during his playing days, Samaita, as Lloyd Mutasa is popularly known, was part of the all-conquering Dynamos class of 1998.\nMutasa announced his grand entry to the coaching fray as head coach of Kiglon in 2007.\nThe soft-spoken coach, however, sits on a record of guiding three different teams from the lower leagues to the premiership.\nMutasa led the now defunct pair of Kiglon and Highway before sealing promotion with Green Fuel.\nLast year, the gaffer missed promotion via a boardroom decision before bouncing through a franchise acquisition and has demonstrated that they are a team on a mission.\nAfter eight rounds of matches, the Punters have downed giants in Highlanders and Dynamos and are yet to lose, but Mutasa still believes it is early days.\n“It is nice to be on top of the log as debutants in the league. I would want to believe the recipe for success was our pre-season. Remember, our leaders assisted the technical team in going to Turkey for some lessons, and after that, we had a two-week stint of team building in Victoria Falls. The motivation of playing in the league after coming second after we probably thought we were winners has seen us trying to prove a point that we are champions,” he said.\nThe former Dynamos midfielder who had a unique dress code during his stint at Dynamos has been on the receiving end losing his job at FC Platinum, Dynamos and Green Fuel and believes he has found a perfect home to nurture his coaching skills.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "Four teams battle in para-volleyball selection tourney",
            "href": "https://www.zbcnews.co.zw/four-teams-battle-in-para-volleyball-selection-tourney/",
            "content": "Story by Mthokozisi Dube\nFOUR teams are participating in a two-day sitting volleyball tournament organised by the Zimbabwe Para-Volleyball Association at King George VI School in Bulawayo.\nSitting volleyball is a variation of traditional volleyball for athletes with disabilities, where players compete in a seated position, using both their arms and legs to manoeuvre across the court. The sport employs the same skills and techniques as standing volleyball, with a few key rule adaptations to accommodate seated play.\nThe Zimbabwe Para-Volleyball Association has organised this selection tournament to scout and prepare players to represent the country at an upcoming invitational event in Kenya,\n“It is interesting to have these tournaments. We think by having more of these, our sport is headed somewhere,” a player said.\n“It is my first time to play but I felt at home today,” another player added.\nMidlands Province youth representative for people with disabilities, Honourable Nyashadzashe Shonhe implored other sporting institutions to take a leaf from the association to accommodate people living with disabilities.\n“We are happy to be mingling in this tournament, but we want this initiative to spread to other sporting disciplines,” Honourable Shonhe said.",
            "time": "08:45",
            "date": "01 May 2025"
        },
        {
            "title": "Bulawayo Chiefs on track for PSL return after maintaining winning streak",
            "href": "https://www.zbcnews.co.zw/bulawayo-chiefs-on-track-for-psl-return-after-maintaining-winning-streak/",
            "content": "Story by Mthokozisi Dube\nFORMER Premier Soccer League side, Bulawayo Chiefs are looking for an early return to the top-flight league after maintaining a 100 % winning record in the ZIFA Southern Region Division One league.\nThe Twitter Boys are leaving nothing to chance in their quest to make an imminent return to the top flight.\nAmakhosi have posted three victories in their first three matches, with their latest triumph being a 1-nil victory over Bosso 90 in a city derby.\nAnother former PSL side, Hwange are also within striking distance after thrashing Zebra Revolution to take second spot with seven points.\nLast year’s runners-up Casymn also had a decent start to the season with two victories in three matches after beating new-boys Megawatt 2-nil.\nIn the Central region, former PSL side Sheasham are at the apex with nine points, while money bags Hardrock are second with an inferior goal difference but the same number of points.",
            "time": "08:45",
            "date": "01 May 2025"
        }
    ]
}