{
    "news": [
        {
            "title": "Southern Region athletics explodes into action",
            "href": "https://www.zbcnews.co.zw/southern-region-athletics-explodes-into-action/",
            "content": "Story by Raynald Ngwarati\nTHE 2025 Southern Region Senior Athletics Championships kicked off in Harare this Saturday, bringing together 10 countries for a battle of speed, strength and skill at the University of Zimbabwe main arena.\nUnited by ambition and the dream of qualifying for the 2025 Tokyo World Athletics Championships, Southern Africa’s top athletes are in Harare for regional championships.\nWith over 25 athletes per country, the University of Zimbabwe main arena was a melting pot of talent this Saturday, as sprinters, jumpers and throwers battled for medals on the opening day and potential scholarship opportunities abroad.\n“I’m looking forward to making it to the World Athletics Championships. Just reaching the finals would be a big milestone,\n“It wasn’t my best day, but I learned so much from competing at this level. I’m honored to be part of this event,”\n“We arrived late from Namibia so I wasn’t at my best today, but I’ll give it my all in the 200m tomorrow. The competition is tough, but the track and officials are world-class,” said the athletes\nDeputy Minister of Sport, Arts, Recreation and Culture, Honourable Emelly Jesaya highlighted Zimbabwe’s pride in hosting the event.\n“The Government of Zimbabwe is proud to be hosting the Confederation of African Athletics. With ten countries represented, this demonstrates our commitment to sport, regional integration, and showcasing Zimbabwe’s capabilities on the international stage,” she said.",
            "time": "08:48",
            "date": "27 Jul 2025"
        },
        {
            "title": "Sables reflect on world cup qualification",
            "href": "https://www.zbcnews.co.zw/sables-reflect-on-world-cup-qualification/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe men’s senior rugby team, the Sables’ qualification for the 2027 Rugby World Cup has been described as testament to the power of teamwork, commitment and shared dreams, a model all sport codes in the country have been urged to adopt.\nAfter three decades in the wilderness, the World Cup dream for the Sables appeared to be far-fetched.\nWhile, on paper the odds were against the Sables, especially against Namibia in the Rugby Africa Cup final, the motivation in the Sables camp spoke of champions and indeed it took a new generation of sportspersons to take Zimbabwe’s rugby to new heights.\nCurious about how Sables turned the tables against Namibia first in 2024 and 2025, the ZBC News crew caught up with the Sables captain, Hilton Mudariki.\n“Within our group we did not panic we were never under pressure even when Namibia scored. We just knew that if we tick our boxes we needed to do what we’ve worked on over the past couple of days we would have been fine. Thank goodness it came through at the end,” he said.\nThe last time Zimbabwe participated at the Rugby World Cup was in 1991 and  Mudariki was not yet born.\n“Three decades a lot of us were not born maybe one or two were born then so for us to rewrite the history books is something that we had spoken about as a group. It was part of our goals and we did know that each game was going to be our final in order for your to achieve that goal. So, to be part of that is super special and for us I think that the motivating factor was to create heroes that other Zimbabwean boys can look up to and inspire to be. We haven’t seen a green and white jersey at the world cup in a very long time so we’ve made our little contribution hopefully to inspire a St Johns boy, a PE boy, a Milton boy to want to be a sable when they grow up,” he added.",
            "time": "08:48",
            "date": "27 Jul 2025"
        },
        {
            "title": "Chaminuka suspended without pay as Dynamos struggles continue",
            "href": "https://www.zbcnews.co.zw/chaminuka-suspended-without-pay-as-dynamos-struggles-continue/",
            "content": "Story by ZBC staff reporter\nTroubled Harare giants, Dynamos, have suspended coach Saul Chaminuka for allegedly breaching the employment code of conduct.",
            "time": "08:48",
            "date": "27 Jul 2025"
        },
        {
            "title": "Zimbabwe eyes gold as development archers shine in Namibia",
            "href": "https://www.zbcnews.co.zw/zimbabwe-eyes-gold-as-development-archers-shine-in-namibia/",
            "content": "Story by ZBC staff reporter\nTHE Zimbabwe Archery developmental team has made it into the top three of the World AGA tournament in Namibia, and will fight for a gold medal this Saturday.\nIt was an action-packed day in Namibia this Friday as the Zimbabwe Archery team sought to overcome stiff competition from several countries in pursuit of a better finish at the World AGA tournament.\nAndrew Manning emerged as Zimbabwe’s top archer at the event.",
            "time": "08:48",
            "date": "27 Jul 2025"
        },
        {
            "title": "Mupfurutsa takes PSL Chair role after an election victory",
            "href": "https://www.zbcnews.co.zw/mupfurutsa-takes-psl-chair-role-after-an-election-victory/",
            "content": "Story by ZBC Reporter\nISAIAH Mupfurutsa has been elected Chairperson of the Premier Soccer League following elections held in Harare this Friday.\nThe Simba Bhora Chairperson, Mupfurutsa, got the mandate to oversee the administration of the top-flight league after being elected ahead of Dumisani Sisale of FC Platinum, Leonard Musariri of Ngezi Platinum Stars, and Manica Diamonds’ Masimba Chihowa.\nHighlanders’ Kenneth Mhlophe landed the Vice Chairperson’s post unopposed, while Dynamos’ Moses Maunganidze and Oscah Nduwure of TelOne were elected Emergency Committee members.",
            "time": "08:48",
            "date": "27 Jul 2025"
        }
    ]
}