{
    "news": [
        {
            "title": "The Chevrons struggle as Mulder breaks captaincy record",
            "href": "https://www.zbcnews.co.zw/the-chevrons-struggle-as-mulder-breaks-captaincy-record/",
            "content": "Story by Raynald Ngwarati\nTHE South Africa national men’s cricket team, the Proteas have laid the foundation of a big first-innings score after closing the day on 465 runs for four in the opening day of the second Test match against Zimbabwe at Queens Sports Club in Bulawayo.\nIt was a tough day on the field for Zimbabwe’s Chevrons as the Proteas ran riot, spearheaded by a record-breaking innings from skipper Wiaan Mulder.\nThe South Africans, who lost two wickets early in the first hour after brilliant bowling from Tanaka Chivanga and Wellington Masakadza, masterminded an emphatic comeback to take control on day one.\nJust like in the first match of the series, Chivanga got the early breakthrough for Zimbabwe, claiming the priced wicket of Toby de Zorzi for 10 runs before Masakadza dismissed debutant Lesego Senokwane for three runs, leaving South Africa reeling at 24 for two.\nMulder, however, was determined to turn the tide for his side.\nPromoted to number three on the batting card and handed the captaincy, Mulder anchored the Proteas’ innings and led their fightback from 24 for two to a commanding score by stumps on day one.\nHe built a 184-run third-wicket stand with David Bedingham before unleashing his attacking flair in a 217-run partnership with Lhuan dre Pretorius for the fourth wicket, as South Africa dominated proceedings.\nThe skipper found boundaries with ease, exploiting Zimbabwe’s sloppy fielding end route to a record-breaking innings. He shattered a 57-year-old mark for the most runs scored on his debut as captain.",
            "time": "06:51",
            "date": "07 Jul 2025"
        },
        {
            "title": "Scottland falls as CAPS United  clinchs derby victory",
            "href": "https://www.zbcnews.co.zw/scottland-falls-as-caps-united-clinchs-derby-victory/",
            "content": "Story by Raynald Ngwarati\nHARARE giants, CAPS United, have kept Scottland’s ambitions at bay after beating the ambitious new boys by a solitary goal at Rufaro Stadium this Sunday.\nAfter a lengthy social media battle, Scottland and CAPS United got a chance to settle their scores on the pitch this Sunday at their shared home venue, Rufaro Stadium.\nBattling for derby bragging rights, the home team failed to live up to their nickname Mabviravira, as they were tamed on their turf by CAPS United.\nMakepekepe, who have rediscovered their rhythm, placed faith in their mid-season signings, a move that paid off, as newly signed Congolese forward Chris Mugalu opened his account in the premiership with a goal on his debut start for CAPS United.",
            "time": "06:51",
            "date": "07 Jul 2025"
        },
        {
            "title": "Agama FC strengthens promotion hopes with crucial victory",
            "href": "https://www.zbcnews.co.zw/agama-fc-strengthens-promotion-hopes-with-crucial-victory/",
            "content": "Story by Tapiwa Machemedze\nMOUNT Darwin-based side Agama is making waves in the Northern Region Soccer League Division One, having set a target for promotion into the top-flight league at the end of the season.\nAgama FC edged Oden FC 1–0 at Pfura Stadium this Saturday to retain second position on the league table, where they are tied on 38 points with N’ombeyawora FC.\nThe decisive goal came late in the first half, courtesy of Alec Chiume.\n“At first, the game was tough, but we made adjustments in the second half. We passed well, scored goals, and managed to maintain our lead,” Agama FC Captain, Tinashe Balakasi said.\nAgama coach Paul Chimalizeni, who has been with the team for only nine days, winning three matches in the process, praised his players for staying focused on securing the sole ticket to the Premier Soccer League.\n“As the new coach, I enjoy winning, and I am here to win the championship. Like any other coach, my goal is to win, that is the plain truth,” he said.\nOden FC coach Phillip Tutani, who is Chimalizeni’s predecessor, conceded that Agama was the better team on the day.\n“They played very well, they are a good side. I wish them all the best,” Golden FC Coach Arthur Tutani said.",
            "time": "06:51",
            "date": "07 Jul 2025"
        },
        {
            "title": "Sables eye 2027 World Cup qualification glory",
            "href": "https://www.zbcnews.co.zw/sables-eye-2027-world-cup-qualification-glory/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe senior fifteens rugby team, the Sables, have arrived in Uganda ahead of their Africa Cup title defence in the East African country which kicks off on the 8th of this month.\nThe reigning African champions touched down on Ugandan soil this Saturday, with their sights firmly set on replicating last year’s exploits to earn an automatic qualification ticket to the 2027 Rugby World Cup.\nFacing stiff competition from eight other countries on the continental stage, Zimbabwe will open their campaign against Morocco on July 8and have retained most of the players who won the cup last year.\nSpeaking upon arrival in Uganda, Sables head coach Pieter Benade emphasised the importance of existing player chemistry in securing qualification for the World Cup for the first time since 1991.\n“We are grateful to have the majority of the players from last year. So, we are hoping for continuity, and hopefully, the good memories from last year will keep the spirits high,” he said.\nZimbabwe has qualified for the global stage twice, first in 1987 and then in 1991.\nThe current squad, which broke a 12-year drought by winning the Rugby Africa Cup in 2024, is aiming to end a World Cup qualification jinx that has persisted for over three decades.",
            "time": "06:51",
            "date": "07 Jul 2025"
        },
        {
            "title": "Chevrons seek historic test win against Proteas",
            "href": "https://www.zbcnews.co.zw/chevrons-seek-historic-test-win-against-proteas/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe senior men’s cricket team, the Chevrons, have a daunting task to level the two-match Test series against South Africa when the two nations face off in the second Test match beginning this Sunday at Queens Sports Club in Bulawayo.\nEying a historic win, the Chevrons need to be at their best to defeat the World Test champions in the second and final test match of the bilateral series.\nAfter suffering a 328-run defeat in the first Test, Zimbabwe will need to overcome a bullish South African side that has gone for eleven test matches without tasting defeat since skipper Temba Bavuma took the reins.\nThe Proteas look sharper than ever with an ambitious young squad that is disciplined in all aspects of the game and ready to hunt at any given time.\nThe Chevrons will need to bring their A-game against the world champions if they are to break South Africa’s winning streak in Test Cricket.",
            "time": "06:51",
            "date": "07 Jul 2025"
        }
    ]
}