{
    "news": [
        {
            "title": "Highlanders dismiss Kaindu after underwhelming first half of season",
            "href": "https://www.zbcnews.co.zw/kaindus-second-spell-at-bosso-ends-in-dismissal/",
            "content": "Story by Mthokozisi Dube\nBULAWAYO giants, Highlanders, have fired head coach Kelvin Kaindu after a string of poor results.\nHighlanders have blown hot and cold during the first half of the season, managing ninth position with 23 points.",
            "time": "06:48",
            "date": "24 Jun 2025"
        },
        {
            "title": "Dhlakama leaves Hwange Football Club returns to Green Fuel",
            "href": "https://www.zbcnews.co.zw/dhlakama-leaves-hwange-football-club-returns-to-green-fuel/",
            "content": "Story by Mthokozisi Dube\nCHISUMBANJE – PREMIER Soccer League side Green Fuel has confirmed the reappointment of Rodwell Dhlakama as head coach, marking a dramatic return to the Chisumbanje-based club after a brief stint with Hwange Football Club.\nIn a statement issued on Monday, the club revealed that Dhlakama has been handed the reins with immediate effect.\nHis return sees Taurai Mangwiro, who had been leading the technical team, elevated to the position of Technical Director, while the rest of the coaching staff retains their current roles.",
            "time": "06:48",
            "date": "24 Jun 2025"
        },
        {
            "title": "Defending Champions Simba Bhora prove their credentials for title defence",
            "href": "https://www.zbcnews.co.zw/defending-champions-simba-bhora-prove-their-credentials-for-title-defence/",
            "content": "Story by Anashe Murombedzi\nCASTLE Lager Premier Soccer League defending champions, Simba Bhora, are proving they have the credentials to defend their title after returning to the top of the league table at the weekend.\nA 1-nil win over Yadah, courtesy of a Blessing Moyo 57th-minute free-kick strike, has seen the Shamva-based side move to the top of the PSL log, dislodging MWOS.\nThey have now amassed 10 wins, five draws, and two losses, giving them a total of 35 points.\nSimba Bhora look to have found consistency as the league reaches mid-season, setting their sights on defending their title.\nThe Shamva-based side dethroned MWOS, who suffered their first loss of the season.\nMWOS are now a point behind Simba Bhora and can be a team to worry about as they are also proving to be a force to be reckoned with.\nTelOne is showing up to be in the game, occupying third position with 28 points, while Scottland seals the top four with 27 points.\nNgezi Platinum is fifth with 25 points, followed by the trio of unbeaten FC Platinum, ZPC Kariba, and Herentals, all locked on 24 points each, sealing the top half of the league table.\nHighlanders lead the bottom half with 23 points, followed by Manica Diamonds with 20.",
            "time": "06:48",
            "date": "24 Jun 2025"
        },
        {
            "title": "Tarakinyu triumphs in Beitbridge half marathon as nation rallies behind drug-free society agenda",
            "href": "https://www.zbcnews.co.zw/tarakinyu-triumphs-in-beitbridge-half-marathon-as-nation-rallies-behind-drug-free-society-agenda/",
            "content": "Story by Providence Maraneli\nBEITBRIDGE – VERERAN long-distance runner Moses Tarakinyu emerged victorious at the Run for Hope Half Marathon, an event held in honour of Vice President Colonel (Retired) Kembo Mohadi in Beitbridge this Saturday.\nRepresenting Black Rhinos, Tarakinyu completed the 21-kilometre race in an impressive 1 hour, 7 minutes, and 45 seconds, narrowly fending off competition from his teammate Tatenda Hove, who crossed the finish line one second later.\nJonathan Chinyoka of ZPCS secured third position with a time of 1 hour and 48 seconds.\n“I am delighted to have won this marathon. It forms an important part of my training for upcoming competitions. I’m grateful to the organisers for such opportunities which keep us focused and prepared,” Tarakinyu said.\nThe event attracted participants from across the country, with various categories including people with disabilities, the elderly, youth, and children.\nParticipants described the race as more than just a sporting event, but a powerful message in the fight against drug and substance abuse.\n“This event is a reminder to us as the youth that we must take a stand against drug and substance abuse,” said one participant.\n“We are so thankful to the Vice President for thinking of people with disabilities. I travelled from afar to participate, and I am proud to have come first in my category,” another added.\nThe event forms part of a broader national campaign to promote healthy lifestyles, unity, and social transformation.",
            "time": "06:48",
            "date": "24 Jun 2025"
        },
        {
            "title": "ZPCS’ Commissioner General Goodwill Trust Fund golf tournament tees off in Vic Falls",
            "href": "https://www.zbcnews.co.zw/zpcs-commissioner-general-goodwill-trust-fund-golf-tournament-tees-off-in-vic-falls/",
            "content": "Story by Tichaona Kurewa\nVICTORIA FALLS – THE 2025 Zimbabwe Prisons and Correctional Services (ZPCS) Commissioner General Goodwill Trust Fund Matabeleland North Golf Tournament teed off this Saturday morning at the Elephant Hills Golf Course in Victoria Falls.\nEstablished in 2011, the Trust Fund aims to support the welfare of families of deceased officers as well as other vulnerable members of the community.",
            "time": "06:48",
            "date": "24 Jun 2025"
        }
    ]
}