{
    "news": [
        {
            "title": "Defending champions Simba clash with MWOS at Wadzanayi Stadium",
            "href": "https://www.zbcnews.co.zw/defending-champions-simba-clash-with-mwos-at-wadzanayi-stadium/",
            "content": "Story by Lawrence Trusida, Sports Editor\nDEFENDING Castle Lager Premier Soccer League champions, Simba Bhora are adopting the underdog tag ahead of their top-of-the-table encounter against high-riding MWOS at Wadzanayi Stadium this Saturday.\nNew boys MWOS are undefeated in seven outings, mastering five wins and two draws while the defending champions have quietly gone about their business after wholesome changes in the off-season.\nDespite the shake-up that saw more than 10 players leaving together with then head coach Tonderai Ndiraya, the Shamva-based club are second, three points behind Saturday’s opponents.\nWith all the noise being taken by MWOS, the defending champions are pleased to go into the match as underdogs.\n“Well it is what it is they have started the season strongly and they have been the talk of town together with Scottland and somewhat puts us as underdogs which is exactly a situation which suits us after the transition from last season and it takes pressure away from my boys allowing them to play freely,” Simba Bhora coach, Joel Luphahla said.\nSimba Bhora have made Wadzanayi Stadium a fortress, losing just once since the start of last season and head coach Joel Luphahla is hoping for a continuation of the same.\n“We have started well at home, the only blemish being FC Platinum where we drew barring that we have won all and we hope to keep the same, I have been telling my boys that the match is just like any other home match and we need to approach it the same way and remember that our supporters will be behind us,” Luphahla said.\nThe Shamva-based side has a clean bill of health, save for midfielder Liberty Chakoroma who has a long-term injury.\nPSL action, however, starts this Friday with Herentals hosting Green Fuel at Rufaro Stadium.",
            "time": "06:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "Arsenal lacked ‘energy’ in Palace draw as Liverpool prepare to seal title",
            "href": "https://www.zbcnews.co.zw/arsenal-lacked-energy-in-palace-draw-as-liverpool-prepare-to-seal-title/",
            "content": "MIKEL Arteta admitted Arsenal have to get their “energy” back for the Champions League showdown with Paris Saint-Germain after a lacklustre 2-2 draw against Crystal Palace left Liverpool on the brink of winning the Premier League.\nArteta’s sidewere hopingto warm up for their first Champions League semi-final appearance since 2009 with a victory over Palace at the Emirates Stadium on Wednesday.\nBut Jakub Kiwior’s third-minute header for the Gunners was cancelled out by Eberechi Eze’s volley in the 27th minute.\nLeandro Trossard’s strike put Arsenal back in front three minutes before half-time, only for Palace substitute Jean-Philippe Mateta to loft a brilliant lob over out-of-position keeper David Raya in the 83rd minute.\nSecond-placed Arsenal are 12 points adrift of Liverpool, and with only four matches left for the north Londoners, Arne Slot’s team will seal the title if they avoid defeat against Tottenham at Anfield on Sunday.\nTheir title hopes effectively over several weeks ago, Arsenal were already focused on winning the Champions League for the first time.\nBut the sloppy display against Palace was hardly ideal preparation for the showdown with French champions PSG, who have eliminated Liverpool and Aston Villa en route to the last four.\n“We are disappointed with the result and performance. We didn’t find enoughconsistency in actionsto dominate the game,” Arteta said.\n“In many aspects, we should have done better. Palace were very organised and deserved credit but we dropped our standards.\n“We struggled to find consistency. We gave the ball away in simple ways and we were late in everything we did. We have to do much better.”\nAdding to Arteta’s concerns is an injury to Mikel Merino that gave the Spaniard out of the Palace game and could sideline him against PSG.",
            "time": "06:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "Thabani Gonye and Ringisai Mapondera vying for ZOC presidency",
            "href": "https://www.zbcnews.co.zw/thabani-gonye-and-ringisai-mapondera-vying-for-zoc-presidency/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE Olympic Committee (ZOC) is set to hold its elective Congress this Sunday, with two candidates, incumbent Thabani Gonye and seasoned administrator, Ringisai Mapondera vying for the presidency.\nThe elections will take centre stage as all the board positions are up for grabs, save for the Treasurer where Mxolisi Ndlovu is unopposed.\nIncumbent Thabani Gonye and current Head of compliance Ringisai Mapondera will go head-to-head for the presidency.\nA legal practitioner, Mapondera, who led Zimbabwe as Chef de Mission believes it is time to reignite Zimbabwe’s Olympic dream and is convinced he has the blueprint to tap into sport-tourism synergies to fund Olympic participation as athletes have struggled for funding.\n“We can learn from others and try to apply the same to reignite the Olympic movement in Zimbabwe. We always struggled as an organisation to get sponsorship just to fund Olympic participation, but what I saw were eye-opening approaches primarily around tourism.\n“You create synergies and I intend to pursue more engagement with the tourism sector. We have a lot of national parks, breathtaking scenery and that can be showcased through the Olympics. The world is watching, and that’s a major advertising opportunity,” Mapondera said.\nMapondera served just one term on the ZOC board and before that he also led the Zimbabwe Volleyball Association for a single term.\nSeven candidates are vying for the two vice-president positions including former ZIFA Spokesperson Xolisani Gwesela, media practitioner Merit Munzwembiri and volleyball administrator Fredrick Ndlovu.",
            "time": "06:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "Bulawayo Chiefs welcome back Thulani Sibanda as new CEO",
            "href": "https://www.zbcnews.co.zw/bulawayo-chiefs-welcome-back-thulani-sibanda-as-new-ceo/",
            "content": "Story by Story by Mthokozisi Dube\nSOUTHERN Region Division One side, Bulawayo chiefs have roped in Thulani Sibanda as their new Chief Executive Officer.",
            "time": "06:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "Football academies key in identifying and nurturing young talent",
            "href": "https://www.zbcnews.co.zw/football-academies-key-in-identifying-and-nurturing-young-talent/",
            "content": "Story by Gay Matambo\nA new football academy has been established in Chiredzi as part of initiatives meant to identify and nurture young talent while providing a platform for them to develop skills.\nFollowing the establishment of the Lowveld Football Academy, close to 100 budding players are being nurtured.\nThe youngsters are acquiring technical skills, tactics and physical conditioning, building a solid foundation for future use.\n“This academy is good for us because, as a young lady, my dream is to take football as a full-time career when I grow up. Well, such initiatives distance thoughts of getting married early amongst us young girls and we appreciate that,” a female footballer said.\n“I am 17 years old and being part of this academy as youths ensures that we do not have time for drug abuse and we are working on pursuing our dreams of playing for big teams in Zimbabwe. At the age of 23, my goal is to be an international footballer by then,” an aspirating footballer said\n“I came back from South Africa where I was doing menial jobs there following the establishment of this academy in my home area. This is helping us a lot, and it will give us the exposure we need,” a football player said.",
            "time": "06:42",
            "date": "25 Apr 2025"
        }
    ]
}