{
    "news": [
        {
            "title": "Mashaya honoured in Poland",
            "href": "https://www.zbcnews.co.zw/mashaya-honoured-in-poland/",
            "content": "Story by ZBC Reporter\nAcclaimed Zimbabwean martial artist Wilfred ‘Zim Ninja’ Mashaya has received special recognition at the International Budo Bushi Hall of Fame in Poland for promoting martial arts in Zimbabwe and globally.\nMashaya received the award this Saturday in Lacko, Poland, at an event was organised by International Martial Arts Association and International Self Defense Association through its president, Grand Master Stanislaw Majchrzak.Literally, Budo Bushi means Martial Arts Warrior and the accolade comes as Mashaya continues to gain International recognition from various countries each year as a sports ambassador for putting Zimbabwe on the global map through his talent.\nThe Inductees were considered after having made a significant contribution to the martial arts way (bushido), for being disciplined, possessing good character that represents a strong role model, qualities admired by the society so as to set an example for others.\nThe award also means that one would have shown exceptional qualities such as sincerity, loyalty, respect, dedication, commitment, mastery, hard work, bravery as well as serving others with love and kindness until death. Above all, the achievements one amassed in Budo (Martial Arts) also give weight to the recognition and honor.On top of those qualities, Shihan Mashaya received a Ninja Warrior Award for being the first certified Ninja from Zimbabwe and the hard work he is doing in promoting the style in his country. He was presented with the 6th Dan certificate in Kobudo in front of Grand Masters from around the World.\nThis comes as testimony of the impact he has made in the weaponry martial arts in Zimbabwe, Africa and the world over. Mashaya defied all odds by pioneering the sport in Zimbabwe years back, hence the international community considers it as contributing to the growth of martial arts. It is also a great milestone as he went on to become one of the top Kobudo practitioners to ever come from Africa.\nMashaya is arguably the best notable and most decorated Kobudo World Champion from Africa. He was presented with The Shihan Self Defense Certificate and Security Self Defense Award for the great job he is doing in Zimbabwe in training the general public and also the security personnel in self defence. He was also honoured with the World Nunchaku Champion Belt, Samurai Award Trophy, Samurai Award Belt, Golden Colour Nunchaku, medals of honour and Order of the Dragon Special Award.\nZim Ninja was honoured in front of notable guests who are Grand Master Bernd Hohle who is an actor, Multiple World Champion and Guinness World Book record holder, Professor Dr Tadeusz Ambrozy, Dr Wieslaw Bigos, as well as World Record Champion and actor GM Thomas Teige, among others.\nGrand Master Majchrzak together with the above mentioned esteemed guests presented the various awards to Shihan Mashaya.Representing Zimbabwe, Zim Ninja was honoured together with other inductees from countries such as Romania, Israel, India, Slovakia, UK, Poland, Nepal, Turkey, Montenegro, Portugal, Ukraine, Germany, Greece, Egypt, Czechia, Indonesia, Switzerland, United States of America and Belgium, among others.\nThis year, Shihan Mashaya is aiming to take a team of 10 or more martial arts students to world championships. He has invested in the junior policy and also in grooming women to promote gender equality in the sport.",
            "time": "06:32",
            "date": "20 Jan 2025"
        },
        {
            "title": "Medvedev heavily fined for Australian Open behaviour",
            "href": "https://www.zbcnews.co.zw/medvedev-heavily-fined-for-australian-open-behaviour/",
            "content": "BBCNEWS – Daniil Medvedev has been fined over £60,000 for unsportsmanlike conduct following his behaviour at the Australian Open.\nThe Russian fifth seed destroyed a net camera by furiously smashing his racquet into it during a five-set first-round win against world number 418 Kasidit Samrej.\nHe then incurred a point penalty during his second-round defeat by American teenager Learner Tien after throwing his racquet, before failing to attend a mandatory post-match news conference.\nMedvedev collected 200,000 Australian dollars (£102,000) for reaching the second round at Melbourne Park.",
            "time": "06:32",
            "date": "20 Jan 2025"
        },
        {
            "title": "Pitbulls thump Steelers in Paramount Garments U20 Rugby League opener",
            "href": "https://www.zbcnews.co.zw/pitbulls-thump-steelers-in-paramount-garments-u20-rugby-league-opener/",
            "content": "Story by Raynald Ngwarati\nDefending Paramount Garments U20 Rugby League Champions Pitbulls have kicked off their title defence in style after thumping the Zambezi Steelers 45-10 at Old Georgians Sports Club this Saturday.\nWith the tussles on the field of play, the lively crowd got a chance to enjoy beautiful grassroots rugby, as traditional powerhouses Pitbulls picked up from last year’s tempo as they eye retaining their crown.Pitbulls were shaky in the first period, as the Zambezi Steelers went toe to toe with them in the headline match of the season opener, much to the delight of revelers who thronged the Sports Club in their numbers.\nSables player Edmore Sigauke told the ZBC News, “It’s enjoyable to see the rugby Community back together, but obviously it’s a bit hard now being outside. Just as much game time as possible is always good leading up even to the boss trophy. So, all the boys out here as you would know, they’re working towards playing for the national team this year. So I think the preparation comes in playing as much as you can going out there on the field for extras for, you know, your practice session.”",
            "time": "06:32",
            "date": "20 Jan 2025"
        },
        {
            "title": "Frankfurt beat Dortmund in Bundesliga, Marmoush to leave for Manchester City",
            "href": "https://www.zbcnews.co.zw/frankfurt-beat-dortmund-in-bundesliga-marmoush-to-leave-for-manchester-city/",
            "content": "CGTN – Eintracht Frankfurt made it three wins on the bounce after inflicting a third successive defeat on Borussia Dortmund in the German Bundesliga, 2-0, on Friday.\nThe Eagles started brightly, and should have opened the scoring two minutes into the game after a moment of madness from Dortmund goalkeeper Gregor Kobel, but Hugo Larsson couldn’t seize the opportunity from 11 meters out.\nDortmund almost broke the deadlock seven minutes later, but Serhou Guirassy’s close-range header hit the woodwork at the far post.\nThe opening goal came at the other end of the pitch in the 18th minute, when Rasmus Kristensen raced down the right wing and rolled across, before Hugo Ekitike tapped in from a central position.\nAfter the restart, Frankfurt stopped attacking and handed control to the visitors, who lacked enough ideas to create any meaningful chances in the second half.\nThe home side were not done scoring, however, and put the result beyond doubt in the closing stages, when Can Uzun dispossessed Emre Can before setting up Oscar Hojlund, who kept his cool in front of Kobel to make it two in stoppage time.",
            "time": "06:32",
            "date": "20 Jan 2025"
        },
        {
            "title": "Haaland signs new 10-year contract with Manchester City through 2034",
            "href": "https://www.zbcnews.co.zw/haaland-signs-new-10-year-contract-with-manchester-city-through-2034/",
            "content": "CGTN – Erling Haaland has signed a 10-year contract extension with Manchester City that will keep him at the club until 2034, the Premier League side said on Friday, as the Norwegian striker seeks the opportunity to build a legacy with the English champions.\nHaaland’s contract was set to expire in June 2027 but the 24-year-old, winner of the league’s Golden Boot for most goals scored in each of the last two seasons, has now committed to the club until the age of 34.\nThe Norwegian, who was signed from Borussia Dortmund in 2022, has netted 111 goals in 126 matches for Man City, winning a Premier League, FA Cup and Champions League treble in his debut season under manager Pep Guardiola.\n“I am super proud and happy, and I am looking forward to staying here for a long time,” Haaland said in a statement, describing it as “an easy decision.”\n“Now I can fully focus on getting better because I am going to stay here for such a long time,” he added.\nHaaland broke records in his first season in England, scoring 36 goals in his debut Premier League campaign and 52 in all competitions.\nHe tallied 27 league goals last season as Manchester City won a fourth consecutive Premier League title, and he has bagged 16 so far this season.\nWith 79 league goals in just 87 appearances, Haaland is well positioned to challenge Alan Shearer’s mark of 260 Premier League goals – a record that has stood since the England striker retired in 2006.\nThe hearing into Man City’s alleged breaches of Premier League rules has also not deterred Haaland from signing a new deal.",
            "time": "06:32",
            "date": "20 Jan 2025"
        }
    ]
}