{
    "news": [
        {
            "title": "Defending champions Simba Bhora secure second win",
            "href": "https://www.zbcnews.co.zw/defending-champions-simba-bhora-secure-second-win/",
            "content": "Story by Raynald Ngwarati\nDEFENDING Castle Lager Premier Soccer League champions, Simba Bhora have picked up their second win of the season after edging TelOne by a goal to nil at Wadzanayi Stadium this Saturday.\nThe reigning champions are proving that they will not be pushovers this campaign, despite a slow start which saw them scoring a single goal in four matches.\nFacing off with a TelOne outfit that has barely let anything loose after four games, the Joel Luphahla coached outfit showed their determination and hunger outwitting the Wi-Fi boys by a single goal to nill.\nDespite falling to Dynamos last week, the defending champions are proving that Wadzanayi is indeed a fortress after picking up seven points so far from a possible nine and are yet to concede in Shamva.\nIn another interesting encounter, Dynamos suffered their first defeat of the season, choking on their trip to Mutare.\nDonald Teguru was the hitman responsible for the fall of the Glamour Boys in the 18th minute, giving Manica Diamonds three points and dine in glory at their arena, Sakubva Stadium.\nWhile, TelOne slumped, Lloyd Mutasa’s MWOS capitalised on the loss to ascend to the apex of the league by beating ZPC Kariba by a single goal.\nAmbitious side, Scottland FC were the biggest winners on the day, pummelling Bikita Minerals by three-goals to nil to move back into the top three.\nYadah found the going tough in Chisumbanje as they lost to Green Fuel by a single goal.\nIn the Midlands derby at Bata Stadium, Kwekwe United shared the spoils with FC Platinum after playing out to a goalless draw.",
            "time": "08:42",
            "date": "06 Apr 2025"
        },
        {
            "title": "Zim U23 Baseball team in camp ahead of Regional qualifiers",
            "href": "https://www.zbcnews.co.zw/zim-u23-baseball-team-in-camp-ahead-of-regional-qualifiers/",
            "content": "Story by Raynald Ngwarati\nTHE Zimbabwe Under-23 Baseball Team has entered camp as it intensifies preparations for the World Baseball and Softball Confederation (WBSC) Regional Qualifier, scheduled for May at a yet-to-be-confirmed venue.\nThe national side has initiated training as it sets its sights on progressing to the African Championships, a crucial step that will also serve as the final qualifier for the Baseball World Cup.\nDespite the players’ enthusiasm and commitment, officials have raised concerns over Zimbabwe’s poor baseball infrastructure, which they fear may affect the team’s chances of qualifying.\nThe team is set to face stiff competition from regional powerhouses such as South Africa and Zambia, but morale remains high.\n“This is my first qualification tournament and as team Zimbabwe, we are very excited. We are preparing well, and I believe we have a real chance to qualify,” player Clayton Mpofu said.\n“This is our second camp. We have been doing team-building exercises, yesterday we had a game night as a team. We are growing stronger both on and off the field, and that is helping us become one mentally and spiritually united team,” another player, Panashe Kuwanda said.\nWhile preparations on the pitch are taking shape, the spotlight has shifted to the urgent need to upgrade baseball facilities in the country. The lack of proper infrastructure is viewed as a serious impediment to the team’s ambitions.\n“This is my first-year qualification tournament. And as Zimbabwe, it is a very, very good tournament, and we are very well preparing, and we are preparing very, very good, and I am hoping that we are going to qualify,” player, Clayton Mpofu said.\n“This is our second Camp, and we have been doing team building practices. Yesterday we went out for a game night as a team and played. We are also building as a team off the field as well as building it in the ground which is helping us to form one team that is fit mentally and spiritually,” another player, Panashe Kuwanda said.\nWhile, it is shaping up on the field of play, the need to spruce up baseball facilities in the country has come under the spotlight, posing a threat to the qualification campaign.",
            "time": "08:42",
            "date": "06 Apr 2025"
        },
        {
            "title": "Triangle United eye first win at renovated Gibbo",
            "href": "https://www.zbcnews.co.zw/triangle-united-eye-first-win-at-renovated-gibbo/",
            "content": "Story by Gay Matambo\nSTRUGGLING Triangle United are banking on home advantage comfort as they seek a change of fortunes when they host Highlanders at Gibbo Stadium this Sunday in a Premier Soccer League encounter.\nThe Sugar Sugar boys started the season at a very slow pace after failing to win any match so far this season.\nTheir problems have been compounded by playing away from home as Gibbo Stadium was undergoing renovations.",
            "time": "08:42",
            "date": "06 Apr 2025"
        },
        {
            "title": "Ngezi Platinum seek to extend lead against struggling CAPS United",
            "href": "https://www.zbcnews.co.zw/ngezi-platinum-seek-to-extend-lead-against-struggling-caps-united/",
            "content": "Story by Mthokozisi Dube\nHARARE giants, CAPS United are hoping to raise the bar when they clash with former champions and current log leaders, Ngezi Platinum at Rufaro stadium this Sunday.\nThe Green Machine are 14th on the log with four points from four matches, with one of the two defeats this season being inflicted by TelOne at Bata Stadium in Gweru.\nMadamburo are oozing with confidence, enjoying a purple patch which saw them collect maximum points over Triangle in their last outing to occupy pole position.\nThe two sides are separated by six points and CAPS United Assistant Coach, Tonderai Marime says Sunday’s blockbuster game is a must-win for the Harare giants to restore lost pride.\n“After the weekend’s game, we sat and had an analysis of how we have played so far from the beginning of the season up to now. What we concluded was that we feel we are punching below our weight and of course, we are disappointed after the weekend’s result. The result is not a true reflection of the game.\n“I think we gave it our all. We got into very good positions to score and we did everything and the result does not match the performance of the team but this is CAPS United, expectations are always to perform and we are all aware of that,” Marime said.\nOnce touted as the Cup Kings in the past, Harare giants, CAPS United have travelled the success path under different coaches with their most decorated campaign coming under Charles Mhlauri in 2004 they won the league with just one loss.\nLloyd Chitembwe also wrote the success story with the team in 2016 but he has had a fair share of challenging campaigns later on.\nMeanwhile, match-day five fixtures begin this Saturday with Manica Diamonds hosting Dynamos at Sakubva, while Chicken Inn will be hunting for a first win in a home clash with Herentals.",
            "time": "08:42",
            "date": "06 Apr 2025"
        },
        {
            "title": "National Chess Championship set for the second week of April",
            "href": "https://www.zbcnews.co.zw/national-chess-championship-set-for-the-second-week-of-april/",
            "content": "Story by Lawrence Trusida, Sports Editor\nDEFENDING women’s champion, Christine Makwena is excited about the return of the CBZ National Chess championship after the principal sponsors committed for another year.\nThe CBZ National Chess championship is the pinnacle of all tournaments in the country where all the top players will showcase their craft and it is also a selection platform for the national team.\nIt is set for Harare from April 7 to 12.\n“I am excited that everything is confirmed and we also have big companies coming on board to support our sport, I want to defend my title I have been preparing well and I hope I will be on top of my game,” Makwena said.\nShe had a stellar 2024 season winning both the national and the Easter Open titles.\nMeanwhile, the sponsors are delighted to be helping athletes achieve their dreams.\n“We are happy to be doing our part as a corporate, Chess is a sport of the mind and we want healthy minds in the country and we also want to help these players to achieve their dreams,” CBZ Group Marketing Officer, Matilda Nyathi said.",
            "time": "08:42",
            "date": "06 Apr 2025"
        }
    ]
}