{
    "news": [
        {
            "title": "FC Platinum boosts squad ahead of new season",
            "href": "https://www.zbcnews.co.zw/fc-platinum-boosts-squad-ahead-of-new-season/",
            "content": "Story by Courage Bushe\nFORMER Premier Soccer League Champions, FC Platinum, have declared their readiness to wrestle back the league trophy after finalising their squad for the upcoming season.\nPure Platinum Play have failed to win any major trophy since sealing their fourth consecutive league trophy in 2022, a year they also won the Castle Challenge Cup.\nAfter finishing second last season, FC Platinum feels they now have the pedigree to gun for the ultimate prize in the domestic game after the unveiling of seven new players, two technical team members and a new sponsorship deal.\n“We have seen some positive changes in the last two seasons, and, we are optimistic that this sponsorship and new additions will add value to our squad. This year, we are leaving no stone unturned in our quest to win the championship and make an impact in the champions league,” FC Platinum chairperson, Dumisani Sisale said.\nFC Platinum struggled for goals last season, but they hope the new Malawian duo, striker Nickson Nyasulu and attacking forward Vincent Nyangulu will be the tonic they need.\nAt the back, they leaked goals and have added defender Precious Phiri from Nyasa Big Bullets of Malawi, Thubelihle Jubane from Sheasham FC and Cory Black from Blanket Mine.\nMidfielder James Nguluve has also joined from Green Fuel FC and forward Claivert Tshuma from relegated Hwange.",
            "time": "06:09",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mbappe can reach Ronaldo’s level, Ancelotti says",
            "href": "https://www.zbcnews.co.zw/mbappe-can-reach-ronaldos-level-ancelotti-says/",
            "content": "Real Madrid manager Carlo Ancelotti heaped praise on his striker Kylian Mbappe after he scored a hat-trick in a 3-1 win over Manchester City on Wednesday that took the Champions League holders into the last 16.\nAncelotti said Mbappe had the potential to reach the same level as club great Cristiano Ronaldo, who is Real’s all-time leading scorer with 451 goals in 438 games for the 15-times Champions League winners.\n“He has the quality to reach his numbers, but he has to work, because Cristiano set the bar very high, but he is so excited to play here, he can reach Cristiano’s level,” Ancelotti told a press conference.\n“Everyone was waiting for this hat-trick from him and it has finally arrived. But Mbappe is not the only one, we have many players who make a difference. And they make a difference with their collective work above their individual quality which is remarkable.”\nMbappe, who scored 256 goals in 308 appearances over six years at Paris St Germain, said he did not care about being the top scorer if it did not lead to silverware.\n“I was the Champions League’s top scorer last year, but did I win it? No,” Mbappe told reporters.\n“I don’t care about being the leading scorer, in my career, I have scored many goals. If with these goals we win titles I will sign with my blood. If I can score 50, all the better, but all I want is to win titles,” he added.\nNEXT OPPONENTSAncelotti lamented that his side had to go through the pain of the knockout round but said that they were to blame after a slow start to the campaign that caused them to finish outside the top eight in the league standings.\nThe holders will face Bayer Leverkusen or city rivals Atletico Madrid, depending on Friday’s draw, as they seek a record-extending 16th title.\n“It’s not positive at all having to go through the knock-out because we had to play 10 games to get to the last 16,” Ancelotti said.",
            "time": "06:09",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mighty Warriors gear up for crunch tie against Angola",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-gear-up-for-crunch-tie-against-angola/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nThe Zimbabwe senior women’s football team, the Mighty Warriors are set to face hosts Angola in the first leg of the 2026 CAF Women’s Africa Cup of Nations Qualifier this Thursday.\nThe team has been fine-tuning their skills having held a two-day training session in the Angolan capital, Luanda.\nThe Mighty Warriors will be looking to get past the hosts they have had difficulties overcoming after so many close battles.\nIn a rallying cry to the nation, Australia-based Mighty Warriors striker Yolanda Kanyai has rallied fans to come out in numbers and support the team as they take on Angola.",
            "time": "06:09",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mighty Warriors begin training ahead of Angola clash",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-begin-training-ahead-of-angola-clash/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nThe Zimbabwe senior women’s football team, the Mighty Warriors, who are now in Angola, ahead of their Thursday CAF Women’s Africa Cup of Nations 2026 Qualifier against the hosts, began their two-day training this Tuesday.\nThe team, which departed Harare this Monday, began their two-day training session in the Angolan capital this Tuesday, fine-tuning their skills and strategies ahead of the crucial encounter set for Thursday.\nThe squad has been bolstered by the arrival of Australia-based forward Yolanda Kanyai, Israeli-based and Mighty Warriors captain Emmaculate Msipa and midfielder Danai Bhobho.\nA win against Angola on Thursday at the Estadio Joaquim Dinis will see the Mighty Warriors advance to the second round of the qualifiers, where they will face the winner between Malawi and Congo.",
            "time": "06:09",
            "date": "21 Feb 2025"
        },
        {
            "title": "Triangle United gear up for 2025 PSL season",
            "href": "https://www.zbcnews.co.zw/triangle-united-gear-up-for-2025-psl-season/",
            "content": "Story by Gay Matambo\nPremier Soccer League returnees Triangle United are not leaving anything to chance in preparation for the 2025 season after acquiring the services of 12 new players.\nWith two weeks left before the Premier Soccer League commences, the Sugar Sugar Boys are busy fine-tuning their squad and infrastructure to gain a competitive edge in the upcoming season.\nThe club retained 18 players from the team that took them to the topflight league and acquired 12 new players to beef up the squad.\nTriangle United Football Club chairman Mr Weston Jemwa said, “We have retained the services of our technical team being led by Luke Masomere. He will be our head coach for this season. We have also retained 18 players from our previous team that took us into the premier league, and we are busy beefing up with 12 players from other teams. We are doing friendly matches with several teams, and so far, we have played in Beitbridge where we managed to score 5 goals and won the two matches.\n“We also had practice matches vs Green Fuel and Manica Diamonds, and we won both matches. We are not excited about winning, but we are excited that we are scoring goals. Match day 1, we are facing Scottland and that’s the game of the week. With respect to Gibbo, renovations are underway to meet the required standards. We are looking at dressing rooms, ablution blocks, and bucket seats so that we meet the required standards. We should be able to play home games at Gibbo this coming season.”",
            "time": "06:09",
            "date": "21 Feb 2025"
        }
    ]
}