{
    "news": [
        {
            "title": "JADEL China clinch U13 Invitational Football tournament",
            "href": "https://www.zbcnews.co.zw/jadel-china-clinch-u13-invitational-football-tournament/",
            "content": "Story by Raynald Ngwarati\nJADEL China have been crowned the winners of the JADEL U13 Invitational Football Tournament after beating Scottland Academy two-nil at Belgravia Sports Club this weekend.\nUnder 13 footballers this Saturday had a chance to showcase their skills in front of top scouts as the JADEL U13 Football Tournament took centre stage at Belgravia Sports Club in Harare.\nThe invitational tournament eyed to spread the wings of the grassroots football development project to different academies, with a goal of collaborating to change the face of Zimbabwean football and restore the country’s former glory.\nWith a project tailored to boost Zimbabwe’s chances of qualifying for the 2034 FIFA World Cup, the JADEL Football Academy has adopted a stance to partner other academies in the project to develop the country’s football.\nJADEL Football Academy Official Nyasha Kadenge said, “We want any talent from any part of the country to get a chance to play and be seen. The hope is that talent is developed all over Zimbabwe. So we are happy to draw teams from all over the country.”",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Nqobile Magwizi elected ZIFA president",
            "href": "https://www.zbcnews.co.zw/nqobile-magwizi-elected-zifa-president/",
            "content": "Story by Lawrence Trusida, Sports Editor\nBusinessman, Nqobile Magwizi has been elected ZIFA president after a landslide victory that saw him beating four other candidates at the association’s elections held this Saturday in Harare.\nThe 45-year-old swept his competition aside after garnering 61 votes, while Philemon Machana was a distant second with five votes.\nHerentals FC chief executive officer, Loveness Mukura and former PSL chief executive officer, Kennedy Ndebele were elected vice presidents by a wide margin.\nHerentals chairperson, Tafadzwa Benza, Professor Thomas Marambanyika and Dutch Academy director, Kudzai Kadzombe were elected as committee members.\nSimba Bhora director Brighton Ushendibaba, Eastern Region chairperson Davison Muchena and lawyer Alice Zeura were also voted as board members.\nThe remaining two boards members will be seconded by the Premier Soccer League and the Women Premier Soccer League to make an 11-member executive committee.",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "KCD Mohadi sports tournament kicks off",
            "href": "https://www.zbcnews.co.zw/kcd-mohadi-sports-tournament-kicks-off/",
            "content": "Story by Providence Maraneli\nTHE two-day KCD Mohadi sports tournament kicked off at Phelandaba in Gwanda this Saturday, with twelve teams from Matabeleland South province participating.\nDubbed KCD Mohadi Sports tournament in honour of the country’s Vice President and ZANU PF’s Second Secretary, Cde Kembo Mohadi, the sports fiesta kicked off on a high note with 12 constituency drawn teams registering their presence with sterling performances.\nZANU PF Youth League chairperson for Matabeleland South Province, Cde Moses Langa said the tournament has brought about unity among the youths, words also echoed by the ZANU PF Matabeleland South Provincial Chairperson, Cde Mangaliso Ndlovu.",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "All set for ZIFA elections",
            "href": "https://www.zbcnews.co.zw/all-set-for-zifa-elections/",
            "content": "Story by Lawrence, Trusida Sports Editor\nThe stage is set for the Zimbabwe Football Association (ZIFA) executive committee elections which will be held in Harare this Saturday.\nThe candidates will battle it out for nine out of the 11 positions, including the presidency.\nOthers are vying for the vice-presidency, one of which should be a woman.",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "TelOne FC ups preparations ahead of 2025 PSL season",
            "href": "https://www.zbcnews.co.zw/telone-fc-ups-preparations-ahead-of-2025-psl-season/",
            "content": "Story by Tafara Chikumira\nGweru-based Premier Soccer League side Telone FC are looking at blending experience with new talent as they aim for a top-four finish in the 2025 season.\nThe Wifi boys who finished at 10th in the PSL last season after a dramatic comeback are hoping to maintain their fine form in the 2025 season.\nTelOne FC, who were facing relegation mid-season had to secure the services of then Harare City coach Herbert Maruwa who changed the fortunes of the team following the sacking of Tendai Chikuni.\nThough TelOne FC have not officially availed their new signings for the upcoming season, ZBC News has it on authority that the Wifi Boys are eying the services of former Dynamos captain Frank Makarati, while they have already snapped up former Green Fuel and Ngezi Platinum Stars Midfielder Brunl Mutigo, Manica Diamonds attacking duo of Gerald Bhero and Tawanda Macheke.",
            "time": "20:36",
            "date": "26 Jan 2025"
        }
    ]
}