{
    "news": [
        {
            "title": "Chicken Inn, Dynamos fined for abandoned matches",
            "href": "https://www.zbcnews.co.zw/chicken-inn-dynamos-fined-for-abandoned-matches/",
            "content": "Story by ZBC staff reporter\nCHICKEN Inn and Dynamos have been punished by the Premier Soccer League, after being found guilty of causing the abandonment of their respective matches in May and June.\nChicken Inn and their player, George Majika were found guilty of causing the abandonment of the team’s match against Scottland, on May 23 this year.\nThe club has since been fined US$5 000, with the match being awarded to Scottland on a 3-nil score line.",
            "time": "09:50",
            "date": "24 Jul 2025"
        },
        {
            "title": "Gweru Central police dominates ZRP games",
            "href": "https://www.zbcnews.co.zw/gweru-central-police-dominates-zrp-games/",
            "content": "Story by Tafara Chikumira\nIT was an action filled week as police officers in the Midlands province converged at Gweru Central Police Grounds to battle it out in various sporting disciplines.\nThe past week witnessed police officers from across the Midlands province battling it out in six sporting disciplines, including football, volleyball and netball.\nIn the end, it was the hosts Gweru Central police who emerged overall winners.\nZRP Officer Commanding Midlands Province, Commissioner Patson Nyabadza hailed police officers for bringing out their best during the sports gala.\n“I am very delighted to note that you guys are improving your skills every time. This year you have shown maturity in conducting the various sporting disciplines. It is through sport that you preserve your dignity. Sport also helps in maintaining discipline,” he said.",
            "time": "09:50",
            "date": "24 Jul 2025"
        },
        {
            "title": "Title race tightens as MWOS suffer shock home defeat",
            "href": "https://www.zbcnews.co.zw/title-race-tightens-as-mwos-suffer-shock-home-defeat/",
            "content": "Story by Anashe Murombedzi\nDEBUTANTS, MWOS’ title credentials are under serious test after the Norton-based side suffered their first home loss and third defeat of the season to FC Platinum, going down 2–0.\nAfter losing two away matches against Yadah and Ngezi Platinum, MWOS suffered their first home defeat at the weekend.\nThe defeat saw the Norton side losing ground on log leaders, Simba Bhora, whom they now trail by three points.\nWhile it might be too early for the MWOS family to get worried, coach Lloyd Mutasa might need to put things right as soon as possible if he is to land the first title of his coaching career.\nAway from MWOS, the defending champions Simba Bhora seem to be the team to beat, after opening a three-point gap with a 1-nil win over troubled Dynamos.\nOn the other hand, ambitious Mabvuku-based side, Scottland, came from behind to edge Bulawayo giants, Highlanders 2-1 in a pulsating Castle Lager Premier Soccer League match day 21 encounter at Rufaro Stadium this Sunday.\nAfter being awarded three points for their abandoned match against Chicken Inn a few weeks ago, Scottland did not waste the opportunity to move closer to the leading pack, thanks to Terrence Dzvukamanja’s brace.",
            "time": "09:50",
            "date": "24 Jul 2025"
        },
        {
            "title": "Young Warrior’s big move: Chakuchichi inks deal with Jay-Z’s ROC Nation",
            "href": "https://www.zbcnews.co.zw/young-warriors-big-move-chakuchichi-inks-deal-with-jay-zs-roc-nation/",
            "content": "Story by Lawrence Trusida ,Sports Editor",
            "time": "09:50",
            "date": "24 Jul 2025"
        },
        {
            "title": "Rising Taekwondo star,  Maritsa, appointed Global Ambassador for diversity and inclusion",
            "href": "https://www.zbcnews.co.zw/rising-taekwondo-star-maritsa-appointed-global-ambassador-for-diversity-and-inclusion/",
            "content": "Story by Lawrence Trusida, Sports Editor\nZIMBABWE’S rising Taekwondo star, Natsiraishe Maritsa, has been appointed one of the three new sustainability ambassadors by World Taekwondo.\nMaritsa will serve as a Champion for Diversity, Equity, and Community Inclusion, helping to raise awareness and support young people across the global Taekwondo community.",
            "time": "09:50",
            "date": "24 Jul 2025"
        }
    ]
}