{
    "news": [
        {
            "title": "Ngodzo joins Gwanda Pirates as head coach",
            "href": "https://www.zbcnews.co.zw/ngodzo-joins-gwanda-pirates-as-head-coach/",
            "content": "Story by Providence Maraneli\nGWANDA Pirates fans are bubbling with confidence after the club unveiled former Highlanders midfielder Johannes Ngodzo as their new head coach.\nAfter securing the services of the yesteryear midfield maestro, Johannes ‘Signature’ Ngodzo as Gwanda Pirates coach, the mining town is excited and hopeful of finally bringing Premier Soccer League football back to Phelandaba stadium.\nNgodzo, who has coaching experience with Adachi FC and Bantu Rivers has already hit the ground running with a stellar performance against Highlanders in a friendly match on Saturday has priced away the hearts of the black and white fans.\n“The new coach has the experience as a player and we hope he is going to bring it to the team,” a fan said.\nThe new gaffer is confident of turning around the fortunes of Gwanda football.\n“From the performances I am getting from the boys, I am confident that if we are united and we can build a formidable team. A team that can compete at the top,” said Ngodzo.",
            "time": "21:26",
            "date": "26 Feb 2025"
        },
        {
            "title": "Mighty Warriors eye comeback against Angola in crucial 2026 WAFCON qualifier",
            "href": "https://www.zbcnews.co.zw/mighty-warriors-eye-comeback-against-angola-in-crucial-2026-wafcon-qualifier/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE Mighty Warriors are seeking to overturn a 2-1 deficit when they take on Angola in the reverse encounter of the first round of the 2026 CAF Women Africa Cup of Nations qualifier set for Lucas Moripe stadium in South Africa this Wednesday.\nZimbabwe have their backs against the wall as they must overturn the deficit to progress to the second round of the WAFCON qualifiers.\nThe Mighty Warriors lost in Luanda and they believe they are ready to wrestle back the momentum after close to a week with the whole team in camp.\nDespite the hard task at hand the Mighty Warriors are determined to get a positive result.\n“The girls are happy, the weather is great, and we are having positive conversations about the game on Wednesday, the team bonding is super, and our preparations are going well. We are working on the areas where we lacked in the previous match.\n“My message to the girls is that the marathon continues, the race is not yet over. We still have 90 minutes plus to win, and that means we have a chance,” Mighty Warriors captain, Emmaculate Msipa said.\nMeanwhile, the Mighty Warriors joined former Warriors captain Peter Ndlovu in celebrating the legend’s 52nd birthday in South Africa this Tuesday.\nSpeaking at a breakfast meeting organised by South African-based funeral services company, Zororo-Phumulani, Ndlovu challenged the new ZIFA leadership to continue supporting the Mighty Warriors.",
            "time": "21:26",
            "date": "26 Feb 2025"
        },
        {
            "title": "ZIFA Referees Committee tightens grip",
            "href": "https://www.zbcnews.co.zw/zifa-referees-committee-tightens-grip/",
            "content": "Story by Lawrence Trusida, Sports Editor\nTHE newly appointed ZIFA referees committee has come up with a number of new measures meant to improve the officiating of matches in the country.\nWith the Premier Soccer League set to kick off this Friday, the newly appointed ZIFA Referees Committee led by Faith Mloyi moved in swiftly to put their house in order.\nThe committee hosted a training workshop facilitated by the respected former referee and former SRC Chairperson Anthony Mandiwanza, with ZIFA vice-chairperson Kennedy Ndebele representing the football mother body.\nThe workshop culminated in key resolutions being passed to try and improve the officiating of matches in the country following a year that saw officials hogging the spotlight for the wrong reasons.\nSome of the landmark resolutions include that all financial transactions related to refereeing will be handled exclusively by ZIFA, and no payments will be processed outside the association’s structures.\nAs a way of maintaining integrity and eliminating conflicts of interest, committee members will no longer serve as match officials in any capacity, including as assessors or match commissioners.",
            "time": "21:26",
            "date": "26 Feb 2025"
        },
        {
            "title": "Scottland FC host Triangle United in season opener",
            "href": "https://www.zbcnews.co.zw/scottland-fc-host-triangle-united-in-season-opener/",
            "content": "Story by Lawrence Trusida, Sports Editor\nNEW boys, Scottland FC will kick off the 2025 Premier Soccer League when they host league returnees Triangle United at Rufaro Stadium on Friday.\nThe Mabvuku-based club lured some of the best players to their camp including reigning Soccer Star of the Year, Walter Musona, last year’s top goal scorer Lynoth Chikuhwa, and Khama Billiat, among others.\nThe clash will see an exuberant club up against another that has been quietly assembling.\nOn Saturday, defending champions, Simba Bhora host FC Platinum at Wadzanayi Stadium in arguably the match of the weekend.\nFC Platinum were the only team to beat Simba Bhora at Wadzanayi Stadium and the Shamva-based side will be plotting revenge.",
            "time": "21:26",
            "date": "26 Feb 2025"
        },
        {
            "title": "Bikers join fight against drug abuse",
            "href": "https://www.zbcnews.co.zw/bikers-join-fight-against-drug-abuse/",
            "content": "Story by Raynald Ngwarati\nTHISSunday, the Zim Free Riders Motor Cycling Club, in collaboration with the Harare City Council, took decisive action against drug and substance abuse by hosting an awareness campaign in the high-density suburb of Mbare.\nThe initiative was aimed at educating the local community about the dangers posed by this widespread pandemic of drug and substance abuse.\nResidents of Mbare weregiven an opportunityto engage with bike culture as motorcyclists from across the capital gathered at theStodartComplex for the event.\nAs part of their 2025 Ghetto Ride, the Zim Free Riders attracted significant attention from the crowd, who were captivated by the powerful sounds and exhilarating displays of skill by the riders.\nWith nearly 50 motorcyclists participating, the youth in attendance expressed their enthusiasm for the thrilling performance, which they regarded as an essential part of the fight against drug abuse.",
            "time": "21:26",
            "date": "26 Feb 2025"
        }
    ]
}