{
    "news": [
        {
            "title": "Zim U-21 hockey teams gear up for Junior Africa Cup",
            "href": "https://www.zbcnews.co.zw/zim-u-21-hockey-teams-gear-up-for-junior-africa-cup/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTHE Zimbabwe Under-21 hockey teams have started preparations for the Junior Africa Cup set to be held in Namibia within the next two months.\nThe tournament, which was initially set for December last year, will see junior teams competing for the African title and earn a slot for the International Hockey Federation (FIH) Junior World Cups.\nZimbabwe is fielding both men’s and women’s teams at the continental event with the ultimate goal to secure a podium finish and qualify for the FIH Junior World Cups.\nThe tournament will feature 24 teams in both men’s and women’s competitions for the first time.\nCoach, Prince Mwale, has retained most of the players from the squads announced last year in October, with a few additions and adjustments.",
            "time": "20:22",
            "date": "15 Feb 2025"
        },
        {
            "title": "Tag rugby gains momentum in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/tag-rugby-gains-momentum-in-zimbabwe-2/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTag Rugby Trust has launched a senior tag tournament, a non-contact version of traditional rugby, which got underway at Harare Sports Club this Friday.\nThe sport was introduced in the country three years ago, to develop a national team to represent Zimbabwe in international competitions.\nTag Rugby was not solely driven by the prospect of participating in the 2026 World Cup, but rather to promote the sport in communities, clubs, and high schools.\nThe focus has been on high-density areas, with the aim of providing exposure and opportunities for young people to travel and compete internationally.\nThe response has been encouraging, with five clubs and seven schools participating in the sport.",
            "time": "20:22",
            "date": "15 Feb 2025"
        },
        {
            "title": "Tag rugby gains momentum in Zimbabwe",
            "href": "https://www.zbcnews.co.zw/tag-rugby-gains-momentum-in-zimbabwe/",
            "content": "Story by Anashe Murombedzi, Sports Reporter\nTag Rugby Trust has launched a senior tag tournament, a non-contact version of traditional rugby, which got underway at Harare Sports Club this Friday.\nThe sport was introduced in the country three years ago, to develop a national team to represent Zimbabwe in international competitions.\nTag Rugby was not solely driven by the prospect of participating in the 2026 World Cup, but rather to promote the sport in communities, clubs, and high schools.\nThe focus has been on high-density areas, with the aim of providing exposure and opportunities for young people to travel and compete internationally.\nThe response has been encouraging, with five clubs and seven schools participating in the sport.",
            "time": "20:22",
            "date": "15 Feb 2025"
        },
        {
            "title": "Courtney Lock and Indian partner through to semi-finals of 2025 Delhi Open",
            "href": "https://www.zbcnews.co.zw/courtney-lock-and-indian-partner-through-to-semi-finals-of-2025-delhi-open/",
            "content": "\nStory by Patience Nyagato\nZimbabwe’s top tennis player Courtney Lock and his Indian partner Niki Poonacha made the semi-finals in doubles at the 2025 Delhi Open 2025 tennis tournament this Thursday.\nZimbabwe’s doubles specialist Courtney Lock and his partner Poonacha are through to the last four after a hard-fought victory over Japan’s Shintaro Mochizuki and Kaito Uesugi in the quarter-finals at the DLTA Complex, in Delhi.\nThe pair won the three-set thriller 6-3, 2-6, 10-5 to move to the semi-finals of the Delhi Open.\nThe two were ecstatic about their progress.",
            "time": "20:22",
            "date": "15 Feb 2025"
        },
        {
            "title": "Cricket analysts call for a change of mindset",
            "href": "https://www.zbcnews.co.zw/cricket-analysts-call-for-a-change-of-mindset-2/",
            "content": "Story by Lawrence Trusida, Sports Editor\nCricket analysts believe a change of mindset can help the Chevrons to play better in test cricket.\nZimbabwe’s latest defeat to Ireland continued a downward spiral that has been going on for years now.\nThe defeat to Ireland was the 10th in a row, after last winning a test match three years ago.The loss also means that in the last 50 tests, Zimbabwe has only managed to win five.\nAnalysts believe Zimbabwe’s problems are more mental than technical.\n“Even without, Ervine, Raza and Williams we should be beating Ireland any day, it’s our mental approach to the game that is wrong. I believe our players are playing way too many shorts for a test match as compared to leaving balls and choosing the ones to play. We saw what Madhevere did in the second innings he was patient and he got the reward, we are playing test cricket in limited overs mode and we are rushing,” said cricket analyst, Godwin Mamhiyo.",
            "time": "20:22",
            "date": "15 Feb 2025"
        }
    ]
}